Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/builders/index.po
Languages: fr, ja, pt_br, zh_cn

source: This builder uses a module that implements the Python serialization API (`pickle`, `simplejson`, `phpserialize`, and others) to dump the generated HTML documentation. The pickle builder is a subclass of it.
fr: Ce constructer utilise un module qui implémente l'API de sérialisation Python (`pickle`, `simplejson`, `phpserialize`, and others) pour enregistrer la documentation HTML générée. Le constructeur sérialisé en est une sous-classe.
ja: このビルダーはPythonのシリアライズAPI(`pickle`, `simplejson`, `phpserialize` など)を利用して、実装されています。生成されたHTMLをダンプします。 pickleビルダーはこのクラスのサブクラスになります。
zh_cn: 这个生成器使用一个实现 Python 序列化 API（`pickle`、`simplejson`、`phpserialize`等）的模块来转储生成的 HTML 文档，pickle 生成器是该生成器的一个子类。

source: A module that implements `dump()`, `load()`, `dumps()` and `loads()` functions that conform to the functions with the same names from the pickle module. Known modules implementing this interface are `simplejson`, `phpserialize`, `plistlib`, and others.
fr: Un module qui implémente les fonctions `dump()`, `load()`, `dumps()` et `loads()` qui sont conformes aux fonctions portant les mêmes noms du module pickle. Les modules connus qui implémentent cette interface sont `simplejson', `phpserialize', `plistlib' et autres.
ja: pickleモジュールと同じ名前の `dump()`, `load()`, `dumps()`, `loads()` 関数が実装されているモジュールです。このようなインタフェースを実装しているモジュールでよく知られているものには、 `simplejson`, `phpserialize`, `plistlib` などがあります。
zh_cn: 实现与 pickle 模块中具有相同名称的函数一致的 “dump（）”、`load（）`、`dumps（）`和 `loads（）`函数的模块。实现此接口的已知模块有 “simplejson”、“phpserialize”、“plistlib” 等。

source: This builder produces an HTML overview of all :rst:dir:`versionadded`, :rst:dir:`versionchanged` and :rst:dir:`deprecated` directives for the current :confval:`version`. This is useful to generate a ChangeLog file, for example.
fr: Ce constructeur produit un aperçu HTML de toutes les directives :rst:dir:`versionadded`, :rst:dir:`versionchanged` et :rst:dir:`deprecated` pour le :confval:`version' courant. Ceci est utile pour générer un fichier ChangeLog, par exemple.
ja: このビルダーは、現在の :confval:`version` の設定値と、 :rst:dir:`versionadded`, :rst:dir:`versionchanged`, :rst:dir:`deprecated` の各ディレクティブの情報から、HTMLを生成します。このビルダーは、例えばChangeLogファイルを生成するのに便利です。
zh_cn: 此生成器生成以下所有内容的 HTML 概述：rst: 方向：`versionadded`，：rst: 方向：`versionchanged` 和：rst: 方向：当前：confval:`version` 的 “deprecated” 指令。例如，这对于生成变更日志文件非常有用。

source: :attr:`.SerializingHTMLBuilder.globalcontext_filename`
zh_cn: ：属性：`.Serializingtmlbuilder.globalcontext_文件名`

source: The builder's "name" must be given to the **-b** command-line option of :program:`sphinx-build` to select a builder.
fr: Le "nom" du constructeur doit être donné à l'option de ligne de commande **-b** de :programme:`sphinx-build` pour sélectionner un constructeur.
ja: :program:`sphinx-build` の起動時には、コマンドラインオプション\ **-b**\ でビルダーの名前を指定しなければなりません。

source: This is an HTML builder that combines the whole project in one output file. (Obviously this only works with smaller projects.) The file is named like the master document. No indices will be generated.
fr: Il s'agit d'un générateur HTML qui combine l'ensemble du projet dans un seul fichier de sortie. (Évidemment, cela ne fonctionne qu'avec des projets plus petits.) Le fichier est nommé comme le document maître. Aucun index ne sera généré.
ja: これは、プロジェクト全体のファイルを結合して、1ファイルにして出力するHTMLビルダーです。 (これは小さなプロジェクトでうまく動作します。) このファイルは、マスタードキュメントに似た名前になります。 また、索引は生成されません。

source: This builder produces the same output as the standalone HTML builder, but also generates an *epub* file for ebook readers. See :ref:`epub-faq` for details about it. For definition of the epub format, have a look at `<http://idpf.org/epub>`_ or `<https://en.wikipedia.org/wiki/EPUB>`_. The builder creates *EPUB 3* files.
fr: Ce constructeur produit le même résultat que le constructeur HTML autonome, mais génère également un fichier *epub* pour les lecteurs d'ebook. Voir :ref:`epub-faq` pour plus de détails à ce sujet. Pour la définition du format epub, voir `<http://idpf.org/epub>`_ ou `<https://en.wikipedia.org/wiki/EPUB>`_. Le constructeur crée des fichiers *EPUB 3*.
ja: このビルダーは標準のStandaloneHTMLBuilderと同じものを出力しますが、電子ブックリーダーのための、 *epub* ファイルも一緒に生成します。詳しくは :ref:`epub-faq` を参照してください。epubフォーマットの定義については `<http://idpf.org/epub>`_ もしくは `<https://en.wikipedia.org/wiki/EPUB>`_ を参照してください。このビルダーが生成するファイルは *EPUB 3* です。

source: Since Sphinx-1.5, the epub3 builder is used for the default builder of epub.
fr: Depuis Sphinx-1.5, le constructeur epub3 est utilisé pour le constructeur par défaut de epub.
ja: Sphinx-1.5より、epub3ビルダーがepubのデフォルトビルダーとして用いられています。

source: This builder produces a bunch of LaTeX files in the output directory. You have to specify which documents are to be included in which LaTeX files via the :confval:`latex_documents` configuration value. There are a few configuration values that customize the output of this builder, see the chapter :ref:`latex-options` for details.
fr: Ce constructeur produit un tas de fichiers LaTeX dans le répertoire de sortie. Vous devez spécifier quels documents doivent être inclus dans quels fichiers LaTeX via la valeur de configuration :confval:`latex_documents`. Il y a quelques valeurs de configuration qui personnalisent la sortie de ce constructeur, voir le chapitre :ref:`latex-options` pour plus de détails.
ja: このビルダーは出力フォルダ内に、LaTeXのファイル群を生成します。どのドキュメントを含むかを、 :confval:`latex_documents` の設定値を使って設定します。このビルダーの出力をカスタマイズするための設定値がいくつかあります。詳しくは :ref:`latex-options` の章を参照してください。

source: Formerly, testing had been done on Ubuntu precise (TeXLive 2009).
fr: Auparavant, des tests avaient été effectués sur Ubuntu precise (TeXLive 2009).

source: Since 1.6, ``make latexpdf`` uses ``latexmk`` (not on Windows). This makes sure the needed number of runs is automatically executed to get the cross-references, bookmarks, indices, and tables of contents right.
fr: Depuis la version 1.6, "make latexpdf" utilise "latexmk" (sauf sous Windows). Cela permet de s'assurer que le nombre de passages nécessaires est automatiquement exécuté pour que les références croisées, les signets, les index et les tables des matières soient corrects.

source: Since Sphinx-1.5, the linkcheck builder comes to use requests module.
fr: Depuis Sphinx-1.5, le linkcheck builder vient utiliser le module de requêtes.
ja: Sphinx-1.5より、linkcheck ビルダーは requests モジュールを使用するようになっています。
