Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/builders/index.po
Languages: fr, ja, pt_br, zh_cn

source: Builders
pt_br: Construtores
zh_cn: 生成器

source: These are the built-in Sphinx builders. More builders can be added by :doc:`extensions </usage/extensions/index>`.
pt_br: Esses são os construtores embutidos do Sphinx. Mais construtores podem ser adicionados através das :doc:`extensões </usage/extensions/index>`.
zh_cn: 这些是内置的Sphinx生成器。可以通过 :doc:`扩展 </usage/extensions/index>`添加更多生成器。

source: The builder's "name" must be given to the **-M** or **-b** command-line options of :program:`sphinx-build` to select a builder.
pt_br: O "nome" do construtor deve ser passado para as opções de linha de comando **-M** ou **-b** do :program:`sphinx-build` para selecionar o construtor.

source: The most common builders are:
pt_br: Os construtores mais comuns são:

source: Build HTML pages. This is the default builder.
pt_br: Constrói páginas HTML. Esse é o construtor padrão.
zh_cn: 生成 HTML 页面。这是默认的生成器。

source: Build HTML pages, but with a single directory per document. Makes for prettier URLs (no ``.html``) if served from a webserver.
pt_br: Constrói páginas HTML, mas em um único diretório por documento. Cria URLs mais bonitas (sem ``.html``) quando servido de um servidor web.
zh_cn: 构建 HTML 页面，每个文档生成一个单独的文件夹。通过网页服务器可以显示出更好看的 URL（可以不显示.html）。

source: Build a single HTML with the whole content.
pt_br: Constrói um único HTML com todo o conteúdo.
zh_cn: 使用整个内容生成单个 HTML 。

source: Build HTML files with additional information for building a documentation collection in one of these formats.
pt_br: Constrói arquivos HTML com informação adicional para construção de uma coleção em um ou mais formatos.
zh_cn: 生成 HTML文件，其中包含以这些格式之一构建文档集合的附加信息。

source: Build an Apple Help Book. Requires :program:`hiutil` and :program:`codesign`, which are not Open Source and presently only available on Mac OS X 10.6 and higher.
pt_br: Constrói um Apple Help Book. Requer :program:`hiutil` e :program:`codesign`, os quais não são Open Source e atualmente estão disponíveis somente em Mac OS X 10.6 ou superior.
zh_cn: 生成一本苹果帮助手册。需要 :program:`hiutil`'和 :program:`codesign`，它们不是开源的，目前仅适用于Mac OS X 10.6及更高版本。

source: Build LaTeX sources that can be compiled to a PDF document using :program:`pdflatex`.
pt_br: Constrói fontes LaTeX que serão compilados em um documento PDF usando o :program:`pdflatex`.
zh_cn: 使用 :program:`pdflatex`生成可以编译为PDF文档的LaTeX源。

source: Build manual pages in groff format for UNIX systems.
pt_br: Constrói páginas man no formato groff para sistemas UNIX.
zh_cn: 为 UNIX 系统生成 groff 格式的手册（man pages）。

source: Build Texinfo files that can be processed into Info files using :program:`makeinfo`.
pt_br: Constrói arquivos Texinfo que podem ser processados em arquivos Info usando :program:`makeinfo`.
zh_cn: 使用 :program:`makeinfo`生成可以被处理为 Info 文件的 Texinfo 文件。

source: Build plain text files.
pt_br: Constrói arquivos texto puro.
zh_cn: 生成纯文本文件。

source: Build gettext-style message catalogs (``.pot`` files).
pt_br: Constrói catalogo de mensagens tipo gettext (arquivos ``.pot``).
zh_cn: 生成 gettext 样式的文本集（“.pot”格式）。

source: Run all doctests in the documentation, if the :mod:`~sphinx.ext.doctest` extension is enabled.
pt_br: Executa todos doctests na documentação, se a extensão :mod:`~sphinx.ext.doctest` estiver habilitada
zh_cn: 如果启动了 :mod:`~sphinx.ext.doctest` 扩展程序，可运行文档中的所有文档测试。

source: Check the integrity of all external links.
pt_br: Verifica a integridade dos links externos.
zh_cn: 检查所有外部链接的完整性。

source: Build Docutils-native XML files.
pt_br: Constrói arquivos XML nativos Docutils.
zh_cn: 生成 Docutils 原生 XML 文件。

source: Build compact pretty-printed "pseudo-XML" files displaying the internal structure of the intermediate document trees.
pt_br: Constrói versão compacta dos arquivos "pseudo-XML" exibindo a estrutura interna intermediária de árvores de documentos, doctrees.
zh_cn: 生成简洁美观的“pseudo-XML”格式文件，显示中间文档树的内部结构。

source: This is the standard HTML builder. Its output is a directory with HTML files, complete with style sheets and optionally the reST sources. There are quite a few configuration values that customize the output of this builder, see the chapter :ref:`html-options` for details.
fr: C'est le constructeur HTML standard. Sa sortie est un répertoire avec des fichiers HTML, des feuilles de style et éventuellement les sources reST. Il y a un certain nombre de valeurs de configuration qui personnalisent la sortie de ce constructeur, voir le chapitre :ref:`html-options` pour plus de détails.
ja: これは標準的なHTMLビルダーです。 このビルダーはディレクトリにHTMLファイルと、スタイルシートを出力します。reSTソースの出力も指定できます。 このビルダーにはビルダーの出力を変更できる設定値をいくつか持っています。 詳しくは :ref:`html-options` をご覧ください。
pt_br: HTML Esse é o construtor padrão. A saída será no diretório de arquivos HTML, completo com as folhas de estilo e opcionalmente com os fontes reST. Existem alguns valores para configuráveis para personalizar a saída desse construtor, ver o capítulo :ref:`html-options` para detalhes.
zh_cn: 这是标准的HTML生成器。它的输出是一个包含HTML文件的目录，包括样式表和可选的reST源。有很多配置值可以自定义此生成器的输出，有关详细信息，请参阅章节：ref:`html options'。

source: The builder's name, for the -b command line option.
pt_br: O nome do construtor, para a opção de linha de comando -b.
zh_cn: 编译器的名称，用于-b命令行选项。

source: The builder's output format, or '' if no document output is produced.
pt_br: O formato de saída do construtor ou '', se nenhuma saída de documento for produzida.
zh_cn: 生成器的输出格式，如果未生成文档输出，则为“”。

source: The list of MIME types of image formats supported by the builder. Image files are searched in the order in which they appear here.
pt_br: A lista de tipos MIME de formatos de imagem suportados pelo construtor. Os arquivos de imagem são pesquisados ​​na ordem em que aparecem aqui.
zh_cn: 生成器支持的图像格式的MIME类型列表。图像文件按它们在此处出现的顺序进行搜索。

source: This is a subclass of the standard HTML builder. Its output is a directory with HTML files, where each file is called ``index.html`` and placed in a subdirectory named like its page name. For example, the document ``markup/rest.rst`` will not result in an output file ``markup/rest.html``, but ``markup/rest/index.html``. When generating links between pages, the ``index.html`` is omitted, so that the URL would look like ``markup/rest/``.
fr: Il s'agit d'une sous-classe de l'éditeur HTML standard. Son résultat est un répertoire avec des fichiers HTML, où chaque fichier est appelé ``index.html`` et placé dans un sous-répertoire nommé comme son nom de page. Par exemple, le document ```markup/rest.rst`` ne donnera pas un fichier de sortie ``markup/rest.html``, mais ``markup/rest/index.html``. Lors de la génération de liens entre les pages, le ``index.html`` est omis, afin que l'URL ressemble à ``markup/rest/``.
ja: このクラスは、標準のHTMLビルダーのサブクラスです。これは\ ``index.html`` \という名前のHTMLファイルと一緒にディレクトリを出力します。そのときに、そのページ名がディレクトリの名前になります。例えば、\ ``markup/rest.rst``\ というファイルがあるとすると、\ ``markup/rest.html``\ というファイルが出力されるのではなく、\ ``markup/rest/index.html``\ というファイルが出力されます。ページ間のリンクが生成される場合には、末尾の\ ``index.html``\ を省いて、\ ``markup/rest/``\ というようなURLが生成されます。
pt_br: Essa é uma subclasse do construtor HTML. Sua saída é no diretorio de arquivos HTML, onde cada arquivo é nomeado ``index.html`` e colocado em um subdiretório igual ao nome da página. Por exemplo, o documento ``markup/rest.rst`` não resultará em um arquivo de saída ``markup/rest.html``, mas sim em ``markup/rest/index.html``. Quando gerando links entre páginas, o ``index.html`` é omitido, a URL será algo como ``markup/rest/``.
zh_cn: 这是标准HTML生成器的一个子类。它的输出是一个包含HTML文件的目录，其中每个文件都被调用``索引.html``并放在一个名为其页面名的子目录中。例如，文档标记/休息.rst``不会产生输出文件``标记/休息.html``，但``标记/休息/索引.html``. 在页面之间生成链接时``索引.html``省略，因此URL看起来像“`markup/rest/`”。

source: This is an HTML builder that combines the whole project in one output file. (Obviously this only works with smaller projects.) The file is named like the root document. No indices will be generated.
pt_br: Esse é um construtor HTML que combina todo o projeto em um único arquivo de saída, (obviamente isso só funciona em pequenos projetos). O arquivo será nomeado como documento raiz. Nenhum índice será gerado.

source: This builder produces the same output as the standalone HTML builder, but also generates HTML Help support files that allow the Microsoft HTML Help Workshop to compile them into a CHM file.
fr: Ce constructeur produit le même résultat que le constructeur HTML autonome, mais génère également des fichiers d'aide HTML qui permettent au Microsoft HTML Help Workshop de les compiler dans un fichier CHM.
ja: このビルダーは標準のHTMLビルダーと同じものを出力しますが、MicrosoftのHTML Help Workshopで使用できる、HTMLヘルプのサポートファイルも生成します。これらの入力をHTML Help Workshop上でコンパイルすると、CHMファイルが生成されます。
pt_br: Esse construtor produz a mesma saída do construtor HTML, mas também gerá arquivos de Ajuda HTML, que permitem ao Microsoft Ajuda HTML Workshop compilá-los em um arquivo CHM.
zh_cn: 此生成器生成与独立的HTML生成器相同的输出，但也生成HTML帮助支持文件，这些文件允许Microsoft HTML帮助研讨会将其编译为CHM文件。

source: This builder produces the same output as the standalone HTML builder, but also generates `Qt help`_ collection support files that allow the Qt collection generator to compile them.
fr: Ce constructeur produit le même résultat que le constructeur HTML autonome, mais génère également des fichiers de support de collection `Qt help`_ qui permettent au générateur de collection Qt de les compiler.
ja: このビルダーは標準のHTMLビルダーと同じものを出力しますが、 `Qt help`_ collectionを使ってコンパイルするのに必要なサポートファイル群も一緒に出力します。
pt_br: Esse construtor produz a mesma saída que o construtor HTML e gera também coleção de arquivos `Qt help`_ que permite ao gerador Qt compilá-los.
zh_cn: 此生成器生成与独立 HTML 生成器相同的输出，但也会生成 “Qt help” 集合支持文件，这些文件允许 Qt 集合生成器编译它们。

source: Moved to sphinxcontrib.qthelp from sphinx.builders package.
pt_br: Movido para sphinxcontrib.qthelp do pacote sphinx.builders.
zh_cn: 从sphinx.生成器包移到sphinxcontrib.qthelp。

source: This builder produces an Apple Help Book based on the same output as the standalone HTML builder.
fr: Ce constructeur produit un livre d'aide Apple basé sur le même résultat que le constructeur HTML autonome.
ja: このビルダーはApple Help Bookを出力します。standalone HTMLビルダーと同じ出力を元に生成しています。
pt_br: Esse construtor produz um Livro Help Apple baseado na mesma saída do construtor HTML.
zh_cn: 此生成器基于与独立HTML生成器相同的输出生成Apple帮助手册。

source: If the source directory contains any ``.lproj`` folders, the one corresponding to the selected language will have its contents merged with the generated output. These folders will be ignored by all other documentation types.
fr: Si le répertoire source contient des dossiers ``.lproj``, celui correspondant à la langue sélectionnée verra son contenu fusionné avec le résultat généré. Ces dossiers seront ignorés par tous les autres types de documentation.
ja: ソースディレクトリが何らかの``.lproj``フォルダを含む場合、選択された言語に対応するフォルダが、生成された出力とマージされます。これらのフォルダは、その他のドキュメントタイプには無視されます。
pt_br: Se o diretório fonte contiver alguma pasta ``.lproj``, então o idioma correspondente será combinado com a saída gerada. Essas pastas serão ignoradas por todos os outros tipos de documentação.
zh_cn: 如果源目录包含任何 `.lproj`` 文件夹，则与所选语言对应的文件夹的内容将与生成的输出合并。这些文件夹将被所有其他文档类型忽略。

source: In order to generate a valid help book, this builder requires the command line tool :program:`hiutil`, which is only available on Mac OS X 10.6 and above. You can disable the indexing step by setting :confval:`applehelp_disable_external_tools` to ``True``, in which case the output will not be valid until :program:`hiutil` has been run on all of the ``.lproj`` folders within the bundle.
fr: Afin de générer un livre d'aide valide, ce constructeur a besoin de l'outil en ligne de commande :programme:`hiutil', qui n'est disponible que sous Mac OS X 10.6 et plus. Vous pouvez désactiver l'étape d'indexation en réglant :confval:`applehelp_disable_external_tools` sur ``True``, auquel cas la sortie ne sera valide que lorsque :programme:`hiutil' aura été exécuté sur tous les dossiers ``.lproj'' du paquet.
ja: 有効なヘルプブックを生成するには、コマンドラインツールの:program:`hiutil`をビルダーに用意してやる必要があります。ただ、Mac OS X 10.6 and aboveのみでしか使用できません。インデックス作成のステップを飛ばすには:confval:`applehelp_disable_external_tools`に`True``を設定します。この場合、:program:`hiutil`をバンドル内の全ての``.lproj``フォルダに対して実行する必要があります。
pt_br: Para gerar um livro de ajuda válido, esse construtor requer o uso da ferramenta de linha de comando :program:`hiutil`, o qual só está disponível no Mac OS X 10.6 ou versão posterior. O passo da indexação pode ser desabilitado com a configuração :confval:`applehelp_disable_external_tools` com ``True``, caso em que a saída não será válida até o término do :program:`hiutil` ter sido executado em todas as pastas ``.lproj`` dentro do pacote.
zh_cn: 为了生成有效的帮助手册，此生成器需要命令行工具：program:`hiutil`，该工具仅在 Mac OS X 10.6 及更高版本上可用。可以通过将 confval:`applehelp_disable_external_tools` 设置为 “True” 来禁用索引步骤，在这种情况下，输出将无效，直到：program:`hiutil` 已在捆绑包中的所有 `.lproj`` 文件夹上运行。

source: Moved to sphinxcontrib.applehelp from sphinx.builders package.
pt_br: Movido para sphinxcontrib.applehelp do pacote sphinx.builders.
zh_cn: 从sphinx.生成器包移到sphinxcontrib.applehelp。

source: This builder produces the same output as the standalone HTML builder, but also generates `GNOME Devhelp <https://wiki.gnome.org/Apps/Devhelp>`__ support file that allows the GNOME Devhelp reader to view them.
fr: Ce constructeur produit le même résultat que le constructeur HTML autonome, mais génère également `GNOME Devhelp <https://wiki.gnome.org/Apps/Devhelp>`__ fichier de support qui permet au lecteur GNOME Devhelp de les visualiser.
ja: このビルダーは標準のHTMLビルダーと同じものを出力しますが、GNOME Devhelpリーダーで使用されいてる `GNOME Devhelp <https://wiki.gnome.org/Apps/Devhelp>`__ のサポートファイルも生成します。
pt_br: Esse construtor produz a mesma saída que o construtor HTML e também gera arquivos de suporte `GNOME Devhelp <https://wiki.gnome.org/Apps/Devhelp>`__ o que permite que o leitor GNOME Devhelp possa visualizá-los.
zh_cn: 此生成器生成与独立 HTML 生成器相同的输出，但也生成 “GNOME Devhelp”<https://wiki.gnome.org/Apps/Devhelp>`__允许 GNOME Devhelp 阅读器查看它们的支持文件

source: Moved to sphinxcontrib.devhelp from sphinx.builders package.
pt_br: Movido para sphinxcontrib.devhelp do pacote sphinx.builders.
zh_cn: 从sphinx.生成器包移到sphinxcontrib.devhelp。

source: This builder produces the same output as the standalone HTML builder, but also generates an *epub* file for ebook readers. See :ref:`epub-faq` for details about it. For definition of the epub format, have a look at `<https://idpf.org/epub>`_ or `<https://en.wikipedia.org/wiki/EPUB>`_. The builder creates *EPUB 3* files.
pt_br: Esse construtor produz a mesma saída do construtor HTML e também gera arquivos *epub* para leitores de ebook readers. Veja :ref:`epub-faq` para detalhes sobre isso. Para definições do formato epub, veja `<https://idpf.org/epub>`_ ou `<https://en.wikipedia.org/wiki/EPUB>`_. O construtor cria arquivos *EPUB 3*.

source: Since Sphinx 1.5, the epub3 builder is used as the default epub builder.
pt_br: Desde Sphinx 1.5, o construtor epub3 é usado como o construtor padrão de epub.

source: This builder produces LaTeX source files in the output directory. The actual PDF builds happen inside this output directory and need to be triggered in a second step. This can be done via :program:`make all-pdf` there. To combine the two steps into only one, use :option:`sphinx-build -M` (i.e. ``-M latexpdf`` not ``-b latexpdf``) or :program:`make latexpdf` at the project root.
pt_br: Este construtor produz arquivos fonte LaTeX no diretório de saída. As construções reais do PDF acontecem dentro deste diretório de saída e precisam ser acionadas em uma segunda etapa. Isso pode ser feito via :program:`make all-pdf`. Para combinar as duas etapas em apenas uma, use :option:`sphinx-build -M` (ou seja, ``-M latexpdf`` e não ``-b latexpdf``) ou :program:`make latexpdf` na raiz do projeto.

source: See :confval:`latex_documents` and the chapter :ref:`latex-options` for available options.
pt_br: Veja :confval:`latex_documents` e o capítulo :ref:`latex-options` para opções disponíveis.

source: PDF builds need a sufficiently complete LaTeX installation. The testing is currently (since 5.3.0) done on Ubuntu 22.04LTS, whose LaTeX distribution matches upstream TeXLive 2021 as of 2022/02/04, but PDF builds can be successfully done on much older LaTeX installations.
pt_br: As construções de PDF precisam de uma instalação LaTeX suficientemente completa. O teste é atualmente (desde 5.3.0) feito no Ubuntu 22.04LTS, cuja distribuição LaTeX corresponde ao TeXLive 2021 upstream em 04/02/2022, mas construções de PDF podem ser feitas com sucesso em instalações LaTeX muito mais antigas.

source: At any rate, on Ubuntu for example, following packages must all be present:
pt_br: De qualquer forma, no Ubuntu, por exemplo, os seguintes pacotes devem estar presentes:

source: ``tex-gyre`` (if :confval:`latex_engine` left to default)
pt_br: ``tex-gyre`` (se :confval:`latex_engine` deixado como padrão)

source: TeX Gyre fonts now required for ``'pdflatex'`` engine (default).
pt_br: Fontes TeX Gyre agora são necessárias para o mecanismo ``'pdflatex'`` (padrão).

source: Additional packages are needed in some circumstances:
pt_br: Pacotes adicionais são necessários em algumas circunstâncias:

source: ``texlive-lang-cyrillic`` for Cyrillic (and also then ``cm-super`` if using the default fonts),
pt_br: ``texlive-lang-cyrillic`` para cirílico (e também ``cm-super`` se estiver usando as fontes padrão),

source: ``texlive-lang-greek`` for Greek (and also then ``cm-super`` if using the default fonts),
pt_br: ``texlive-lang-greek`` para grego (e também ``cm-super`` se estiver usando as fontes padrão),

source: ``texlive-xetex`` if :confval:`latex_engine` is ``'xelatex'``,
pt_br: ``texlive-xetex`` se :confval:`latex_engine` é ``'xelatex'``,
zh_cn: ``texlive-xetex`` 如果 :confval:`latex_engine` 是 ``'xelatex'``，

source: ``texlive-luatex`` if :confval:`latex_engine` is ``'lualatex'``,
pt_br: ``texlive-luatex`` se :confval:`latex_engine` é ``'lualatex'``,
zh_cn: ``texlive-luatex`` 如果 :confval:`latex_engine` 是 ``'lualatex'``，

source: ``fonts-freefont-otf`` if :confval:`latex_engine` is either ``'xelatex'`` or ``'lualatex'``.
pt_br: ``fonts-freefont-otf`` se :confval:`latex_engine` é ou ``'xelatex'`` ou ``'lualatex'``.

source: Since 1.6, ``make latexpdf`` uses on GNU/Linux and macOS :program:`latexmk`, as it makes sure the needed number of runs is automatically executed. On Windows the PDF builds execute a fix number of LaTeX runs (three, then ``makeindex``, then two more).
pt_br: Desde a versão 1.6, ``make latexpdf`` usa no GNU/Linux e macOS :program:`latexmk`, pois garante que o número necessário de execuções seja executado automaticamente. No Windows, as construções de PDF executam um número fixo de execuções de LaTeX (três, depois ``makeindex`` e mais duas).

source: One can pass to ``latexmk`` options via the ``LATEXMKOPTS`` Makefile variable. For example:
fr: On peut passer des options à ``latexmk`` via la variable ``LATEXMKOPTS`` du Makefile. Par exemple :
pt_br: Podem ser passadas ao ``latexmk`` opções via ``LATEXMKOPTS`` variável Makefile. Por exemplo:
zh_cn: 可以通过 “LATEXMKOPTS”Makefile 变量传递给 “latexmk” 选项。例如：

source: reduces console output to a minimum.
fr: réduit la sortie de la console au minimum.
pt_br: reduz saída na console ao mínimo.
zh_cn: 将控制台输出降至最低。

source: Also, if ``latexmk`` is at version 4.52b or higher (January 2017) ``LATEXMKOPTS="-xelatex"`` speeds up PDF builds via XeLateX in case of numerous graphics inclusions.
pt_br: Além disso, se ``latexmk`` estiver na versão 4.52b ou posterior (Janeiro de 2017), ``LATEXMKOPTS="-xelatex"`` aumenta a velocidade da construção de PDF via XeLateX em caso de inclusões diversos gráficos.
zh_cn: 另外，如果 “latexmk” 版本是4.52b或更高（1月17日），`LATEXMKOPTS=“-xelatex”` 将通过 xelatex 加速 PDF 构建，以防出现大量图形包含。

source: To pass options directly to the ``(pdf|xe|lua)latex`` binary, use variable ``LATEXOPTS``, for example:
pt_br: Para passar opções diretamente ao binário ``(pdf|xe|lua)latex``, use a variável ``LATEXOPTS``. por exemplo:
zh_cn: 要将选项直接传递到 “`（pdf | xe|lua）latex`` 二进制文件，请使用变量 `LATEXOPTS``”。例如：

source: Note that a direct PDF builder is being provided by `rinohtype`_. The builder's name is ``rinoh``. Refer to the `rinohtype manual`_ for details.
fr: Notez qu'un constructeur PDF direct est fourni par `rinohtype`_. Le nom du constructeur est "rinoh". Reportez-vous au manuel `rinohtype manual`_ pour plus de détails.
pt_br: Observe que um construtor do dicrect PDF está sendo fornecido por `rinohtype`_. O nome do construtor é ``rinoh``. Consulte o `manual do rinohtype`_ para detalhes.
zh_cn: 请注意，“rinohtype” 正在提供一个直接的PDF构建器。建筑商的名字叫“里诺”。有关详细信息，请参阅 “rinohtype 手册”。

source: This builder produces a text file for each reST file -- this is almost the same as the reST source, but with much of the markup stripped for better readability.
fr: Ce constructeur produit un fichier texte pour chaque fichier reST -- c'est presque la même chose que la source reST, mais avec une grande partie des balises supprimées pour une meilleure lisibilité.
ja: このビルダーはそれぞれのreSTファイルからテキストファイルを生成します。ほぼreSTのソースと同じですが、多くのマークアップが読みやすさのために落とされています。
pt_br: Esse construtor produz um arquivo texto para cada arquivo reST -- e é exatamente o mesmo que a fonte reST, mas sem as marcações que são suprimidas para melhor legibilidade.
zh_cn: 这个构建器为每个 reST 文件生成一个文本文件——这与 reST 源文件几乎相同，但是为了更好的可读性，去掉了许多标记。

source: This builder produces manual pages in the groff format. You have to specify which documents are to be included in which manual pages via the :confval:`man_pages` configuration value.
fr: Ce constructeur produit des pages de manuel au format groff. Vous devez spécifier quels documents doivent être inclus dans quelles pages de manuel via la valeur de configuration :confval:`man_pages`.
ja: このビルダーは、groffフォーマットのmanページを作成します。manページに含めるドキュメントは、 :confval:`man_pages` 設定値を使って指定します。
pt_br: Esse construtor produz páginas de manual no formato groff. Especificar quais documentos serão incluídos em quais páginas de manual através do valor de configuração :confval:`man_pages`.
zh_cn: 此生成器以 groff 格式生成手册页。您必须通过：confval:`man_pages` 配置值指定哪些文档要包含在哪些手册页中。

source: This builder produces Texinfo files that can be processed into Info files by the :program:`makeinfo` program. You have to specify which documents are to be included in which Texinfo files via the :confval:`texinfo_documents` configuration value.
fr: Ce constructeur produit des fichiers Texinfo qui peuvent être traités en fichiers Info par le programme :programme:`makeinfo'. Vous devez spécifier quels documents doivent être inclus dans quels fichiers Texinfo via la valeur de configuration :confval:`texinfo_documents`.
ja: このビルダーは、 :program:`makeinfo` プログラムを使って、Infoファイルを生成可能な、Texinfoファイルを生成します。どのドキュメントをTexinfoファイルに含めるかは、 :confval:`texinfo_documents` 設定値を使って設定します。
pt_br: Esse construtorproduz arquivos Texinfo que podem ser processados em arquivos Info através do :program:`makeinfo`. Especificar quais documentos serão incluídosem quais arquivos Texinfo através do valor de configuração :confval:`texinfo_documents`.
zh_cn: 此生成器生成 Texinfo 文件，这些文件可以由：program:`makeinfo` 程序处理为 Info 文件。您必须通过：confval:`Texinfo_documents` 配置值指定哪些Texinfo文件要包含在哪些文档。
