Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/builders/index.po
Languages: fr, ja, pt_br, zh_cn

source: The Info format is the basis of the on-line help system used by GNU Emacs and the terminal-based program :program:`info`. See :ref:`texinfo-faq` for more details. The Texinfo format is the official documentation system used by the GNU project. More information on Texinfo can be found at `<https://www.gnu.org/software/texinfo/>`_.
fr: Le format Info est la base du système d'aide en ligne utilisé par GNU Emacs et le programme terminal :programme:`info'. Voir :ref:`texinfo-faq` pour plus de détails. Le format Texinfo est le système de documentation officiel utilisé par le projet GNU. Plus d'informations sur Texinfo peuvent être trouvées sur `<https://www.gnu.org/software/texinfo/>`_.
ja: InfoフォーマットはGNU Emacsやターミナルベースの :program:`info` プログラムで使用される、オンラインヘルプシステムの基盤となっています。詳しくは、 :ref:`texinfo-faq` を参照してください。Texinfoフォーマットは、GNUプロジェクトの、公式なドキュメントシステムです。Texinfoについての詳細は、 `<https://www.gnu.org/software/texinfo/>`_ で見ることができます。
pt_br: Formato Info é a base da ajuda on-line usado por GNU Emacs e por programas baseados em termina :program:`info`. Veja :ref:`texinfo-faq` para mais detalhes. O formato Texinfo é o sistema de documentação usado pelo projeto GNU. Mais informações sobre o Texinfo podem ser encontradas em `<https://www.gnu.org/software/texinfo/>`_.
zh_cn: Info 格式是 gnuemacs 使用的在线帮助系统和基于终端的程序的基础：program:`Info`。有关详细信息，请参见：ref:`texinfo faq`。Texinfo 格式是 GNU 项目使用的官方文档系统。有关 Texinfo 的更多信息，请访问`<https://www.gnu.org/software/texinfo/>`_.

source: This builder uses a module that implements the Python serialization API (``pickle``, ``simplejson``, ``phpserialize``, and others) to dump the generated HTML documentation. The pickle builder is a subclass of it.
pt_br: Esse construtor usa um módulo que implementa API de serialização Python (``pickle``, ``simplejson``, ``phpserialize`` e outros) para dump da documentação HTML gerada. O construtor pickle é uma subclasse desse construtor.

source: A concrete subclass of this builder serializing to the `PHP serialization`_ format could look like this::
fr: Une sous-classe concrète de ce constructeur sérialisant au format `PHP serialization'_ pourrait ressembler à ceci: :
ja: このビルダーのサブクラスを作成して `PHP シリアライズ`_ フォーマットでシリアライズするには、以下のようにします::
pt_br: O formato de uma subclasse concreta desse construtor de serialização para `PHP serialization`_ aparenta::
zh_cn: 序列化为 “PHP serialization” 格式的此生成器的具体子类可能如下所示：

source: A module that implements ``dump()``, ``load()``, ``dumps()`` and ``loads()`` functions that conform to the functions with the same names from the pickle module. Known modules implementing this interface are ``simplejson``, ``phpserialize``, ``plistlib``, and others.
pt_br: O módulo que implementa funções ``dump()``, ``load()``, ``dumps()`` e ``loads()`` em acordo com funções com o mesmo nome do módulo usado. Módulos conhecidos que implementam essa interface são ``simplejson``, ``phpserialize``, ``plistlib`` e outros.

source: The suffix for all regular files.
fr: Le suffixe pour tous les fichiers réguliers.
ja: すべての通常のファイルに付くサフィックスです。
pt_br: O sufixo para todos arquivos padrão.
zh_cn: 所有常规文件的后缀。

source: The filename for the file that contains the "global context". This is a dict with some general configuration values such as the name of the project.
fr: Le nom du fichier contenant le "contexte globale". C'est un dictionnaire avec des valeurs générales de configuration telles que le nom du projet.
ja: "グローバルコンテキスト"を含むファイルのファイル名です。これは、プロジェクト名などの一般的な設定値を含む辞書です。
pt_br: O nome do arquivo que contém a "contexto global". Essa é uma configuração dicionário com alguns valores como nome do projeto.
zh_cn: 包含“全局上下文”的文件的文件名。这是一个包含一些常规配置值的 dict，例如项目的名称。

source: The filename for the search index Sphinx generates.
fr: Le nom de fichier de l'index de recherche que Sphinx génère.
ja: Sphinxが作成する、検索インデックスのファイル名です。
pt_br: O nome do arquivo para índice de busca que o Sphinx irá criar.
zh_cn: Sphinx 生成的搜索索引的文件名。

source: See :ref:`serialization-details` for details about the output format.
fr: Voir :ref:`serialization-details` pour plus de détails sur le format de sortie.
ja: 出力フォーマットの詳細については、 :ref:`serialization-details` を参照してください。
pt_br: Ver :ref:`serialization-details` para detalhes sobre formato de saída.
zh_cn: 有关输出格式的详细信息，请参见：ref:`serialization details'。

source: This builder produces a directory with pickle files containing mostly HTML fragments and TOC information, for use of a web application (or custom postprocessing tool) that doesn't use the standard HTML templates.
fr: Ce constructeur produit un répertoire avec des fichiers pickle contenant principalement des fragments HTML et des informations TOC, pour l'utilisation d'une application web (ou outil de post-traitement personnalisé) qui n'utilise pas les modèles HTML standard.
ja: このビルダーは、pickleでシリアライズしたほとんどのHTML片と、目次情報を含むディレクトリを作成します。このビルダーで生成した結果は、標準のHTMLテンプレートを使用しない、ウェブアプリケーションや、カスタムの後処理ツールで使えます。
pt_br: Esse construtor produz um diretório com arquivos com fragmentos de HTML e informações TOC tabela de conteúdo, para uso pela aplicação web (ou ferramenta personalizada pós processamento) que não utiliza modelos HTML padrão.
zh_cn: 这个构建器生成一个目录，其中包含 pickle 文件，主要包含 HTML 片段和 TOC 信息，以供不使用标准 HTML 模板的 web 应用程序（或自定义后处理工具）使用。

source: The old name ``web`` still works as well.
fr: L'ancien nom "Web" fonctionne toujours aussi bien.
ja: 古いビルダー名 ``web`` もまだ使用できます。
pt_br: O antigo nome ``web`` também continua funcionando.
zh_cn: 旧名 “web” 仍然有效。

source: The file suffix is ``.fpickle``. The global context is called ``globalcontext.pickle``, the search index ``searchindex.pickle``.
fr: Le suffixe du fichier est ``.fpickle``. Le contexte global s'appelle "globalcontext.pickle", l'index de recherche "searchindex.pickle".
ja: ファイルのサフィックスは ``.fpickle`` になります。グローバルコンテキストは ``globalcontext.pickle`` に、検索インデックスは ``searchindex.pickle`` になります。
pt_br: O sufixo do arquivo é ``.fpickle``. O contexto global é chamado ``globalcontext.pickle``, o índice pesquisa ``searchindex.pickle``.
zh_cn: 文件后缀为 “.fpickle”。全局上下文为“globalcontext.pickle”，搜索索引是“.searchpickle”.

source: This builder produces a directory with JSON files containing mostly HTML fragments and TOC information, for use of a web application (or custom postprocessing tool) that doesn't use the standard HTML templates.
fr: Ce constructeur produit un répertoire avec des fichiers JSON contenant principalement des fragments HTML et des informations TOC, pour l'utilisation d'une application web (ou outil de post-traitement personnalisé) qui n'utilise pas les modèles HTML standard.
ja: このビルダーは、jsonでシリアライズしたほとんどのHTML片と、目次情報を含むディレクトリを作成します。このビルダーで生成した結果は、標準のHTMLテンプレートを使用しない、ウェブアプリケーションや、カスタムの後処理ツールで使用できます。
pt_br: Esse construtor produz um diretório com arquivos JSON contendo maioria das informações HTML e TOC tabela de conteúdo, para uso da aplicação web (ou ferramenta de pós processamento) que não utilize modelos HTML padrão.
zh_cn: 这个生成器生成一个包含 JSON 文件的目录，其中大部分包含 HTML 片段和 TOC 信息，以供不使用标准 HTML 模板的 web 应用程序（或自定义后处理工具）使用。

source: The file suffix is ``.fjson``. The global context is called ``globalcontext.json``, the search index ``searchindex.json``.
fr: Le suffixe du fichier est ``.fjson``. Le contexte mondial s'appelle "globalcontext.json", l'index de recherche "searchindex.json".
ja: ファイルのサフィックスは ``.fjson`` になります。グローバルコンテキストは ``globalcontext.json`` に、検索インデックスは ``searchindex.json`` になります。
pt_br: O sufixo do arquivo é ``.fjson``. O contexto global é chamado ``globalcontext.json`` e o índice de busca ``searchindex.json``.
zh_cn: 文件后缀为 “.fpickle”。全局上下文为“globalcontext.pickle”，搜索索引是“.searchpickle”.

source: This builder produces gettext-style message catalogs. Each top-level file or subdirectory grows a single ``.pot`` catalog template.
fr: Ce constructeur produit des catalogues de messages de type gettext. Chaque fichier ou sous-répertoire de niveau supérieur développe un seul modèle de catalogue ``.pot``.
ja: このビルダーは、gettext スタイルのメッセージ カタログを生成します。最上位のファイルとサブディレクトリはそれぞれ1つの ``.pot`` カタログ テンプレートに変換されます。
pt_br: Esse construtor produz catálogos de mensagem estilo gettext. Cada arquivo de topo de nível ou subdiretório gera um simples catálogo padrão ``.pot``.
zh_cn: 此生成器生成 gettext 样式的消息目录。每个顶级文件或子目录都会增长一个单独的“.pot” 目录模板。

source: See the documentation on :ref:`intl` for further reference.
fr: Voir la documentation sur :ref:`intl` pour plus de détails.
ja: この機能については、 :ref:`intl` のドキュメントを参照してください。
pt_br: Para referências adicionais ver a documentação :ref:`intl`
zh_cn: 有关进一步参考，请参阅以下文档：ref:`intl'。

source: This builder produces an HTML overview of all :rst:dir:`versionadded`, :rst:dir:`versionchanged`, :rst:dir:`deprecated` and :rst:dir:`versionremoved` directives for the current :confval:`version`. This is useful to generate a changelog file, for example.
pt_br: Este construtor produz uma visão geral em HTML de todas as diretivas :rst:dir:`versionadded`, :rst:dir:`versionchanged`, :rst:dir:`deprecated` e :rst:dir:`versionremoved` para :confval:`version` atual. Isso é útil para gerar um arquivo de changelog, por exemplo.

source: This builder produces no output. The input is only parsed and checked for consistency. This is useful for linting purposes.
fr: Ce constructeur ne produit aucun rendement. L'entrée est seulement analysée et la cohérence est vérifiée. Ceci est utile pour le la vérification syntaxique.
ja: このビルダーは何も出力を行いません。入力ファイルをパースしその整合性を確認するだけです。これは入力ファイルの文法をチェックする場合有用です。
pt_br: Esse construtor não produz saída. A entra é passada e verificada só para consistência. Isso é útil para diversos propósitos.
zh_cn: 此生成器不生成输出。只分析和检查输入的一致性。这对于进行重要意图非常有用。

source: This builder scans all documents for external links, tries to open them with ``requests``, and writes an overview which ones are broken and redirected to standard output and to :file:`output.txt` in the output directory.
fr: Ce constructeur scanne tous les documents à la recherche de liens externes, essaie de les ouvrir avec des ``requêtes``, et écrit un aperçu de ceux qui sont cassés et redirigés vers la sortie standard et vers le fichier :file:`output.txt` dans le répertoire de sortie.
ja: このビルダーは、すべてのドキュメントの外部リンクをチェックして、 :mod:`requests` モジュールを使用してきちんと開けるかどうか確認を行います。壊れたリンク、および、リダイレクトされるリンクの情報を、標準出力と、出力ディレクトリの :file:`output.txt` というファイルに出力します。
pt_br: Esse construtor busca links externos em todos os documentos, tenta abrir esses links com ``requests``, e grava uma visão com os inconsistentes e redireciona para a saída padrão e para :file:`output.txt` no diretório de saída.
zh_cn: 此生成器扫描所有文档以查找外部链接，尝试使用“请求”打开它们，并编写一个概述，其中哪些链接已断开并重定向到标准输出和：file:`输出 .txt` 在输出目录中。

source: Since Sphinx 1.5, the linkcheck builder uses the requests module.
pt_br: Desde Sphinx 1.5, o construtor linkcheck usa o módulo requests.

source: The linkcheck builder retries links when servers apply rate limits.
pt_br: O construtor linkcheck tenta acessar links novamente quando os servidores aplicam limites de taxa de acesso.

source: This builder produces Docutils-native XML files. The output can be transformed with standard XML tools such as XSLT processors into arbitrary final forms.
fr: Ce constructeur produit des fichiers XML natifs Docutils. La sortie peut être transformée avec des outils XML standard tels que les processeurs XSLT en formes finales arbitraires.
ja: このビルダーは、Docutils ネイティブのXML ファイルを生成します。出力されたファイルはXSLTプロセッサなどの標準的なXMLツールで任意の最終的なフォーマットに変換できます。
pt_br: Esse construtor produz arquivos XML nativos de Docutils. A saída pode ser transformada com ferramentas XML padrão como processadores XSLT em formulários prontos arbitrários.
zh_cn: 此生成器生成 Docutils 本机 XML 文件。输出可以用标准的 XML 工具（如 XSLT 处理器）转换成任意的最终形式。

source: This builder is used for debugging the Sphinx/Docutils "Reader to Transform to Writer" pipeline. It produces compact pretty-printed "pseudo-XML", files where nesting is indicated by indentation (no end-tags). External attributes for all elements are output, and internal attributes for any leftover "pending" elements are also given.
fr: Ce constructeur est utilisé pour déboguer le pipeline Sphinx/Docutils "Reader to Transform to Writer". Il produit des fichiers "pseudo-XML" joliment imprimés et compacts, où l'imbrication est indiquée par une indentation (pas de balises de fin). Les attributs externes pour tous les éléments sont édités, et les attributs internes pour les éléments "en attente" restants sont également donnés.
ja: このビルダーは、Sphinx/Docutilsの「読み込み（Reader）・変換（Transform）・書き出し（Writer）」パイプラインのデバッグに使うことが出来ます。このビルダーは入れ子構造で(終了タグ)のないコンパクトな"擬似XML"ファイルを生成します。全てのエレメントの外部属性が出力され、また残りの「保留中」の要素の内部属性も出力されます。
pt_br: Esse construtor é usado para depuração do Sphinx/Docutils na linha "Leitor para Transformador para Escritor". Produz arquivos de counteúdo formatado "pseudo-XML", aninhados por identação (sem marcas finais). Atributos externos para todos elementos são criados bem como atributos internos para qualquer pendência de elemento, também é dada.
zh_cn: 此生成器用于调试 Sphinx/Docutils“Reader to Transform to Writer” 管道。它生成紧凑的漂亮打印的“伪 XML”文件，其中嵌套由缩进表示（没有结束标记）。输出所有元素的外部属性，并给出任何剩余的“挂起”元素的内部属性。

source: Built-in Sphinx extensions that offer more builders are:
fr: Built-in Sphinx extensions qui offrent plus de constructeurs sont :
ja: 組み込みのSphinx拡張には、以下の追加のビルダーが含まれます:
pt_br: Extensões embutidas do Sphinx que oferecem mais construtores são:
zh_cn: 提供更多构建器的内置 Sphinx 扩展包括：

source: Serialization builder details
fr: Détails du constructeur de la sérialisation
ja: シリアライズを行うビルダーの詳細
pt_br: Detalhes de construtores de serialização
zh_cn: 序列化生成器详细信息

source: All serialization builders outputs one file per source file and a few special files. They also copy the reST source files in the directory ``_sources`` under the output directory.
fr: Tous les constructeurs de sérialisation produisent un fichier par fichier source et quelques fichiers spéciaux. Ils copient également les fichiers sources reST dans le répertoire ``_sources'' sous le répertoire de sortie.
ja: すべてのシリアライズを行うビルダーは、ソースファイル１つごとに対応するファイルと、いくつかの特殊なファイルを出力します。また、reST形式のソースファイルは、出力ディレクトリ内の ``_sources`` ディレクトリ内にコピーされます。
pt_br: Todos os construtores de serialização produzem saída em um arquivo para cada arquivo fonte e alguns arquivos especiais. Também são copiados os arquivos fonte reST do diretório ``_sources`` para o diretório de saída.
zh_cn: 所有序列化生成器为每个源文件输出一个文件和一些特殊文件。它们还将其余源文件复制到输出目录下的 “u sources” 目录中。

source: The :class:`.PickleHTMLBuilder` is a builtin subclass that implements the pickle serialization interface.
fr: La classe :class:`.PickleHTMLBuilder` est une sous-classe intégrée qui implémente l'interface de sérialisation pickle.
ja: :class:`.PickleHTMLBuilder` クラスは組み込みのサブクラスで、pickleでシリアライズを行うインタフェースを実装しています。
pt_br: A :class:`.PickleHTMLBuilder` é uma subclasse embutida que implementa o interface de serialização com pickle.
zh_cn: class:`.PickleHTMLBuilder` 是一个实现 pickle 序列化接口的内置子类。

source: The files per source file have the extensions of :attr:`~.SerializingHTMLBuilder.out_suffix`, and are arranged in directories just as the source files are. They unserialize to a dictionary (or dictionary like structure) with these keys:
fr: Les fichiers par fichier source ont les extensions de :attr:`~.SerializingHTMLBuilder.out_suffix`, et sont organisées en répertoires comme les fichiers sources. Ils sont désérialisés en dictionnaire (ou une structure de type dictionnaire) avec ces clés :
ja: ソースファイルごとに出力されるファイルは :attr:`~.SerializingHTMLBuilder.out_suffix` で指定された拡張子を持ち、ソースファイルと同様のディレクトリ構成で書き出されます。これらのファイルは以下のようなキーを持つ辞書、あるいは辞書のようなオブジェクトとして復元することが可能です。
pt_br: Os arquivos por arquivo fonte têm extensões de :attr:`~.SerializingHTMLBuilder.out_suffix`, e são organizadas em diretórios como estão os arquivos fonte. Eles são desserializados para um dicionário, ou estrutura similar, com essas chaves:
zh_cn: 每个源文件的扩展名为：attr:` ~.Serializingtmlbuilder.out_后缀`，和在目录中的排列方式与源文件相同。它们使用以下键将非序列化为字典（或类似字典的结构）：

source: The HTML "body" (that is, the HTML rendering of the source file), as rendered by the HTML translator.
fr: Le "corps" HTML (c'est-à-dire le rendu HTML du fichier source), tel que rendu par le traducteur HTML.
ja: HTMLの本体が格納されています。HTMLトランスレータを利用してレンダリングされたものになります。
pt_br: O "corpo" HTML (que é o HTML renderizado do arquivo fonte), como renderizado pelo tradutor HTML.
zh_cn: HTML“body”（即源文件的 HTML 呈现），由 HTML 转换器呈现。

source: The title of the document, as HTML (may contain markup).
fr: Le titre du document, en HTML (peut contenir des balises).
ja: ドキュメントのタイトルです。HTMLのマークアップが含まれている可能性があります。
pt_br: O título do documento, como HTML (pode conter marcação).
zh_cn: 文档的标题，如 HTML（可能包含标记）。

source: The table of contents for the file, rendered as an HTML ``<ul>``.
fr: La table des matières du fichier, rendu en HTML ``<ul>``.
ja: ファイルの索引になります。HTMLの ``<ul>`` を使って表現されています。
pt_br: A tabela de conteúdo ou sumário do arquivo, renderizado como um ``<ul>`` de HTML.
zh_cn: 文件的目录，呈现为 HTML <ul>。

source: A boolean that is ``True`` if the ``toc`` contains more than one entry.
fr: Un booléen qui est à "True" si le "toc" contient plus d'une entrée.
ja: ``toc`` が一つ以上のエントリーを含む場合に ``True`` になる、ブール型の値になります。
pt_br: Um booleano que é ``True`` se o ``toc`` contém mais de uma entrada.
zh_cn: 如果“toc”包含多个条目，则为“True”的布尔值。

source: The document name of the current file.
fr: Le nom du document du fichier courant.
ja: 現在のファイルのドキュメント名になります。
pt_br: O nome do documento do arquivo atual.
zh_cn: 当前文件的文档名。

source: ``parents``, ``prev`` and ``next``
pt_br: ``parents``, ``prev`` e ``next``

source: Information about related chapters in the TOC tree. Each relation is a dictionary with the keys ``link`` (HREF for the relation) and ``title`` (title of the related document, as HTML). ``parents`` is a list of relations, while ``prev`` and ``next`` are a single relation.
fr: Informations sur les chapitres connexes dans l'arborescence TOC. Chaque relation est un dictionnaire avec les clés "lien" (HREF pour la relation) et "titre" (titre du document associé, en HTML). "parents" est une liste de relations, alors que "précédent" et "suivant" sont une relation unique.
ja: TOCツリー上で関連する章の情報です。関連は辞書として表現されます。 ``link``\ (HREF情報)と\ ``title``\ (関連ドキュメントのタイトル情報のHTML)が含まれます。 ``parents``\ の場合には、関連のリストが含まれますが、\ ``prev``\ と\ ``next``\ の場合には関連が一つだけ含まれます。
pt_br: Informações sobre os capítulos relacionados na árvore de TOC. Cada relação é um dicionário com as chaves ``link`` (HREF da relação) e ``title`` (título do documento relacionado, como HTML). ``parents`` é a lista de relações, enquanto ``prev`` e ``next`` são relações simples.
zh_cn: 有关目录树中相关章节的信息。每个关系都是一个字典，其键为“link”（表示关系的HREF）和“title”（相关文档的标题，以 HTML 形式）。``parents 是一个关系列表，而prev 和 next 是一个关系。

source: The name of the source file under ``_sources``.
fr: Le nom du fichier source sous ``_sources``.
ja: ``_sources``\ 以下に置かれている、ソースファイルの名前になります。
pt_br: O nome do arquivo fonte sob ``_sources``.
zh_cn: “%u sources”下的源文件的名称。

source: The special files are located in the root output directory. They are:
fr: Les fichiers spéciaux se trouvent dans le répertoire de sortie racine. Ils sont :
ja: 出力ディレクトリのルートには、以下の特殊なファイルが配置されます:
pt_br: Arquivos especiais localizados na raiz do diretório. São eles:
zh_cn: 特殊文件位于根输出目录中。他们是：

source: A pickled dict with these keys:
fr: Un dictionnaire pickle avec ces clés :
ja: pickleでシリアライズされた辞書です。以下のキーを持っています:
pt_br: Um dicionário serializado com pickle com as seguintes chaves:
zh_cn: 用这些键腌制的 dict：

source: The same values as given in the configuration file.
fr: Les mêmes valeurs que celles données dans le fichier de configuration.
ja: 設定ファイルで指定された、同じ名前の設定の値が入ります。
pt_br: Os mesmos valores informados no arquivo de configuração.
zh_cn: 与配置文件中给定的值相同。

source: Date of last build.
fr: Date de la dernière construction.
ja: 最後にビルドした日時です。
pt_br: Data da última construção.
zh_cn: 最近修订时间。

source: Name of the used builder, in the case of pickles this is always ``'pickle'``.
fr: Nom du constructeur utilisé, dans le cas de sérialisations, on a toujours la valeur ``'pickle'``.
ja: 使用したビルダーの名前です。この場合はこれは常に\ ``'pickle'``\ になります。
pt_br: Nome do construtor usado, no caso de serializações com pickle isso sempre será ``'pickle'``.
zh_cn: 使用的生成器的名称，如果是 pickle，则始终为“pickle”。

source: A dictionary of all documents' titles, as HTML strings.
fr: Un dictionnaire des titres de tous les documents, sous forme de chaînes HTML.
ja: すべてのドキュメントのHTML形式のタイトルを含む辞書です。
pt_br: Um dicionário com todos os títulos de documentos, como strings HTML.
zh_cn: 所有文档标题的字典，如 HTML 字符串。

source: An index that can be used for searching the documentation. It is a pickled list with these entries:
fr: Un index qui peut être utilisé pour rechercher dans la documentation. C'est une liste sérialisée avec ces entrées :
ja: ドキュメントの検索で使用されるインデックスになります。以下のエントリーを含む、pickleでシリアライズされたエントリーのリストになります。
pt_br: Um índice que pode ser usado para busca na documentação. É uma lista com estas entradas:
zh_cn: 可用于搜索文档的索引。它是一个包含以下条目的 pickle 列表：

source: A list of indexed docnames.
fr: Une liste de noms de documents indexés.
ja: インデックスが作成されたドキュメント名のリストです。
pt_br: Uma lista de nomes de documentos (docnames) indexados.
zh_cn: 索引文档名的列表。

source: A list of document titles, as HTML strings, in the same order as the first list.
fr: Une liste de titres de document, sous forme de chaînes HTML, dans le même ordre que la première liste.
ja: HTMLの文字列形式で作成された、タイトルのリストです。最初のリストと同じ順序になっています。
pt_br: Uma lista de títulos de documentos, como strings HTML, na mesma ordem da primeira lista.
zh_cn: 文档标题的列表，如 HTML 字符串，与第一个列表的顺序相同。

source: A dict mapping word roots (processed by an English-language stemmer) to a list of integers, which are indices into the first list.
fr: Un dictionnaire de correspondance de racines de mot (traité par un stemmer en langue anglaise) à une liste d'entiers, qui sont des indices dans la première liste.
ja: 単語から、数値のリストへの辞書です。この数値は最初のリストのインデックスになります。
pt_br: Um dicionário mapeando raízes de palavras (processadas por tratamento de idioma Inglês) para uma lista de inteiros, os quais possuem índices na primeira lista.
zh_cn: 将词根（由英语词干分析器处理）映射到整数列表的 dict，整数是第一个列表的索引。

source: The build environment. This is always a pickle file, independent of the builder and a copy of the environment that was used when the builder was started.
fr: L'environnement de construction. Il s'agit toujours d'un fichier pickle, indépendant du constructeur et d'une copie de l'environnement utilisé lors du démarrage du constructeur.
ja: ビルド環境です。これは常にpickleでシリアライズされたファイルで、ビルダーとは独立しています。ビルダーが起動された地点で使用された、環境のコピーです。ドキュメント間の共有のメンバーです。
pt_br: O ambiente do construtor. Sempre é um arquivo pickle, independentemente do construtor e uma cópia do ambiente usado quando o construtor foi iniciado.
zh_cn: 生成环境。这始终是一个 pickle 文件，独立于构建器，并且是启动构建器时使用的环境的副本。

source: Todo
fr: À faire
pt_br: Por fazer
zh_cn: 待处理

source: Document common members.
fr: Membres communs du document.
ja: 共通メンバーのドキュメントを書く
pt_br: Membros comuns do documento.
zh_cn: 记录普通成员。

source: Unlike the other pickle files this pickle file requires that the ``sphinx`` package is available on unpickling.
fr: Contrairement aux autres fichiers de sérialisation, ce fichier de sérialisation nécessite que le paquet ``sphinx`` soit disponible lors de la désérialisation.
ja: 他のシリアライズされたファイルとは異なり、このファイルは ``sphinx`` のパッケージのみが中を読むことを想定しています。
pt_br: Diferentemente de outros arquivos pickle, esse arquivo requer que o pacote ``sphinx`` esteja disponível na desserialização com pickle.
zh_cn: 与其他 pickle 文件不同，这个 pickle 文件要求“sphinx”包在取消 pickle 时可用。
