Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/changes/0.1.po
Languages: pt_br

source: Release 0.1.61950 (Mar 26, 2008)
pt_br: Versão 0.1.61950 (26 mar 2008)

source: sphinx.quickstart: Fix format string for Makefile.
pt_br: sphinx.quickstart: Corrige sequência de formato para Makefile.

source: Release 0.1.61945 (Mar 26, 2008)
pt_br: Versão 0.1.61945 (26 mar 2008)

source: sphinx.htmlwriter, sphinx.latexwriter: Support the ``.. image::`` directive by copying image files to the output directory.
pt_br: sphinx.htmlwriter, sphinx.latexwriter: Suporte à diretiva ``.. image::`` copiando arquivos de imagem para o diretório de saída.

source: sphinx.builder: Consistently name "special" HTML output directories with a leading underscore; this means ``_sources`` and ``_static``.
pt_br: sphinx.builder: Nomeia consistentemente os diretórios de saída HTML "especiais" com um sublinhado à esquerda; isso significa ``_sources`` e ``_static``.

source: sphinx.environment: Take dependent files into account when collecting the set of outdated sources.
pt_br: sphinx.environment: Leva em consideração os arquivos dependentes ao coletar o conjunto de fontes desatualizadas.

source: sphinx.directives: Record files included with ``.. literalinclude::`` as dependencies.
pt_br: sphinx.directives: Registra arquivos incluídos com ``.. literalinclude::`` como dependências.

source: sphinx.ext.autodoc: Record files from which docstrings are included as dependencies.
pt_br: sphinx.ext.autodoc: Registre arquivos dos quais as docstrings são incluídas como dependências.

source: sphinx.builder: Rebuild all HTML files in case of a template change.
pt_br: sphinx.builder: Reconstrói todos os arquivos HTML em caso de alteração de modelo.

source: sphinx.builder: Handle unavailability of TOC relations (previous/ next chapter) more gracefully in the HTML builder.
pt_br: sphinx.builder: Lida com a indisponibilidade de relações de TOC (capítulo anterior/próximo) de forma mais elegante no construtor de HTML.

source: sphinx.latexwriter: Include fncychap.sty which doesn't seem to be very common in TeX distributions. Add a ``clean`` target in the latex Makefile. Really pass the correct paper and size options to the LaTeX document class.
pt_br: sphinx.latexwriter: Inclui fncychap.sty que não parece ser muito comum em distribuições TeX. Adiciona um alvo ``clean`` no Makefile do latex. Realmente passa as opções corretas de papel e tamanho para a classe de documento LaTeX.

source: setup: On Python 2.4, don't egg-depend on Docutils if a Docutils is already installed -- else it will be overwritten.
pt_br: setup: No Python 2.4, não dependa do Docutils se ele já estiver instalado, caso contrário, ele será substituído.

source: Release 0.1.61843 (Mar 24, 2008)
pt_br: Versão 0.1.61843 (24 mar 2008)

source: sphinx.quickstart: Really don't create a makefile if the user doesn't want one.
pt_br: sphinx.quickstart: Realmente não cria um makefile se o usuário não quiser um.

source: setup: Don't install scripts twice, via setuptools entry points and distutils scripts. Only install via entry points.
pt_br: setup: Não instala scripts duas vezes, via pontos de entrada setuptools e scripts distutils. Instale somente via pontos de entrada.

source: sphinx.builder: Don't recognize the HTML builder's copied source files (under ``_sources``) as input files if the source suffix is ``.txt``.
pt_br: sphinx.builder: Não reconhece os arquivos fonte copiados do construtor HTML (em ``_sources``) como arquivos de entrada se o sufixo de origem for ``.txt``.

source: sphinx.highlighting: Generate correct markup for LaTeX Verbatim environment escapes even if Pygments is not installed.
pt_br: sphinx.highlighting: Gera marcação correta para escapes de ambiente LaTeX Verbatim, mesmo que o Pygments não esteja instalado.

source: sphinx.builder: The WebHTMLBuilder is now called PickleHTMLBuilder.
pt_br: sphinx.builder: O WebHTMLBuilder agora é chamado de PickleHTMLBuilder.

source: sphinx.htmlwriter: Make parsed-literal blocks work as expected, not highlighting them via Pygments.
pt_br: sphinx.htmlwriter: Faz com que os blocos literais analisados ​​funcionem conforme o esperado, sem destacá-los por meio do Pygments.

source: sphinx.environment: Don't error out on reading an empty source file.
pt_br: sphinx.environment: Não comete erros ao ler um arquivo fonte vazio.

source: Release 0.1.61798 (Mar 23, 2008)
pt_br: Versão 0.1.61798 (23 mar 2008)

source: sphinx: Work with Docutils SVN snapshots as well as 0.4.
pt_br: sphinx: Trabalha com snapshots do Docutils SVN e também com a versão 0.4.

source: sphinx.ext.doctest: Make the group in which doctest blocks are placed selectable, and default to ``'default'``.
pt_br: sphinx.ext.doctest: Torna o grupo no qual os blocos doctest são colocados selecionável e o padrão seja ``'default'``.

source: sphinx.ext.doctest: Replace ``<BLANKLINE>`` in doctest blocks by real blank lines for presentation output, and remove doctest options given inline.
pt_br: sphinx.ext.doctest: Substitui ``<BLANKLINE>`` nos blocos doctest por linhas em branco reais para saída de apresentação e remova as opções de doctest fornecidas em linha.

source: sphinx.environment: Move doctest_blocks out of block_quotes to support indented doctest blocks.
pt_br: sphinx.environment: Move doctest_blocks para fora de block_quotes para suportar blocos doctest indentados.

source: sphinx.ext.autodoc: Render ``.. automodule::`` docstrings in a section node, so that module docstrings can contain proper sectioning.
pt_br: sphinx.ext.autodoc: Renderiza ``.. automodule::`` docstrings em um nó de seção, para que as docstrings do módulo possam conter o seccionamento adequado.

source: sphinx.ext.autodoc: Use the module's encoding for decoding docstrings, rather than requiring ASCII.
pt_br: sphinx.ext.autodoc: Usa a codificação do módulo para decodificar docstrings, em vez de exigir ASCII.

source: Release 0.1.61611 (Mar 21, 2008)
pt_br: Versão 0.1.61611 (21 mar 2008)

source: First public release.
pt_br: Primeiro lançamento público.
