Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/changes/5.2.po
Languages: pt_br

source: Release 5.2.3 (released Sep 30, 2022)
pt_br: Versão 5.2.3 (lançada em 30 set 2022)

source: #10878: Fix base64 image embedding in ``sphinx.ext.imgmath``
pt_br: #10878: Corrige a incorporação de imagem base64 em ``sphinx.ext.imgmath``

source: #10886: Add ``:nocontentsentry:`` flag and global domain table of contents entry control option. Patch by Adam Turner
pt_br: #10886: Adiciona o sinalizador ``:nocontentsentry:`` e a opção de controle de entrada de tabela de conteúdo de domínio global. Patch de Adam Turner

source: Release 5.2.2 (released Sep 27, 2022)
pt_br: Versão 5.2.2 (lançada em 27 set 2022)

source: #10872: Restore link targets for autodoc modules to the top of content. Patch by Dominic Davis-Foster.
pt_br: #10872: Restaura alvos de link para módulos autodoc para o topo do conteúdo. Patch de Dominic Davis-Foster.

source: Release 5.2.1 (released Sep 25, 2022)
pt_br: Versão 5.2.1 (lançada em 25 set 2022)

source: Bugs fixed
pt_br: Erros corrigidos

source: #10861: Always normalise the ``pycon3`` lexer to ``pycon``.
pt_br: #10861: Sempre normaliza o analisador léxico ``pycon3`` para ``pycon``.

source: Fix using ``sphinx.ext.autosummary`` with modules containing titles in the module-level docstring.
pt_br: Corrige o uso de ``sphinx.ext.autosummary`` com módulos contendo títulos na docstring de nível de módulo.

source: Release 5.2.0.post0 (released Sep 24, 2022)
pt_br: Versão 5.2.0.post0 (lançada em 24 set 2022)

source: Recreated source tarballs for Debian maintainers.
pt_br: Tarballs de código-fonte recriados para mantenedores do Debian.

source: Release 5.2.0 (released Sep 24, 2022)
pt_br: Versão 5.2.0 (lançada em 24 set 2022)

source: Dependencies
pt_br: Dependências

source: #10356: Sphinx now uses declarative metadata with ``pyproject.toml`` to create packages, using PyPA's ``flit`` project as a build backend. Patch by Adam Turner.
pt_br: #10356: O Sphinx agora usa metadados declarativos com ``pyproject.toml`` para criar pacotes, usando o projeto ``flit`` do PyPA como um backend de construção. Patch de Adam Turner.

source: Deprecated
pt_br: Descontinuada

source: #10843: Support for HTML 4 output. Patch by Adam Turner.
pt_br: #10843: Suporte para saída HTML 4. Patch de Adam Turner.

source: Features added
pt_br: Funcionalidades adicionadas

source: #10738: napoleon: Add support for docstring types using 'of', like ``type of type``. Example: ``tuple of int``.
pt_br: #10738: napoleon: Adiciona suporte para tipos de docstring usando 'of', como ``type of type``. Exemplo: ``tuple of int``.

source: #10286: C++, support requires clauses not just between the template parameter lists and the declaration.
pt_br: #10286: C++, o suporte requer cláusulas não apenas entre as listas de parâmetros do modelo e a declaração.

source: #10755: linkcheck: Check the source URL of raw directives that use the ``url`` option.
pt_br: #10755: linkcheck: Verifica a URL de origem das diretivas brutas que usam a opção ``url``.

source: #10781: Allow :rst:role:`ref` role to be used with definitions and fields.
pt_br: #10781: Permite que o papel :rst:role:`ref` seja usada com definições e campos.

source: #10717: HTML Search: Increase priority for full title and subtitle matches in search results
pt_br: #10717: Pesquisa HTML: Aumentaa a prioridade para correspondências de título completo e subtítulo nos resultados da pesquisa

source: #10718: HTML Search: Save search result score to the HTML element for debugging
pt_br: #10718: Pesquisa HTML: Salva a pontuação do resultado da pesquisa no elemento HTML para depuração

source: #10673: Make toctree accept 'genindex', 'modindex' and 'search' docnames
pt_br: #10673: Faz o toctree aceitar os docname 'genindex', 'modindex' e 'search'

source: #6316, #10804: Add domain objects to the table of contents. Patch by Adam Turner
pt_br: #6316, #10804: Adiciona objetos de domínio ao índice. Patch de Adam Turner

source: #6692: HTML Search: Include explicit :rst:dir:`index` directive index entries in the search index and search results. Patch by Adam Turner
pt_br: #6692: Pesquisa HTML: Inclui entradas de índice de diretiva explícitas :rst:dir:`index` no índice de pesquisa e nos resultados da pesquisa. Patch de Adam Turner

source: #10816: imgmath: Allow embedding images in HTML as base64
pt_br: #10816: imgmath: Permite a incorporação de imagens em HTML como base64

source: #10854: HTML Search: Use browser localstorage for highlight control, stop storing highlight parameters in URL query strings. Patch by Adam Turner.
pt_br: #10854: Pesquisa HTML: Usa o localstorage do navegador para controle de destaque, para de armazenar parâmetros de destaque em strings de consulta de URL. Patch de Adam Turner.

source: #10723: LaTeX: 5.1.0 has made the 'sphinxsetup' ``verbatimwithframe=false`` become without effect.
pt_br: #10723: LaTeX: 5.1.0 fez com que o 'sphinxsetup' ``verbatimwithframe=false`` ficasse sem efeito.

source: #10257: C++, ensure consistent non-specialization template argument representation.
pt_br: #10257: C++, garante representação consistente de argumentos de modelo de não especialização.

source: #10729: C++, fix parsing of certain non-type template parameter packs.
pt_br: #10729: C++, corrige análise de certos pacotes de parâmetros de modelo não-tipo.

source: #10715: Revert #10520: "Fix" use of sidebar classes in ``agogo.css_t``
pt_br: #10715: Reverte #10520: "Corrige" o uso de classes de barra lateral em ``agogo.css_t``
