Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/changes/6.1.po
Languages: pt_br

source: Release 6.1.3 (released Jan 10, 2023)
pt_br: Versão 6.1.3 (lançada em 10 jan 2023)

source: Bugs fixed
pt_br: Erros corrigidos

source: #11116: Reverted to previous Sphinx 5 node copying method
pt_br: #11116: Revertido para o método de cópia de nó Sphinx 5 anterior

source: #11117: Reverted changes to parallel image processing from Sphinx 6.1.0
pt_br: #11117: Alterações revertidas no processamento de imagem paralelo do Sphinx 6.1.0

source: #11119: Suppress ``ValueError`` in the ``linkcheck`` builder
pt_br: #11119: Suprime ``ValueError`` no construtor ``linkcheck``

source: Release 6.1.2 (released Jan 07, 2023)
pt_br: Versão 6.1.2 (lançada em 07 jan 2023)

source: #11101: LaTeX: ``div.topic_padding`` key of sphinxsetup documented at 5.1.0 was implemented with name ``topic_padding``
pt_br: #11101: LaTeX: A chave ``div.topic_padding`` do sphinxsetup documentada em 5.1.0 foi implementada com o nome ``topic_padding``

source: #11099: LaTeX: ``shadowrule`` key of sphinxsetup causes PDF build to crash since Sphinx 5.1.0
pt_br: #11099: LaTeX: A chave ``shadowrule`` do sphinxsetup faz com que a construção do PDF trave desde o Sphinx 5.1.0

source: #11096: LaTeX: ``shadowsize`` key of sphinxsetup causes PDF build to crash since Sphinx 5.1.0
pt_br: #11096: LaTeX: A chave ``shadowsize`` do sphinxsetup faz com que a construção do PDF trave desde o Sphinx 5.1.0

source: #11095: LaTeX: shadow of :dudir:`topic` and :dudir:`contents <table-of-contents>` boxes not in page margin since Sphinx 5.1.0
pt_br: #11095: LaTeX: sombra das caixas :dudir:`topic` e :dudir:`contents <table-of-content>` não estão na margem da página desde o Sphinx 5.1.0

source: #11100: Fix copying images when running under parallel mode.
pt_br: #11100: Corrige a cópia de imagens ao executar no modo paralelo.

source: Release 6.1.1 (released Jan 05, 2023)
pt_br: Versão 6.1.1 (lançada em 05 jan 2023)

source: #11091: Fix ``util.nodes.apply_source_workaround`` for ``literal_block`` nodes with no source information in the node or the node's parents.
pt_br: #11091: Corrige ``util.nodes.apply_source_workaround`` para nós de ``literal_block`` sem informações de origem no nó ou nos pais do nó.

source: Release 6.1.0 (released Jan 05, 2023)
pt_br: Versão 6.1.0 (lançada em 05 jan 2023)

source: Dependencies
pt_br: Dependências

source: Adopted the `Ruff`_ code linter.
pt_br: Adotado o linter de código `Ruff`_.

source: Incompatible changes
pt_br: Atualizações incompatíveis

source: #10979: gettext: Removed support for pluralisation in ``get_translation``. This was unused and complicated other changes to ``sphinx.locale``.
pt_br: #10979: gettext: Removido o suporte para pluralização em ``get_translation``. Isso não era usado e complicava outras alterações em ``sphinx.locale``.

source: Deprecated
pt_br: Descontinuada

source: ``sphinx.util`` functions:
pt_br: Funções ``sphinx.util``:

source: Renamed ``sphinx.util.typing.stringify()`` to ``sphinx.util.typing.stringify_annotation()``
pt_br: Renomeada ``sphinx.util.typing.stringify()`` para ``sphinx.util.typing.stringify_annotation()``

source: Moved ``sphinx.util.xmlname_checker()`` to ``sphinx.builders.epub3._XML_NAME_PATTERN``
pt_br: Movida ``sphinx.util.xmlname_checker()`` para ``sphinx.builders.epub3._XML_NAME_PATTERN``

source: Moved to ``sphinx.util.display``:
pt_br: Movida para ``sphinx.util.display``:

source: Moved to ``sphinx.util.http_date``:
pt_br: Movida para ``sphinx.util.http_date``:

source: Moved to ``sphinx.util.exceptions``:
pt_br: Movida para ``sphinx.util.exceptions``:

source: Features added
pt_br: Funcionalidades adicionadas

source: Cache doctrees in the build environment during the writing phase.
pt_br: Armazena em cache doctrees no ambiente de construção durante a fase de escrita.

source: Make all writing phase tasks support parallel execution.
pt_br: Faz com que todas as tarefas da fase de escrita suportem execução paralela.

source: #11072: Use PEP 604 (``X | Y``) display conventions for ``typing.Optional`` and ``typing.Optional`` types within the Python domain and autodoc.
pt_br: #11072: Usa as convenções de exibição da PEP 604 (``X | Y``) para os tipos ``typing.Optional`` e ``typing.Optional`` dentro do domínio Python e autodoc.

source: #10700: autodoc: Document ``typing.NewType()`` types as classes rather than 'data'.
pt_br: #10700: autodoc: Documenta os tipos ``typing.NewType()`` como classes em vez de 'data'.

source: Cache doctrees between the reading and writing phases.
pt_br: Armazena em cache doctrees entre as fases de leitura e escrita.

source: #10962: HTML: Fix the multi-word key name lookup table.
pt_br: #10962: HTML: Corrige a tabela de consulta de nomes de chaves com várias palavras.

source: Fixed support for Python 3.12 alpha 3 (changes in the ``enum`` module).
pt_br: Corrigido suporte para Python 3.12 alpha 3 (alterações no módulo ``enum``).

source: #11069: HTML Theme: Removed outdated "shortcut" link relation keyword.
pt_br: #11069: Tema HTML: Removida a palavra-chave de relação de link "atalho" desatualizada.

source: #10952: Properly terminate parallel processes on programme interruption.
pt_br: #10952: Encerra corretamente os processos paralelos na interrupção do programa.

source: #10988: Speed up ``TocTree.resolve()`` through more efficient copying.
pt_br: #10988: Acelera ``TocTree.resolve()`` por meio de cópias mais eficientes.

source: #6744: LaTeX: support for seealso directive should be via an environment to allow styling.
pt_br: #6744: LaTeX: suporte para a diretiva seealso deve ser feito por meio de um ambiente que permita estilização.

source: #11074: LaTeX: Can't change sphinxnote to use sphinxheavybox starting with 5.1.0
pt_br: #11074: LaTeX: Não é possível alterar o sphinxnote para usar o sphinxheavybox a partir da versão 5.1.0
