Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/changes/6.2.po
Languages: pt_br

source: Release 6.2.1 (released Apr 25, 2023)
pt_br: Versão 6.2.1 (lançada em 25 abr 2023)

source: Bugs fixed
pt_br: Erros corrigidos

source: #11355: Revert the default type of :confval:`nitpick_ignore` and :confval:`nitpick_ignore_regex` to ``list``.
pt_br: #11355: Reverte o tipo padrão de :confval:`nitpick_ignore` e :confval:`nitpick_ignore_regex` para ``list``.

source: Release 6.2.0 (released Apr 23, 2023)
pt_br: Versão 6.2.0 (lançada em 23 abr 2023)

source: Dependencies
pt_br: Dependências

source: Require Docutils 0.18.1 or greater.
pt_br: Requer Docutils 0.18.1 ou posterior.

source: Incompatible changes
pt_br: Atualizações incompatíveis

source: LaTeX: removal of some internal TeX ``\dimen`` registers (not previously publicly documented) as per 5.1.0 code comments in ``sphinx.sty``: ``\sphinxverbatimsep``, ``\sphinxverbatimborder``, ``\sphinxshadowsep``, ``\sphinxshadowsize``, and ``\sphinxshadowrule``. (refs: #11105)
pt_br: LaTeX: remoção de alguns registros internos ``\dimen`` do TeX (não documentados anteriormente publicamente) conforme comentários do código 5.1.0 em ``sphinx.sty``: ``\sphinxverbatimsep``, ``\sphinxverbatimborder``, ``\sphinxshadowsep``, ``\sphinxshadowsize`` e ``\sphinxshadowrule``. (refs: #11105)

source: Remove ``.egg`` support from pycode ``ModuleAnalyser``; Python eggs are a now-obsolete binary distribution format
pt_br: Remove suporte a ``.egg`` do pycode ``ModuleAnalyser``; eggs do Python são agora um formato descontinuado de distribuição binário.

source: #11089: Remove deprecated code in ``sphinx.builders.linkcheck``. Patch by Daniel Eades
pt_br: #11089: Remove código descontinuado em ``sphinx.builders.linkcheck``. Patch de Daniel Eades

source: Remove internal-only ``sphinx.locale.setlocale``
pt_br: Remove o ``sphinx.locale.setlocale`` interno

source: Deprecated
pt_br: Descontinuada

source: #11247: Deprecate the legacy ``intersphinx_mapping`` format
pt_br: #11247: Descontinua o formato legado ``intersphinx_mapping``

source: ``sphinx.util.osutil.cd`` is deprecated in favour of ``contextlib.chdir``.
pt_br: ``sphinx.util.osutil.cd`` foi descontinuado em favor de ``contextlib.chdir``.

source: Features added
pt_br: Funcionalidades adicionadas

source: #11277: :rst:dir:`autoproperty` allows the return type to be specified as a type comment (e.g., ``# type: () -> int``). Patch by Bénédikt Tran
pt_br: #11277: :rst:dir:`autoproperty` permite que o tipo de retorno seja especificado como um comentário de tipo (por exemplo, ``# type: () -> int``). Patch de Bénédikt Tran

source: #10811: Autosummary: extend ``__all__`` to imported members for template rendering when option ``autosummary_ignore_module_all`` is set to ``False``. Patch by Clement Pinard
pt_br: #10811: Autosummary: estende ``__all__`` para membros importados para renderização de modelo quando a opção ``autosummary_ignore_module_all`` estiver definida como ``False``. Patch de Clement Pinard

source: #11147: Add a ``content_offset`` parameter to ``nested_parse_with_titles()``, allowing for correct line numbers during nested parsing. Patch by Jeremy Maitin-Shepard
pt_br: #11147: Adiciona um parâmetro ``content_offset`` a ``nested_parse_with_titles()``, permitindo números de linha corretos durante a análise aninhada. Patch de Jeremy Maitin-Shepard

source: Update to Unicode CLDR 42
pt_br: Atualização para Unicode CLDR 42

source: Add a ``--jobs`` synonym for ``-j``. Patch by Hugo van Kemenade
pt_br: Adiciona um sinônimo ``--jobs`` para ``-j``. Patch de Hugo van Kemenade

source: LaTeX: a command ``\sphinxbox`` for styling text elements with a (possibly rounded) box, optional background color and shadow, has been added. See :ref:`sphinxbox`. (refs: #11224)
pt_br: LaTeX: um comando ``\sphinxbox`` para estilizar elementos de texto com uma caixa (possivelmente arredondada), cor de fundo opcional e sombra, foi adicionado. Veja :ref:`sphinxbox`. (refs: #11224)

source: LaTeX: add ``\sphinxstylenotetitle``, ..., ``\sphinxstylewarningtitle``, ..., for an extra layer of mark-up freeing up ``\sphinxstrong`` for other uses. See :ref:`latex-macros`. (refs: #11267)
pt_br: LaTeX: adiciona ``\sphinxstylenotetitle``, ..., ``\sphinxstylewarningtitle``, ..., para uma camada extra de marcação, liberando ``\sphinxstrong`` para outros usos. Veja :ref:`latex-macros`. (refs: #11267)

source: LaTeX: :dudir:`note`, :dudir:`hint`, :dudir:`important` and :dudir:`tip` can now each be styled as the other admonitions, i.e. possibly with a background color, individual border widths and paddings, possibly rounded corners, and optional shadow. See :ref:`additionalcss`. (refs: #11234)
pt_br: LaTeX: :dudir:`note`, :dudir:`hint`, :dudir:`important` e :dudir:`tip` agora cada um pode ser estilizado como as outras advertências, ou seja, possivelmente com uma cor de fundo, larguras de borda e preenchimentos individuais, possivelmente cantos arredondados e sombra opcional. Veja :ref:`additionalcss`. (refs: #11234)

source: LaTeX: admonitions and :dudir:`topic` (and :dudir:`contents <table-of-contents>`) directives, and not only :rst:dir:`code-block`, support ``box-decoration-break=slice``.
pt_br: LaTeX: admonições e diretivas :dudir:`topic` (e :dudir:`contents <table-of-contents>`), e não apenas :rst:dir:`code-block`, dão suporte a ``box-decoration-break=slice``.

source: LaTeX: let rounded boxes support up to 4 distinct border-widths (refs: #11243)
pt_br: LaTeX: permite que caixas arredondadas suportem até 4 larguras de borda distintas (refs: #11243)

source: LaTeX: new options ``noteTextColor``, ``noteTeXextras`` et al. See :ref:`additionalcss`.
pt_br: LaTeX: novas opções ``noteTextColor``, ``noteTeXextras`` e outras. Veja :ref:`additionalcss`.

source: LaTeX: support elliptical corners in rounded boxes. (refs: #11254)
pt_br: LaTeX: suporte a cantos elípticos em caixas arredondadas. (refs: #11254)

source: #11150: Include source location in highlighting warnings, when lexing fails. Patch by Jeremy Maitin-Shepard
pt_br: #11150: Inclui o local da fonte em avisos de realce, quando a lexagem falhar. Patch de Jeremy Maitin-Shepard

source: #11281: Support for :confval:`imgmath_latex` ``= 'tectonic'`` or ``= 'xelatex'``. Patch by Dimitar Dimitrov
pt_br: #11281: Suporte a :confval:`imgmath_latex` ``= 'tectonic'`` ou ``= 'xelatex'``. Patch de Dimitar Dimitrov

source: #11109, #9643: Add :confval:`python_display_short_literal_types` option for condensed rendering of ``Literal`` types.
pt_br: #11109, #9643: Adiciona a opção :confval:`python_display_short_literal_types` para renderização condensada de tipos ``Literal``.

source: #11079: LaTeX: figures with align attribute may disappear and strangely impact following lists
pt_br: #11079: LaTeX: figuras com atributo align podem desaparecer e impactar estranhamente as listas seguintes

source: #11093: LaTeX: fix "multiply-defined references" PDF build warnings when one or more reST labels directly precede an :rst:dir:`py:module` or :rst:dir:`automodule` directive. Patch by Bénédikt Tran (picnixz)
pt_br: #11093: LaTeX: corrige avisos de construção de PDF "multiply-defined references" quando um ou mais rótulos de reST precedem diretamente uma diretiva :rst:dir:`py:module` ou :rst:dir:`automodule`. Patch de Bénédikt Tran (picnixz)

source: #11110: LaTeX: Figures go missing from latex pdf if their files have the same base name and they use a post transform. Patch by aaron-cooper
pt_br: #11110: LaTeX: Figuras desaparecem do PDF do LaTeX se seus arquivos tiverem o mesmo nome base e usarem uma transformação de post. Patch de Aaron-Cooper

source: LaTeX: fix potential color leak from shadow to border of rounded boxes, if shadow color is set but border color is not
pt_br: LaTeX: corrige vazamento potencial de cor da sombra para a borda de caixas arredondadas, se a cor da sombra estiver definida, mas a cor da borda não estiver

source: LaTeX: fix unintended 1pt upwards vertical shift of code blocks frames respective to contents (when using rounded corners)
pt_br: LaTeX: corrige deslocamento vertical não intencional de 1pt para cima dos quadros de blocos de código em relação ao conteúdo (ao usar cantos arredondados)

source: #11235: LaTeX: added ``\color`` in topic (or admonition) contents may cause color leak to the shadow and border at a page break
pt_br: #11235: LaTeX: adicionado ``\color`` no conteúdo do tópico (ou advertência) pode causar vazamento de cor na sombra e na borda em uma quebra de página

source: #11264: LaTeX: missing space before colon after "Voir aussi" for :rst:dir:`seealso` directive in French
pt_br: #11264: LaTeX: faltando espaço antes dos dois pontos após "Voir aussi" para a diretiva :rst:dir:`seealso` em francês

source: #11268: LaTeX: longtable with left alignment breaks out of current list indentation context in PDF. Thanks to picnixz.
pt_br: #11268: LaTeX: longtable com alinhamento à esquerda sai do contexto de recuo da lista atual em PDF. Graças a picnixz.

source: #11274: LaTeX: external links are not properly escaped for ``\sphinxupquote`` compatibility
pt_br: #11274: LaTeX: links externos não são escapados corretamente para compatibilidade com ``\sphinxupquote``

source: #11147: Fix source file/line number info in object description content and in other uses of ``nested_parse_with_titles``. Patch by Jeremy Maitin-Shepard.
pt_br: #11147: Corrige informações de número de linha/arquivo fonte no conteúdo da descrição do objeto e em outros usos de ``nested_parse_with_titles``. Patch de Jeremy Maitin-Shepard.

source: #11192: Restore correct parallel search index building. Patch by Jeremy Maitin-Shepard
pt_br: #11192: Restaura a construção correta do índice de pesquisa paralela. Patch de Jeremy Maitin-Shepard

source: Use the new Transifex ``tx`` client
pt_br: Usa o novo cliente Transifex ``tx``

source: Testing
pt_br: Testes

source: Fail testing when any Python warnings are emitted
pt_br: Falha no teste quando quaisquer avisos do Python são emitidos

source: Migrate remaining ``unittest.TestCase`` style test functions to pytest style
pt_br: Migra as funções de teste restantes no estilo ``unittest.TestCase`` para o estilo pytest

source: Remove tests that rely on setuptools
pt_br: Remove os testes que dependem de setuptools
