Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/changes/7.0.po
Languages: pt_br

source: Release 7.0.1 (released May 12, 2023)
pt_br: Versão 7.0.1 (lançada em 12 mai 2023)

source: Dependencies
pt_br: Dependências

source: #11411: Support `Docutils 0.20`_. Patch by Adam Turner.
pt_br: #11411: Suporte a `Docutils 0.20`_. Patch de Adam Turner.

source: Bugs fixed
pt_br: Erros corrigidos

source: #11418: Clean up remaining references to ``sphinx.setup_command`` following the removal of support for setuptools. Patch by Willem Mulder.
pt_br: #11418: Limpa as referências restantes ao ``sphinx.setup_command`` após a remoção do suporte para setuptools. Patch de Willem Mulder.

source: Release 7.0.0 (released Apr 29, 2023)
pt_br: Versão 7.0.0 (lançada em 29 abr 2023)

source: Incompatible changes
pt_br: Atualizações incompatíveis

source: #11359: Remove long-deprecated aliases for ``MecabSplitter`` and ``DefaultSplitter`` in ``sphinx.search.ja``.
pt_br: #11359: Remove apelidos descontinuados há muito tempo para ``MecabSplitter`` e ``DefaultSplitter`` em ``sphinx.search.ja``.

source: #11360: Remove deprecated ``make_old_id`` functions in domain object description classes.
pt_br: #11360: Remove funções descontinuadas ``make_old_id`` nas classes de descrição de objetos de domínio.

source: #11363: Remove the Setuptools integration (``build_sphinx`` hook in ``setup.py``).
pt_br: #11363: Remove a integração do Setuptools (gancho ``build_sphinx`` em ``setup.py``).

source: #11364: Remove deprecated ``sphinx.ext.napoleon.iterators`` module.
pt_br: #11364: Remove o módulo descontinuado ``sphinx.ext.napoleon.iterators``.

source: #11365: Remove support for the ``jsdump`` format in ``sphinx.search``.
pt_br: #11365: Remove o suporte para o formato ``jsdump`` em ``sphinx.search``.

source: #11366: Make ``locale`` a required argument to ``sphinx.util.i18n.format_date()``.
pt_br: #11366: Faz de ``locale`` um argumento obrigatório para ``sphinx.util.i18n.format_date()``.

source: #11370: Remove deprecated ``sphinx.util.stemmer`` module.
pt_br: #11370: Remove o módulo descontinuado ``sphinx.util.stemmer``.

source: #11371: Remove deprecated ``sphinx.pycode.ast.parse()`` function.
pt_br: #11371: Remove a função descontinuada ``sphinx.pycode.ast.parse()``.

source: #11372: Remove deprecated ``sphinx.io.read_doc()`` function.
pt_br: #11372: Remove a função descontinuada ``sphinx.io.read_doc()``.

source: #11373: Removed deprecated ``sphinx.util.get_matching_files()`` function.
pt_br: #11373: Remove a função descontinuada ``sphinx.util.get_matching_files()``.

source: #11378: Remove deprecated ``sphinx.util.docutils.is_html5_writer_available()`` function.
pt_br: #11378: Remove a função descontinuada ``sphinx.util.docutils.is_html5_writer_available()``.

source: #11379: Make the ``env`` argument to ``Builder`` subclasses required.
pt_br: #11379: Torna o argumento ``env`` para as subclasses ``Builder`` obrigatório.

source: #11380: autosummary: Always emit grouped import exceptions.
pt_br: #11380: autosummary: Sempre emite exceções de importação agrupadas.

source: #11381: Remove deprecated ``style`` key for HTML templates.
pt_br: #11381: Remove a chave descontinuada ``style`` para modelos HTML.

source: #11382: Remove deprecated ``sphinx.writers.latex.LaTeXTranslator.docclasses`` attribute.
pt_br: #11382: Remove o atributo descontinuado ``sphinx.writers.latex.LaTeXTranslator.docclasses``.

source: #11383: Remove deprecated ``sphinx.builders.html.html5_ready`` and ``sphinx.builders.html.HTMLTranslator`` attributes.
pt_br: #11383: Remove os atributos descontinuados ``sphinx.builders.html.html5_ready`` e ``sphinx.builders.html.HTMLTranslator``.

source: #11385: Remove support for HTML 4 output.
pt_br: #11385: Remove suporte para saída HTML 4.
