Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/changes/7.1.po
Languages: pt_br

source: Release 7.1.2 (released Aug 02, 2023)
pt_br: Versão 7.1.2 (lançada em 02 ago 2023)

source: Bugs fixed
pt_br: Erros corrigidos

source: #11542: linkcheck: Properly respect :confval:`linkcheck_anchors` and do not spuriously report failures to validate anchors. Patch by James Addison.
pt_br: #11542: linkcheck: Respeita adequadamente :confval:`linkcheck_anchors` e não relata falsamente falhas na validação de âncoras. Patch de James Addison.

source: Release 7.1.1 (released Jul 27, 2023)
pt_br: Versão 7.1.1 (lançada em 27 jul 2023)

source: #11514: Fix ``SOURCE_DATE_EPOCH`` in multi-line copyright footer. Patch by Bénédikt Tran.
pt_br: #11514: Corrige ``SOURCE_DATE_EPOCH`` no rodapé de direitos autorais com várias linhas. Patch de Bénédikt Tran.

source: Release 7.1.0 (released Jul 24, 2023)
pt_br: Versão 7.1.0 (lançada em 24 jul 2023)

source: Incompatible changes
pt_br: Atualizações incompatíveis

source: Releases are no longer signed, given the `change in PyPI policy`_.
pt_br: Os lançamentos não são mais assinad9s, dada a `mudança na política do PyPI`_.

source: Deprecated
pt_br: Descontinuada

source: #11412: Emit warnings on using a deprecated Python-specific index entry type (namely, ``module``, ``keyword``, ``operator``, ``object``, ``exception``, ``statement``, and ``builtin``) in the :rst:dir:`index` directive, and set the removal version to Sphinx 9. Patch by Adam Turner.
pt_br: #11412: Emite avisos ao usar um tipo de entrada de índice específico do Python descontinuado (ou seja, ``module``, ``keyword``, ``operator``, ``object``, ``exception``, ``statement`` e ``builtin``) na diretiva :rst:dir:`index` e define a versão de remoção como Sphinx 9. Patch de Adam Turner.

source: Features added
pt_br: Funcionalidades adicionadas

source: #11415: Add a checksum to JavaScript and CSS asset URIs included within generated HTML, using the CRC32 algorithm.
pt_br: #11415: Adiciona uma soma de verificação aos URIs de ativos JavaScript e CSS incluídos no HTML gerado, usando o algoritmo CRC32.

source: :meth:`~sphinx.application.Sphinx.require_sphinx` now allows the version requirement to be specified as ``(major, minor)``.
pt_br: :meth:`~sphinx.application.Sphinx.require_sphinx` agora permite que o requisito da versão seja especificado como ``(major, minor)``.

source: #11011: Allow configuring a line-length limit for object signatures, via :confval:`maximum_signature_line_length` and the domain-specific variants. If the length of the signature (in characters) is greater than the configured limit, each parameter in the signature will be split to its own logical line. This behaviour may also be controlled by options on object description directives, for example :rst:dir:`py:function:single-line-parameter-list`. Patch by Thomas Louf, Adam Turner, and Jean-François B.
pt_br: #11011: Permite configurar um limite de comprimento de linha para assinaturas de objetos, via :confval:`maximum_signature_line_length` e as variantes específicas do domínio. Se o comprimento da assinatura (em caracteres) for maior que o limite configurado, cada parâmetro da assinatura será dividido em sua própria linha lógica. Este comportamento também pode ser controlado por opções nas diretivas de descrição de objetos, por exemplo :rst:dir:`py:function:single-line-parameter-list`. Patch de Thomas Louf, Adam Turner e Jean-François B.

source: #10983: Support for multiline copyright statements in the footer block. Patch by Stefanie Molin
pt_br: #10983: Suporte para declarações de direitos autorais de várias linhas no bloco de rodapé. Patch de Stefanie Molin

source: ``sphinx.util.display.status_iterator`` now clears the current line with ANSI control codes, rather than overprinting with space characters.
pt_br: ``sphinx.util.display.status_iterator`` agora limpa a linha atual com códigos de controle ANSI, em vez de imprimir vários caracteres de espaço.

source: #11431: linkcheck: Treat SSL failures as broken links. Patch by James Addison.
pt_br: #11431: linkcheck: Trata as falhas de SSL como links quebrados. Patch de James Addison.

source: #11157: Keep the ``translated`` attribute on translated nodes.
pt_br: #11157: Mantém o atributo ``translated`` nos nós traduzidos.

source: #11451: Improve the traceback displayed when using :option:`sphinx-build -T` in parallel builds. Patch by Bénédikt Tran
pt_br: #11451: Melhora o traceback exibido ao usar :option:`sphinx-build -T` em construções paralelas. Patch de Bénédikt Tran

source: #11324: linkcheck: Use session-basd HTTP requests.
pt_br: #11324: linkcheck: Usa solicitações HTTP baseadas em sessão.

source: #11438: Add support for the :rst:dir:`py:class` and :rst:dir:`py:function` directives for PEP 695 (generic classes and functions declarations) and PEP 696 (default type parameters). Multi-line support (#11011) is enabled for type parameters list and can be locally controlled on object description directives, e.g., :rst:dir:`py:function:single-line-type-parameter-list`. Patch by Bénédikt Tran.
pt_br: #11438: Adiciona suporte para as diretivas :rst:dir:`py:class` e :rst:dir:`py:function` da PEP 695 (classes genéricas e declarações de funções) e PEP 696 (parâmetros de tipo padrão). O suporte multilinha (#11011) está habilitado para lista de parâmetros de tipo e pode ser controlado localmente em diretivas de descrição de objeto, por exemplo, :rst:dir:`py:function:single-line-type-parameter-list`. Patch de Bénédikt Tran.

source: #11484: linkcheck: Allow HTML anchors to be ignored on a per-URL basis via :confval:`linkcheck_anchors_ignore_for_url` while still checking the validity of the page itself. Patch by Bénédikt Tran
pt_br: #11484: linkcheck: Permite que as âncoras HTML sejam ignoradas por URL via :confval:`linkcheck_anchors_ignore_for_url` enquanto ainda verifica a validade da própria página. Patch de Bénédikt Tran

source: #1246: Add translation progress statistics and inspection support, via a new substitution (``|translation progress|``) and a new configuration variable (:confval:`translation_progress_classes`). These enable determining the percentage of translated elements within a document, and the remaining translated and untranslated elements.
pt_br: #1246: Adiciona estatísticas de progresso de tradução e suporte a inspeção, através de uma nova substituição (``|translation progress|``) e uma nova variável de configuração (:confval:`translation_progress_classes`). Estes permitem determinar a percentagem de elementos traduzidos dentro de um documento e os restantes elementos traduzidos e não traduzidos.

source: Restored the ``footnote-reference`` class that has been removed in the latest (unreleased) version of Docutils.
pt_br: Restaurada a classe ``footnote-reference`` que foi removida na versão mais recente (não lançada) do Docutils.

source: #11486: Use :rfc:`8081` font file MIME types in the EPUB builder. Using the correct MIME type will prevent warnings from ``epubcheck`` and will generate a valid EPUB.
pt_br: #11486: Usa tipos MIME de arquivo de fonte :rfc:`8081` no construtor EPUB. Usar o tipo MIME correto evitará avisos do ``epubcheck`` e gerará um EPUB válido.

source: #11435: Use microsecond-resolution timestamps for outdated file detection in ``BuildEnvironment.get_outdated_files``.
pt_br: #11435: Usa registros de data e hora com resolução de microssegundos para detecção de arquivos desatualizados em ``BuildEnvironment.get_outdated_files``.

source: #11437: Top-level headings starting with a reStructuredText role now render properly when :confval:`rst_prolog` is set. Previously, a file starting with the below would have improperly rendered due to where the prologue text was inserted into the document.
pt_br: #11437: Títulos de nível superior começando com um papel reStructuredText agora são renderizados corretamente quando :confval:`rst_prolog` é definido. Anteriormente, um arquivo começando com o seguinte seria renderizado incorretamente devido ao local onde o texto do prólogo foi inserido no documento.

source: Patch by Bénédikt Tran.
pt_br: Patch de Bénédikt Tran.

source: #11337: Fix a ``MemoryError`` in ``sphinx.ext.intersphinx`` when using ``None`` or ``typing.*`` as inline type references. Patch by Bénédikt Tran (picnixz)
pt_br: #11337: Corrige um ``MemoryError`` em ``sphinx.ext.intersphinx`` ao usar ``None`` ou ``typing.*`` como referências de tipo inline. Patch de Bénédikt Tran (picnixz)

source: Testing
pt_br: Testes

source: #11345: Always delete ``docutils.conf`` in test directories when running ``SphinxTestApp.cleanup()``.
pt_br: #11345: Sempre exclui ``docutils.conf`` nos diretórios de teste ao executar ``SphinxTestApp.cleanup()``.
