Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/changes/7.2.po
Languages: pt_br

source: Release 7.2.6 (released Sep 13, 2023)
pt_br: Versão 7.2.6 (lançada em 13 set 2023)

source: Bugs fixed
pt_br: Erros corrigidos

source: #11679: Add the :envvar:`!SPHINX_AUTODOC_RELOAD_MODULES` environment variable, which if set reloads modules when using autodoc with ``TYPE_CHECKING = True``. Patch by Matt Wozniski and Adam Turner.
pt_br: #11679: Adiciona a variável de ambiente :envvar:`!SPHINX_AUTODOC_RELOAD_MODULES`, que, se definida, recarrega os módulos ao usar o autodoc com ``TYPE_CHECKING = True``. Patch de Matt Wozniski e Adam Turner.

source: #11679: Use :py:func:`importlib.reload` to reload modules in autodoc. Patch by Matt Wozniski and Adam Turner.
pt_br: #11679: Usa :py:func:`importlib.reload` para recarregar módulos no autodoc. Patch de Matt Wozniski e Adam Turner.

source: Release 7.2.5 (released Aug 30, 2023)
pt_br: Versão 7.2.5 (lançada em 30 ago 2023)

source: #11645: Fix a regression preventing autodoc from importing modules within packages that make use of ``if typing.TYPE_CHECKING:`` to guard circular imports needed by type checkers. Patch by Matt Wozniski.
pt_br: #11645: Corrige uma regressão que impedia o autodoc de importar módulos dentro de pacotes que fazem uso de ``if typo.TYPE_CHECKING:`` para proteger as importações circulares necessárias aos verificadores de tipo. Patch de Matt Wozniski.

source: #11634: Fixed inheritance diagram relative link resolution for sibling files in a subdirectory. Patch by Albert Shih.
pt_br: #11634: Corrigida resolução de link relativo do diagrama de herança para arquivos irmãos em um subdiretório. Patch de Albert Shih.

source: #11659: Allow ``?config=...`` in :confval:`mathjax_path`.
pt_br: #11659: Permite ``?config=...`` em :confval:`mathjax_path`.

source: #11654: autodoc: Fail with a more descriptive error message when an object claims to be an instance of ``type``, but is not a class. Patch by James Braza.
pt_br: #11654: autodoc: Falha com uma mensagem de erro mais descritiva quando um objeto afirma ser uma instância de ``type``, mas não é uma classe. Patch de James Braza.

source: 11620: Cease emitting :event:`source-read` events for files read via the :dudir:`include` directive.
pt_br: 11620: Deixa de emitir eventos :event:`source-read` para arquivos lidos através da diretiva :dudir:`include`.

source: 11620: Add a new :event:`include-read` for observing and transforming the content of included files via the :dudir:`include` directive.
pt_br: 11620: Adiciona um novo :event:`include-read` para observar e transformar o conteúdo dos arquivos incluídos através da diretiva :dudir:`include`.

source: #11627: Restore support for copyright lines of the form ``YYYY`` when ``SOURCE_DATE_EPOCH`` is set.
pt_br: #11627: Restaura o suporte a linhas de copyright no formato ``YYYY`` quando ``SOURCE_DATE_EPOCH`` estiver definido.

source: Release 7.2.4 (released Aug 28, 2023)
pt_br: Versão 7.2.4 (lançada em 28 ago 2023)

source: #11618: Fix a regression in the MoveModuleTargets transform, introduced in #10478 (#9662).
pt_br: #11618: Corrige uma regressão na transformação de MoveModuleTargets, introduzida em #10478 (#9662).

source: #11649: linkcheck: Resolve hanging tests for timezones west of London and incorrect conversion from UTC to offsets from the UNIX epoch. Patch by Dmitry Shachnev and Adam Turner.
pt_br: #11649: linkcheck: Resolve testes suspensos para fusos horários a oeste de Londres e conversão incorreta de UTC para compensações da época UNIX. Patch de Dmitry Shachnev e Adam Turner.

source: Release 7.2.3 (released Aug 23, 2023)
pt_br: Versão 7.2.3 (lançada em 23 ago 2023)

source: Dependencies
pt_br: Dependências

source: #11576: Require sphinxcontrib-serializinghtml 1.1.9.
pt_br: #11576: Requer sphinxcontrib-serializinghtml 1.1.9.

source: Fix regression in ``autodoc.Documenter.parse_name()``.
pt_br: Corrige regressão em ``autodoc.Documenter.parse_name()``.

source: Fix regression in JSON serialisation.
pt_br: Corrige regressão em serialização de JSON.

source: #11543: autodoc: Support positional-only parameters in ``classmethod`` methods when ``autodoc_preserve_defaults`` is ``True``.
pt_br: #11543: autodoc: Suporte a parâmetros somente-posicionais em métodos ``classmethod`` quando ``autodoc_preserve_defaults`` é ``True``.

source: Restore support string methods on path objects. This is deprecated and will be removed in Sphinx 8. Use :py:func:`os.fspath` to convert :py:class:`~pathlib.Path` objects to strings, or :py:class:`~pathlib.Path`'s methods to work with path objects.
pt_br: Restaura métodos de string de suporte em objetos caminho. Isso foi descontinuado e será removido no Sphinx 8. Use :py:func:`os.fspath` para converter objetos :py:class:`~pathlib.Path` em strings, ou os métodos de :py:class:`~pathlib.Path` para trabalhar com objetos caminho.

source: Release 7.2.2 (released Aug 17, 2023)
pt_br: Versão 7.2.2 (lançada em 17 ago 2023)

source: Fix the signature of the ``StateMachine.insert_input()`` patch, for when calling with keyword arguments.
pt_br: Corrigida a assinatura do patch ``StateMachine.insert_input()``, para quando chamar com argumentos nomeados.

source: Fixed membership testing (``in``) for the :py:class:`str` interface of the asset classes (``_CascadingStyleSheet`` and ``_JavaScript``), which several extensions relied upon.
pt_br: Corrigido o teste de associação (``in``) para a interface de :py:class:`str` das classes de ativos (``_CascadingStyleSheet`` e ``_JavaScript``), nas quais várias extensões dependiam.

source: Fixed a type error in ``SingleFileHTMLBuilder._get_local_toctree``, ``includehidden`` may be passed as a string or a boolean.
pt_br: Corrigido um erro de tipo em ``SingleFileHTMLBuilder._get_local_toctree``, ``includehidden`` pode ser passado como uma string ou um booleano.

source: Fix ``:noindex:`` for ``PyModule`` and ``JSModule``.
pt_br: correção de ``:noindex:`` para ``PyModule`` e ``JSModule``.

source: Release 7.2.1 (released Aug 17, 2023)
pt_br: Versão 7.2.1 (lançada em 17 ago 2023)

source: Restored the the :py:class:`str` interface of the asset classes (``_CascadingStyleSheet`` and ``_JavaScript``), which several extensions relied upon. This will be removed in Sphinx 9.
pt_br: Restaurada a interface de :py:class:`str` das classes de ativos (``_CascadingStyleSheet`` e ``_JavaScript``), nas quais várias extensões dependiam. Isso será removido no Sphinx 9.

source: Restored calls to ``Builder.add_{css,js}_file()``, which several extensions relied upon.
pt_br: Restauradas as chamadas para ``Builder.add{css,js}file()``, nas quais várias extensões dependiam.

source: Restored the private API ``TocTree.get_toctree_ancestors()``, which several extensions relied upon.
pt_br: Restaurada a API privada ``TocTree.get_toctree_ancestors()``, da qual várias extensões dependiam.

source: Release 7.2.0 (released Aug 17, 2023)
pt_br: Versão 7.2.0 (lançada em 17 ago 2023)

source: #11511: Drop Python 3.8 support.
pt_br: #11511: Descarta o suporte a Python 3.8.

source: #11576: Require Pygments 2.14 or later.
pt_br: #11576: Requer Pygments 2.14 ou posterior.

source: Deprecated
pt_br: Descontinuada

source: #11512: Deprecate ``sphinx.util.md5`` and ``sphinx.util.sha1``. Use ``hashlib`` instead.
pt_br: #11512: Descontinua ``sphinx.util.md5`` e ``sphinx.util.sha1``. Use ``hashlib`` em vez disso.

source: #11526: Deprecate ``sphinx.testing.path``. Use ``os.path`` or ``pathlib`` instead.
pt_br: #11526: Descontinua ``sphinx.testing.path``. Use ``os.path`` ou ``pathlib`` em vez disso.

source: #11528: Deprecate ``sphinx.util.split_index_msg`` and ``sphinx.util.split_into``. Use ``sphinx.util.index_entries.split_index_msg`` instead.
pt_br: #11528: Descontinua ``sphinx.util.split_index_msg`` e ``sphinx.util.split_into``. Use ``sphinx.util.index_entries.split_index_msg`` em vez disso.

source: Deprecate ``sphinx.builders.html.Stylesheet`` and ``sphinx.builders.html.Javascript``. Use ``sphinx.application.Sphinx.add_css_file()`` and ``sphinx.application.Sphinx.add_js_file()`` instead.
pt_br: Descontinua ``sphinx.builders.html.Stylesheet`` e ``sphinx.builders.html.Javascript``. Use ``sphinx.application.Sphinx.add_css_file()`` e ``sphinx.application.Sphinx.add_js_file()`` em vez disso.

source: #11582: Deprecate ``sphinx.builders.html.StandaloneHTMLBuilder.css_files`` and ``sphinx.builders.html.StandaloneHTMLBuilder.script_files``. Use ``sphinx.application.Sphinx.add_css_file()`` and ``sphinx.application.Sphinx.add_js_file()`` instead.
pt_br: #11582: Descontinua ``sphinx.builders.html.StandaloneHTMLBuilder.css_files`` e ``sphinx.builders.html.StandaloneHTMLBuilder.script_files``. Use ``sphinx.application.Sphinx.add_css_file()`` e ``sphinx.application.Sphinx.add_js_file()`` em vez disso.

source: #11459: Deprecate ``sphinx.ext.autodoc.preserve_defaults.get_function_def()``. Patch by Bénédikt Tran.
pt_br: #11459: Descontinua ``sphinx.ext.autodoc.preserve_defaults.get_function_def()``. Patch de Bénédikt Tran.

source: Features added
pt_br: Funcionalidades adicionadas

source: #11526: Support ``os.PathLike`` types and ``pathlib.Path`` objects in many more places.
pt_br: #11526: Suporte aos tipos ``os.PathLike`` e objetos ``pathlib.Path`` em muitos mais lugares.

source: #5474: coverage: Print summary statistics tables. Patch by Jorge Leitao.
pt_br: #5474: coverage: Imprime tabelas de estatísticas resumidas. Patch de Jorge Leitão.

source: #6319: viewcode: Add :confval:`viewcode_line_numbers` to control whether line numbers are added to rendered source code. Patch by Ben Krikler.
pt_br: #6319: viewcode: Adiciona :confval:`viewcode_line_numbers` para controlar se os números de linha são adicionados ao código-fonte renderizado. Patch de Ben Krikler.

source: #9662: Add the ``:no-typesetting:`` option to suppress textual output and only create a linkable anchor. Patch by Latosha Maltba.
pt_br: #9662: Adiciona a opção ``:no-typesetting:`` para suprimir a saída textual e criar apenas uma âncora vinculável. Patch de Latosha Maltba.

source: #11221: C++: Support domain objects in the table of contents. Patch by Rouslan Korneychuk.
pt_br: #11221: C++: Suporte a objetos de domínio no índice. Patch de Rouslan Korneychuk.

source: #10938: doctest: Add :confval:`doctest_show_successes` option. Patch by Trey Hunner.
pt_br: #10938: doctest: Adiciona a opção :confval:`doctest_show_successes`. Patch de Trey Hunner.

source: #11533: Add ``:no-index:``, ``:no-index-entry:``, and ``:no-contents-entry:``.
pt_br: #11533: Adiciona ``:no-index:``, ``:no-index-entry:`` e ``:no-contents-entry:``.

source: #11572: Improve ``debug`` logging of reasons why files are detected as out of date. Patch by Eric Larson.
pt_br: #11572: Melhora o registro de ``debug`` dos motivos pelos quais os arquivos são detectados como desatualizados. Patch de Eric Larson.

source: #10678: Emit :event:`source-read` events for files read via the :dudir:`include` directive. Patch by Halldor Fannar.
pt_br: #10678: Emite eventos :event:`source-read` para arquivos lidos através da diretiva :dudir:`include`. Patch de Halldor Fannar.

source: #11570: Use short names when using :pep:`585` built-in generics. Patch by Riccardo Mori.
pt_br: #11570: Usa nomes curtos ao usar genéricos embutidos da :pep:`585`. Patch de Riccardo Mori.

source: #11300: Improve ``SigElementFallbackTransform`` fallback logic and signature text elements nodes. See :doc:`the documentation </extdev/nodes>` for more details. Patch by Bénédikt Tran.
pt_br: #11300: Melhora a lógica de fallback ``SigElementFallbackTransform`` e os nós de elementos de texto de assinatura. Veja :doc:`a documentação </extdev/nodes>` para mais detalhes. Patch de Bénédikt Tran.

source: Allow running Sphinx with ``python -m sphinx build ...``.
pt_br: Permite executar Sphinx com ``python -m sphinx build ...``.

source: #11077: graphviz: Fix relative links from within the graph. Patch by Ralf Grubenmann.
pt_br: #11077: graphviz: Corrige links relativos de dentro do gráfico. Patch de Ralf Grubenmann.

source: #11529: Line Block in LaTeX builder outputs spurious empty token. Patch by Adrian Vollmer.
pt_br: #11529: O bloco de linhas no construtor LaTeX gera um token vazio falso. Patch de Adrian Vollmer.

source: #11196: autosummary: Summary line extraction failed with "e.g."
pt_br: #11196: autosummary: A extração da linha de resumo falhava com "e.g."

source: #10614: Fixed a number of bugs in inheritance diagrams that resulted in missing or broken links. Patch by Albert Shih.
pt_br: #10614: Corrigidos vários bugs em diagramas de herança que resultavam em links ausentes ou quebrados. Patch de Albert Shih.

source: #9428: Exclude substitution definitions when running the ``gettext`` builder. Patch by Alvin Wong.
pt_br: #9428: Exclui definições de substituição ao executar o construtor ``gettext``. Patch de Alvin Wong.

source: #10795: Raise a descriptive error if ``graphviz_dot`` is falsy.
pt_br: #10795: Levanta um erro descritivo se ``graphviz_dot`` for falso.

source: #11546: Translated nodes identical to their original text are now marked with the ``translated=True`` attribute.
pt_br: #11546: Nós traduzidos idênticos ao seu texto original agora são marcados com o atributo ``translated=True``.

source: #10049: html: Change "Permalink" to "Link" for title text in link anchors.
pt_br: #10049: html: Altera “Permalink” para “Link” para o texto do título nas âncoras do link.

source: #4225: Relax Pygments parsing on lexing failures.
pt_br: #4225: Relaxa a análise sintática de pigmentos em falhas de análise lexical.

source: #11246: Allow inline links in the first line of a docstring and one-line type comments ``#: :meta ...:`` when using :mod:`sphinx.ext.napoleon`. Patch by Bénédikt Tran.
pt_br: #11246: Permite links embutidos na primeira linha de uma docstring e comentários do tipo uma linha ``#: :meta ...:`` ao usar :mod:`sphinx.ext.napoleon`. Patch de Bénédikt Tran.

source: #10930: Highlight all search terms on the search results page. Patch by Dmitry Shachnev.
pt_br: #10930: Realça todos os termos de pesquisa na página de resultados da pesquisa. Patch de Dmitry Shachnev.

source: #11473: Type annotations containing :py:data:`~typing.Literal` enumeration values now render correctly. Patch by Bénédikt Tran.
pt_br: #11473: Anotações de tipo contendo valores de enumeração :py:data:`~typing.Literal` agora são renderizadas corretamente. Patch de Bénédikt Tran.

source: #11591: Fix support for C coverage in ``sphinx.ext.coverage`` extension. Patch by Stephen Finucane.
pt_br: #11591: Corrigido suporte para cobertura C na extensão ``sphinx.ext.coverage``. Patch de Stephen Finucane.

source: #11594: HTML Theme: Enhancements to horizontal scrolling on smaller devices in the ``agogo`` theme. Patch by Lukas Engelter.
pt_br: #11594: Tema HTML: Melhorias na rolagem horizontal em dispositivos menores no tema ``agogo``. Patch de Lukas Engelter.

source: #11459: Fix support for async and lambda functions in ``sphinx.ext.autodoc.preserve_defaults``. Patch by Bénédikt Tran.
pt_br: #11459: Corrigido suporte para funções assíncronas e lambda em ``sphinx.ext.autodoc.preserve_defaults``. Patch de Bénédikt Tran.

source: Testing
pt_br: Testes

source: #11577: pytest: Fail tests on "XPASS".
pt_br: #11577: pytest: Não passa nos testes do "XPASS".

source: #11577: pytest: Use "importlib" import mode.
pt_br: #11577: pytest: Usa o modo de importação do "importlib".

source: #11577: pytest: Set PYTHONWARNINGS=error.
pt_br: #11577: pytest: Define PYTHONWARNINGS=error.

source: #11577: pytest: Set strict config and strict markers.
pt_br: #11577: pytest: Define configurações e marcadores estritos.
