Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/changes/7.3.po
Languages: pt_br

source: Release 7.3.7 (released Apr 19, 2024)
pt_br: Versão 7.3.7 (lançada em 19 abr 2024)

source: Bugs fixed
pt_br: Erros corrigidos

source: #12299: Defer loading themes defined via entry points until their explicit use by the user or a child theme. Patch by Adam Turner.
pt_br: #12299: Adia o carregamento de temas definidos por meio de pontos de entrada até seu uso explícito pelo usuário ou por um tema filho. Patch de Adam Turner.

source: #12305: Return the default value for ``theme.get_config()`` with an unsupported theme configuration section. Patch by Adam Turner.
pt_br: #12305: Retorna o valor padrão para ``theme.get_config()`` com uma seção de configuração de tema não suportada. Patch de Adam Turner.

source: Release 7.3.6 (released Apr 17, 2024)
pt_br: Versão 7.3.6 (lançada em 17 abr 2024)

source: #12295: Re-export all AST types in the C and C++ domains. Patch by Adam Turner.
pt_br: #12295: Reexporta todos os tipos AST nos domínios C e C++. Patch de Adam Turner.

source: #12295: Re-export various objects from ``sphinx.domains.python._annotations`` in ``sphinx.domains.python``. Patch by Jacob Chesslo and Adam Turner.
pt_br: #12295: Reexporta vários objetos de ``sphinx.domains.python._annotations`` em ``sphinx.domains.python``. Patch de Jacob Chesslo e Adam Turner.

source: Release 7.3.5 (released Apr 17, 2024)
pt_br: Versão 7.3.5 (lançada em 17 abr 2024)

source: #12295: Re-export various objects from ``sphinx.domains.python._object`` in ``sphinx.domains.python``. Patch by Jacob Chesslo and Adam Turner.
pt_br: #12295: Reexporta vários objetos de ``sphinx.domains.python._object`` em ``sphinx.domains.python``. Patch de Jacob Chesslo e Adam Turner.

source: Release 7.3.4 (released Apr 17, 2024)
pt_br: Versão 7.3.4 (lançada em 17 abr 2024)

source: Handle cases when ``Any`` is not an instance of ``type``. Patch by Adam Turner.
pt_br: Trata casos quando ``Any`` não é uma instância de ``type``. Patch de Adam Turner.

source: Release 7.3.3 (released Apr 17, 2024)
pt_br: Versão 7.3.3 (lançada em 17 abr 2024)

source: #12290: Fix a false-positive warning when setting a configuration value with ``Any`` as the valid type to a type other than the value's default. Patch by Adam Turner.
pt_br: #12290: Corrige um aviso de falso positivo ao definir um valor de configuração com ``Any`` como o tipo válido para um tipo diferente do que o padrão do valor. Patch de Adam Turner.

source: Release 7.3.2 (released Apr 17, 2024)
pt_br: Versão 7.3.2 (lançada em 17 abr 2024)

source: Preload all themes defined via entry points. Patch by Adam Turner.
pt_br: Pré-carrega todos os temas definidos por meio de pontos de entrada. Patch de Adam Turner.

source: Fix a bad interaction between the ``'Furo'`` theme and the new-style for configuration values. Patch by Adam Turner.
pt_br: Corrige uma interação ruim entre o tema ``'Furo'`` e o novo estilo para valores de configuração. Patch de Adam Turner.

source: Release 7.3.1 (released Apr 17, 2024)
pt_br: Versão 7.3.1 (lançada em 17 abr 2024)

source: Dependencies
pt_br: Dependências

source: Require ``tomli`` on Python 3.10 and earlier. Patch by Adam Turner.
pt_br: Requer ``tomli`` no Python 3.10 e versões anteriores. Patch de Adam Turner.

source: Release 7.3.0 (released Apr 16, 2024)
pt_br: Versão 7.3.0 (lançada em 16 abr 2024)

source: #11858: Increase the minimum supported version of Alabaster to 0.7.14. Patch by Adam Turner.
pt_br: #11858: Aumente a versão mínima suportada do Alabaster para 0.7.14. Patch de Adam Turner.

source: #11411: Support `Docutils 0.21`_. Patch by Adam Turner.
pt_br: #11411: Suporte a `Docutils 0.21`_. Patch de Adam Turner.

source: #12012: Use ``types-docutils`` instead of ``docutils-stubs``.
pt_br: #12012: Use ``types-docutils`` em vez de ``docutils-stubs``.

source: Deprecated
pt_br: Descontinuada

source: #11693: Support for old-style :file:`Makefile` and :file:`make.bat` output in :program:`sphinx-quickstart`, and the associated options :option:`!-M`, :option:`!-m`, :option:`!--no-use-make-mode`, and :option:`!--use-make-mode`.
pt_br: #11693: Suporte para a saída :file:`Makefile` e :file:`make.bat` no estilo antigo em :program:`sphinx-quickstart`, e as opções associadas :option:`!-M`, :option:`!-m`, :option:`!--no-use-make-mode` e :option:`!--use-make-mode`.

source: #11285: Direct access to :attr:`!sphinx.testing.util.SphinxTestApp._status` or :attr:`!sphinx.testing.util.SphinxTestApp._warning` is deprecated. Use the public properties :attr:`!sphinx.testing.util.SphinxTestApp.status` and :attr:`!sphinx.testing.util.SphinxTestApp.warning` instead. Patch by Bénédikt Tran.
pt_br: #11285: Acesso direto a :attr:`!sphinx.testing.util.SphinxTestApp._status` ou :attr:`!sphinx.testing.util.SphinxTestApp._warning` foi descontinuado. Use as propriedades públicas :attr:`!sphinx.testing.util.SphinxTestApp.status` e :attr:`!sphinx.testing.util.SphinxTestApp.warning`. Patch de Bénédikt Tran.

source: tests: :func:`!sphinx.testing.util.strip_escseq` is deprecated in favour of :func:`!sphinx.util.console.strip_colors`. Patch by Bénédikt Tran.
pt_br: testes: :func:`!sphinx.testing.util.strip_escseq` foi descontinuado em favor de :func:`!sphinx.util.console.strip_colors`. Patch de Bénédikt Tran.

source: Features added
pt_br: Funcionalidades adicionadas

source: #12265: Support theme configuration via ``theme.toml``.
pt_br: #12265: Suporte a configuração de temas via ``theme.toml``.

source: #11701: HTML Search: Adopt the new `\<search\>`_ element. Patch by Bénédikt Tran.
pt_br: #11701: Pesquisa HTML: adota o novo elemento `\<search\>`_. Patch de Bénédikt Tran.

source: #11776: Add long option names to ``sphinx-build``. Patch by Hugo van Kemenade, Adam Turner, Bénédikt Tran, and Ezio Melotti.
pt_br: #11776: Adiciona nomes de opções longos ao ``sphinx-build``. Patch de Hugo van Kemenade, Adam Turner, Bénédikt Tran e Ezio Melotti.

source: Organise the ``sphinx-build`` options into groups. Patch by Adam Turner.
pt_br: Organiza as opções do ``sphinx-build`` em grupos. Patch de Adam Turner.

source: #11855: Defer computation of configuration values. Patch by Adam Turner.
pt_br: #11855: Adia o cálculo dos valores de configuração. Patch de Adam Turner.

source: Add ``:no-search:`` as an alias of the ``:nosearch:`` metadata field. Patch by Adam Turner.
pt_br: Adiciona ``:no-search:`` como um alias do campo de metadados ``:nosearch:``. Patch de Adam Turner.

source: #11803: autodoc: Use an overridden ``__repr__()`` function in an enum, if defined. Patch by Shengyu Zhang.
pt_br: #11803: autodoc: Usa uma função ``__repr__()`` substituída em um enum, se definido. Patch de Shengyu Zhang.

source: #11825: Allow custom targets in the manpage role. Patch by Nicolas Peugnet.
pt_br: #11825: Permite alvos personalizados no papel de página man. Patch de Nicolas Peugnet.

source: #11892: Improved performance when resolving cross references in the C++ domain. Patch by Rouslan Korneychuk.
pt_br: #11892: Melhor desempenho ao resolver referências cruzadas no domínio C++. Patch de Rouslan Korneychuk.

source: #11905: Add a :rst:dir:`versionremoved` directive. Patch by Hugo van Kemenade, Adam Turner, and C.A.M. Gerlach.
pt_br: #11905: Adiciona uma diretiva :rst:dir:`versionremoved`. Patch de Hugo van Kemenade, Adam Turner e C.A.M. Gerlach.

source: #11981: Improve rendering of signatures using ``slice`` syntax, e.g., ``def foo(arg: np.float64[:,:]) -> None: ...``.
pt_br: #11981: Melhora a renderização de assinaturas usando a sintaxe de ``slice``, por exemplo, ``def foo(arg: np.float64[:,:]) -> None: ...``.

source: The manpage builder now adds `OSC 8`_ anchors to hyperlinks, using the `groff`_ device control command.
pt_br: O construtor de página man agora adiciona âncoras `OSC 8`_ aos hiperlinks, usando o comando de controle de dispositivo `groff`_.

source: #11015: Change the text of the :rst:dir:`versionadded` directive from ``New in [...]`` to ``Added in [...]``. Patch by Bénédikt Tran.
pt_br: #11015: Altera o texto da diretiva :rst:dir:`versionadded` de ``New in [...]`` para ``Added in [...]``. Patch de Bénédikt Tran.

source: #12131: Added :confval:`show_warning_types` configuration option. Patch by Chris Sewell.
pt_br: #12131: Adicionada opção de configuração :confval:`show_warning_types`. Patch de Chris Sewell.

source: #12193: Improve ``external`` warnings for unknown roles. In particular, suggest related role names if an object type is mistakenly used. Patch by Chris Sewell.
pt_br: #12193: Melhora os avisos ``external`` para papéis desconhecidos. Em particular, sugere nomes de papéis relacionados se um tipo de objeto for usado por engano. Patch de Chris Sewell.

source: Add public type alias :class:`sphinx.util.typing.ExtensionMetadata`. This can be used by extension developers to annotate the return type of their ``setup`` function. Patch by Chris Sewell.
pt_br: Adiciona o apelido de tipo público :class:`sphinx.util.typing.ExtensionMetadata`. Isto pode ser usado por desenvolvedores de extensões para anotar o tipo de retorno de sua função ``setup``. Patch de Chris Sewell.

source: #11668: Raise a useful error when ``theme.conf`` is missing. Patch by Vinay Sajip.
pt_br: #11668: Levanta um erro útil quando ``theme.conf`` está faltando. Patch de Vinay Sajip.

source: #11622: Ensure that the order of keys in ``searchindex.js`` is deterministic. Patch by Pietro Albini.
pt_br: #11622: Certifica-se de que a ordem das chaves em ``searchindex.js`` seja determinística. Patch de Pietro Albini.

source: #11617: ANSI control sequences are stripped from the output when writing to a warnings file with :option:`-w <sphinx-build -w>`. Patch by Bénédikt Tran.
pt_br: #11617: As sequências de controle ANSI são removidas da saída ao gravar em um arquivo de avisos com :option:`-w <sphinx-build -w>`. Patch de Bénédikt Tran.

source: #11666: Skip all hidden directories in ``CatalogRepository.pofiles``. Patch by Aryaz Eghbali.
pt_br: #11666: Ignora todos os diretórios ocultos em ``CatalogRepository.pofiles``. Patch de Aryaz Eghbali.

source: #9686: html builder: Fix MathJax lazy loading when equations appear in titles. Patch by Bénédikt Tran.
pt_br: #9686: construtor html: corrige o carregamento lento do MathJax quando as equações aparecem nos títulos. Patch de Bénédikt Tran.

source: #11483: singlehtml builder: Fix MathJax lazy loading when the index does not contain any math equations. Patch by Bénédikt Tran.
pt_br: #11483: construtor singlehtml: Corrige o carregamento lento do MathJax quando o índice não contém nenhuma equação matemática. Patch de Bénédikt Tran.

source: #11697: HTML Search: add 'noindex' meta robots tag. Patch by James Addison.
pt_br: #11697: Pesquisa HTML Search: adiciona a tag de robôs 'noindex'. Patch de James Addison.

source: #11678: Fix a possible ``ZeroDivisionError`` in ``sphinx.ext.coverage``. Patch by Stephen Finucane.
pt_br: #11678: Corrige um possível ``ZeroDivisionError`` em ``sphinx.ext.coverage``. Patch de Stephen Finucane.

source: #11756: LaTeX: build error with recent TeXLive due to missing ``substitutefont`` package (triggered if using ``fontenc`` with ``T2A`` option and document language is not a Cyrillic one). Patch by Jean-François B.
pt_br: #11756: LaTeX: erro de construção com o TeXLive recente devido à falta do pacote ``substitutefont`` (disparado se estiver usando ``fontenc`` com a opção ``T2A`` e o idioma do documento não for cirílico). Patch de Jean-François B.

source: #11675: Fix rendering of progression bars in environments that do not support ANSI control sequences. Patch by Bénédikt Tran.
pt_br: #11675: Corrige a renderização de barras de progressão em ambientes que não suportam sequências de controle ANSI. Patch de Bénédikt Tran.

source: #11861: Whitelist more types with an incorrect ``__module__`` attribute. Patch by Adam Turner.
pt_br: #11861: Adiciona como aceitos mais tipos com um atributo ``__module__`` incorreto. Patch de Adam Turner.

source: #11715: Apply ``tls_verify`` and ``tls_cacerts`` config to ``ImageDownloader``. Patch by Nick Touran.
pt_br: #11715: Aplica a configuração ``tls_verify`` e ``tls_cacerts`` em ``ImageDownloader``. Patch de Nick Touran.

source: Allow hyphens in group names for :rst:dir:`productionlist` cross-references. Patch by Adam Turner.
pt_br: Permite hífens em nomes de grupos para referências cruzadas :rst:dir:`productionlist`. Patch de Adam Turner.

source: #11433: Added the :confval:`linkcheck_allow_unauthorized` configuration option. Set this option to ``False`` to report HTTP 401 (unauthorized) server responses as broken. Patch by James Addison.
pt_br: #11433: Adicionada a opção de configuração :confval:`linkcheck_allow_unauthorized`. Defina esta opção como ``False`` para reportar respostas do servidor HTTP 401 (não autorizado) como quebradas. Patch de James Addison.

source: #11868: linkcheck: added a distinct ``timeout`` reporting status code. This can be enabled by setting :confval:`linkcheck_report_timeouts_as_broken` to ``False``. Patch by James Addison.
pt_br: #11868: linkcheck: adicionado um código de status de relatório ``timeout`` distinto. Isto pode ser habilitado configurando :confval:`linkcheck_report_timeouts_as_broken` para ``False``. Patch de James Addison.

source: #11869: Refresh the documentation for the ``linkcheck_timeout`` setting. Patch by James Addison.
pt_br: #11869: Atualiza a documentação para a configuração ``linkcheck_timeout``. Patch de James Addison.

source: #11874: Configure a default 30-second value for ``linkcheck_timeout``. Patch by James Addison.
pt_br: #11874: Configura um valor padrão de 30 segundos para ``linkcheck_timeout``. Patch de James Addison.

source: #11886: Print the Jinja2 template path chain in ``TemplateNotFound`` exceptions. Patch by Colin Marquardt.
pt_br: #11886: Imprime a cadeia de caminhos do modelo Jinja2 nas exceções ``TemplateNotFound``. Patch de Colin Marquardt.

source: #11598: Do not use query components in URLs for assets in EPUB rendering. Patch by David Runge.
pt_br: #11598: Não usa componentes de consulta em URLs para ativos na renderização de EPUB. Patch de David Runge.

source: #11904: Support unary subtraction when parsing annotations. Patch by James Addison.
pt_br: #11904: Adiciona suporte a subtração unária ao analisar anotações. Patch de James Addison.

source: #11925: Blacklist the ``sphinxprettysearchresults`` extension; the functionality it provides was merged into Sphinx v2.0.0. Patch by James Addison.
pt_br: #11925: Marca como proibida a extensão ``sphinxprettysearchresults``; a funcionalidade que ele fornece foi incorporada ao Sphinx v2.0.0. Patch de James Addison.

source: #11917: Fix rendering of annotated inherited members for Python 3.9. Patch by Janet Carson.
pt_br: #11917: Corrige a renderização de membros herdados anotados para Python 3.9. Patch de Janet Carson.

source: #11935: C Domain: Fix namespace-pop context. Patch by Frank Dana.
pt_br: #11935: Domínio C: Corrige o contexto namespace-pop. Patch de Frank Dana.

source: #11923: Avoid zombie processes when parallel builds fail. Patch by Felix von Drigalski.
pt_br: #11923: Evita processos zumbis quando as construções paralelas falham. Patch de Felix von Drigalski.

source: #11353: Support enumeration classes inheriting from mixin or data types. Patch by Bénédikt Tran.
pt_br: #11353: Adiciona suporte a classes de enumeração herdadas de mixin ou tipos de dados. Patch de Bénédikt Tran.

source: #11962: Fix target resolution when using ``:paramtype:`` fields. Patch by Bénédikt Tran.
pt_br: #11962: Corrige a resolução alvo ao usar campos ``:paramtype:``. Patch de Bénédikt Tran.

source: #11944: Use anchor in search preview. Patch by Will Lachance.
pt_br: #11944: Usa âncora na visualização da pesquisa. Patch de Will Lachance.

source: #12008: Fix case-sensitive lookup of ``std:label`` names in intersphinx inventory. Patch by Michael Goerz.
pt_br: #12008: Corrige a pesquisa com distinção entre maiúsculas e minúsculas de nomes ``std:label`` no inventário intersphinx. Patch de Michael Goerz.

source: #11958: HTML Search: Fix partial matches overwriting full matches. Patch by William Lachance.
pt_br: #11958: Pesquisa HTML: Corrige correspondências parciais substituindo correspondências completas. Patch de William Lachance.

source: #11959: Fix multiple term matching when word appears in both title and document. Patch by Will Lachance.
pt_br: #11959: Corrige a correspondência de vários termos quando a palavra aparecer no título e no documento. Patch de Will Lachance.

source: #11474: Fix doctrees caching causing files not be rebuilt in some cases, e.g., when :confval:`numfig` is ``True``. Patch by Bénédikt Tran.
pt_br: #11474: Corrige o cache de doctrees fazendo com que os arquivos não sejam reconstruídos em alguns casos, por exemplo, quando :confval:`numfig` é ``True``. Patch de Bénédikt Tran.

source: #11278: autodoc: Fix rendering of :class:`functools.singledispatchmethod` combined with :func:`@classmethod <classmethod>`. Patch by Bénédikt Tran.
pt_br: #11278: autodoc: Corrige a renderização de :class:`functools.singledispatchmethod` combinada com :func:`@classmethod <classmethod>`. Patch de Bénédikt Tran.

source: #11894: Do not add checksums to css files if building using the htmlhelp builder. Patch by reduerK akiM.
pt_br: #11894: Não adiciona somas de verificação aos arquivos CSS se estiver construindo usando o construtor htmlhelp. Patch de reduerK akiM.

source: #12052: Remove ``<script>`` and ``<style>`` tags from the content of search result summary snippets. Patch by James Addison.
pt_br: #12052: Remove as tags ``<script>`` e ``<style>`` do conteúdo dos snippets de resumo dos resultados da pesquisa. Patch de James Addison.

source: #11578: HTML Search: Order non-main index entries after other results. Patch by Brad King.
pt_br: #11578: Pesquisa HTML: Ordena as entradas do índice não principal após outros resultados. Patch de Brad King.

source: #12147: autosummary: Fix a bug whereby the wrong file extension may be used, when multiple suffixes are specified in :confval:`source_suffix`. Patch by Sutou Kouhei.
pt_br: #12147: autosummary: Corrige um bug onde a extensão de arquivo errada pode ser usada, quando múltiplos sufixos são especificados em :confval:`source_suffix`. Patch de Sutou Kouhei.

source: #10786: improve the error message when a file to be copied (e.g., an asset) is removed during Sphinx execution. Patch by Bénédikt Tran.
pt_br: #10786: melhora a mensagem de erro quando um arquivo a ser copiado (por exemplo, um ativo) é removido durante a execução do Sphinx. Patch de Bénédikt Tran.

source: #12040: HTML Search: Ensure that document titles that are partially-matched by the user search query are included in search results. Patch by James Addison.
pt_br: #12040: Pesquisa HTML: Certifica-se de que os títulos dos documentos que correspondam parcialmente à consulta de pesquisa do usuário sejam incluídos nos resultados da pesquisa. Patch de James Addison.

source: #11970: singlehtml builder: make target URIs to be same-document references in the sense of :rfc:`RFC 3986, §4.4 <3986#section-4.4>`, e.g., ``index.html#foo`` becomes ``#foo``. Patch by Eric Norige.
pt_br: #11970: construtor singlehtml: faz com que os URIs alvo sejam referências do mesmo documento no sentido de :rfc:`RFC 3986, §4.4 <3986#section-4.4>`, por exemplo, ``index.html#foo`` torna-se ``#foo``. Patch de Eric Norige.

source: #12271: Partially revert Docutils' r9562__ to fix EPUB files. Patch by Adam Turner.
pt_br: #12271: Reverte parcialmente o r9562__ do Docutils para corrigir arquivos EPUB. Patch de Adam Turner.

source: #12253: Escape reserved path characters in the remote images post-transform download cache. Patch by James Addison and Adam Turner.
pt_br: #12253: Escapa caracteres de caminho reservados no cache de download pós-transformação de imagens remotas. Patch de James Addison e Adam Turner.

source: Testing
pt_br: Testes

source: Reorganise tests into directories. Patch by Adam Turner.
pt_br: Reorganiza os testes em diretórios. Patch de Adam Turner.

source: Clean up global state in ``SphinxTestApp``. Patch by Adam Turner.
pt_br: Limpa o estado global em ``SphinxTestApp``. Patch de Adam Turner.

source: #11285: :func:`!pytest.mark.sphinx` and :class:`!sphinx.testing.util.SphinxTestApp` accept *warningiserror*, *keep_going* and *verbosity* as keyword arguments. Patch by Bénédikt Tran.
pt_br: #11285: :func:`!pytest.mark.sphinx` e :class:`!sphinx.testing.util.SphinxTestApp` aceitam *warningiserror*, *keep_going* e *verbosity* como argumentos nomeados. Patch de Bénédikt Tran.

source: #11285: :class:`!sphinx.testing.util.SphinxTestApp` *status* and *warning* arguments are checked to be :class:`io.StringIO` objects (the public API incorrectly assumed this without checking it). Patch by Bénédikt Tran.
pt_br: #11285: Os argumentos *status* e *warning* de :class:`!sphinx.testing.util.SphinxTestApp` são verificados como objetos :class:`io.StringIO` (a API pública presumia isso incorretamente sem devida verificação). Patch de Bénédikt Tran.

source: Report the result of ``test_run_epubcheck`` as ``skipped`` instead of ``success`` when either Java or ``epubcheck`` are not available.
pt_br: Relata o resultado de ``test_run_epubcheck`` como ``skipped`` em vez de ``success`` quando Java ou ``epubcheck`` não estiverem disponíveis.

source: Use dynamic allocation of unused port numbers for the test HTTP(S) servers. As a side-effect, this removes the need for test server lockfiles, meaning that any remaining ``tests/test-server.lock`` files can safely be deleted.
pt_br: Usa a alocação dinâmica de números de porta não utilizados para os servidores HTTP(S) de teste. Como efeito colateral, isso elimina a necessidade de arquivos de bloqueio do servidor de teste, o que significa que quaisquer arquivos ``tests/test-server.lock`` restantes podem ser excluídos com segurança.
