Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/changes/8.1.po
Languages: pt_br

source: Release 8.1.3 (released Oct 13, 2024)
pt_br: Versão 8.1.3 (lançada em 13 out 2024)

source: Bugs fixed
pt_br: Erros corrigidos

source: #13013: Restore support for :func:`!cut_lines` with no object type. Patch by Adam Turner.
pt_br: #13013: Restaura o suporte para :func:`!cut_lines` com nenhum tipo de objeto. Patch de Adam Turner.

source: Release 8.1.2 (released Oct 12, 2024)
pt_br: Versão 8.1.2 (lançada em 12 out 2024)

source: #13012: Expose :exc:`sphinx.errors.ExtensionError` in ``sphinx.util`` for backwards compatibility. This will be removed in Sphinx 9, as exposing the exception in ``sphinx.util`` was never intentional. :exc:`!ExtensionError` has been part of ``sphinx.errors`` since Sphinx 0.9. Patch by Adam Turner.
pt_br: #13012: Expõe :exc:`sphinx.errors.ExtensionError` em ``sphinx.util`` para compatibilidade com versões anteriores. Isso será removido no Sphinx 9, pois expor a exceção em ``sphinx.util`` nunca foi intencional. :exc:`!ExtensionError` faz parte de ``sphinx.errors`` desde o Sphinx 0.9. Patch de Adam Turner.

source: Release 8.1.1 (released Oct 11, 2024)
pt_br: Versão 8.1.1 (lançada em 11 out 2024)

source: #13006: Use the preferred https://www.cve.org/ URL for the :rst:role:`:cve: <cve>` role. Patch by Hugo van Kemenade.
pt_br: #13006: Usa a URL https://www.cve.org/ preferida para o papel :rst:role:`:cve: <cve>`. Patch de Hugo van Kemenade.

source: #13007: LaTeX: Improve resiliency when the required ``fontawesome`` or ``fontawesome5`` packages are not installed. Patch by Jean-François B.
pt_br: #13007: LaTeX: Melhora a resiliência quando os pacotes necessários ``fontawesome`` ou ``fontawesome5`` não estiverem instalados. Patch de Jean-François B.

source: Release 8.1.0 (released Oct 10, 2024)
pt_br: Versão 8.1.0 (lançada em 10 out 2024)

source: Dependencies
pt_br: Dependências

source: #12756: Add lower-bounds to the ``sphinxcontrib-*`` dependencies. Patch by Adam Turner.
pt_br: #12756: Adiciona limites mínimos às dependências ``sphinxcontrib-*``. Patch de Adam Turner.

source: #12833: Update the LaTeX ``parskip`` package from 2001 to 2018. Patch by Jean-François B.
pt_br: #12833: Atualiza o pacote LaTeX ``parskip`` de 2001 para 2018. Patch de Jean-François B.

source: Incompatible changes
pt_br: Atualizações incompatíveis

source: #12763: Remove unused internal class ``sphinx.util.Tee``. Patch by Adam Turner.
pt_br: #12763: Remove classe interna não utilizada ``sphinx.util.Tee``. Patch de Adam Turner.

source: #12822: LaTeX: for Unicode engines, the :ref:`fvset` default is changed to ``'\\fvset{fontsize=auto}'`` from ``'\\fvset{fontsize=\\small}'``. Code-blocks are unchanged as FreeMono is now loaded with ``Scale=0.9``. An adjustment to existing projects is needed only if they used a custom :ref:`fontpkg` configuration and did not set :ref:`fvset`. Patch by Jean-François B.
pt_br: #12822: LaTeX: para mecanismos Unicode, o padrão :ref:`fvset` é alterado para ``'\\fvset{fontsize=auto}'`` de ``'\\fvset{fontsize=\\small}'``. Os blocos de código não foram alterados, pois o FreeMono agora é carregado com ``Scale=0.9``. Um ajuste em projetos existentes é necessário somente se eles usaram uma configuração :ref:`fontpkg` personalizada e não definiram :ref:`fvset`. Patch de Jean-François B.

source: #12875: Disable smartquotes for languages: ``zh_CN`` and ``zh_TW`` by default. Patch by A. Rafey Khan.
pt_br: #12875: Desabilita aspas inteligentes por idiomas: ``zh_CN`` e ``zh_TW`` por padrão. Patch de A. Rafey Khan.

source: Deprecated
pt_br: Descontinuada

source: #12762: Deprecate ``sphinx.util.import_object``. Use :py:func:`importlib.import_module` instead. Patch by Adam Turner.
pt_br: #12762: Descontinua ``sphinx.util.import_object``. Em vez disso, usa :py:func:`importlib.import_module`. Patch de Adam Turner.

source: #12766: Deprecate ``sphinx.util.FilenameUniqDict`` and ``sphinx.util.DownloadFiles``. Patch by Adam Turner.
pt_br: #12766: Descontinua ``sphinx.util.FilenameUniqDict`` e ``sphinx.util.DownloadFiles``. Patch de Adam Turner.

source: Features added
pt_br: Funcionalidades adicionadas

source: #11328: Mention evaluation of templated content during production of static output files. Patch by James Addison.
pt_br: #11328: Menciona a avaliação de conteúdo modelado durante a produção de arquivos de saída estáticos. Patch de James Addison.

source: #12704: LaTeX: make :dudir:`contents <table-of-contents>`, :dudir:`topic`, and :dudir:`sidebar` directives separately customizable for PDF output. Patch by Jean-François B. and Bénédikt Tran.
pt_br: #12704: LaTeX: torna as diretivas :dudir:`contents <table-of-contents>`, :dudir:`topic` e :dudir:`sidebar` separadamente personalizáveis ​​para saída em PDF. Patch de Jean-François B. e Bénédikt Tran.

source: #12474: Support type-dependent search result highlighting via CSS. Patch by Tim Hoffmann.
pt_br: #12474: Suporte a realce de resultados de pesquisa dependentes de tipo via CSS. Patch de Tim Hoffmann.

source: #12652: LaTeX: Add :confval:`math_numsep` support to latex builder. Patch by Thomas Fanning and Jean-François B.
pt_br: #12652: LaTeX: Adiciona suporte a :confval:`math_numsep` ao construtor latex. Patch de Thomas Fanning e Jean-François B.

source: #12743: No longer exit on the first warning when :option:`--fail-on-warning <sphinx-build --fail-on-warning>` is used. Instead, exit with a non-zero status if any warnings were generated during the build. Patch by Adam Turner.
pt_br: #12743: Não é mais encerrado no primeiro aviso quando :option:`--fail-on-warning <sphinx-build --fail-on-warning>` é usado. Em vez disso, sai com um status diferente de zero se algum aviso foi gerado durante a construção. Patch de Adam Turner.

source: #12743: Add :option:`sphinx-build --exception-on-warning`, to raise an exception when warnings are emitted during the build. Patch by Adam Turner and Jeremy Maitin-Shepard.
pt_br: #12743: Adiciona :option:`sphinx-build --exception-on-warning`, para levantar uma exceção quando avisos são emitidos durante a construção. Patch de Adam Turner e Jeremy Maitin-Shepard.

source: #12907: Add :confval:`html_last_updated_use_utc` to allow using universal time (GMT/UTC) instead of local time for the date-time supplied to :confval:`html_last_updated_fmt`. Patch by Adam Turner.
pt_br: #12907: Adiciona :confval:`html_last_updated_use_utc` para permitir usar horário universal (GMT/UTC) em vez de horário local para a data e hora fornecida para :confval:`html_last_updated_fmt`. Patch de Adam Turner.

source: #12910: Copyright entries now support the ``'%Y'`` placeholder to substitute the current year. This is helpful for reducing the reliance on Python modules such as :py:mod:`time` or :py:mod:`datetime` in :file:`conf.py`. See :ref:`the docs <config-copyright>` for further detail. Patch by Adam Turner.
pt_br: #12910: As entradas de direitos autorais agora oferecem suporte ao espaço reservado ``'%Y'`` para substituir o ano atual. Isso é útil para reduzir a dependência de módulos Python como :py:mod:`time` ou :py:mod:`datetime` em :file:`conf.py`. Veja :ref:`a documentação <config-copyright>` para mais detalhes. Patch de Adam Turner.

source: #11781: Add roles for referencing CVEs (:rst:role:`:cve: <cve>`) and CWEs (:rst:role:`:cwe: <cwe>`). Patch by Hugo van Kemenade.
pt_br: #11781: Adiciona papéis para referenciar CVEs (:rst:role:`:cve: <cve>`) e CWEs (:rst:role:`:cwe: <cwe>`). Patch de Hugo van Kemenade.

source: #11809: Improve the formatting for RFC section anchors. Patch by Jakub Stasiak and Adam Turner.
pt_br: #11809: Melhora a formatação para âncoras de seção RFC. Patch de Jakub Stasiak e Adam Turner.

source: #12852: Support a :attr:`.Builder.supported_linkcode` attribute for builders to enable use of :mod:`sphinx.ext.linkcode`-generated references. Patch by James Knight.
pt_br: #12852: Suporte a um atributo :attr:`.Builder.supported_linkcode` para construtores para habilitar o uso de referências geradas por :mod:`sphinx.ext.linkcode`. Patch de James Knight.

source: #12949: Print configuration options that differ from the pickled environment. This can be helpful in diagnosing the cause of a full rebuild. Patch by Adam Turner.
pt_br: #12949: Imprime opções de configuração que diferem do ambiente serializado com picke. Isso pode ser útil para diagnosticar a causa de uma reconstrução completa. Patch de Adam Turner.

source: #12514: intersphinx: fix the meaning of a negative value for :confval:`intersphinx_cache_limit`. Patch by Shengyu Zhang.
pt_br: #12514: intersphinx: corrige o significado de um valor negativo para :confval:`intersphinx_cache_limit`. Patch de Shengyu Zhang.

source: #12722: LaTeX: avoid TeX reporting ``Overfull \hbox`` from too long strings in a codeline when the problem has actually been solved thanks to :ref:`latexsphinxsetupforcewraps`. Patch by Jean-François B.
pt_br: #12722: LaTeX: evita o TeX relatando ``Overfull \hbox`` de strings muito longas em uma linha de código quando o problema foi realmente resolvido graças a :ref:`latexsphinxsetupforcewraps`. Patch de Jean-François B.

source: #12730: The ``UnreferencedFootnotesDetector`` transform has been improved to more consistently detect unreferenced footnotes. Note, the priority of the transform has been changed from 200 to 622, so that it now runs after the docutils ``Footnotes`` resolution transform. Patch by Chris Sewell.
pt_br: #12730: A transformação ``UnreferencedFootnotesDetector`` foi melhorada para detectar de forma mais consistente notas de rodapé não referenciadas. Observe que a prioridade da transformação foi alterada de 200 para 622, de modo que agora ela é executada após a transformação de resolução de ``Footnotes`` do docutils. Patch de Chris Sewell.

source: #12778: LaTeX: let :ref:`'sphinxsetup' <latexsphinxsetup>` ``div.topic_box-shadow`` key if used with only one dimension set both x-offset and y-offset as per documentation. Patch by Jean-François B.
pt_br: #12778: LaTeX: deixa a chave ``div.topic_box-shadow`` de :ref:`'sphinxsetup' <latexsphinxsetup>`, se usada com apenas uma dimensão, definir tanto x-offset quanto y-offset, conforme documentação. Patch de Jean-François B.

source: #12587: Do not warn when potential ambiguity detected during Intersphinx resolution occurs due to duplicate targets that differ case-insensitively. Patch by James Addison.
pt_br: #12587: Não avisa quando ambiguidade potencial detectada durante a resolução do Intersphinx ocorre devido a alvos duplicados que diferem sem distinção entre maiúsculas e minúsculas. Patch de James Addison.

source: #12639: Fix singular and plural search results text. Patch by Hugo van Kemenade.
pt_br: #12639: Corrige texto em singular e plural de resultados de pesquisa. Patch de Hugo van Kemenade.

source: #12645: Correctly support custom gettext output templates. Patch by Jeremy Bowman.
pt_br: #12645: Suporte correto a modelos de saída gettext personalizados. Patch de Jeremy Bowman.

source: #12717: LaTeX: let :option:`-q <sphinx-build -q>` (quiet) option for :program:`sphinx-build -M latexpdf` or :program:`make latexpdf` (``O=-q``) get passed to :program:`latexmk`. Let :option:`-Q <sphinx-build -Q>` (silent) apply as well to the PDF build phase. Patch by Jean-François B.
pt_br: #12717: LaTeX: deixa a opção :option:`-q <sphinx-build -q>` (silenciosa) para :program:`sphinx-build -M latexpdf` ou :program:`make latexpdf` (``O=-q``) ser passada para :program:`latexmk`. Deixa :option:`-Q <sphinx-build -Q>` (silenciosa) aplicar-se também à fase de construção do PDF. Patch de Jean-François B.

source: #12744: LaTeX: Classes injected by a custom interpreted text role now give rise to nested ``\DUrole``'s, rather than a single one with comma separated classes. Patch by Jean-François B.
pt_br: #12744: LaTeX: Classes injetadas por uma função de texto interpretada personalizada agora dão origem a ``\DUrole`` aninhados, em vez de um único com classes separadas por vírgula. Patch de Jean-François B.

source: #12831: LaTeX: avoid large voids sometimes occurring at page bottoms. Patch by Jean-François B.
pt_br: #12831: LaTeX: evita grandes vazios que às vezes ocorrem no rodapé das páginas. Patch de Jean-François B.

source: #11970, #12551: singlehtml builder: make target URIs to be same-document references in the sense of :rfc:`RFC 3986, §4.4 <3986#section-4.4>`, e.g., ``index.html#foo`` becomes ``#foo``. (note: continuation of a partial fix added in Sphinx 7.3.0) Patch by James Addison (with reference to prior work by Eric Norige).
pt_br: #11970, #12551: construtor singlehtml: faz com que os URIs de alvos sejam referências do mesmo documento no sentido do :rfc:`RFC 3986, §4.4 <3986#section-4.4>`, por exemplo, ``index.html#foo`` se torna ``#foo``. (observação: continuação de uma correção parcial adicionada no Sphinx 7.3.0) Patch de James Addison (com referência ao trabalho anterior de Eric Norige).

source: #12735: Fix :pep:`695` generic classes LaTeX output formatting. Patch by Jean-François B. and Bénédikt Tran.
pt_br: #12735: Corrige formatação de saída LaTeX de classes genéricas :pep:`695`. Patch de Jean-François B. e Bénédikt Tran.

source: #12782: intersphinx: fix double forward slashes when generating the inventory file URL (user-defined base URL of an intersphinx project are left untouched even if they end with double forward slashes). Patch by Bénédikt Tran.
pt_br: #12782: intersphinx: corrige barras duplas ao gerar a URL do arquivo de inventário (as URLs base definidas pelo usuário de um projeto intersphinx são deixadas intocadas mesmo se terminarem com barras duplas). Patch de Bénédikt Tran.

source: #12796: Enable parallel reading if requested, even if there are fewer than 6 documents. Patch by Matthias Geier.
pt_br: #12796: Habilita a leitura paralela se solicitado, mesmo se houver menos de 6 documentos. Patch de Matthias Geier.

source: #12844: Restore support for ``:noindex:`` for the :rst:dir:`js:module` and :rst:dir:`py:module` directives. Patch by Stephen Finucane.
pt_br: #12844: Restaura o suporte a ``:noindex:`` para as diretivas :rst:dir:`js:module` e :rst:dir:`py:module`. Patch de Stephen Finucane.

source: #12916: Restore support for custom templates named with the legacy ``_t`` suffix during ``apidoc`` RST rendering (regression in 7.4.0). Patch by James Addison.
pt_br: #12916: Restaura o suporte para modelos personalizados nomeados com o sufixo legado ``_t`` durante a renderização RST ``apidoc`` (regressão em 7.4.0). Patch de James Addison.

source: #12451: Only substitute copyright notice years with values from ``SOURCE_DATE_EPOCH`` for entries that match the current system clock year, and disallow substitution of future years. Patch by James Addison and Adam Turner.
pt_br: #12451: Substitui apenas anos de avisos de direitos autorais por valores de ``SOURCE_DATE_EPOCH`` para entradas que correspondem ao ano do relógio do sistema atual e não permita a substituição de anos futuros. Patch de James Addison e Adam Turner.

source: #12905: intersphinx: fix flipped use of :confval:`intersphinx_cache_limit`, which always kept the cache for positive values, and always refreshed it for negative ones. Patch by Nico Madysa.
pt_br: #12905: intersphinx: corrige o uso invertido de :confval:`intersphinx_cache_limit`, que sempre mantinha o cache para valores positivos e sempre o atualizava para valores negativos. Patch de Nico Madysa.

source: #12888: Add a warning when document is included in multiple toctrees and ensure deterministic resolution of global toctree in parallel builds by choosing the lexicographically greatest parent document. Patch by A. Rafey Khan
pt_br: #12888: Adiciona um aviso quando o documento for incluído em vários toctrees e garanta a resolução determinística do toctree global em construções paralelas escolhendo o documento pai lexicograficamente maior. Patch de A. Rafey Khan

source: #12995: Significantly improve performance when building the search index for Chinese languages. Patch by Adam Turner.
pt_br: #12995: Melhora significativamente o desempenho ao construir o índice de pesquisa para idiomas chineses. Patch de Adam Turner.

source: #12767: :py:meth:`.Builder.write` is typed as ``final``, meaning that the :event:`write-started` event may be relied upon by extensions. A new :py:meth:`.Builder.write_documents` method has been added to control how documents are written. This is intended for builders that do not output a file for each document. Patch by Adam Turner.
pt_br: #12767: :py:meth:`.Builder.write` é tipado como ``final``, significando que o evento :event:`write-started` pode ser confiável para extensões. Um novo método :py:meth:`.Builder.write_documents` foi adicionado para controlar como os documentos são escritos. Isso é destinado a construtores que não produzem um arquivo para cada documento. Patch de Adam Turner.

source: Testing
pt_br: Testes

source: #12141: Migrate from the deprecated ``karma`` JavaScript test framework to the actively-maintained ``jasmine`` framework. Test coverage is unaffected. Patch by James Addison.
pt_br: #12141: Migra do framework de teste JavaScript descontinuado ``karma`` para o framework ``jasmine`` mantido ativamente. A cobertura de teste não é afetada. Patch de James Addison.
