Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/develop.po
Languages: ja, pt_br, zh_cn

source: Sphinx development
ja: Sphinxの開発
pt_br: Desenvolvimento do Sphinx
zh_cn: Sphinx 发展

source: Sphinx is a maintained by a group of volunteers. We value every contribution!
ja: Sphinxはボランティアグループによって開発されています。私たちは、すべての貢献を歓迎します！
pt_br: Sphinx é mantido por um grupo de voluntários. Nós damos valor a cada contribuição!
zh_cn: Sphinx 是由一群志愿者维护的。我们感谢每一位志愿者。

source: The code can be found in a Git repository, at https://github.com/sphinx-doc/sphinx/.
ja: コードはGitリポジトリにあります: https://github.com/sphinx-doc/sphinx/.
pt_br: O Código pode ser encontrado no repositório Git, em https://github.com/sphinx-doc/sphinx/.
zh_cn: 代码可以在 Git 存储库中找到，网址是 https://github.com/sphinx doc/sphinx/。

source: Issues and feature requests should be raised in the `tracker <https://github.com/sphinx-doc/sphinx/issues>`_.
ja: 課題と機能リクエストは `課題管理ツール <https://github.com/sphinx-doc/sphinx/issues>`_ で登録してください。
pt_br: Requerimentos e funcionalidades podem ser encaminhados pelo rastreador `tracker <https://github.com/sphinx-doc/sphinx/issues>`_.
zh_cn: 问题和功能请求应在“tracker”中提出<https://github.com/sphinx-doc/sphinx/issues>`_.

source: The mailing list for development is at `Google Groups <https://groups.google.com/forum/#!forum/sphinx-dev>`_.
ja: 開発者用メーリングリストは `Google Groups <https://groups.google.com/forum/#!forum/sphinx-dev>`_ です。
pt_br: A lista de distribuição para desenvolvimento está em `Google Groups <https://groups.google.com/forum/#!forum/sphinx-dev>`_.
zh_cn: 如您有开发相关的问题可通过`Google Groups 上面的邮箱地址联系我们：<https://groups.google.com/forum/#!forum/sphinx-dev>`_.

source: There is also the #sphinx-doc IRC channel on `freenode <https://freenode.net/>`_.
ja: また、`freenode <https://freenode.net/>`_ には #sphinx-doc というIRCチャネルがあります。
pt_br: Há também um canal IRC #sphinx-doc `freenode <https://freenode.net/>`_.
zh_cn: 在 freenode <https://freenode.net/>`_上还有＃sphinx-doc IRC 通道。

source: For more about our development process and methods, refer to :doc:`/internals/index`.
zh_cn: 有关我们的开发过程和方法的更多信息，请参见：doc：`/ internals / index`。

source: Extensions
ja: 拡張
pt_br: Extensões
zh_cn: 插件

source: To learn how to write your own extension, see :ref:`dev-extensions`.
ja: 自分で拡張を書く方法を知りたいときは、 :ref:`dev-extensions` をご覧ください。
pt_br: Para aprender como escrever suas próprias extensões, ver :ref:`dev-extensions`.
zh_cn: 要了解如何编写自己的扩展名，请参阅：ref-`dev-extensions`。

source: This is the current list of contributed extensions in that repository:
ja: これはリポジトリに含まれている寄贈された拡張の現在のリストです:
pt_br: Essa é a lista corrente das contribuições e extensões que estão no repositório:
zh_cn: 这是该存储库中当前已贡献的扩展的列表：

source: aafig: render embedded ASCII art as nice images using aafigure_
ja: aafig: aafigure_ を使い、素敵な画像としてASCIIアートを埋め込みます。
pt_br: aafig: renderiza arte ASCII incorporada como imagens legais usando aafigure_
zh_cn: aafig：使用 aafigure_将嵌入式 ASCII 艺术渲染为漂亮的图像

source: actdiag: embed activity diagrams by using actdiag_
ja: actdiag: actdiag_ を使ってアクティビティ図を埋め込みます。
pt_br: actdiag: embute diagramas atividade usando actdiag_
zh_cn: actdiag：使用 actdiag_ 嵌入活动 diarams

source: adadomain: an extension for Ada support (Sphinx 1.0 needed)
ja: adadomain: Adaサポートの拡張です (Sphinx 1.0が必要です)。
pt_br: adadomain: suporte para Ada (Sphinx 1.0 necessário)
zh_cn: adadomain：支持 Ada 的扩展（需要 Sphinx 1.0）

source: ansi: parse ANSI color sequences inside documents
ja: ansi: ドキュメント中のANSIカラーシーケンスをパースします。
pt_br: ansi: passa cores e sequências ANSI dentro dos documentos
zh_cn: ansi：解析文档中的 ANSI 颜色序列

source: argdoc: automatically generate documentation for command-line arguments, descriptions and help text
zh_cn: argdoc：自动生成命令行参数，描述和帮助文本的文档

source: astah: embed diagram by using astah
ja: astah: astahを使ってダイアグラムを埋め込みます。
pt_br: astah: embute diagrama usando ``astah``
zh_cn: astah：使用 astah 嵌入图表

source: autoanysrc: Gather reST documentation from any source files
ja: autoanysrc: いずれのソースファイルのreSTドキュメンテーションも集めます
pt_br: autoanysrc: reúna a documentação do reST a partir de qualquer arquivo de origem
zh_cn: autoanysrc：从任何源文件收集 reST 文档

source: autorun: Execute code in a ``runblock`` directive
ja: autorun: ``runblock`` ディレクティブ内のコードを実行します。
pt_br: autorun: executa o código em uma diretiva ``runblock``
zh_cn: 自动运行：在“runblock”指令中执行代码

source: beamer_: A builder for Beamer (LaTeX) output.
zh_cn: beamer_： Beamer (LaTeX) 输出生成器。

source: blockdiag: embed block diagrams by using blockdiag_
ja: blockdiag: blockdiag_ を使ってブロック図を埋め込みます。
pt_br: blockdiag: embed diagramas de bloco usando blockdiag_
zh_cn: blockdiag：使用 blockdiag_嵌入框图

source: cacoo: embed diagram from Cacoo
ja: cacoo: Cacooからのダイアグラムを埋め込みます。
pt_br: cacoo: incorpora diagrama de ``Cacoo``
zh_cn: cacoo: Cacoo 内嵌表

source: cf3domain: a domain for CFEngine 3 policies
ja: cf3domain: CFEngine 3 のポリシー用のドメイン
pt_br: cf3domain: um domínio para políticas do ``CFEngine 3``
zh_cn: cf3domain：CFEngine 3策略的域

source: cheader: The missing c:header directive for Sphinx's built-in C domain
pt_br: cheader: a diretiva ``c:header`` ausente para o domínio ``C`` interno do ``Sphinx``
zh_cn: cheader：Sphinx 的内置 C 域缺少的c：header指令

source: cheeseshop: easily link to PyPI packages
ja: cheeseshop: PyPIパッケージへのリンクを簡単に作成出来ます。
pt_br: cheeseshop: links amigáveis pacotes PyPI
zh_cn: Cheeseshop：轻松链接到 PyPI 软件包

source: clearquest: create tables from ClearQuest_ queries
ja: clearquest: ClearQuest_ クエリーを使ってテーブルを作成します。
pt_br: clearquest: criar tabelas a partir de consultas do ClearQuest_
zh_cn: clearquest：从 ClearQuest_ 查询创建表

source: cmakedomain_: a domain for CMake_
ja: cmakedomain_: CMakeのドメイン_
pt_br: cmakedomain_: domínio para CMake_
zh_cn: cmakedomain_: CMake_域

source: coffeedomain: a domain for (auto)documenting CoffeeScript source code
ja: coffeedomain: CoffeeScriptソースコードを(自動で)ドキュメントするドメインです。
pt_br: coffeedomain: um domínio para documentar (auto) o código fonte do CoffeeScript
zh_cn: coffeedomain：（自动）记录 CoffeeScript 源代码的域

source: context: a builder for ConTeXt
ja: context: ConTeXtのためのビルダーです。
pt_br: context: um construtor para o ``ConTeXt``
zh_cn: context: ConTeXt 生成器

source: disqus: embed Disqus comments in documents
ja: disqus: ドキュメント内に Disqus のコメントを埋め込みます。
pt_br: disqus: embute Disqus comentários em documentos
zh_cn: disqus: 将 Disqus 评论嵌入文档中

source: documentedlist: converts a Python list to a table in the generated documentation
ja: documentedlist: Pythonのリスト形式をテーブルに変換し、文書に埋め込みます。
pt_br: documentedlist: converte uma lista do Python em uma tabela na documentação gerada
zh_cn: documentedlist：将 Python 列表转换为生成的文档中的表

source: doxylink: Link to external Doxygen-generated HTML documentation
ja: doxylink: Doxygenが生成した外部のHTMLドキュメントへのリンクを作成します。
pt_br: doxylink: Link para documentação externa Doxygen HTML
zh_cn: doxylink：链接到外部 Doxygen 生成的 HTML 文档

source: domaintools_: A tool for easy domain creation
ja: domaintools_: 簡便なドメイン作成用ツール
pt_br: domaintools_: Uma ferramenta para facilitar a criação de domínios
zh_cn: domaintools_：创建域的便捷工具

source: email: obfuscate email addresses
ja: email: メールアドレスを難読化します。
pt_br: email: disfarçes paa endereços de email
zh_cn: email：：混淆电子邮件地址

source: erlangdomain: an extension for Erlang support (Sphinx 1.0 needed)
ja: erlangdomain: Erlangサポートの拡張です (Sphinx 1.0が必要です)。
pt_br: erlangdomain: extensão suporte para Erlang (Sphinx 1.0 necessário)
zh_cn: erlangdomain：支持 Erlang 的扩展（需要 Sphinx 1.0）

source: exceltable: embed Excel spreadsheets into documents using exceltable_
ja: exceltable: exceltable_ を使い、Excelスプレッドシートをドキュメントに埋め込みます。
pt_br: exceltable: embutir planilhas Excel em documentos usando exceltable_
zh_cn: exceltable：使用 exceltable_ 将 Excel 电子表格嵌入文档中

source: feed: an extension for creating syndication feeds and time-based overviews from your site content
ja: フィード: 時間ベースでサイトのコンテンツから概要を作成して配信フィードを生成する拡張です。
pt_br: feed: uma extensão para assinatura feeds com base em tempo e visões do conteúdo do site
zh_cn: feed：用于从您的网站内容创建联合供稿和基于时间的概述的扩展

source: findanything_: an extension to add Sublime Text 2-like findanything panels to your documentation to find pages, sections and index entries while typing
ja: findanything_: Sublime Text 2のようなfindanythingパネルを、タイプしながらドキュメントのfind,section, 及びindexエントリーに追加できるエクステンションです。
pt_br: findanything_: extensão para adicionar Sublime Text 2 com paineis para sua documentação encontrar páginas, seções e entradas de índice enquanto digita
zh_cn: findanything_：用于在文档中添加Sublime Text 2之类的findanything面板的扩展，以在键入时查找页面，节和索引条目

source: gnuplot: produces images using gnuplot_ language
ja: gnuplot: gnuplot_ を使って画像を生成します。
pt_br: gnuplot: produz imagens usando a linguagem gnuplot_
zh_cn: gnuplot：使用 gnuplot_ 语言生成图像

source: googleanalytics: track web visitor statistics by using `Google Analytics`_
ja: googleanalytics: `Google Analytics`_ を使ってwebの訪問者を追跡します。
pt_br: googleanalytics: estatísticas e rastreia visitas usando `Google Analytics`_
zh_cn: googleanalytics：使用“ Google Analytics（分析）” _跟踪网络访问者统计信息

source: googlechart: embed charts by using `Google Chart`_
ja: googlechart: `Google Chart`_ を使ってチャートを埋め込みます。
pt_br: googlechar: gráficos embutidos usando `Google Chart`_
zh_cn: 谷歌图表：使用“谷歌图表”嵌入图表_

source: googlemaps: embed maps by using `Google Maps`_
ja: googlemaps: `Google Maps`_ を使って地図を埋め込みます。
pt_br: googlemaps: mapas embutidos usando `Google Maps`_
zh_cn: googlemaps：使用`Google Maps__嵌入地图

source: httpdomain: a domain for documenting RESTful HTTP APIs
ja: httpdomain: RESTful HTTP APIをドキュメント化するドメインです。
pt_br: httpdomain: um domínio para documentar APIs ``HTTP RESTful``
zh_cn: httpdomain：用于记录 RESTful HTTP API 的域

source: hyphenator: client-side hyphenation of HTML using hyphenator_
ja: hyphenator: hyphenator_ を使ってHTMLをクライアント側でハイフネーションを行います。
pt_br: hyphenator: hifenização HTML lado cliente usando hiphenator_
zh_cn: 连字符：使用 hyphenator_的 HTML 的客户端连字符

source: imgur: embed Imgur images, albums, and metadata in documents
ja: imgur: Imgur の画像、アルバム、メタデータを文書に埋め込みます。
pt_br: imgur: embute imagens, álbuns e metadados do ``Imgur`` em documentos
zh_cn: imgur：将 Imgur 图像，相册和元数据嵌入文档中

source: inlinesyntaxhighlight_: inline syntax highlighting
ja: inlinesyntaxhighlight_: インラインのシンタックスハイライト
zh_cn: inlinesyntaxhighlight_：内联语法突出显示

source: lassodomain: a domain for documenting Lasso_ source code
ja: lassodomain: Lasso_ source codeをドキュメントするためのドメインです。
pt_br: lassodomain: domínio para documentação código fonte Lasso_
zh_cn: lassodomain：用于记录 Lasso_ 源代码的域

source: libreoffice: an extension to include any drawing supported by LibreOffice (e.g. odg, vsd, ...)
ja: libreoffice: LibreOfficeでサポートされている描画(例： odg, vsd)を取り込むエクステンションです。
pt_br: libreoffice: uma extensão para incluir qualquer desenho suportado pelo LibreOffice (por exemplo, odg, vsd, ...)
zh_cn: libreoffice：扩展，包括 LibreOffice 支持的任何图形（例如odg，vsd等）

source: lilypond: an extension inserting music scripts from Lilypond_ in PNG format
ja: lilypond: Lilypond_ を使って楽譜をPNG画像として挿入する拡張です。
pt_br: lilypond: uma extensão que insere scripts de música de Lilypond_ no formato PNG
zh_cn: lilypond：一个扩展程序，以 PNG 格式插入来自 Lilypond_ 的音乐脚本

source: makedomain_: a domain for `GNU Make`_
ja: makedomain_: `GNU Make`のためのドメイン_
pt_br: makedomain_: domínio para `GNU Make`_
zh_cn: makedomain _：“ GNU Make” _的域

source: matlabdomain: document MATLAB_ code
ja: matlabdomain: MATLAB_ コードをドキュメントするためのドメイン
pt_br: matlabdomain: documenta o código MATLAB_
zh_cn: Matlab域：文档 MATLAB 代码

source: mockautodoc: mock imports
ja: mockautodoc: インポートをモックする
pt_br: mockautodoc: embute simuladas
zh_cn: mockautodoc：模拟导入

source: mscgen: embed mscgen-formatted MSC (Message Sequence Chart)s
ja: mscgen: mscgen形式のMSC (Message Sequence Chart) を埋め込みます。
pt_br: mscgen: embute o MSC (Message Sequence Chart) formatado em ``mscgen``
zh_cn: mscgen：嵌入 mscgen 格式的 MSC（消息序列图）

source: napoleon: supports `Google style`_ and `NumPy style`_ docstrings
ja: napoleon: `Google style`_ と `NumPy style`_ のdocstringsをサポートします。
pt_br: napoleon: suporta `Google style`_ e `NumPy style`_ docstrings
zh_cn: napoleon：支持“ Google风格” _和“ NumPy风格” _文档字符串

source: nicovideo: embed videos from nicovideo
ja: nicovideo: ニコニコ動画からの動画を埋め込みます。
pt_br: nicovideo: embute vídeos de ``nicovideo``
zh_cn: nicovideo：nicovideo 内嵌视频

source: nwdiag: embed network diagrams by using nwdiag_
ja: nwdiag: nwdiag_ を使ってネットワーク図を埋め込みます。
pt_br: nwdiag: diagramas rede embutidos usando nwdiag_
zh_cn: nwdiag：使用 nwdiag_ 嵌入网络图

source: omegat: support tools to collaborate with OmegaT_ (Sphinx 1.1 needed)
ja: omegat: OmegaT_ との連携をサポートするツールです(Sphinx 1.1 が必要です)。
pt_br: omegat: suporta funcionalidades para colaboração com OmegaT_ (Sphinx 1.1 necessário)
zh_cn: omegat：与 OmegaT_协作的支持工具（需要 Sphinx 1.1）

source: osaka: convert standard Japanese doc to Osaka dialect (this is a joke extension)
ja: osaka: 日本語の標準語を大阪弁に変換します(ジョーク拡張です)。
pt_br: osaka: converter doc japonês padrão para o dialeto de ``Osaka`` (isso é uma extensão de brincadeira)
zh_cn: 大阪：将标准日文文档转换为大阪方言（这只是个玩笑）

source: paverutils: an alternate integration of Sphinx with Paver_
ja: paverutils: Paver_ とSphinxの別の連携を行います。
pt_br: paverutils: uma integração alternativa de Sphinx com Paver_
zh_cn: paverutils：Sphinx 与 Paver_的替代集成

source: phpdomain: an extension for PHP support
ja: phpdomain: PHPサポートの拡張です。
pt_br: phpdomain: extensão para suporte PHP
zh_cn: phpdomain：PHP 支持的扩展

source: plantuml: embed UML diagram by using PlantUML_
ja: plantuml: PlantUML_ を使ってUMLダイアグラムを埋め込みます。
pt_br: plantuml: diagramas UML embutidos usando PlantUML_
zh_cn: plantuml：使用 PlantUML_ 嵌入 UML 图

source: py_directive: Execute python code in a ``py`` directive and return a math node
ja: py_directive: Pythonコードを"py"ディレクティブで実行し、Mathノードを返す。
pt_br: py_directive: execute o código Python em uma diretiva ``py`` e retorne um nó de matemática
zh_cn: py_directive：在 py 指令中执行 Python 代码并返回数学节点

source: rawfiles: copy raw files, like a CNAME
ja: rawfiles: CNAMEのように元のファイルをコピーします。
pt_br: rawfiles: copie arquivos brutos, como um ``CNAME``
zh_cn: rawfiles：复制原始文件，例如 CNAME

source: requirements: declare requirements wherever you need (e.g. in test docstrings), mark statuses and collect them in a single list
ja: requirements: 必要なところにrequirementsを記載して(例えばテストのdocstringで)、記載した内容とステータスを1つのリストにまとめて出力する拡張です。
pt_br: requirements: declara requerimentos onde for precisso (ex. em testes docstrings), marca status e coleta em uma simples lista
zh_cn: 需求：在任何需要的地方声明需求（例如在测试文档字符串中），标记状态并将其收集在一个列表中

source: restbuilder: a builder for reST (reStructuredText) files
ja: restbuilder: reST (reStructuredText) ファイルに対するビルダー
pt_br: restbuilder: um construtor para arquivos reST (reStructuredText)
zh_cn: restbuilder：reST（reStructuredText）文件的生成器

source: rubydomain: an extension for Ruby support (Sphinx 1.0 needed)
ja: rubydomain: Rubyサポートの拡張です (Sphinx 1.0が必要です)。
pt_br: rubydomain: extensão para suporte a Ruby (Sphinx 1.0 necessário)
zh_cn: rubydomain：Ruby 支持的扩展（需要 Sphinx 1.0）

source: sadisplay: display SqlAlchemy model sadisplay_
ja: sadisplay: sadisplay_ モデルのSqlAlchemyを表示します。
pt_br: sadisplay: exibir modelo SqlAlchemy sadisplay_
zh_cn: sadisplay：显示 SqlAlchemy 模型 sadisplay_

source: sdedit: an extension inserting sequence diagram by using Quick Sequence Diagram Editor (sdedit_)
ja: sdedit: Quick Sequence Diagram Editor (sdedit_) を使って、シーケンス図を挿入する拡張です。
pt_br: sdedit: extensão para inserir diagrama sequência usando Quick Seq. Diagram Editor (sdedit_)
zh_cn: sdedit：使用快速序列图编辑器（sdedit_）的扩展插入序列图

source: seqdiag: embed sequence diagrams by using seqdiag_
ja: seqdiag: seqdiag_ を使ってシーケンス図を埋め込みます。
pt_br: seqdiag: embutir diagramas de sequência usando seqdiag_
zh_cn: seqdiag：使用 seqdiag_ 嵌入序列图

source: slide: embed presentation slides on slideshare_ and other sites
ja: slide: slideshare_ や他のサイトのプレゼンスライドを埋め込みます。
pt_br: slide: inserir slides de apresentação em slideshare_ e outros sites
zh_cn: 幻灯片：将演示文稿幻灯片嵌入 slideshare_ 和其他网站上

source: swf_: embed flash files
ja: swf_: Flashを埋め込みます。
pt_br: swf_: arquivos flash embutidos
zh_cn: swf_：内嵌动画文件

source: sword: an extension inserting Bible verses from Sword_
ja: sword: Sword_ からBible versesを埋め込む拡張です。
pt_br: sword: uma extensão inserindo versículos da Bíblia de Sword_
zh_cn: 剑：以 Sword_ 插入圣经经文的扩展名

source: tikz: draw pictures with the `TikZ/PGF LaTeX package`_
ja: tikz: `TikZ/PGF LaTeX package`_ を使って絵を書きます。
pt_br: tikz: desenhe imagens com o `TikZ/PGF LaTeX package`_
zh_cn: tikz：使用“ TikZ / PGF LaTeX软件包”绘制图片_

source: traclinks: create TracLinks_ to a Trac_ instance from within Sphinx
ja: traclinks: Sphinxから Trac_ インスタンスへの TracLinks_ を作成します。
pt_br: traclinks: criar TracLinks_ para instância Trac_ dentro do Sphinx
zh_cn: Traclinks：在 Sphinx 中将 TracLinks_ 创建到 Trac_ 实例

source: versioning: Sphinx extension that allows building versioned docs for self-hosting
ja: (特別なホスティングサービスではなく、)セルフホスティング環境で、複数バージョンのドキュメントの生成を行うスフィンクス拡張です。
pt_br: versioning: extensão Sphinx que permite criar documentos com versão para auto-hospedagem
zh_cn: 版本控制：Sphinx 扩展，允许构建用于自我托管的版本控制文档

source: whooshindex: whoosh indexer extension
ja: whooshindex: whooshのインデクサー拡張です。
pt_br: whooshindex: extensão indexador whoosh
zh_cn: whooshindex：Whoosh Indexer 扩展

source: youtube: embed videos from YouTube_
ja: youtube: YouTube_ から動画を埋め込みます。
pt_br: youtube: embutir videos do YouTube_
zh_cn: youtube：嵌入 YouTube_ 中的视频

source: zopeext: provide an ``autointerface`` directive for using `Zope interfaces`_
ja: zopeext: `Zope interfaces`_ を使って ``autointerface`` ディレクティブを提供します。
pt_br: zopeext: forneça uma diretiva ``autointerface`` para usar `Zope interfaces`_
zh_cn: zopeext：提供一个使用 `Zope interfaces`_ 的 “ autointerface`` 指令

source: See the :doc:`extension tutorials <../development/tutorials/index>` on getting started with writing your own extensions.
pt_br: Veja o :doc:`extension tutorials <../development/tutorials/index>` para começar a escrever suas próprias extensões.
zh_cn: 请参阅扩展文档 <../ development / tutorials / index> 中的扩展教程，以开始编写自己的扩展。

source: For more about our development process and methods, see the :doc:`devguide`.
ja: 開発プロセスについては、 :doc:`devguide` を参照してください。
pt_br: Saiba mais sobre o processo de desenvolvimento bem como os métodos, veja :doc:`devguide`.

source: The `sphinx-contrib <https://bitbucket.org/birkenfeld/sphinx-contrib/>`_ repository contains many contributed extensions. Some of them have their own releases on PyPI, others you can install from a checkout.
ja: `sphinx-contrib <https://bitbucket.org/birkenfeld/sphinx-contrib/>`_ リポジトリは寄贈されたたくさんの拡張を含んでいます。いくつかの拡張はPyPI上に独自にリリースされており、またその他のものはチェックアウトしてインストール出来ます。
pt_br: O repositório `sphinx-contrib <https://bitbucket.org/birkenfeld/sphinx-contrib/>`_ contém algumas contiruições de extensões. Algumas com suas próprias versões no PyPI outras pode instalar através de checkout.

source: argdoc: automatically generate documentation for command-line arguments, descriptions, and help text
ja: argdoc: コマンドライン引数とその説明、またヘルプを自動生成します。
