Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/devguide.po
Languages: ja, pt_br, zh_cn

source: JavaScript stemming algorithms in ``sphinx/search/*.py`` (except ``en.py``) are generated by this `modified snowballcode generator <https://github.com/shibukawa/snowball>`_. Generated `JSX <https://jsx.github.io/>`_ files are in `this repository <https://github.com/shibukawa/snowball-stemmer.jsx>`_. You can get the resulting JavaScript files using the following command::
ja: JavaScript ストリーミングアルゴリズムは `modified snowballcode generator <https://github.com/shibukawa/snowball>`_ によって生成されます。 `sphinx/search/*.py` (`en.py` を除く)の中の 生成された `JSX <http://jsx.github.io/>`_ ファイルは `このリポジトリ <https://github.com/shibukawa/snowball-stemmer.jsx>`_ です。 生成された JavaScript は下記のコマンドを使用して取得することができます:
pt_br: Os algoritmos de stemming de JavaScript em ``sphinx/search/*.py`` (exceto ``en.py``) são gerados por este ``gerador de snowballcode modificado <https://github.com/shibukawa/snowball>`_. Os arquivos `JSX <https://jsx.github.io/>`_ gerados estão neste repositório <https://github.com/shibukawa/snowball-stemmer.jsx>`_. Você pode obter os arquivos JavaScript resultantes usando o seguinte comando::
zh_cn: “sphinx/search/*.py”中的JavaScript词干算法（除了``英语``)是由这个经过修改的雪球代码生成器生成的<https://github.com/shibukawa/snowball>`_. 生成`JSX<https://jsx.github.io/>`_文件在此存储库中<https://github.com/shibukawa/snowball-stemmer.jsx>`_. 可以使用以下命令获取生成的JavaScript文件：

source: Branch Model
pt_br: Modelo de Branch
zh_cn: 分支模型

source: Sphinx project uses following branches for developing that conforms to Semantic Versioning 2.0.0 (refs: https://semver.org/ ).
pt_br: O projeto ``Sphinx`` usa as seguintes ramificações para desenvolvimento que estão em conformidade com o Semântica de versão 2.0.0 (refs: https://semver.org/).
zh_cn: Sphinx项目使用以下分支开发符合语义版本控制2.0.0（参考文献：https://semver.org/).

source: ``master``
zh_cn: “主分支”

source: Development for MAJOR version. All changes including incompatible behaviors and public API updates are allowed.
pt_br: Desenvolvimento para a versão MAJOR. Todas as alterações, incluindo comportamentos incompatíveis e atualizações de API públicas, são permitidas.
zh_cn: 主要版本的开发。允许所有更改，包括不兼容的行为和公共API更新。

source: Where ``A.x`` is the ``MAJOR.MINOR`` release. Used to maintain current MINOR release. All changes are allowed if the change preserves backwards-compatibility of API and features.
zh_cn: 其中“A.x”是``大调。小调``释放。用于维持当前的小版本。如果更改保留了API和特性的向后兼容性，则允许进行所有更改。

source: Only the most recent ``MAJOR.MINOR`` branch is currently retained. When a new MAJOR version is released, the old ``MAJOR.MINOR`` branch will be deleted and replaced by an equivalent tag.
pt_br: Apenas o branch ``MAJOR.MINOR`` mais recente está atualmente retido. Quando uma nova versão MAJOR for lançada, a antiga ramificação ``MAJOR.MINOR`` será excluída e substituída por uma tag equivalente.
zh_cn: 只有最近的``大调。小调``分支当前被保留。当新的主要版本发布时，旧版本``大调。小调``分支将被删除并替换为等效标记。

source: Where ``A.B.x`` is the ``MAJOR.MINOR.PATCH`` release. Only backwards-compatible bug fixes are allowed. In Sphinx project, PATCH version is used for urgent bug fix.
zh_cn: 其中“A.B.x”是``主要.次要.修补``释放。只允许向后兼容的错误修复。在Sphinx项目中，补丁版本用于紧急修复bug。

source: ``MAJOR.MINOR.PATCH`` branch will be branched from the ``v`` prefixed release tag (ex. make 2.3.1 that branched from v2.3.0) when a urgent release is needed. When new PATCH version is released, the branch will be deleted and replaced by an equivalent tag (ex. v2.3.1).
pt_br: o ramo ``MAJOR.MINOR.PATCH`` será ramificado a partir da tag de release prefixada ``v`` (por exemplo, make 2.3.1 que ramificou de v2.3.0) quando um release urgente é necessário. Quando uma nova versão PATCH é lançado, a ramificação será excluída e substituída por uma tag equivalente (ex. V2.3.1).
zh_cn: ``主要.次要.修补``当需要紧急发布时，分支将从前缀为“v”的发布标记（例如，make 2.3.1从v2.3.0分支）分支。当新的补丁版本发布时，分支将被删除，并被一个等价的标签（例如v2.3.1）替换。

source: Deprecating a feature
ja: 非推奨の機能
pt_br: Recurso em Desuso
zh_cn: 弃用功能

source: There are a couple reasons that code in Sphinx might be deprecated:
ja: 次の2つの理由からSphinx内のコードは非推奨なものとなるかもしれません:
pt_br: Existem alguns motivos pelos quais o código no ``Sphinx`` pode ser descontinuado:
zh_cn: Sphinx中的代码可能会被弃用，这有两个原因：

source: If a feature has been improved or modified in a backwards-incompatible way, the old feature or behavior will be deprecated.
ja: ある機能が後方互換のない方法で改良、修正された場合、古い機能，動作は非推奨となります。
pt_br: Se um recurso foi aprimorado ou modificado de maneira incompatível com versões anteriores, o recurso ou comportamento antigo será descontinuado.
zh_cn: 如果某个功能以向后不兼容的方式进行了改进或修改，则旧功能或行为将被弃用。

source: Sometimes Sphinx will include a backport of a Python library that's not included in a version of Python that Sphinx currently supports. When Sphinx no longer needs to support the older version of Python that doesn't include the library, the library will be deprecated in Sphinx.
ja: Sphinxが現在サポートしているPythonのバージョンで収録されていないPythonライブラリを，Sphinxはバックポートとして収録することがあります。Pythonの旧バージョンで，当該ライブラリを収録していないものについてサポートをSphinxが打ち切るときに、そのライブラリはSphinxで非推奨となります。
pt_br: Às vezes, o ``Sphinx`` incluirá um backport de uma biblioteca Python que não está incluída em uma versão do Python que o ``Sphinx`` atualmente suporta. Quando o ``Sphinx`` não precisa mais suportar a versão mais antiga do Python que não inclui a biblioteca, a biblioteca será descontinuada no ``Sphinx``.
zh_cn: 有时候，Sphinx将包含Python库的一个后端口，而Sphinx当前支持的Python版本中没有包含该库。当Sphinx不再需要支持不包含库的Python旧版本时，Sphinx中将不推荐使用该库。

source: As the :ref:`deprecation-policy` describes, the first release of Sphinx that deprecates a feature (``A.B``) should raise a ``RemovedInSphinxXXWarning`` (where ``XX`` is the Sphinx version where the feature will be removed) when the deprecated feature is invoked. Assuming we have good test coverage, these warnings are converted to errors when running the test suite with warnings enabled::
pt_br: Como o :ref:`deprecation-policy` descreve, o primeiro release do ``Sphinx`` que marcou um recurso como estando em desuso (``A.B``) deve gerar um ``RemovedInSphinxXXWarning`` (em que ``XX`` é a versão do ``Sphinx`` em que o recurso será removido) quando o recurso em desuso for chamado. Supondo que tenhamos uma boa cobertura de teste, esses avisos serão convertidos em erros ao executar o conjunto de testes com avisos ativados::
zh_cn: 正如：ref:`deprecision policy`所描述的，在调用不推荐使用的功能时，第一个不推荐使用的功能的Sphinx版本（`a.B``）应该发出一个“RemovedInSphinxXXWarning``（其中``XX``是将删除该功能的Sphinx版本）。假设我们有良好的测试覆盖率，在运行启用警告的测试套件时，这些警告将转换为错误：

source: Thus, when adding a ``RemovedInSphinxXXWarning`` you need to eliminate or silence any warnings generated when running the tests.
pt_br: Assim, ao adicionar um ``RemovedInSphinxXXWarning``, você precisa eliminar ou silenciar quaisquer avisos gerados ao executar os testes.
zh_cn: 因此，在添加“RemovedInSphinxXXWarning”时，需要消除或消除运行测试时生成的任何警告。

source: Deprecation policy
ja: 非推奨についての方針
pt_br: Política de Desuso
zh_cn: 弃用政策

source: MAJOR and MINOR releases may deprecate certain features from previous releases. If a feature is deprecated in a release A.x, it will continue to work in all A.x.x versions (for all versions of x). It will continue to work in all B.x.x versions but raise deprecation warnings. Deprecated features will be removed at the C.0.0. It means the deprecated feature will work during 2 MAJOR releases at least.
pt_br: As versões MAJOR e MINOR podem descartar certos recursos de versões anteriores. Se um recurso for marcado como em desuso em um release A.x, ele continuará a funcionar em todas as versões do A.x.x (para todas as versões do x). Ele continuará a funcionar em todas as versões B.x.x, mas levantará os avisos de descontinuação. Os recursos em desuso serão removidos na C.0.0. Isso significa que o recurso em desuso funcionará durante pelo menos 2 lançamentos MAJOR.
zh_cn: 主要版本和次要版本可能会贬低以前版本中的某些功能。如果某个特性在版本a.x中被弃用，它将继续在所有a.x.x版本中工作（对于x的所有版本）。它将继续在所有B.x.x版本中工作，但会引发不推荐使用的警告。不推荐使用的功能将在C.0.0中删除。这意味着不推荐的特性将在至少两个主要版本中工作。

source: So, for example, if we decided to start the deprecation of a function in Sphinx 2.x:
pt_br: Então, por exemplo, se decidimos iniciar o desuso de uma função no Sphinx 2.x:
zh_cn: 因此，例如，如果我们决定开始对Sphinx 2.x中的函数进行弃用：

source: Sphinx 2.x will contain a backwards-compatible replica of the function which will raise a ``RemovedInSphinx40Warning``. This is a subclass of :exc:`python:PendingDeprecationWarning`, i.e. it will not get displayed by default.
zh_cn: sphinx2.x将包含该函数的向后兼容副本，该副本将引发“RemovedInSphinx40Warning”。这是：exc:`python:pendingdprecationwarning`，即默认不显示。

source: Sphinx 3.x will still contain the backwards-compatible replica, but ``RemovedInSphinx40Warning`` will be a subclass of :exc:`python:DeprecationWarning` then, and gets displayed by default.
zh_cn: Sphinx3.x仍将包含向后兼容的副本，但“RemovedInSphinx40Warning”将是exc:`python:弃用警告`然后，默认显示。

source: Sphinx 4.0 will remove the feature outright.
pt_br: O Sphinx 4.0 removerá o recurso imediatamente.
zh_cn: 斯芬克斯4.0将彻底删除该功能。

source: Deprecation warnings
zh_cn: 弃用警告

source: Sphinx will enable its ``RemovedInNextVersionWarning`` warnings by default, if :envvar:`python:PYTHONWARNINGS` is not set. Therefore you can disable them using:
zh_cn: Sphinx将在默认情况下启用其“RemovedInNextVersionWarning”警告，前提是：envvar：`python：PYTHON警告`未设置。因此，您可以使用以下方法禁用它们：

source: ``PYTHONWARNINGS= make html`` (Linux/Mac)
zh_cn: 运行 ``PYTHONWARNINGS= make html`` （适用于Linux/Mac系统），注意中间的空格

source: ``export PYTHONWARNINGS=`` and do ``make html`` (Linux/Mac)
ja: ``export PYTHONWARNINGS=`` として、 ``make html`` を実行する(Linux/Mac)
pt_br: ``export PYTHONWARNINGS=`` e executar ``make html`` (Linux/Mac)
zh_cn: 先运行 ``export PYTHONWARNINGS=`` 然后 ``make html`` （适用于Linux/Mac系统）

source: ``set PYTHONWARNINGS=`` and do ``make html`` (Windows)
ja: ``set PYTHONWARNINGS=`` として ``make html``を実行する(Windows)
pt_br: ``set PYTHONWARNINGS=`` e executar ``make html`` (Windows)
zh_cn: 先运行 ``set PYTHONWARNINGS=`` 然后 ``make html`` （适用于 Windows 系统）

source: But you can also explicitly enable the pending ones using e.g. ``PYTHONWARNINGS=default`` (see the :ref:`Python docs on configuring warnings <python:describing-warning-filters>`) for more details.
zh_cn: 但您也可以使用“PYTHONWARNINGS=default`”显式地启用挂起的警告（请参阅：ref:`Python docs on configuring warnings`）以获取更多详细信息。

source: Unit Testing
ja: 単体テスト
pt_br: Testes Unitários
zh_cn: 单元测试

source: Sphinx has been tested with pytest runner. Sphinx developers write unit tests using pytest notation. Utility functions and pytest fixtures for testing are provided in ``sphinx.testing``. If you are a developer of Sphinx extensions, you can write unit tests with using pytest. At this time, ``sphinx.testing`` will help your test implementation.
ja: Sphinxのテストはpytestで行われてきました。Sphinx開発者はpytestの表記法を用いて単体テストを書きます。ユーティリティ関数とテストのためのpytest フィクスチャは``sphinx.testing``で提供されています。もしなたがSphinx拡張の開発者でしたら、pytestを使って単体テストを書くことができます。現時点では、テストの実装には``sphinx.testing``が有用でしょう。
pt_br: O ``Sphinx`` foi testado com runner do ``PyTest``. Os desenvolvedores do ``Sphinx`` escrevem testes unitários usando a notação ``PyTest``. As funções de utilidade e os dispositivos de teste ``PyTest`` para testes são fornecidos em ``sphinx.testing``. Se você é um desenvolvedor de extensões ``Sphinx``, você pode escrever testes de unidade usando o ``PyTest``. Neste momento, o ``sphinx.testing`` ajudará sua implementação de teste.
zh_cn: sphinx已经用pytest runner测试过了。Sphinx开发人员使用pytest符号编写单元测试。中提供了用于测试的实用程序函数和pytest夹具``狮身人面像测试``. 如果您是Sphinx扩展的开发人员，可以使用pytest编写单元测试。在这个时候``sphinx测试``将有助于您的测试实现。

source: How to use pytest fixtures that are provided by ``sphinx.testing``? You can require ``'sphinx.testing.fixtures'`` in your test modules or ``conftest.py`` files like this::
ja: ``sphinx.testing``で提供されているpytestフィクスチャーはどのように使うのでしょうか？ ご自身のテストモジュールや ``conftest.py`` ファイルに ``'sphinx.testing.fixtures'`を次のように用意します::
pt_br: Como usar as ``fixtures`` do ``PyTest`` que são fornecidos pelo ``sphinx.testing``? Você pode requer ``'sphinx.testing.fixtures'`` em seus módulos de teste ou arquivos ``conftest.py`` como este::
zh_cn: 如何使用由提供的pytest设备``sphinx测试``? 你可以要求`'sphinx测试夹具'``在你的测试模块中，或者``conftest.py``像这样的文件：

source: If you want to know more detailed usage, please refer to ``tests/conftest.py`` and other ``test_*.py`` files under ``tests`` directory.
ja: さらに詳しい使い方を知りたい場合は、``tests/conftest.py`` と``tests`` ディレクトリ配下にある ``test_*.py`` ファイルらを参照してください。
pt_br: Se você quiser saber o uso mais detalhado, consulte ``tests/conftest.py`` e outros arquivos ``test_*.py`` sob o diretório ``tests``.
zh_cn: 如果你想知道更详细的用法，请参考“测试”/conftest.py``以及“tests”目录下的其他“tests”文件。

source: Prior to Sphinx - 1.5.2, Sphinx was running the test with nose.
ja: Sphinx - 1.5.2以前は, Sphinx はnoseを使ってテストを走らせていました.
pt_br: Antes do Sphinx - 1.5.2, o ``Sphinx`` fazia o teste com o ``Nose``.
zh_cn: 在Sphinx-1.5.2之前，Sphinx是用nose来测试的。

source: ``sphinx.testing`` as a experimental.
pt_br: ``sphinx.testing`` como experimental.
zh_cn: sphinx测试作为一个实验。

source: Sphinx also runs JavaScript tests.
pt_br: O ``Sphinx`` também executa testes de JavaScript.
zh_cn: Sphinx也能运行JAVA脚本测试。

source: Release procedures
zh_cn: 发布程序

source: The release procedures are listed on ``utils/release-checklist``.
zh_cn: 发布程序列在“utils/release checklist”上。

source: Locale Updates
zh_cn: 区域设置更新

source: The parts of messages in Sphinx that go into builds are translated into several locales. The translations are kept as gettext ``.po`` files translated from the master template :file:`sphinx/locale/sphinx.pot`.
zh_cn: Sphinx中进入构建的消息部分被转换成几个区域设置。翻译保存为从主模板file:sphinx/locale翻译的gettext``.po``文件/shinx.pot`.

source: Sphinx uses `Babel <http://babel.pocoo.org/en/latest/>`_ to extract messages and maintain the catalog files. It is integrated in ``setup.py``:
ja: Sphinxはメッセージを展開し、カタログファイルを管理するために `Babel <http://babel.pocoo.org/en/latest/>`_ を使っています。これは ``setup.py`` に含まれています。
pt_br: O ``Sphinx`` usa o `Babel <http://babel.pocoo.org/en/latest/>`_ para extrair mensagens e manter os arquivos de catálogo. Está integrado no ``setup.py``:
zh_cn: sphinx用的是“巴别塔”<http://babel.pocoo.org/en/latest/>`_提取消息并维护目录文件。它集成在``设置.py``:

source: Use ``python setup.py extract_messages`` to update the ``.pot`` template.
ja: ``.pot`` テンプレートを更新するには ``python setup.py extract_messages`` を使います。
pt_br: Usar ``python setup.py extract_messages`` para atualizar modelo ``.pot``.
zh_cn: 使用``python设置.py提取“消息”以更新“.pot”模板。

source: Use ``python setup.py update_catalog`` to update all existing language catalogs in ``sphinx/locale/*/LC_MESSAGES`` with the current messages in the template file.
ja: テンプレートファイルにある現時点でのメッセージで ``sphinx/locale/*/LC_MESSAGES`` のすべての既存のカタログを更新するには、 ``python setup.py update_catalog`` を使います。
pt_br: Usar ``python setup.py update_catalog`` para atualizar todos os catálogos de idiomas em ``sphinx/locale/*/LC_MESSAGES`` com mensagens do arquivo modelo.
zh_cn: 使用``python设置.pyupdate\u catalog``使用模板文件中的当前消息更新“sphinx/locale/*/LC_MESSAGES”中的所有现有语言目录。

source: Use ``python setup.py compile_catalog`` to compile the ``.po`` files to binary ``.mo`` files and ``.js`` files.
ja: ``.po`` ファイルをバイナリの ``.mo`` ファイルと ``.js`` ファイルにコンパイルするには ``python setup.py compile_catalog`` を使います。
pt_br: Usar ``python setup.py compile_catalog`` para compilar arquivos ``.po`` para arquivos binários ``.mo`` e arquivos ``.js``.
zh_cn: 使用``python设置.pycompile\u catalog``将`.po``文件编译为二进制``.mo``文件和``.js``文件。

source: When an updated ``.po`` file is submitted, run compile_catalog to commit both the source and the compiled catalogs.
ja: 更新された ``.po`` ファイルが投稿された場合、ソースとコンパイルされたカタログの両方をコミットするために compile_catalog を実行します。
pt_br: Quando arquivo ``.po`` for submetido, executar o compile_catalog para o commit de ambos catálogos fonte e compilados.
zh_cn: 当提交更新的“.po”文件时，运行compile泳catalog以提交源目录和已编译的目录。

source: When a new locale is submitted, add a new directory with the ISO 639-1 language identifier and put ``sphinx.po`` in there. Don't forget to update the possible values for :confval:`language` in ``doc/usage/configuration.rst``.
zh_cn: 当提交一个新的语言环境时，添加一个带有ISO639-1语言标识符的新目录，并将``sphinx.po``在那里。别忘了更新“doc/usage”中的confval:`language`的可能值/配置.rst``.

source: The Sphinx core messages can also be translated on `Transifex <https://www.transifex.com/>`_. There exists a client tool named ``tx`` in the Python package "transifex_client", which can be used to pull translations in ``.po`` format from Transifex. To do this, go to ``sphinx/locale`` and then run ``tx pull -f -l LANG`` where LANG is an existing language identifier. It is good practice to run ``python setup.py update_catalog`` afterwards to make sure the ``.po`` file has the canonical Babel formatting.
ja: Sphinxのメインとなるメッセージは `Transifex <https://www.transifex.com/>`_ でも翻訳されています。Pythonパッケージの "transifex_client" の中に ``tx`` と呼ばれるクライアントツールがあり、 これを使うとTransifexから翻訳を ``.po`` フォーマットで取得できます。そのためには、 ``sphinx/locale`` に行き、 ``tx pull -f -l LANG`` を実行します。なお、LANGは既存の言語の識別子です。 ``.po`` ファイルが正しいBabel形式かどうかを確認するために ``python setup.py update_catalog`` を実行すると良いでしょう。
pt_br: As mensagens do núcleo Sphinx também podem ser traduzidas em `Transifex <https://www.transifex.com/>`_. Existe uma ferramenta cliente chamada ``tx`` nos pacotes Python "transifex_client", a qual pode ser usada para fazer pull das traduções para Transifex no formato ``.po``. Para isso, ir até ``sphinx/locale`` e executar `tx pull -f -l LANG`` onde LANG é o identificador do idioma. Boas práticas indicam executar ``python setup.py update_catalog`` para certificar-se que o arquivo ``.po`` tenha o formato adequado ao Babel.
zh_cn: sphinx的核心信息也可以在Transifex上翻译<https://www.transifex.com/>`_. Python包“transifex_client”中有一个名为“tx”的客户机工具，可用于从transifex中获取以'`.po``格式的翻译。为此，请转到“sphinx/locale”，然后运行“tx pull-f-l LANG”，其中LANG是现有的语言标识符。运行python是一个很好的实践设置.py之后更新\u catalog``以确保`.po``文件具有规范的Babel格式。

source: Fork `the repository`_ on GitHub to start making your changes to the ``master`` branch for next MAJOR version, or ``X.Y`` branch for next MINOR version (see `Branch Model`_).
pt_br: Fork `the repository`_ no GitHub para começar a fazer suas mudanças no branch ``master`` para a próxima versão MAJOR, ou ``X.Y`` para a próxima versão MINOR (veja `Branch Model`_).

source: For changes that preserves backwards-compatibility of API and features, they should be included in the next MINOR release, use the ``X.Y`` branch. ::
pt_br: Para alterações que preservam a compatibilidade retroativa da API e dos recursos, elas devem ser incluídas na próxima versão MINOR, use a ramificação ``X.Y``::

source: Submit a pull request from your branch to the respective branch (``master`` or ``X.Y``).
pt_br: Envie um *pull request* de seu branch para o respectivo branch (``master`` ou ``X.Y``).

source: Locale updates
ja: 言語の更新
pt_br: Atualizações Locale

source: The parts of messages in Sphinx that go into builds are translated into several locales. The translations are kept as gettext ``.po`` files translated from the master template ``sphinx/locale/sphinx.pot``.
ja: Sphinxが出力するメッセージの一部はいくつかの言語に翻訳されています。翻訳は gettext の ``.po`` ファイルに保存されており、マスターとなるテンプレートの ``sphinx/locale/sphinx.pot`` から翻訳されています。
pt_br: Partes das mensagens do Sphinx vão para diversos idiomas e locales. As traduções são mantidas como arquivos gettext ``.po`` traduziveis a partir do template principal ``sphinx/locale/sphinx.pot``.

source: Where ``X.Y`` is the ``MAJOR.MINOR`` release. Used to maintain current MINOR release. All changes are allowed if the change preserves backwards-compatibility of API and features.
pt_br: Onde ``X.Y`` é a versão ``MAJOR.MINOR``. Usado para manter a versão atual MINOR. Todas as alterações são permitidas se a alteração preservar a compatibilidade retroativa da API e dos recursos.

source: Where ``X.Y.Z`` is the ``MAJOR.MINOR.PATCH`` release. Only backwards-compatible bug fixes are allowed. In Sphinx project, PATCH version is used for urgent bug fix.
pt_br: Onde ``X.Y.Z`` é o release ``MAJOR.MINOR.PATCH``. Apenas correções de erros compatíveis com versões anteriores são permitidas. No projeto ``Sphinx``, a versão PATCH é usada para correção urgente de erros.

source: Sphinx 2.x will contain a backwards-compatible replica of the function which will raise a ``RemovedInSphinx40Warning``.
pt_br: O Sphinx 2.x conterá uma réplica da função compatível com versões anteriores que levantará um aviso ``RemovedInSphinx40Warning``.

source: Sphinx 3.x will still contain the backwards-compatible replica.
pt_br: O Sphinx 3.x ainda conterá a réplica compatível com versões anteriores.

source: The warnings are displayed by default. You can turn off display of these warnings with:
ja: デフォルトでは警告が表示されます。次のようにすることで、これらの警告表示を止めることができます：
pt_br: Os avisos são exibidos por padrão. Você pode desativar a exibição desses avisos com:

source: When a new locale is submitted, add a new directory with the ISO 639-1 language identifier and put ``sphinx.po`` in there. Don't forget to update the possible values for :confval:`language` in ``doc/config.rst``.
ja: 新しい言語が登録された場合、ISO 639-1の言語定義に従い新しいディレクトリを作成し、 ``sphinx.po`` をそこに置きます。 ``doc/config.rst`` の ``doc/config.rst`` にある「サポートしている言語リスト」を更新することを忘れないように。

source: When adding a new configuration variable, be sure to document it and update :file:`sphinx/quickstart.py` if it's important enough.
ja: 新しい設定変数を加える場合、ドキュメント化が必要な内容であれば、 :file:`sphinx/quickstart.py` を更新してください。

source: Use the included :program:`utils/check_sources.py` script to check for common formatting issues (trailing whitespace, lengthy lines, etc).
ja: 一般的なフォーマットの問題 (末尾の空白、長い行など) をチェックするため、同梱されている :program:`utils/check_sources.py` スクリプトを使用してください。

source: A feature release may deprecate certain features from previous releases. If a feature is deprecated in feature release 1.A, it will continue to work in all 1.A.x versions (for all versions of x) but raise warnings. Deprecated features will be removed in the first 1.B release, or 1.B.1 for features deprecated in the last 1.A.x feature release to ensure deprecations are done over at least 2 feature releases.
ja: リリースは以前のリリースの特定の機能を非推奨にするかもしれません。

source: So, for example, if we decided to start the deprecation of a function in Sphinx 1.4:
ja: 例えば、ある関数を非推奨にすることをSphinx1.4で決めたとしましょう：

source: Sphinx 1.4.x will contain a backwards-compatible replica of the function which will raise a ``RemovedInSphinx16Warning``.
ja: Sphinx 1.4.xには当該関数の後方互換性のあるレプリカが含まれていて、``RemovedInSphinx16Warning`を発生させます。

source: Sphinx 1.5 (the version that follows 1.4) will still contain the backwards-compatible replica.
ja: Sphinx 1.5 (1.4に続くバージョン) は後方互換があるレプリカを依然として保持してます。

source: Sphinx 1.6 will remove the feature outright.
ja: Sphinx 1.6で、その機能を完全に取り除きます。
