Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/devguide.po
Languages: ja, pt_br, zh_cn

source: Sphinx Developer's Guide
ja: Sphinx開発者のためのガイド
pt_br: Guia do desenvolvedor do Sphinx
zh_cn: sphinx开发者指南

source: Abstract
ja: 概要
pt_br: Sumário
zh_cn: 摘要

source: This document describes the development process of Sphinx, a documentation system used by developers to document systems used by other developers to develop other systems that may also be documented using Sphinx.
ja: このドキュメントは Sphinx の開発プロセスについて記述します。 Sphinx は、開発者によって使用されるドキュメンテーションシステムなので、その開発者が作るシステムを他の開発者に使ってもらうためのドキュメントに使用されます。そのようなシステムを利用する開発者もまた Sphinx を使用してドキュメントを書くかもしれません。
pt_br: Esse documento descreve o processo de desenvolvimento do Sphinx, o sistema de documentação usado pelos desenvolvedores para documentar sistemas usados por outros desenvolvedores do sistema que também podem ser usados para documentar Sphinx.
zh_cn: 本文档描述了Sphinx的开发过程，开发人员使用该文档系统来记录其他开发人员用来开发其他系统的系统，这些系统也可以使用Sphinx进行文档记录。

source: The Sphinx source code is managed using Git and is hosted on GitHub.
ja: SphinxのソースコードはGitで管理され、GitHubでホストされています。
pt_br: O código fonte do ``Sphinx`` é gerenciado usando o Git e está hospedado no GitHub.
zh_cn: Sphinx源代码使用Git进行管理，并托管在GitHub上。

source: Community
ja: コミュニティ
pt_br: Comunidade
zh_cn: 社区

source: sphinx-users <sphinx-users@googlegroups.com>
zh_cn: sphinx用户 <sphinx-users@googlegroups.com>

source: Mailing list for user support.
ja: ユーザーサポートのためのメーリングリスト
pt_br: Lista Distribuição para suporte usuário.
zh_cn: 用户支持邮件列表。

source: Mailing list for development related discussions.
ja: 開発関連の議論を行うためのメーリングリスト
pt_br: Lista Distribuição para discussões relacionadas a desenvolvimento.
zh_cn: 开发相关讨论的邮件列表。

source: IRC channel for development questions and user support.
ja: 開発の質問やユーザーサポートのためのIRCチャンネル
pt_br: Canal IRC para questões desenvolvimento e suporte usuário.
zh_cn: 开发问题和用户支持的IRC频道。

source: Bug Reports and Feature Requests
ja: バグ報告と機能のリクエスト
pt_br: Reportar Erros e Requisitar Funcionalidades
zh_cn: 错误报告和功能请求

source: If you have encountered a problem with Sphinx or have an idea for a new feature, please submit it to the `issue tracker`_ on GitHub or discuss it on the `sphinx-dev`_ mailing list.
pt_br: Se você encontrou um problema no ``Sphinx`` ou tem uma ideia para um novo recurso, envie-o para o `issue tracker`_ no GitHub ou discuta-o na lista de discussão `sphinx-dev`_.
zh_cn: 如果您在使用Sphinx时遇到问题或有新功能的想法，请将其提交到GitHub上的“issue tracker”或在“Sphinx dev”邮件列表中讨论。

source: For bug reports, please include the output produced during the build process and also the log file Sphinx creates after it encounters an unhandled exception. The location of this file should be shown towards the end of the error message.
pt_br: Para relatórios de bugs, inclua a saída produzida durante o processo de compilação e também o arquivo de log criado pelo ``Sphinx`` após encontrar uma exceção não tratada. A localização deste arquivo deve ser mostrada no final da mensagem de erro.
zh_cn: 对于bug报告，请包括生成过程中生成的输出，以及Sphinx遇到未处理异常后创建的日志文件。此文件的位置应显示在错误消息的末尾。

source: Including or providing a link to the source files involved may help us fix the issue. If possible, try to create a minimal project that produces the error and post that instead.
ja: 関係するソースファイルを含めるか、リンクを提供することで、私たちが問題を解決する助けになります。可能なら、エラーを生成する最小のプロジェクトを作成して、代わりにそれを送信するようにしてください。
pt_br: Incluindo or informando um link para os arquivos fonte envolvidos podem ajudar na correção da ocorrência. Se possível, tente criar e postar um projeto restrito para reproduzir e exibir o erro.
zh_cn: 包含或提供指向所涉及的源文件的链接可能有助于我们解决该问题。如果可能，尝试创建一个生成错误的最小项目，并将其发布。

source: Contributing to Sphinx
ja: Sphinx への貢献
pt_br: Contribuindo com Sphinx
zh_cn: 对sphinx的贡献

source: The recommended way for new contributors to submit code to Sphinx is to fork the repository on GitHub and then submit a pull request after committing the changes. The pull request will then need to be approved by one of the core developers before it is merged into the main repository.
ja: 新しいコントリビュータが Sphinx にコードを提出する際に推奨される方法は、GitHub上のリポジトリをフォークして、変更をコミットした後で pull request を送ることです。その後 pull request は、メインリポジトリにマージされる前に、コア開発者のうちの1人によって承認される必要があります。
pt_br: A forma recomendada para os novos contribuintes enviarem seus códigos para o Sphinx é através de fork do repositório no GitHub e, em seguida, envie uma solicitação de Pull Request depois de confirmar as alterações. O `pull request` deverá ser aprovado por um dos desenvolvedores principais antes de ser incorporado no repositório principal.
zh_cn: 新贡献者向Sphinx提交代码的推荐方法是在GitHub上分叉存储库，然后在提交更改后提交pull请求。然后，在将pull请求合并到主存储库之前，它需要得到一个核心开发人员的批准。

source: Check for open issues or open a fresh issue to start a discussion around a feature idea or a bug.
ja: 機能のアイデアやバグについての議論を行うために、進行中のissueチケットを探すか、または新しいチケットを作成してください。
pt_br: Verificar requerimentos em aberto e abrir um requerimento atual para iniciar uma discussão sobre a funcionalidade ou sobre o erro.
zh_cn: 检查是否有未解决的问题，或者打开一个新的问题，围绕某个特性想法或bug展开讨论。

source: If you feel uncomfortable or uncertain about an issue or your changes, feel free to email the *sphinx-dev* mailing list.
pt_br: Se você se sentir desconfortável ou incerto sobre um problema ou suas alterações, sinta-se à vontade para enviar e-mail para a lista de e-mail *sphinx-dev.
zh_cn: 如果您对某个问题或您的更改感到不安或不确定，请随时发送电子邮件至*sphinx dev*邮件列表。

source: Fork `the repository`_ on GitHub to start making your changes to the ``master`` branch for next MAJOR version, or ``A.x`` branch for next MINOR version (see `Branch Model`_).
zh_cn: 在GitHub上Fork`the repository``，开始对下一个主要版本的“master”分支或下一个次要版本的分支“A.x”分支进行更改（请参见“branch Model”`）。

source: Write a test which shows that the bug was fixed or that the feature works as expected.
ja: バグが修正されたことや、機能が想定どおりに動作することを確認するテストを記述します。
pt_br: Escreve um teste que exiba a solução do erro ou que demonstre o adequado funcionamento do recurso.
zh_cn: 编写一个测试，测试该错误是否已修复，或者该功能是否按预期工作。

source: Send a pull request and bug the maintainer until it gets merged and published. Make sure to add yourself to AUTHORS_ and the change to CHANGES_.
ja: プルリクエストを送信し、それがマージされてリリースされるまで、bug the maintainerします。AUTHORS_ に自分を追加したり、 CHANGES_ に変更を書いたりしてください。
pt_br: Envie uma requisição pull ao mantenedor até que seja incorporado e publicado. Certificar-se de adicionar seu nome em AUTHORS_ e modificar CHANGES_.
zh_cn: 发送一个pull请求并对维护者进行bug，直到它被合并和发布。确保将自己添加到“作者”和“更改”中。

source: Getting Started
ja: はじめに
pt_br: Iniciando
zh_cn: 快速上手

source: These are the basic steps needed to start developing on Sphinx.
ja: これらは Sphinx の開発を始めるために必要な基本的なステップです。
pt_br: Passos básicos necessários para iniciar no desenvolvimento do Sphinx.
zh_cn: 这些是在Sphinx上开始开发所需的基本步骤。

source: Create an account on GitHub.
ja: GitHub上にアカウントを作る。
pt_br: Crie uma conta no GitHub.
zh_cn: 在github上创建一个账户，

source: Fork the main Sphinx repository (`sphinx-doc/sphinx <https://github.com/sphinx-doc/sphinx>`_) using the GitHub interface.
ja: GitHubインタフェースを使用して、 Sphinx のメインリポジトリ (`sphinx-doc/sphinx <https://github.com/sphinx-doc/sphinx>`_) をフォークする。
pt_br: Fork o repositório principal do Sphinx (`sphinx-doc/sphinx <https://github.com/sphinx-doc/sphinx>`_) usando a interface do GitHub.
zh_cn: Sphinx存储库（`Sphinx doc/Sphinx<https://github.com/sphinx-doc/sphinx>`_)使用GitHub接口。

source: Clone the forked repository to your machine. ::
ja: フォークしたリポジトリをあなたのマシンにクローンする。 ::
pt_br: Clone o repositório derivado para seu computador. ::
zh_cn: 将叉状的存储库克隆到您的机器上。

source: Checkout the appropriate branch.
ja: 適切なブランチをチェックアウトする。
pt_br: Faça o apropriado Checkout no ambiente.
zh_cn: 检查合适的分支。

source: Sphinx adopts Semantic Versioning 2.0.0 (refs: https://semver.org/ ).
pt_br: O ``Sphinx`` adota o *Semantic Versioning 2.0.0* (refs: https://semver.org/).
zh_cn: Sphinx采用语义版本控制2.0.0（参考文献：https://semver.org/).

source: For changes that preserves backwards-compatibility of API and features, they should be included in the next MINOR release, use the ``A.x`` branch. ::
zh_cn: 对于保留API和特性向后兼容性的更改，它们应该包含在下一个次要版本中，请使用“A.x”分支。::

source: For incompatible or other substantial changes that should wait until the next MAJOR release, use the ``master`` branch.
pt_br: Para alterações substanciais incompatíveis ou outras que devem aguardar até a próxima liberação MAJOR, use o branch ``master``.
zh_cn: 对于应该等到下一个主要版本的不兼容或其他实质性更改，请使用“master”分支。

source: For urgent release, a new PATCH branch must be branched from the newest release tag (see `Branch Model`_ for detail).
pt_br: Para liberação urgente, um novo branch PATCH deve ser branched a partir da tag de release mais nova (veja `Branch Model`_ para detalhes).
zh_cn: 对于紧急发布，必须从最新的发布标记分支一个新的补丁分支（参见“branch Model”了解详细信息）。

source: Setup a virtual environment.
pt_br: Configurar um ambiente virtual.
zh_cn: 建立一个虚拟环境。

source: This is not necessary for unit testing, thanks to ``tox``, but it is necessary if you wish to run ``sphinx-build`` locally or run unit tests without the help of ``tox``. ::
pt_br: Isto não é necessário para testes unitários, graças ao ``tox``, mas é necessário se você deseja executar ``sphinx-build`` localmente ou executar testes unitários sem a ajuda do ``tox``::
zh_cn: 由于“tox”，对于单元测试不是必需的，但是如果您希望在本地运行“sphinx build”或在没有“tox”帮助的情况下运行单元测试，那么这是必要的。::

source: Create a new working branch. Choose any name you like. ::
ja: 新しい作業ブランチを作成します。ブランチ名は好きな名前を選んで構いません。::
pt_br: Criar um novo ramo de trabalho. Escolha qualquer nome que desejar. ::
zh_cn: 创建新的工作分支。选择你喜欢的名字。::

source: Hack, hack, hack.
ja: ハック・ハック・ハック
pt_br: Hack, trabalhe, trabalhe, escreva.
zh_cn: 黑客，黑客，黑客。

source: For tips on working with the code, see the `Coding Guide`_.
ja: コードで作業する際の tips については、 `コーディングガイド`_ を参照してください。
pt_br: Para dicas como codificar, ver `Coding Guide`_.
zh_cn: 有关使用代码的提示，请参阅“编码指南”。

source: Test, test, test.
ja: テスト・テスト・テスト
pt_br: Teste, teste, teste.
zh_cn: 测试，测试，测试。

source: Testing is best done through ``tox``, which provides a number of targets and allows testing against multiple different Python environments:
pt_br: O teste é feito melhor através do ``tox``, que fornece vários alvos e permite testar vários ambientes diferentes do Python:
zh_cn: 最好通过“tox”进行测试，它提供了许多目标，并允许针对多个不同的Python环境进行测试：

source: To list all possible targets::
pt_br: Para listar todos os alvos possíveis::
zh_cn: 列出所有可能的目标：

source: To run unit tests for a specific Python version, such as 3.6::
pt_br: Para executar testes de unidade para uma versão específica do Python, como 3.6::
zh_cn: 对于特定于Python:3的单元测试，例如Python:6

source: To run unit tests for a specific Python version and turn on deprecation warnings on so they're shown in the test output::
pt_br: Para executar testes de unidade para uma versão específica do Python e ativar os avisos de descontinuação para que eles sejam mostrados na saída de teste::
zh_cn: 要为特定的Python版本运行单元测试并启用弃用警告，以便它们显示在测试输出中，请执行以下操作：

source: To run code style and type checks::
pt_br: Para executar o estilo de código e tipo de verificações::
zh_cn: 要运行代码样式和类型检查：

source: Arguments to ``pytest`` can be passed via ``tox``, e.g. in order to run a particular test::
pt_br: Argumentos para ``pytest`` podem ser passados via ``tox``, por exemplo, a fim de executar um teste específico::
zh_cn: “pytest”的参数可以通过“tox”传递，例如为了运行特定的测试：

source: To build the documentation::
pt_br: Para construir a documentação::
zh_cn: 建立文档：

source: To build the documentation in multiple formats::
pt_br: Para construir a documentação em vários formatos::
zh_cn: 要以多种格式生成文档：

source: To run JavaScript tests with `Karma <https://karma-runner.github.io>`_, execute the following commands (requires `Node.js <https://nodejs.org>`_)::
pt_br: Para executar testes JavaScript com `Karma <https://karma-runner.github.io>`_, execute os seguintes comandos (requer `Node.js <https://nodejs.org>`_)::
zh_cn: 使用“Karma”运行JavaScript测试<https://karma-runner.github.io>`_，执行以下命令（需要`节点.js<https://nodejs.org>`_)::

source: You can also test by installing dependencies in your local environment. ::
pt_br: Você também pode testar instalando dependências em seu ambiente local::
zh_cn: 您还可以通过在本地环境中安装依赖项来进行测试。::

source: New unit tests should be included in the ``tests`` directory where necessary:
pt_br: Novos testes unitários devem ser incluídos no diretório ``tests`` onde necessário:
zh_cn: 必要时，新的单元测试应包含在“tests”目录中：

source: For bug fixes, first add a test that fails without your changes and passes after they are applied.
ja: バグフィックスについては、まず最初に問題を再現する、つまり失敗するテストを追加してください。その後テストが通るようにバグを修正します。
pt_br: Para corrigir bugs, primeiro adicionar um teste que falha seu suas modificações e passe após suas modificações.
zh_cn: 对于bug修复，首先添加一个测试，该测试在没有更改的情况下失败，并在应用更改后通过。

source: Tests that need a ``sphinx-build`` run should be integrated in one of the existing test modules if possible. New tests that to ``@with_app`` and then ``build_all`` for a few assertions are not good since *the test suite should not take more than a minute to run*.
pt_br: Os testes que precisam de uma execução ``sphinx-build`` devem ser integrados em um dos módulos de teste existentes, se possível. Novos testes que para ``@with_app`` e depois ``build_all`` para algumas asserções não são bons desde *o conjunto de testes não deve demorar mais de um minuto para ser executado*.
zh_cn: 如果可能，需要“sphinx build”运行的测试应该集成到一个现有的测试模块中。对于一些断言，新的测试先是“使用”app“@”，然后是“build\u all”，这是不好的，因为*测试套件的运行时间不应超过一分钟*。

source: Please add a bullet point to :file:`CHANGES` if the fix or feature is not trivial (small doc updates, typo fixes). Then commit::
ja: もし、修正が限定的なもの(ドキュメントの微細な修正、スペルミス)ではない場合は、:file:`CHANGES`に「黒丸 bullet point」を追加してからcommit::してください。
pt_br: Por favor adicione lista pontos ao arquivo :file:`CHANGES` se correção ou funcionalidade não é trivial (pequenas atualiz. docs, correção ortográfica). Então faça commit::
zh_cn: 如果修复或功能不是很简单（小文档更新、打字错误修复），请将要点添加到：file:`CHANGES`中。然后提交：

source: GitHub recognizes certain phrases that can be used to automatically update the issue tracker.
ja: Githubは特定のフレーズを認識して、自動的に課題トラッカーを更新できます。
pt_br: O GitHub reconhece certas frases que podem ser usadas para atualizar automaticamente o rastreador de problemas.
zh_cn: GitHub可以识别某些可用于自动更新问题跟踪程序的短语。

source: For example::
ja: 例えば::
pt_br: Por exemplo::
zh_cn: 例如：

source: would close issue #42.
ja: これはチケット #42 をクローズします。
pt_br: pode fechar requerimento #42.
zh_cn: 将结束第42期。

source: Push changes in the branch to your forked repository on GitHub. ::
ja: 変更をGithubにあるフォークしたあなたのリポジトリのブランチに push する。 ::
pt_br: Empurre as alterações no branch para o seu repositório forkado no GitHub::
zh_cn: 将分支中的更改推送到GitHub上的分支存储库。::

source: Submit a pull request from your branch to the respective branch (``master`` or ``A.x``).
zh_cn: 从您的分支向相应的分支（“master”或“a.x”）提交请求。

source: Wait for a core developer to review your changes.
ja: コア開発者が変更をレビューするのを待つ。
pt_br: Aguarde até que um desenvolvedor do núcleo revise suas modificações.
zh_cn: 等待核心开发人员检查您的更改。

source: Translations
zh_cn: 翻译

source: The Sphinx core messages and documentations are translated on `Transifex <https://www.transifex.com/>`_. Please join `Sphinx project on Transifex <https://www.transifex.com/sphinx-doc/>`_ and translate them.
zh_cn: sphinx的核心信息和文档在Transifex上翻译<https://www.transifex.com/>`_. 请加入Transifex上的sphinx项目<https://www.transifex.com/sphinx-doc/>`_然后翻译。

source: Core Developers
ja: コア開発者
pt_br: Desenvolvedores Núcleo
zh_cn: 核心开发人员

source: The core developers of Sphinx have write access to the main repository. They can commit changes, accept/reject pull requests, and manage items on the issue tracker.
ja: Sphinx のコア開発者は、メインリポジトリへの書き込みアクセスを持っています。コア開発者は、変更をコミットすることができ、 pull request を受理/却下することができ、課題トラッカー上のアイテムを管理することができます。
pt_br: Os desenvolvedores do núcleo Sphinx possuem direito de gravação no repositório central. Podem fazer commit das modificações, aceitar / rejeitar requisições pull bem como gerenciar itens no tracker.
zh_cn: Sphinx的核心开发人员拥有对主存储库的写访问权限。他们可以提交更改、接受/拒绝请求请求以及管理问题跟踪程序上的项目。

source: You do not need to be a core developer or have write access to be involved in the development of Sphinx. You can submit patches or create pull requests from forked repositories and have a core developer add the changes for you.
ja: Sphinx の開発に参加するために、コア開発者である必要はなく、書き込みアクセスを持つ必要もありません。あなたはパッチを提出したり、フォークしたリポジトリから pull request を作成したりすることができます。そして、コア開発者があなたの代わりに変更を追加します。
pt_br: Não é preciso ser um desenvolvedor do núcleo ou possuir acesso a gravação para fazer algum desenvolvimento no Sphinx. As modificações podem ser submetidas através de requisições pull a partir de repositórios derivados e então um desenvolvedor do núcleo fará suas modificações.
zh_cn: 您不需要成为核心开发人员或具有写权限才能参与Sphinx的开发。您可以从叉状的存储库提交修补程序或创建拉取请求，并让核心开发人员为您添加更改。

source: The following are some general guidelines for core developers:
ja: 以下はコア開発者のためのいくつかの一般的なガイドラインです:
pt_br: As seguintes diretrizes são orientações para desenvolvedores do núcleo:
zh_cn: 以下是针对核心开发人员的一些通用指南：

source: Questionable or extensive changes should be submitted as a pull request instead of being committed directly to the main repository. The pull request should be reviewed by another core developer before it is merged.
ja: 不確かな変更や広範囲に及ぶ変更は、メインリポジトリに直接コミットする代わりに pull request を提出すべきです。その pull request は、マージされる前に他のコア開発者によってレビューされるべきです。
pt_br: Extensivas ou modificações questionáveis devem ser submetidas como requisições pull ao invés de commit direto no repositório principal. A requisição pull deve ser revista por outro desenvolvedor do núcleo antes de ser incorporada.
zh_cn: 有问题的或广泛的更改应该作为请求提交，而不是直接提交到主存储库。在合并请求之前，拉请求应该由另一个核心开发人员审查。

source: Trivial changes can be committed directly but be sure to keep the repository in a good working state and that all tests pass before pushing your changes.
ja: 自明な変更は直接コミットできますが、リポジトリを良好に動作する状態に保ち、変更を push する前にすべてのテストが通ることを確かめるようにしてください。
pt_br: Modificações triviais podem ser incorporadas diretamente mas certificar-se que o repositório esteja em situação funcional e que todos os testes passaram antes de finalizar modificações.
zh_cn: 微小的更改可以直接提交，但请确保存储库处于良好的工作状态，并且在推动更改之前，所有测试都通过了。

source: When committing code written by someone else, please attribute the original author in the commit message and any relevant :file:`CHANGES` entry.
ja: 誰か他の人によって書かれたコードをコミットする場合、コミットメッセージといずれかの適切な :file:`CHANGES` エントリーの中でオリジナルの作者に言及してください。
pt_br: Quando fizer commit do código escrito por alguém, favor identificar o autor na mensagem de commit e atualizações em :file:`CHANGES`.
zh_cn: 提交其他人编写的代码时，请在提交消息和任何相关的：file:`CHANGES`条目中指定原始作者。

source: Coding Guide
ja: コーディングガイド
pt_br: Guia de Codificação
zh_cn: 编码指南

source: Try to use the same code style as used in the rest of the project. See the `Pocoo Styleguide`__ for more information.
ja: プロジェクトの他の部分で使用されているのと同じコードスタイルをなるべく使用してください。詳細は、 `Pocoo Styleguide`__ を参照してください。
pt_br: Tentar usar o mesmo estilo de código das outras partes do projeto. Ver `Pocoo Styleguide`__ para maiores informações.
zh_cn: 尝试使用与项目其余部分相同的代码样式。有关详细信息，请参阅“Pocoo Styleguide”。

source: For non-trivial changes, please update the :file:`CHANGES` file. If your changes alter existing behavior, please document this.
ja: 自明でない変更については、 :file:`CHANGES` ファイルを更新してください。あなたの変更が既存の振る舞いを変更する場合は、このことをドキュメント化してください。
pt_br: Para modificações não triviais, favor atualizar arquivo :file:`CHANGES`. Caso suas atualizações modifiquem comportamentos, favor documentar isso.
zh_cn: 对于不重要的更改，请更新：file:`changes`文件。如果您的更改改变了现有的行为，请记录这一点。

source: New features should be documented. Include examples and use cases where appropriate. If possible, include a sample that is displayed in the generated output.
ja: 新機能はドキュメント化されなければなりません。適切な場合は例とユースケースを含めてください。可能なら、生成される出力に表示されるサンプルを含めてください。
pt_br: Novas funcionalidades devem ser documentadas. Incluir exemplos e usos onde apropriado. Se possível, incluir um exemplo do que é exibido na geração de saída.
zh_cn: 新特性应记录在案。包括适当的例子和用例。如果可能，包括在生成的输出中显示的示例。

source: When adding a new configuration variable, be sure to document it and update :file:`sphinx/cmd/quickstart.py` if it's important enough.
pt_br: Ao adicionar uma nova variável de configuração, certifique-se de documentá-la e atualizar :file:`sphinx/cmd/quickstart.py` se ela for importante o suficiente.
zh_cn: 添加新的配置变量时，请确保对其进行记录并更新：file:`sphinx/cmd/快速入门.py`，如果它足够重要的话。

source: Add appropriate unit tests.
ja: 適切なユニットテストを追加してください。
pt_br: Adicionar unidades de teste apropriadas.
zh_cn: 添加合适的单元测试。

source: Debugging Tips
ja: デバッグ tips
pt_br: Dicas para Depuração
zh_cn: 调试小贴士

source: Delete the build cache before building documents if you make changes in the code by running the command ``make clean`` or using the :option:`sphinx-build -E` option.
ja: コードに変更を加えた場合は、コマンド ``make clean`` の実行または :option:`sphinx-build -E` オプションの使用によりドキュメントをビルドする前にビルドキャッシュを削除してください。
pt_br: Apague o cache de construção antes de construir documentos, caso tenha feito modificações no código, usar o comando ``make clean`` ou usar a opção :option:`sphinx-build -E`.
zh_cn: 如果通过运行命令“make clean”或使用：option:`sphinx build-E`选项对代码进行更改，请在生成文档之前删除生成缓存。

source: Use the :option:`sphinx-build -P` option to run ``pdb`` on exceptions.
pt_br: Use a opção :option:`sphinx-build -P` para executar ``pd`` em exceções.
zh_cn: 使用：选项：`sphinx build-P`选项对异常运行“pdb”。

source: Use ``node.pformat()`` and ``node.asdom().toxml()`` to generate a printable representation of the document structure.
ja: ドキュメント構造の表示可能な表現を生成するには ``node.pformat()`` と ``node.asdom().toxml()`` を使用してください。
pt_br: Usar ``node.pformat()`` e ``node.asdom().toxml()`` para gerar representação impressa da estrutura do documento.
zh_cn: 使用``节点.pformat（）``和``节点.asdom（）.toxml（）``生成文档结构的可打印表示。

source: Set the configuration variable :confval:`keep_warnings` to ``True`` so warnings will be displayed in the generated output.
ja: 生成される出力に警告が表示されるよう、設定変数 :confval:`keep_warnings` に ``True`` を設定してください。
pt_br: Definir a variável de configuração :confval:`keep_warnings` para ``True`` assim os avisos serão exibidos na saída gerada.
zh_cn: 将配置变量confval:keep\u warnings设置为True，这样生成的输出中将显示警告。

source: Set the configuration variable :confval:`nitpicky` to ``True`` so that Sphinx will complain about references without a known target.
ja: 既知のターゲットのない参照について Sphinx が警告するように、設定変数 :confval:`nitpicky` に ``True`` を設定してください。
pt_br: Configurar a variável :confval:`nitpicky` para ``True`` assim Sphinx irá respeitar referências sem alvos conhecidos.
zh_cn: 将配置变量confval:nitpicky设置为True，这样Sphinx就会抱怨没有已知目标的引用。

source: Set the debugging options in the `Docutils configuration file <http://docutils.sourceforge.net/docs/user/config.html>`_.
ja: `Docutils 設定ファイル <http://docutils.sourceforge.net/docs/user/config.html>`_ 中でデバッグオプションを設定してください。
pt_br: Configuração de opções de depuração do arquivo `Docutils configuration file <http://docutils.sourceforge.net/docs/user/config.html>`_.
zh_cn: 在`Docutils配置文件中设置调试选项<http://docutils.sourceforge.net/docs/user/config.html>`_.
