Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/faq.po
Languages: pt_br, zh_cn

source: Sphinx FAQ
pt_br: FAQ do Sphinx
zh_cn: Sphinx常见问题解答

source: This is a list of Frequently Asked Questions about Sphinx. Feel free to suggest new entries!
pt_br: Essa é a lista de Perguntas Frequentes sobre Sphinx. Sinta-se livre para sugerir novas entradas!
zh_cn: 这是关于Sphinx的常见问题列表。欢迎提出新的建议！

source: How do I...
pt_br: Como eu faço...
zh_cn: 我该如何...

source: ... create PDF files without LaTeX?
pt_br: ... para criar arquivos PDF sem LaTeX?
zh_cn: 不用LaTeX创建pdf文件？

source: `rinohtype`_ provides a PDF builder that can be used as a drop-in replacement for the LaTeX builder.
pt_br: `rinohtype`_ fornece um construtor de PDF que pode ser usado como um substituto drop-in para o construtor de LaTeX.
zh_cn: `rinohtype`а提供了一个PDF构建器，可以作为LaTeX构建器的直接替代品。

source: ... get section numbers?
pt_br: ... obter seções numeradas?
zh_cn: 获取到节的数目？

source: They are automatic in LaTeX output; for HTML, give a ``:numbered:`` option to the :rst:dir:`toctree` directive where you want to start numbering.
pt_br: Elas são automáticas na saída LaTeX; para HTML, use a opção ``:numbered:`` para a diretiva :rst:dir:`toctree` onde é desejado o início da numeração.
zh_cn: 它们在LaTeX输出中是自动的；对于HTML，为：rst:方向：`toctree`指令，从中开始编号。

source: ... customize the look of the built HTML files?
pt_br: ... configurar a aparência dos arquivos HTML?
zh_cn: ... 自定义生成的HTML文件的外观？

source: Use themes, see :doc:`/usage/theming`.
pt_br: Use temas, veja :doc:`/usage/theming`.
zh_cn: 使用主题，请参阅：doc:`/usage/theming`。

source: ... add global substitutions or includes?
pt_br: ... adicionar inclusões ou substituições globais?
zh_cn: ... 添加全局替换或包含？

source: Add them in the :confval:`rst_prolog` or :confval:`rst_epilog` config value.
pt_br: Adicione-as no valor de configuração :confval:`rst_prolog` ou :confval:`rst_epilog`.
zh_cn: 将它们添加到：confval:`rst_prolog`或：confval:`rst_epilog`配置值中。

source: ... display the whole TOC tree in the sidebar?
pt_br: ... exibir toda uma árvore de TOC na barra lateral?
zh_cn: ... 在侧边栏中显示整个目录树？

source: Use the :data:`toctree` callable in a custom layout template, probably in the ``sidebartoc`` block.
pt_br: Use o chamável :data:`toctree` em um modelo de layout personalizado, provavelmente no bloco ``sidebartoc``.
zh_cn: 在自定义布局模板中使用可调用的：data:`toctree'，可能在`sidebartoc``块中。

source: ... write my own extension?
pt_br: ... escrever minha própria extensão?
zh_cn: ... 编写我自己的插件?

source: See the :doc:`/development/tutorials/index`.
pt_br: Veja :doc:`/development/tutorials/index`.
zh_cn: 请参阅：doc:`/development/tutorials/index`。

source: ... convert from my existing docs using MoinMoin markup?
pt_br: ... converter de meus documentos existentes usando a marcação MoinMoin?
zh_cn: ... 使用MoinMoin标记从现有文档转换？

source: The easiest way is to convert to xhtml, then convert `xhtml to reST`_. You'll still need to mark up classes and such, but the headings and code examples come through cleanly.
pt_br: A maneira mais fácil é converter para xhtml e, em seguida, converter `xhtml para reST`_. Você ainda precisará marcar classes e coisas assim, mas os títulos e exemplos de código vêm de forma limpa.
zh_cn: 最简单的方法是转换为xhtml，然后将“xhtml转换为reST”。您仍然需要标记类之类的，但是标题和代码示例清晰明了。

source: For many more extensions and other contributed stuff, see the sphinx-contrib_ repository.
pt_br: Para muitas outras extensões e outras contribuições, consulte o repositório sphinx-contrib_.
zh_cn: 有关更多插件和其他贡献的内容，请参阅sphinx-contrib_u存储库。

source: Using Sphinx with...
pt_br: Usar Sphinx com...
zh_cn: 用...使用sphinx

source: Read the Docs
zh_cn: 阅读文档

source: `Read the Docs <https://readthedocs.org>`_ is a documentation hosting service based around Sphinx. They will host sphinx documentation, along with supporting a number of other features including version support, PDF generation, and more. The `Getting Started`_ guide is a good place to start.
pt_br: `Read the Docs <https://readthedocs.org>`_ é um serviço de hospedagem de documentação baseado no Sphinx. Eles hospedarão a documentação do sphinx, junto com o suporte de uma série de outros recursos, incluindo suporte de versão, geração de PDF e muito mais. O guia `Primeiros passos`_ é um bom lugar para começar.
zh_cn: `阅读文档<https://readthedocs.org>`_是一个基于Sphinx的文档托管服务。他们将托管sphinx文档，同时支持许多其他功能，包括版本支持、PDF生成等。《入门指南》是一个很好的起点。

source: Epydoc
zh_cn: Epy文档

source: There's a third-party extension providing an `api role`_ which refers to Epydoc's API docs for a given identifier.
pt_br: Existe uma extensão de terceiros que fornece um `papel de api`_ que faz referência aos documentos da API do Epydoc para um determinado identificador.
zh_cn: 有一个第三方插件提供了一个“api role”，它引用给定标识符的Epydoc的api文档。

source: Doxygen
zh_cn: 编程辅助工具

source: Michael Jones is developing a reST/Sphinx bridge to doxygen called `breathe <https://github.com/michaeljones/breathe/tree/master>`_.
pt_br: Michael Jones está desenvolvendo uma ponte reST/Sphinx para doxygen chamada `breathe <https://github.com/michaeljones/breathe/tree/master>`_.
zh_cn: 迈克尔琼斯正在开发一个reST/Sphinx桥到编程辅助工具，名为“breathe”<https://github.com/michaeljones/breathe/tree/master>`_.

source: Glenn Hutchings has written a SCons build script to build Sphinx documentation; it is hosted here: https://bitbucket.org/zondo/sphinx-scons
zh_cn: Glenn Hutchings编写了一个SCons构建脚本来构建Sphinx文档；它的宿主是：https://bitbucket.org/zondo/sphinx-scons

source: Jannis Leidel wrote a `setuptools command <https://pypi.org/project/Sphinx-PyPI-upload/>`_ that automatically uploads Sphinx documentation to the PyPI package documentation area at https://pythonhosted.org/.
pt_br: Jannis Leidel escreveu um `comando setuptools <https://pypi.org/project/Sphinx-PyPI-upload/>`_ que carrega automaticamente a documentação Sphinx para a área de documentação do pacote PyPI em https://pythonhosted.org/.
zh_cn: Jannis Leidel编写了一个`setuptools命令<https://pypi.org/project/Sphinx-pypi-upload/>`_它会自动将Sphinx文档上载到位于的PyPI包文档区域https://pythonhosted.org/。

source: GitHub Pages
zh_cn: GitHub页面

source: Please add :py:mod:`sphinx.ext.githubpages` to your project. It allows you to publish your document in GitHub Pages. It generates helper files for GitHub Pages on building HTML document automatically.
pt_br: Adicione :py:mod:`sphinx.ext.githubpages` ao seu projeto. Ele permite que você publique seu documento nas páginas do GitHub. Ele gera arquivos auxiliares para GitHub Pages na construção de documentos HTML automaticamente.
zh_cn: 请添加：py:mod:`HubGitSphinx`你的项目。它允许您在GitHub页面中发布文档。它在自动生成HTML文档时为GitHub页面生成帮助文件。

source: MediaWiki
zh_cn: 维基百科

source: See https://bitbucket.org/kevindunn/sphinx-wiki/wiki/Home, a project by Kevin Dunn.
zh_cn: 看到了吗https://bitbucket.org/kevindunn/sphinx-wiki/wiki/Home这是凯文·邓恩的一个项目。

source: Google Analytics
zh_cn: 谷歌分析

source: You can use a custom ``layout.html`` template, like this:
pt_br: Você pode usar um modelo ``layout.html`` personalizado, como este:
zh_cn: 你可以使用自定义``layout.html``模板，如下所示：

source: Google Search
pt_br: Pesquisa Google
zh_cn: 谷歌搜索

source: To replace Sphinx's built-in search function with Google Search, proceed as follows:
pt_br: Para substituir a função de pesquisa integrada do Sphinx pela Pesquisa Google, proceda da seguinte forma:
zh_cn: 要将Sphinx的内置搜索功能替换为Google search，请执行以下操作：

source: Go to https://cse.google.com/cse/all to create the Google Search code snippet.
pt_br: Acesse https://cse.google.com/cse/all para criar o trecho de código de Pesquisa Google.
zh_cn: 去https://cse.google.com/cse/all创建Google搜索代码片段。

source: Copy the code snippet and paste it into ``_templates/searchbox.html`` in your Sphinx project:
pt_br: Copie o trecho de código e cole-o em ``_templates/searchbox.html`` em seu projeto Sphinx:
zh_cn: 复制代码段并将其粘贴到模板中/searchbox.html``在你的Sphinx项目中：

source: Add ``searchbox.html`` to the :confval:`html_sidebars` configuration value.
pt_br: Adicione ``searchbox.html`` ao valor de configuração :confval:`html_sidebars`.
zh_cn: 添加``searchbox.html``到：confval:`html_sidebars`配置值。

source: Sphinx vs. Docutils
zh_cn: Sphinx 和 Docutils

source: tl;dr: *docutils* converts reStructuredText to multiple output formats. Sphinx builds upon docutils to allow construction of cross-referenced and indexed bodies of documentation.
pt_br: De forma resumida, *docutils* converte reStructuredText em vários formatos de saída. O Sphinx se baseia no docutils para permitir a construção de corpos de documentação com referência cruzada e indexados.
zh_cn: tl；dr:*docutils*将structedText转换为多种输出格式。Sphinx构建在docutils之上，允许构建交叉引用和索引的文档体。

source: `docutils`__ is a text processing system for converting plain text documentation into other, richer formats. As noted in the `docutils documentation`__, docutils uses *readers* to read a document, *parsers* for parsing plain text formats into an internal tree representation made up of different types of *nodes*, and *writers* to output this tree in various document formats. docutils provides parsers for one plain text format - `reStructuredText`__ - though other, *out-of-tree* parsers have been implemented including Sphinx's :doc:`Markdown parser </usage/markdown>`. On the other hand, it provides writers for many different formats including HTML, LaTeX, man pages, Open Document Format and XML.
pt_br: `docutils`__ é um sistema de processamento de texto para converter documentação de texto simples em outros formatos mais ricos. Conforme observado na `documentação do docutils`__, docutils usa *leitores* para ler um documento, *analisadores* para analisar formatos de texto simples em uma representação de árvore interna composta de diferentes tipos de *nós* e *escritores* para gerar este árvore em vários formatos de documento. docutils fornece analisadores para um formato de texto simples -- `reStructuredText`__ -- embora outros analisadores *fora da árvore* tenham sido implementados incluindo o :doc:`analisador Markdown </usage/markdown>` do Sphinx. Por outro lado, ele fornece escritores para muitos formatos diferentes, incluindo HTML, LaTeX, páginas man, Open Document Format e XML.
zh_cn: `docutils是一个文本处理系统，用于将纯文本文档转换为其他更丰富的格式。如“docutils documentation”中所述，docutils使用*readers*读取文档，*parsers*用于将纯文本格式解析为由不同类型的*节点*组成的内部树表示，而*writers*则使用*writers*以各种文档格式输出该树。docutils为一种纯文本格式提供了解析器-“reStructuredText”\uuu尽管其他格式，*out-of-tree*解析器已经实现，包括Sphinx的：doc:`Markdown parser 1 `。另一方面，它为许多不同的格式提供了编写器，包括HTML、LaTeX、手册页、开放文档格式和XML。

source: docutils exposes all of its functionality through a variety of `front-end tools`__, such as ``rst2html``, ``rst2odt`` and ``rst2xml``. Crucially though, all of these tools, and docutils itself, are concerned with individual documents. They don't support concepts such as cross-referencing, indexing of documents, or the construction of a document hierarchy (typically manifesting in a table of contents).
pt_br: docutils expõe todas as suas funcionalidades através de uma variedade de `ferramentas front-end`__, como ``rst2html``, ``rst2odt`` e ``rst2xml``. Porém, crucialmente, todas essas ferramentas, e os próprios docutils, estão relacionados a documentos individuais. Eles não oferecem suporte a conceitos como referência cruzada, indexação de documentos ou a construção de uma hierarquia de documentos (normalmente manifestando-se em um índice analítico).
zh_cn: docutils通过各种“前端工具”公开其所有功能，例如“rst2html”、“rst2odt”和“rst2xml”。但最关键的是，所有这些工具和docutil本身都与单个文档有关。文档的层次结构通常不支持文档的交叉引用。

source: Sphinx builds upon docutils by harnessing docutils' readers and parsers and providing its own :doc:`/usage/builders/index`. As a result, Sphinx wraps some of the *writers* provided by docutils. This allows Sphinx to provide many features that would simply not be possible with docutils, such as those outlined above.
pt_br: O Sphinx se baseia em docutils, aproveitando os leitores e analisadores de docutils e fornecendo seus próprios :doc:`/usage/builders/index`. Como resultado, o Sphinx envolve alguns dos *escritores* fornecidos pelos docutils. Isso permite que o Sphinx forneça muitos recursos que simplesmente não seriam possíveis com docutils, como os descritos acima.
zh_cn: Sphinx通过利用docutils的读取器和解析器并提供自己的：doc:`/usage/builders/index`，在docutils的基础上构建。因此，Sphinx包装了docutils提供的一些*writers*。这使得Sphinx能够提供许多docutils无法提供的特性，比如上面概述的那些特性。

source: Epub info
pt_br: Informações de epub
zh_cn: Epub信息

source: The following list gives some hints for the creation of epub files:
pt_br: A lista a seguir fornece algumas dicas para a criação de arquivos epub:
zh_cn: 下表给出了创建epub文件的一些提示：

source: Split the text into several files. The longer the individual HTML files are, the longer it takes the ebook reader to render them. In extreme cases, the rendering can take up to one minute.
pt_br: Divida o texto em vários arquivos. Quanto mais longos são os arquivos HTML individuais, mais tempo leva para o leitor de e-books processá-los. Em casos extremos, a renderização pode levar até um minuto.
zh_cn: 把文本分成几个文件。单个HTML文件越长，电子书阅读器呈现它们的时间就越长。在极端情况下，渲染可能需要一分钟。

source: Try to minimize the markup. This also pays in rendering time.
pt_br: Tente minimizar a marcação. Isso também compensa no tempo de renderização.
zh_cn: 尽量减少标记。这也会增加渲染时间。

source: For some readers you can use embedded or external fonts using the CSS ``@font-face`` directive. This is *extremely* useful for code listings which are often cut at the right margin. The default Courier font (or variant) is quite wide and you can only display up to 60 characters on a line. If you replace it with a narrower font, you can get more characters on a line. You may even use `FontForge <https://fontforge.github.io/>`_ and create narrow variants of some free font. In my case I get up to 70 characters on a line.
pt_br: Para alguns leitores, você pode usar fontes incorporadas ou externas usando a diretiva CSS ``@font-face``. Isso é *extremamente* útil para listagens de código que geralmente são cortadas na margem direita. A fonte Courier padrão (ou variante) é bastante ampla e você só pode exibir até 60 caracteres em uma linha. Se você substituí-la por uma fonte mais estreita, pode obter mais caracteres em uma linha. Você pode até usar `FontForge <https://fontforge.github.io/>`_ e criar variantes estreitas de alguma fonte livre. No meu caso, recebo até 70 caracteres em uma linha.
zh_cn: 对于某些读者，可以使用CSS`@font face``指令使用嵌入式或外部字体。这对于经常在右边空白处剪切的代码列表非常有用。默认的Courier字体（或变体）非常宽，一行最多只能显示60个字符。如果用更窄的字体替换它，可以在一行中获得更多字符。你甚至可以用FontForge<https://fontforge.github.io/>`_并创建一些自由字体的窄变体。在我的例子中，一行最多有70个字符。

source: You may have to experiment a little until you get reasonable results.
pt_br: Você pode ter que experimentar um pouco até obter resultados razoáveis.
zh_cn: 在得到合理的结果之前，你可能要做一些实验。

source: Test the created epubs. You can use several alternatives. The ones I am aware of are Epubcheck_, Calibre_, FBreader_ (although it does not render the CSS), and Bookworm_. For Bookworm, you can download the source from https://code.google.com/archive/p/threepress and run your own local server.
pt_br: Teste os epubs criados. Você pode usar várias alternativas. Os que conheço são Epubcheck_, Calibre_, FBreader_ (embora não renderize o CSS) e Bookworm_. Para Bookworm, você pode baixar o código-fonte em https://code.google.com/archive/p/threepress e executar seu próprio servidor local.
zh_cn: 测试创建的ePub。你可以使用几种选择。我知道的是Epubcheck、Calibre、fbreder（尽管它不呈现CSS）和bookmoom。对于Bookworm，您可以从https://code.google.com/archive/p/threepress运行自己的本地服务器。

source: Large floating divs are not displayed properly. If they cover more than one page, the div is only shown on the first page. In that case you can copy the :file:`epub.css` from the ``sphinx/themes/epub/static/`` directory to your local ``_static/`` directory and remove the float settings.
pt_br: Divs flutuantes grandes não são exibidos corretamente. Se eles cobrirem mais de uma página, o div será mostrado apenas na primeira página. Nesse caso, você pode copiar o :file:`epub.css` do diretório ``sphinx/themes/epub/static/`` para seu diretório local ``_static/`` e remover as configurações de float.
zh_cn: 大的浮动div未正确显示。如果它们覆盖多个页面，则div只显示在第一页上。在这种情况下，您可以复制：文件：`电子邮箱.css`从“sphinx/themes/epub/static/``目录到本地的`u static/``目录，并删除float设置。

source: Files that are inserted outside of the ``toctree`` directive must be manually included. This sometimes applies to appendixes, e.g. the glossary or the indices. You can add them with the :confval:`epub_post_files` option.
pt_br: Os arquivos inseridos fora da diretiva ``toctree`` devem ser incluídos manualmente. Isso às vezes se aplica a apêndices, por exemplo o glossário ou os índices. Você pode adicioná-los com a opção :confval:`epub_post_files`.
zh_cn: 必须手动包含在“toctree”指令之外插入的文件。这有时适用于附录，例如术语表或索引。您可以使用：confval:`epub_post_files`选项添加它们。

source: The handling of the epub cover page differs from the reStructuredText procedure which automatically resolves image paths and puts the images into the ``_images`` directory. For the epub cover page put the image in the :confval:`html_static_path` directory and reference it with its full path in the :confval:`epub_cover` config option.
pt_br: O tratamento da página de rosto do epub difere do procedimento do reStructuredText que resolve automaticamente os caminhos das imagens e as coloca no diretório ``_images``. Para a página de rosto do epub, coloque a imagem no diretório :confval:`html_static_path` e faça referência a ela com seu caminho completo na opção de configuração :confval:`epub_cover`.
zh_cn: epub封面页的处理不同于recostructedText过程，后者自动解析图像路径并将图像放入“u images”目录。对于epub封面页，请将图像放在：confval:`html_static_path`目录中，并在：confval:`epub_cover` config选项中引用它的完整路径。

source: kindlegen_ command can convert from epub3 resulting file to ``.mobi`` file for Kindle. You can get ``yourdoc.mobi`` under ``_build/epub`` after the following command:
pt_br: O comando kindlegen_ pode converter do arquivo resultante epub3 para o arquivo ``.mobi`` para Kindle. Você pode obter ``yourdoc.mobi`` em ``_build/epub`` após o seguinte comando:
zh_cn: kindlegen_u命令可以将epub3生成的文件转换为Kindle的`.mobi``文件。你可以得到``你的医生.mobi``在以下命令后的“\u build/epub”下：

source: The kindlegen command doesn't accept documents that have section titles surrounding ``toctree`` directive:
pt_br: O comando kindlegen não aceita documentos que tenham títulos de seção em torno da diretiva ``toctree``:
zh_cn: kindlegen命令不接受包含“toctree”指令的节标题的文档：

source: kindlegen assumes all documents order in line, but the resulting document has complicated order for kindlegen::
pt_br: kindlegen assume que todos os documentos estejam em ordem, mas o documento resultante tem uma ordem complicada para o kindlegen::
zh_cn: kindlegen假设所有文档的顺序都是一行，但是生成的文档对kindlegen来说顺序很复杂：

source: If you get the following error, fix your document structure:
pt_br: Se você receber o seguinte erro, corrija a estrutura do seu documento:
zh_cn: 如果你遇到了这些错误，请修复你的文件结构：

source: Texinfo info
pt_br: Informações de Texinfo
zh_cn: Texinfo信息

source: There are two main programs for reading Info files, ``info`` and GNU Emacs. The ``info`` program has less features but is available in most Unix environments and can be quickly accessed from the terminal. Emacs provides better font and color display and supports extensive customization (of course).
pt_br: Existem dois programas principais para ler arquivos Info, ``info`` e GNU Emacs. O programa ``info`` tem menos recursos, mas está disponível na maioria dos ambientes Unix e pode ser acessado rapidamente do terminal. O Emacs oferece melhor fonte e exibição de cores e suporta ampla personalização (é claro).
zh_cn: 有两个主要的程序用于读取Info文件，``Info``和gnuemacs。“info”程序的功能较少，但在大多数Unix环境中都可用，并且可以从终端快速访问。Emacs提供了更好的字体和颜色显示，并支持广泛的定制（当然）。

source: Displaying Links
pt_br: Exibindo links
zh_cn: 展示链接

source: One noticeable problem you may encounter with the generated Info files is how references are displayed. If you read the source of an Info file, a reference to this section would look like::
pt_br: Um problema perceptível que você pode encontrar com os arquivos Info gerados é como as referências são exibidas. Se você ler a fonte de um arquivo Info, uma referência a esta seção seria semelhante a::
zh_cn: 在使用生成的信息文件时，您可能会遇到一个值得注意的问题，即引用的显示方式。如果您读取信息文件的源代码，对该节的引用将如下所示：

source: In the stand-alone reader, ``info``, references are displayed just as they appear in the source. Emacs, on the other-hand, will by default replace ``*note:`` with ``see`` and hide the ``target-id``. For example:
pt_br: No leitor autônomo, ``info``, as referências são exibidas exatamente como aparecem na fonte. Emacs, por outro lado, irá por padrão substituir ``*note:`` por ``see`` e ocultar o ``target-id``. Por exemplo:
zh_cn: 在独立阅读器“info”中，引用的显示方式与源代码中的显示方式相同。另一方面，Emacs在默认情况下会将“`*注意：`”替换为“see`”，并隐藏“target id`”。例如：

source: The exact behavior of how Emacs displays references is dependent on the variable ``Info-hide-note-references``. If set to the value of ``hide``, Emacs will hide both the ``*note:`` part and the ``target-id``. This is generally the best way to view Sphinx-based documents since they often make frequent use of links and do not take this limitation into account. However, changing this variable affects how all Info documents are displayed and most do take this behavior into account.
pt_br: O comportamento exato de como o Emacs exibe as referências depende da variável ``Info-hide-note-extensions``. Se definido com o valor de ``hide``, o Emacs irá ocultar a parte ``*note:`` e o ``target-id``. Em geral, essa é a melhor maneira de visualizar documentos baseados no Sphinx, pois eles costumam fazer uso frequente de links e não levam essa limitação em consideração. No entanto, a alteração dessa variável afeta a forma como todos os documentos Info são exibidos e a maioria leva esse comportamento em consideração.
zh_cn: Emacs显示引用的确切行为取决于变量“Info hide note references”。如果设置为“hide”的值，Emacs将同时隐藏“note:`”部分和“target id`”。这通常是查看基于Sphinx的文档的最佳方法，因为它们经常使用链接，并且没有考虑到这个限制。但是，更改此变量会影响所有信息文档的显示方式，而且大多数文档都会将此行为考虑在内。

source: If you want Emacs to display Info files produced by Sphinx using the value ``hide`` for ``Info-hide-note-references`` and the default value for all other Info files, try adding the following Emacs Lisp code to your start-up file, ``~/.emacs.d/init.el``.
pt_br: Se você deseja que o Emacs exiba os arquivos Info produzidos pelo Sphinx usando o valor ``hide`` para ``Info-hide-note-extensions`` e o valor padrão para todos os outros arquivos Info, tente adicionar o seguinte código Emacs Lisp ao seu arquivo de inicialização, ``~/.emacs.d/init.el``.
zh_cn: 如果希望Emacs显示Sphinx生成的信息文件，并使用“Info hide note references”的“hide”值和所有其他信息文件的默认值，请尝试将以下Emacs Lisp代码添加到启动文件“~/.Emacs.d”中/初始标高``.

source: Notes
pt_br: Notas
zh_cn: 提示

source: The following notes may be helpful if you want to create Texinfo files:
pt_br: As notas a seguir podem ser úteis se você deseja criar arquivos Texinfo:
zh_cn: 如果要创建Texinfo文件，以下注释可能会有所帮助：

source: Each section corresponds to a different ``node`` in the Info file.
pt_br: Cada seção corresponde a um ``node`` diferente no arquivo Info.
zh_cn: 每个部分对应于Info文件中的不同“node”。

source: Colons (``:``) cannot be properly escaped in menu entries and xrefs. They will be replaced with semicolons (``;``).
pt_br: Dois pontos (``:``) não podem ser escapados apropriadamente em entradas de menu e refexs. Eles serão substituídos por ponto-e-vírgulas (``;``).
zh_cn: 冒号（：）不能正确转义到”外部冒号“中。它们将被替换为分号（`；``）。

source: Links to external Info files can be created using the somewhat official URI scheme ``info``. For example::
pt_br: Links para arquivos Info externos podem ser criados usando o esquema URI oficial do ``info``. Por exemplo::
zh_cn: 可以使用某种正式的URI方案“Info”创建指向外部信息文件的链接。例如：：

source: One can disable generation of the inline references in a document with :confval:`texinfo_cross_references`. That makes an info file more readable with stand-alone reader (``info``).
pt_br: Pode-se desabilitar a geração das referências em linha em um documento com :confval:`texinfo_cross_references`. Isso torna um arquivo de informação mais legível com o leitor autônomo (``info``).
