Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/glossary.po
Languages: ca_es, ja, pt_br

source: Glossary
ca_es: Glossari
ja: 用語集
pt_br: Glossário

source: builder
ca_es: constructor (builder)
ja: ビルダー
pt_br: construtor

source: A class (inheriting from :class:`~sphinx.builders.Builder`) that takes parsed documents and performs an action on them. Normally, builders translate the documents to an output format, but it is also possible to use builders that e.g. check for broken links in the documentation, or build coverage information.
pt_br: Classe (herdada de :class:`~sphinx.builders.Builder`) que controla ou executa certas ações nesses quais documentos. Normalmente, construtores traduzem documentos para um formato de saída, mas também é possível usar construtores que, por exemplo, verificam links inconsistentes na documentação ou constróem informações de cobertura.

source: See :doc:`/usage/builders/index` for an overview over Sphinx's built-in builders.
pt_br: Veja :doc:`/usage/builders/index` para uma visão geral dos construtores integrados do Sphinx.

source: configuration directory
ca_es: directori de configuració
ja: 設定ディレクトリ
pt_br: diretório de configuração

source: The directory containing :file:`conf.py`. By default, this is the same as the :term:`source directory`, but can be set differently with the **-c** command-line option.
ca_es: El directori que conté :file:`conf.py`. Per defecte, és el mateix que :term:`source directory`, pot ser, però, assignat a un altre amb l'opció de línia de comandes **-c**
ja: :file:`conf.py` を含むディレクトリです。デフォルトでは、 :term:`ソースディレクトリ` と同じですが、**-c** コマンドラインで別のディレクトリも設定できます。
pt_br: O diretório contendo o :file:`conf.py`. Por padrão, esse é o mesmo nomeado no :term:`source directory`, mas pode ser modificado usando a opção da linha de comando **-c**.

source: directive
ca_es: directiva
ja: ディレクティブ
pt_br: diretiva

source: A reStructuredText markup element that allows marking a block of content with special meaning. Directives are supplied not only by docutils, but Sphinx and custom extensions can add their own. The basic directive syntax looks like this:
ca_es: Una marca de reStructuredText que permet marcar un bloc de contingut amb un significat especial. Les directives són proporcionades tan per docutils, com per Sphinx i altres extensions. La sintaxi bàsica d'una directivapresenta el següent aspecte:
ja: reSturcturedTextのマークアップの要素で、特別な意味を持つコンテンツのブロックを表現できます。ディレクティブはDocutils由来のものだけでなく、Sphinx、カスタムの拡張機能によって定義されたものも使用できます。基本的なディレクティブの文法は次のようになります:
pt_br: Um elemento marcado de reStructuredText que permite marcar um bloco de conteúdo com significado especial. Diretivas são fornecidas não só pelo docutils, mas por extensões configuráveis do Sphinx podem ter suas próprias funcionalidades. A diretiva básica tem a sintaxe como essa:

source: See :ref:`rst-directives` for more information.
pt_br: Consulte :ref:`rst-directives` para mais informações.

source: document name
ca_es: nom del document
ja: ドキュメント名
pt_br: nome do documento

source: Since reST source files can have different extensions (some people like ``.txt``, some like ``.rst`` -- the extension can be configured with :confval:`source_suffix`) and different OSes have different path separators, Sphinx abstracts them: :dfn:`document names` are always relative to the :term:`source directory`, the extension is stripped, and path separators are converted to slashes. All values, parameters and such referring to "documents" expect such document names.
ca_es: Els fitxers font reST poden presentar diferents extensions, com ara ``.txt`` o ``.rst`` (l'extensió pot ser configurada per :confval:`source_suffix`). A més, els diferents sistemes operatius presenten separadors de camins diferents. Per tot plegat, Sphinx realitza la següent abstracció: els :dfn:`noms de document` són sempre relatius al :term:`directori font`. L'extensió és eliminada, i els separadors de camí es converteixen en barres ``/``. Tots els valors, paràmetres i similars que fan referència a "documents", esperen aquest tipus de noms de document.
ja: reSTのソースファイルにはいくつかの拡張子を付けることができます。 ``.txt`` と付けるのが好きな人もいますし、 ``.rst`` を好む人もいます。Sphinxの中では :confval:`source_suffix` で拡張子を設定できます。また、OSによっては、パスの区切り文字が変わります。そのため、Sphinxではこれを抽象化して、 :dfn:`ドキュメント名` として、 :term:`ソースディレクトリ` からの相対パスで、拡張子は省略し、区切り文字にスラッシュを利用するように変換されます。ドキュメントが来ることを期待する値、パラメータなどは、すべてこのようなドキュメント名が渡されるのを期待します。
pt_br: Arquivos fontes reST podem possuir diferentes extensões (alguns usam ``.txt``, outros ``.rst`` -- a extensão pode ser configurada com :confval:`source_suffix`) e diferentes S.O. usam separador de diretório distinto. Sphinx abstrai esses separadores :dfn:`document names` os quais são sempre relativos ao :term:`source directory`, a extensão é subtraída e os separadores são convertidos para barras. Todos valores, parâmetros e referências a "documents" devem ser nomes de documentos.

source: Examples for document names are ``index``, ``library/zipfile``, or ``reference/datamodel/types``. Note that there is no leading or trailing slash.
ca_es: Com a exemples de noms de documents, considera: ``index``, ``library/zipfile``, o ``reference/datamodel/types``. Fixat que no contenen barra ni al començament ni al final.
ja: ドキュメント名のサンプルとしては、 ``index``, ``library/zipfile``, ``reference/datamodel/types`` などがあります。前後のスラッシュは完全に省略されることに注意して下さい。
pt_br: Exemplos para nomes de documento são `index``, ``library/zipfile``, ou ``reference/datamodel/types``. Note que não há barra inicial nem final.

source: domain
ca_es: domini
ja: ドメイン
pt_br: domínio

source: A domain is a collection of markup (reStructuredText :term:`directive`\ s and :term:`role`\ s) to describe and link to :term:`object`\ s belonging together, e.g. elements of a programming language. Directive and role names in a domain have names like ``domain:name``, e.g. ``py:function``.
ca_es: Un domini és una col·lecció de marques (de tipus :term:`directiva` i :term:`rol`) que descriuen i enllacen a :term:`objecte`\ s que van junts, com ara elements d'un llenguatge de programació. Els noms de les directives i els rols presenten la forma ``domain:name``. Per exemple, ``py:function``.
ja: ドメインは、特定のプログラミング言語の要素などの :term:`オブジェクト` の説明をしたり、リンクを張ったりするような、マークアップ(reSturucturedTextの :term:`ディレクティブ`, :term:`ロール`)を集めたものです。ドメインに属するディレクティブとロールの名前は、 ``py:function`` のように ``ドメイン:名前`` となります。
pt_br: Um domínio é uma coleção de marcações (reStructuredText :term:`directive`\ e :term:`role`\) para descrever e ligar o :term:`object`\ ao qual pertencem conjuntamente, ex: elementos de uma linguagem de programação. Nomes de diretiva e regra em um nome de domínio parecem com ``domain:name`` ex: ``py:function``.

source: Having domains means that there are no naming problems when one set of documentation wants to refer to e.g. C++ and Python classes. It also means that extensions that support the documentation of whole new languages are much easier to write.
ja: ドメインがあるということは、C++とPythonの両方のクラスに言及したいようなドキュメントを書く場合でも、名前が衝突する問題がない、ということです。まったく新しい言語のドキュメントをサポートするのも簡単になります。
pt_br: Ter domínios significa que não há problemas de nomenclatura quando um conjunto de documentação deseja fazer referência a Classes C++ e Python. Isso também significa que as extensões que suportam a documentação de novos idiomas são muito mais fáceis de serem escritas.

source: For more information, refer to :doc:`/usage/domains/index`.
pt_br: Para mais informações, consulte :doc:`/usage/domains/index`.

source: environment
ca_es: entorns
ja: 環境
pt_br: ambiente

source: A structure where information about all documents under the root is saved, and used for cross-referencing. The environment is pickled after the parsing stage, so that successive runs only need to read and parse new and changed documents.
ca_es: L'estructura en la que es guarda tota la informació sobre els documents continguts a l'arrel. Es fa servir per a permetre referències creuades. L'entorn es guardat amb "pickle" un cop realitzada la fase de parseig, de manera que execucions posteriors únicament han de llegir i fer el parseig dels documents nous i dels modificats.
ja: ルート以下のすべてのドキュメントの情報が格納される場所です。この情報はクロスリファレンスを作成する際に利用されます。この環境には、パース段階の後の結果のpickleされたものが入ります。ソースファイルが新規で作成されたり、変更されて、読み込んだりパースする必要がない限りはこの中のデータが更新されることはありません。
pt_br: A estrutura onde a informação sobre todos os documentos será salva e usada para referência cruzada. O ambiente é obtido após o estágio de passagem, por isso sucessivas execuções são necessárias somente para ler e passar documentos modificados.

source: extension
pt_br: extensão

source: A custom :term:`role`, :term:`directive` or other aspect of Sphinx that allows users to modify any aspect of the build process within Sphinx.
pt_br: Um personalizado :term:`role`, :term:`directive` ou outro aspecto do Sphinx que permite aos usuários modificar qualquer aspecto do processo de criação no Sphinx.

source: For more information, refer to :doc:`/usage/extensions/index`.
pt_br: Para mais informações, consulte :doc:`/usage/extensions/index`.

source: master document
ca_es: document mestre
ja: マスタードキュメント
pt_br: documento mestre

source: The document that contains the root :rst:dir:`toctree` directive.
ca_es: El document que conté la directiva arrel :rst:dir:`toctree`.
ja: ルートとなる :rst:dir:`toctree` ディレクティブを含むドキュメントです。
pt_br: O documento que contém a diretiva raiz :rst:dir:`toctree` .

source: root document
pt_br: documento raiz

source: Same as :term:`master document`.
pt_br: Mesmo que :term:`documento mestre`.

source: object
ca_es: objecte
ja: オブジェクト
pt_br: objeto

source: The basic building block of Sphinx documentation. Every "object directive" (e.g. :rst:dir:`py:function` or :rst:dir:`object`) creates such a block; and most objects can be cross-referenced to.
pt_br: O bloco básico de construção de documentação Sphinx. Toda "diretiva de objeto" (ex: :rst:dir:`py:function` ou :rst:dir:`object`) cria esse tipo de bloco e muitos objetos podem fazer essa referência cruzada.

source: The feature which is warned will be removed in Sphinx-XXX version. It usually caused from Sphinx extensions which is using deprecated. See also :ref:`when-deprecation-warnings-are-displayed`.
ja: SphinxのXXXバージョンでこの機能が削除される警告です。通常、Sphinx拡張で利用しているAPIが非推奨となった場合等に発生します。参考: :ref:`when-deprecation-warnings-are-displayed`.
pt_br: A funcionalidade para a qual é exibido o aviso Sphinx-XXX versão. Normalmente tem como causa extensões que são tornadas obsoletas para uso. Ver também :ref:`when-deprecation-warnings-are-displayed`.

source: role
ca_es: rol
ja: ロール
pt_br: papel

source: A reStructuredText markup element that allows marking a piece of text. Like directives, roles are extensible. The basic syntax looks like this: ``:rolename:`content```. See :ref:`rst-inline-markup` for details.
pt_br: Um elemento de marcação ``reStructuredText`` que permite marcar um pedaço de texto. Como diretivas, os papéis são extensíveis. A sintaxe básica é assim: ``:rolename:`content```. Veja :ref:`rst-inline-markup` para detalhes.

source: source directory
ca_es: directori font
ja: ソースディレクトリ
pt_br: diretório fonte

source: The directory which, including its subdirectories, contains all source files for one Sphinx project.
ca_es: El directori,amb els corresponents subdirectoris, que conté tots els fitxers fonts d'un projecte Sphinx.
ja: ひとつのSphinxプロジェクトにおいて、すべてのソースファイルを含むディレクトリ。このディレクトリ直下だけではなく、サブディレクトリを使用してソースファイルを分類して入れておくことも可能です。
pt_br: O diretório no qual, incluindo seus subdiretórios, contem todos os arquivos fontes de um projeto Sphinx.

source: An easy-to-read, what-you-see-is-what-you-get plaintext markup syntax and parser system.
pt_br: Uma sintaxe de marcação de texto plano e sistema de análise de marcação de texto simples e fácil de ler, que você vê, é o que você obtém.

source: A class (inheriting from :class:`~sphinx.builders.Builder`) that takes parsed documents and performs an action on them. Normally, builders translate the documents to an output format, but it is also possible to use the builder builders that e.g. check for broken links in the documentation, or build coverage information.
ja: :class:`~sphinx.builders.Builder` を継承したクラスで、パースされたドキュメントを受け取り、それに対してアクションをします。通常、ビルダーは他の出力フォーマットへ、ドキュメントを変換しますが、壊れたリンクのチェックを行ったり、情報のカバレッジを計測したり、といった用途にも使用できます。

source: The basic building block of Sphinx documentation. Every "object directive" (e.g. :rst:dir:`function` or :rst:dir:`object`) creates such a block; and most objects can be cross-referenced to.
ca_es: L'element bàsic de construcció de documentació en Sphinx. Cada "directiva d'objecte" (com ara :rst:dir:`function` o :rst:dir:`object`) crea un d'aquest objectes. A més, la majoria dels objectes també poden ser referenciats.
ja: Sphinxドキュメントを構築する、基本構成単位です。すべての "オブジェクトディレクティブ"(:rst:dir:`function`, :rst:dir:`object`)はこのユニットを作成します。ほとんどのオブジェクトに対して、クロスリファレンスを行えます。
