Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/index.po
Languages: pt_br

source: The Basics
pt_br: O básico

source: User Guides
pt_br: Guias de usuário

source: Community
pt_br: Comunidade

source: Reference
pt_br: Referência

source: Create intelligent and beautiful documentation with ease
pt_br: Crie documentação inteligente e bonita com facilidade

source: 📝 Rich Text Formatting
pt_br: 📝 Formatação rica de texto

source: Author in :ref:`reStructuredText <rst-primer>` or :ref:`MyST Markdown <markdown>` to create highly structured technical documents, including tables, highlighted code blocks, mathematical notations, and more.
pt_br: Crie em :ref:`reStructuredText <rst-primer>` ou :ref:`MyST Markdown <markdown>` para criar documentos técnicos altamente estruturados, incluindo tabelas, blocos de código realçados, notações matemáticas e muito mais.

source: 🔗 Powerful Cross-Referencing
pt_br: 🔗 Referência cruzada poderosa

source: Create :ref:`cross-references <xref-syntax>` within your project, and even across :ref:`different projects <ext-intersphinx>`. Include references to sections, figures, tables, citations, glossaries, code objects, and more.
pt_br: Crie :ref:`referências cruzadas <xref-syntax>` dentro do seu projeto e até mesmo entre :ref:`diferentes projetos <ext-intersphinx>`. Inclua referências a seções, figuras, tabelas, citações, glossários, objetos código e muito mais.

source: 📚 Versatile Documentation Formats
pt_br: 📚 Formatos versáteis de documentação

source: Generate documentation in the preferred formats of your audience, including HTML, LaTeX (for PDF), ePub, Texinfo, :ref:`and more <builders>`.
pt_br: Gere documentação nos formatos preferidos do seu público, incluindo HTML, LaTeX (para PDF), ePub, Texinfo, :ref:`e mais <builders>`.

source: 🎨 Extensive Theme Support
pt_br: 🎨 Suporte extensível a temas

source: Create visually appealing documentation, with a wide choice of :ref:`built-in <builtin-themes>` and :ref:`third-party <third-party-themes>` HTML themes and the ability to customize or :ref:`create new themes <extension-html-theme>`.
pt_br: Crie documentação visualmente atraente, com uma ampla escolha de temas HTML :ref:`embutidos <builtin-themes>` e de :ref:`terceiros <third-party-themes>` e a capacidade de personalizar ou :ref:`criar novos temas <extension-html-theme>`.

source: 🔌 Fully Extensible
pt_br: 🔌 Totalmente extensível

source: Add custom functionality, via robust :ref:`extension mechanisms <extending-sphinx>` with numerous :ref:`built-in <builtin-extensions>` and :ref:`third-party <third-party-extensions>` extensions available for tasks like creating diagrams, testing code, and more.
pt_br: Adicione funcionalidade personalizada, por meio de :ref:`mecanismos de extensão <extending-sphinx>` robustos com inúmeras extensões :ref:`embutidas <builtin-extensions>` e de :ref:`terceiros <third-party-extensions>` disponíveis para tarefas como criação de diagramas, teste de código e muito mais.

source: 🛠️ Automatic API Documentation
pt_br: 🛠️ Documentação automática de API

source: Generate API documentation for Python, C++ and other :ref:`software domains <usage-domains>`, manually or :ref:`automatically from docstrings <ext-autodoc>`, ensuring your code documentation stays up-to-date with minimal effort.
pt_br: Gere documentação de API para Python, C++ e outros :ref:`domínios de software <usage-domains>`, manualmente ou :ref:`automaticamente a partir de docstrings <ext-autodoc>`, garantindo que a documentação do seu código permaneça atualizada com o mínimo de esforço.

source: 🌍 Internationalization (i18n)
pt_br: 🌍 Internacionalização (i18n)

source: Add documentation :ref:`translations <intl>` multiple languages to reach a global audience.
pt_br: Adicione :ref:`traduções <intl>` de documentação em vários idiomas para atingir um público global.

source: 🌟 Active Community and Support
pt_br: 🌟 Suporte e comunidade ativa

source: Benefit from an :ref:`active community <support-index>`, with numerous resources, tutorials, forums, and examples.
pt_br: Beneficie-se de uma :ref:`comunidade ativa <support-index>`, com numerosos recursos, tutoriais, fóruns e exemplos.

source: As used by:
pt_br: Usado por:

source: Python Logo
pt_br: Logo do Python

source: Linux Logo
pt_br: Logo do Linux

source: Jupyter Logo
pt_br: Logo do Jupyter

source: Project Jupyter
pt_br: Projeto Jupyter

source: See below for how to navigate Sphinx's documentation.
pt_br: Veja abaixo como navegar na documentação do Sphinx.

source: The `Sphinx documentation Table of Contents <contents.html>`_ has a full list of this site's pages.
pt_br: A `tabela de conteúdo da documentação do Sphinx <contents.html>`_ tem uma lista completa das páginas deste site.

source: Get started
pt_br: Primeiros passos

source: These sections cover the basics of getting started with Sphinx, including creating and building your own documentation from scratch.
pt_br: Essas seções cobrem os conceitos básicos de introdução ao Sphinx, incluindo a criação e construção de sua própria documentação a partir do zero.

source: These sections cover various topics in using and extending Sphinx for various use-cases. They are a comprehensive guide to using Sphinx in many contexts and assume more knowledge of Sphinx. If you are new to Sphinx, we recommend starting with :ref:`get-started`.
pt_br: Estas seções cobrem vários tópicos no uso e extensão do Sphinx para vários casos de uso. Eles são um guia abrangente para usar o Sphinx em muitos contextos e pressupõem mais conhecimento do Sphinx. Se você é novo no Sphinx, recomendamos começar com :ref:`get-started`.

source: Community guide
pt_br: Guia comunitário

source: Sphinx is community supported and welcomes contributions from anybody. The sections below should help you get started joining the Sphinx community as well as contributing.
pt_br: Sphinx é apoiado pela comunidade e aceita contribuições de qualquer pessoa. As seções abaixo devem ajudar você a começar a se juntar à comunidade Sphinx, além de contribuir.

source: See the :doc:`Sphinx contributors' guide <internals/contributing>` if you would like to contribute to the project.
pt_br: Veja o :doc:`Guia dos contribuidores do Sphinx <internals/contributing>` se você quiser contribuir para o projeto.

source: Reference guide
pt_br: Guia de referência

source: Reference documentation is more complete and programmatic in nature, it is a collection of information that can be quickly referenced. If you would like usecase-driven documentation, see :ref:`get-started` or :ref:`user-guides`.
pt_br: A documentação de referência é mais completa e programática por natureza, é uma coleção de informações que podem ser rapidamente referenciadas. Se você quiser documentação orientada a casos de uso, veja :ref:`get-started` ou :ref:`user-guides`.
