Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/install.po
Languages: ja, pl_pl, pt_br, ru, zh_cn

source: Installing Sphinx
ja: Sphinxのインストール
pl_pl: Instalacja Sphinksa
pt_br: Instalando Sphinx
ru: Установка Sphinx
zh_cn: 安装Sphinx

source: Since Sphinx is written in the Python language, you need to install Python (the required version is at least 2.7) and Sphinx.
ja: SphinxはPythonを用いて書かれているため、Python (必要とされるバージョンは最低で2.7) とSphinxをインストールする必要があります。
pl_pl: Jako że Sphinx jest napisany w języku Python, musisz zainstalować Pythona (wymagana wersja to co najmniej 2.7) oraz Sphinksa.
ru: Поскольку Sphinx написан на языке Python - вам необходимо установить Python (требуемая версия не менее 2.7) и Sphinx.
zh_cn: 由于Sphinx是用Python语言编写的，所以Python(所需的版本至少是2.7)和Sphinx都需要安装。

source: Sphinx packages are available on the `Python Package Index <https://pypi.python.org/pypi/Sphinx>`_.
ja: Sphinx関係のパッケージは `Python Package Index <https://pypi.python.org/pypi/Sphinx>`_ より入手可能です。
pl_pl: Pakiety Sphinksa są dostępne w `Python Package Index <https://pypi.python.org/pypi/Sphinx>`_.
pt_br: Pacotes Sphinx estão disponíveis em `Python Package Index <https://pypi.python.org/pypi/Sphinx>`_.
ru: Пакеты Sphinx доступны в `Индексаторе пакетов Python <https://pypi.python.org/pypi/Sphinx>`_.
zh_cn: 您可以在`Python 包索引<https://pypi.python.org/pypi/Sphinx>`_中找到Sphinx包。

source: You can also download a snapshot from the Git repository:
ja: Gitリポジトリからスナップショットをダウンロードすることもできます。
pl_pl: Możesz też pobrać snapshot z repozytorium Gita:
pt_br: Também pode ser feito download do snapshot do repositório Git:
ru: Вы также можете скачать снапшот из репозитория Git:
zh_cn: 您还可以从Git存储库下载快照：

source: as a `.tar.gz <https://github.com/sphinx-doc/sphinx/archive/master.tar.gz>`__ file or
ja: `.tar.gz <https://github.com/sphinx-doc/sphinx/archive/master.tar.gz>`__ ファイルか
pl_pl: jako plik `.tar.gz <https://github.com/sphinx-doc/sphinx/archive/master.tar.gz>`__ lub
pt_br: como um arquivo `.tar.gz <https://github.com/sphinx-doc/sphinx/archive/master.tar.gz>`__ ou
ru: как файл `.tar.gz <https://github.com/sphinx-doc/sphinx/archive/master.tar.gz>`__ или
zh_cn: 如`.tar.gz <https://github.com/sphinx-doc/sphinx/archive/master.tar.gz>`__ 文件，或者

source: as a `.zip <https://github.com/sphinx-doc/sphinx/archive/master.zip>`_ file
ja: `.zip <https://github.com/sphinx-doc/sphinx/archive/master.zip>`_ ファイル
pl_pl: jako plik `.zip <https://github.com/sphinx-doc/sphinx/archive/master.zip>`_
pt_br: como arquivo `.zip <https://github.com/sphinx-doc/sphinx/archive/master.zip>`_
ru: как файл `.zip <https://github.com/sphinx-doc/sphinx/archive/master.zip>`_
zh_cn: 如 `.zip <https://github.com/sphinx-doc/sphinx/archive/master.zip>`_文件

source: There are introductions for several environments:
ja: いくつかの環境について導入方法を紹介します:
pl_pl: Mamy wprowadzenia dla kilku środowisk:
pt_br: Existem introduções para diversos ambientes:
ru: Существуют введения для нескольких сред:
zh_cn: 关于几个环境的介绍：

source: Debian/Ubuntu: Install Sphinx using packaging system
ja: Debian/Ubuntu: パッケージシステムを利用してPythonをインストールします。
pl_pl: Debian/Ubuntu: Instalacja Sphinksa przy użyciu systemu pakietów
pt_br: Debian/Ubuntu: Instalar Sphinx usando o sistema de pacotes
ru: Debian/Ubuntu: установка Sphinx с помощью системы пакетов
zh_cn: Debian/Ubuntu：使用打包系统安装Sphinx

source: You may install using this command if you use Debian/Ubuntu.
ja: Ubuntu LinuxなどのDebian系のOSの場合は、以下のコマンドを使ってインストールできます。
pl_pl: Jeśli używasz Debiana lub Ubuntu, możesz użyć tej komendy do instalacji.
pt_br: Pode usar esse comando se for utilizado Debian/Ubuntu
ru: Вы можете установить его с помощью этой команды, если используете Debian/Ubuntu.
zh_cn: 如果您使用的是Debian/Ubuntu，您可以使用这个命令进行安装。

source: Other Linux distributions
ja: 他のLinuxディストリビューション
pl_pl: Inne dystrybucje Linuksa
pt_br: Outras distribuições Linux
ru: Другие дистрибутивы Linux
zh_cn: 其他Linux发行版

source: Most Linux distributions have Sphinx in their package repositories. Usually the package is called "python-sphinx", "python-Sphinx" or "sphinx". Be aware that there are two other packages with "sphinx" in their name: a speech recognition toolkit (CMU Sphinx) and a full-text search database (Sphinx search).
ja: ほとんどのLinuxディストリビューションは、OSのパッケージ管理リポジトリにSphinxが用意されています。一般的なパッケージ名は "python-sphinx", "python-Sphinx", "sphinx" です。"sphinx"という名前をもつ別の用途のパッケージが他に2つあることに注意してください: 音声認識ツールキット(CMU Sphinx), フルテキスト検索データベース(Sphinx search)。
pl_pl: Większość dystrybucji Linuksa ma Sphinksa w swoich repozytoriach pakietów. Zazwyczaj nazwa pakietu to „python-sphinx”, „python-Sphinx” lub „sphinx”. Uwaga na dwa inne pakiety zawierające „sphinx” w swojej nazwie: zestaw narzędzi do rozpoznawania mowy (CMU Sphinx) i bazę danych z wyszukiwaniem pełnotekstowym (Sphinx search).
pt_br: Muitas distribuições linux possuem o Sphinx em seus repositorios de pacotes. Normalmente o pacote é chamado "python-sphinx", "python-Sphinx" ou "sphinx". Preste atenção pois existem outros dois pacotes com "sphinx" dentro de seus nomes: um sistema de reconhecimento de voz (CMU Sphinx) e um banco de dados pesquisa texto-integral.
ru: Большинство дистрибутивов Linux имеют Sphinx в своих репозиториях пакетов. Обычно пакет называется "python-sphinx", "python-Sphinx" или "sphinx". Имейте в виду, что есть еще два пакета с "sphinx" в их названии: набор инструментов распознавания речи (CMU Sphinx) и база данных полнотекстового поиска (Sphinx search).
zh_cn: 大多数Linux发行版的包存储库中都有Sphinx。通常这个包被称为“python-sphinx”、“python-sphinx”或“sphinx”。请注意，还有两个包的名称中带有“sphinx”：一个是语音识别工具包（CMU sphinx），另一个是全文搜索数据库（sphinx搜索）。

source: Mac OS X: Install Sphinx using MacPorts
ja: Mac OS X: MacPortsを利用してインストールします。
pl_pl: Mac OS X: Instalacja Sphinksa przy użyciu MacPorts
pt_br: Mac OS X: Instalar Sphinx usando MacPorts
ru: Mac OS X: Установка Sphinx с использованием MacPorts
zh_cn: Mac OS X：使用MacPorts安装Sphinx

source: If you use Mac OS X `MacPorts <http://www.macports.org/>`_, use this command to install all necessary software.
ja: Mac OS Xの `MacPorts <http://www.macports.org/>`_ を利用しているのであれば、下記のコマンド一発で、必要なものがすべてインストールされます。
pl_pl: Jeśli używasz programu `MacPorts <http://www.macports.org/>`_ w systemie Mac OS X, użyj tej komendy do zainstalowania potrzebnego oprogramowania.
pt_br: Se usar Mac OS X, use o seguinte comando para instalar todo software necessário. `MacPorts <http://www.macports.org/>`_,
ru: Если вы используете Mac OS X `MacPorts <http://www.macports.org/>`_, используйте эту команду для установки всего необходимого программного обеспечения.
zh_cn: 如果您使用Mac OS X `MacPorts <http://www.macports.org/>`_，请使用此命令安装所有必要的软件。

source: To set up the executable paths, use the ``port select`` command:
ja: 実行パスを設定するために ``port select`` コマンドを使って下さい:
pl_pl: Aby ustawić ścieżki wykonywalne, użyj komendy ``port select``:
pt_br: Para configurar os caminhos dos executáveis, use o comando ``port select``:
ru: Для настройки исполняемых путей используйте команду ``port select``:
zh_cn: 使用“端口选择” 命令设置可执行路径：

source: Type :command:`which sphinx-quickstart` to check if the installation was successful.
ja: :command:`which sphinx-quickstart` を実行してインストールが完了しているか確認出来ます。
pl_pl: Wpisz :command:`which sphinx-quickstart`, aby sprawdzić, czy instalacja się powiodła.
pt_br: Digitar :command:`which sphinx-quickstart` para certificar-se que a instalação foi com sucesso.
ru: Введите :command:`which sphinx-quickstart` чтобы проверить была ли установка успешной.
zh_cn: 输入：命令: ' which sphinx-quickstart '检查安装是否成功。

source: Windows: Install Python and Sphinx
ja: Windows: PythonとSphinxをインストールします。
pl_pl: Windows: Instalacja Pythona i Sphinksa
pt_br: Windows: Instalar Python e Sphinx
ru: Windows: Установка Python и Sphinx
zh_cn: Windows：安装Python和Sphinx

source: Install Python
ja: Pythonのインストール
pl_pl: Instalacja Pythona
pt_br: Instalar Python
ru: Установка Python
zh_cn: 安装Python

source: Most Windows users do not have Python, so we begin with the installation of Python itself. If you have already installed Python, please skip this section.
ja: Windowsの場合は、Pythonが入っていない場合がほとんどだと思いますので、Pythonのインストールから説明します。すでにPythonを利用している人は、この項目を飛ばしてください。
pl_pl: Większość użytkowników systemu Windows nie ma Pythona, więc zaczniemy od jego instalacji. Jeśli masz już zainstalowanego Pythona, prosimy pomiń tę sekcję.
pt_br: Muitos usuários de Windows não possuem Python, comece instalando o Python primeiro. Se já possuir Python instalado, favor pular essa seção.
ru: Большинство пользователей Windows не имеют Python - поэтому мы начнем с установки самого Python. Если вы уже установили Python - пропустите этот раздел.
zh_cn: 大多数Windows用户没有Python，所以我们从Python本身的安装开始介绍。如果您已经安装了Python，请跳过此部分。

source: Go to https://www.python.org/, the main download site for Python. Look at the left sidebar and under "Quick Links", click "Windows Installer" to download.
ja: https://www.python.org/ を開きます。Pythonの総本山です。英語が多いですが、恐れないで行きましょう！左側のサイドバーから、Quick Linksの中のWindows Installerをクリックしてダウンロードして、インストールします。
pl_pl: Wejdź na https://www.python.org/, główną stronę pobierania Pythona. Spójrz na lewy sidebar i pod „Quick Links” kliknij w „Windows Installer”, aby pobrać.
pt_br: Ir para https://www.python.org/, download principal do site Python. Olhe na barra da esquerda sob "Links Rápidos", clique em "Instalador Windows" para download.
ru: Перейдите на https://www.python.org/, основной сайт загрузки Python. Посмотрите на левую боковую панель и в разделе "Quick Links" нажмите "Windows Installer" для загрузки.
zh_cn: 转到Python的主要下载网址https://www.python.org/ ，在工具条的左边“快捷链接”下，点击“Windows 用户”下载。

source: Currently, Python offers two major versions, 2.x and 3.x. Sphinx 1.5 can run under Python 2.7, 3.4, 3.5, 3.6, with the recommended version being 2.7. This chapter assumes you have installed Python 2.7.
ja: 現在、Pythonは2.xと3.xの2つのメジャーバージョンを提供しています。Sphinx 1.3はPython 2.7、3.4、3.5、3.6のもとで動き、推奨バージョンは2.7です。この章は、Python 2.7がインストールされていることを想定して書かれています。
pl_pl: Obecnie Python oferuje dwie główne wersje, 2.x i 3.x. Sphinx 1.5 działa z Pythonem 2.7, 3.4, 3.5, 3.6, a rekomendowaną wersją jest 2.7. Ten rozdział zakłada, że masz zainstalowanego Pythona 2.7.
ru: В настоящее время Python предлагает две основные версии: 2.x и 3.x. Sphinx 1.5 может работать под Python 2.7, 3.4, 3.5, 3.6, с рекомендуемой версией 2.7. В этой главе предполагается что вы установили Python 2.7.
zh_cn: 目前，Python提供了两个主要版本， 2.x和3.x。Sphinx 1.5可以在Python 2.7、3.4、3.5和3.6下运行，推荐的版本是2.7。本章假设您已经安装了Python 2.7。

source: Follow the Windows installer for Python.
ja: Windowsのインストーラに従がってインストールが完了させてください。
pl_pl: Postępuj zgodnie z instrukcjami windowsowego instalatora Pythona.
pt_br: Siga as instruções do Instalador Python para Windows.
ru: Следуйте инструкциям установщика Windows для Python.
zh_cn: 使用Python的Windows安装程序。

source: After installation, you better add the Python executable directories to the environment variable ``PATH`` in order to run Python and package commands such as ``sphinx-build`` easily from the Command Prompt.
ja: インストールが完了したら、コマンドラインからPythonや ``sphinx-build`` を簡単に起動できるように、環境変数の ``PATH`` にPythonの実行ディレクトリをいくつか追加しましょう。
pl_pl: Po instalacji powinieneś dodać katalogi wykonywalne Pythona do zmiennej środowiskowej ``PATH``, aby prosto uruchamiać z Wiersza poleceń Pythona i komendy pakietów, takie jak ``sphinx-build``.
pt_br: Após a instalação, é melhor adicionar os diretórios dos executaveis Python na variável de ambiente ``PATH``, para facilitar a execução do Python e dos comandos de pacotes como ``sphinx-build`` a partir da linha de comando (prompt).
ru: После установки лучше добавить исполняемые каталоги Python в переменную окружения ``PATH``, чтобы легко запускать Python и пакетные команды, такие как ``sphinx-build``, из командной строки.
zh_cn: 安装之后，您最好将Python可执行目录添加到环境变量“PATH”中，以便从命令提示符顺利运行Python和包命令，如“‘sphinx-build’’。

source: Right-click the "My Computer" icon and choose "Properties"
ja: マイコンピュータのアイコンを右クリックして、プロパティダイアログを開きます
pl_pl: Kliknij prawym przyciskiem myszy w ikonę „Mój Komputer” i wybierz „Właściwości”
pt_br: Clique-Botão-Direito no ícone "Meu Computador" e escolha "Propriedades"
ru: Щелкните правой кнопкой мыши значок "Мой компьютер" и выберите пункт "Свойства"
zh_cn: 右击“我的电脑”图标，选择“属性”。

source: Click the "Environment Variables" button under the "Advanced" tab
ja: 詳細タブの下の方にある環境変数ボタンをクリックします
pl_pl: Kliknij w przycisk „Zmienne środowiskowe” w zakładce „Zaawansowane”
pt_br: Clique botão "Variáveis de Ambiente" que está na Aba "Avançado"
ru: Нажмите кнопку "Environment Variables" на вкладке "Advanced"
zh_cn: 点击“高级”标签下面的“环境变量”按钮。

source: If "Path" (or "PATH") is already an entry in the "System variables" list, edit it. If it is not present, add a new variable called "PATH".
ja: "Path" (または "PATH") がすでに「システム環境変数」に存在する場合それを編集します。存在しない場合は "PATH" という名前で新しい変数を追加します。
pl_pl: Jeśli „Path” (lub „PATH”) jest już wpisem na liście „Zmienne systemowe”, wejdź w edycję. Jeśli go nie ma, dodaj nową zmienną o nazwie „PATH”.
pt_br: Se já existir "Path" (ou "PATH") na lista de "Variáveis do Sistema", edite-a. Caso não exista, adicione uma nova variável chamada "PATH".
ru: Если "Path" (или "PATH") уже является записью в списке "System variables" - отредактируйте ее. Если её нет - добавьте новую переменную с именем "PATH".
zh_cn: 如果“路径（Path或PATH）”已经是“系统变量”列表中的一个条目，即可进行编辑。如果不存在，则添加一个名为“路径（PATH）”的新变量。

source: Add these paths, separating entries by ";":
ja: 各パスはセミコロン ";" で区切ります。
pl_pl: Dodaj te ścieżki, rozdzielając wpisy znakiem „;”:
pt_br: Adicione esses caminhos, separando as entradas por ";":
ru: Добавьте эти пути, разделяя записи ";":
zh_cn: 添加这些路径，用“;”分隔条目：

source: ``C:\Python27`` -- this folder contains the main Python executable
ja: ``C:\Python27`` -- このフォルダーにPythonの実行可能なプログラムが含まれています
pl_pl: ``C:\Python27`` – ten folder zawiera główne pliki wykonywalne Pythona
pt_br: ``C:\Python27`` -- esse diretório contém o executavel Python
ru: ``C:\Python27`` -- эта папка содержит основной исполняемый файл Python
zh_cn: “C:\Python27”——此文件夹包含Python的主要可执行文件

source: ``C:\Python27\Scripts`` -- this folder will contain executables added by Python packages installed with pip (see below)
ja: ``C:\Python27\Scripts`` -- このフォルダーには、pip (下記参照) などでインストールするPythonパッケージの実行可能ファイルが含まれます
pl_pl: ``C:\Python27\Scripts`` – ten folder będzie zawierał pliki wykonywalne dodane przez pakiety Pythona zainstalowane przy użyciu pipa (patrz poniżej)
pt_br: ``C:\Python27\Scripts`` -- esse diretório irá conter executáveis adicionados pelos pacotes Python instalados com pip (ver abaixo)
ru: ``C:\Python27\Scripts`` -- эта папка будет содержать исполняемые файлы, добавленные пакетами Python, установленными с помощью pip (см. ниже)
zh_cn: “C:\Python27\Scripts”——此文件夹将包含由与pip一起安装的Python包添加的可执行文件（见下文）

source: This is for Python 2.7. If you use another version of Python or installed to a non-default location, change the digits "27" accordingly.
ja: これは Python 2.7 の場合です。別のバージョンのPythonを使用する場合や、他の場所にインストールしている場合は、 "27" の数字をそれに応じて変更してください。
pl_pl: Tyczy się to Pythona 2.7. Jeśli używasz innej wersji Pythona lub zainstalowałeś go w nie-domyślnej lokalizacji, zmień odpowiednio cyfry „27”.
pt_br: Isso é para Python 2.7. Se usar outra versão de Python ou instalar em um local não padrão, modifique os dígitos "27"e pastas adequadamente.
ru: Это для Python 2.7. Если вы используете другую версию Python или установили в другое место - измените цифры "27" соответственно.
zh_cn: 这是python2.7。如果您使用另一个版本的Python或安装到非默认位置，请相应地更改数字“27”。

source: Now run the **Command Prompt**. After command prompt window appear, type ``python`` and Enter. If the Python installation was successful, the installed Python version is printed, and you are greeted by the prompt ``>>>``. Type ``Ctrl+Z`` and Enter to quit.
ja: **コマンド プロンプト** を実行しましょう。コマンドプロンプトウィンドウが表示されたら、 ``python`` と入力してEnterキーを押下します。Pythonのインストールが成功していれば、インストールしたPythonのバージョンと、プロンプト ``>>>`` が表示されます。 ``Ctrl+Z`` とEnterキーを入力して終了してください。
pl_pl: Teraz uruchom **Wiersz poleceń**. Gdy pojawi się okno wiersza poleceń, wpisz ``python`` i Enter. Jeśli instalacja Pythona się powiodła, wydrukowana zostanie zainstalowana wersja Pythona i zobaczysz wiersz zachęty ``>>>``. Wprowadź ``Ctrl+Z`` i Enter, aby wyjść.
pt_br: Agora execute o **Prompt de Comando**. Após a janela aparecer, digite ``python`` e tecle ENTER. Se a instalação Python foi concluída com sucesso, a versão instalada do Python é impressa, e será apresentado o prompt ``>>>``. Digite ``Ctrl+Z`` e ENTER para sair.
ru: Теперь запустите **Командную строку**. После появления окна командной строки введите ``python`` и Enter. Если установка Python прошла успешно - выведется установленная версия Python и приглашение `` >>> ``. Нажмите ``Ctrl + Z`` и Enter чтобы выйти.
zh_cn: 现在运行**命令提示符**。在命令提示符窗口出现后，输入“ python”并输入。如果Python安装成功，则会打印已安装的Python版本，您将看到提示“>>>”。键入“ Ctrl+Z ”并退出。

source: Install the pip command
ja: pipコマンドのインストール
pl_pl: Instalacja komendy pip
pt_br: Instalar através do comando pip
ru: Установка командой pip
zh_cn: 安装pip命令

source: Python has a very useful :command:`pip` command which can download and install 3rd-party libraries with a single command. This is provided by the Python Packaging Authority(PyPA): https://groups.google.com/forum/#!forum/pypa-dev
ja: Pythonには非常に有用な :command:`pip` コマンドがあり、1コマンドでサードパーティー製のライブラリをダウンロード・インストールできます。このコマンドは、 Python Packaging Authority(PyPA)プロジェクトによって提供されています: https://groups.google.com/forum/#!forum/pypa-dev
pl_pl: Python ma bardzo przydatną komendę :command:`pip`, która może pobierać i instalować biblioteki „z zewnątrz” przy pomocy jednej komendy. Dostarcza ją Python Packaging Authority (PyPA): https://groups.google.com/forum/#!forum/pypa-dev
pt_br: Python possui comando muito útil :command:`pip`, o qual pode baixar e instalar automaticamente bibliotecas de terceiros em um simples comando. Isso é provido pela Autoridade Pacotes Python (PyPA): https://groups.google.com/forum/#!forum/pypa-dev
ru: Python имеет очень полезную команду :command:`pip`, которая может загружать и устанавливать сторонние библиотеки с помощью одной команды. Это обеспечивается Python Packaging Authority (PyPA): https://groups.google.com/forum/#!forum/pypa-dev
zh_cn: Python有一个非常有用的:command:`pip` 命令，它可以用一个命令下载和安装第三方库。这是由Python打包权威机构（PyPA）提供的：https://groups.google.com/forum/#!forum/ PyPA -dev

source: To install pip, download https://bootstrap.pypa.io/get-pip.py and save it somewhere. After download, invoke the command prompt, go to the directory with ``get-pip.py`` and run this command:
ja: pipをインストールするために、 https://bootstrap.pypa.io/get-pip.py をダウンロードしてどこかに保存してください。ダウンロード後に、コマンドプロンプトを起動して、``get-pip.py`` を保存したディレクトリに移動して、以下のコマンドを実行します:
pl_pl: Aby zainstalować pipa, pobierz https://bootstrap.pypa.io/get-pip.py i gdzieś zapisz. Po pobraniu uruchom linię komend, przejdź do katalogu zawierającego ``get-pip.py`` i uruchom tę komendę:
pt_br: Para instalar pip, fazer download de https://bootstrap.pypa.io/get-pip.py e salve-o em qualquer lugar. Após o download, chame o prompt de comando, vá para o diretório onde salvou o ``get-pip.py`` (use cd nome-do-diretório) e execute o comando:
ru: Чтобы установить pip - скачайте https://bootstrap.pypa.io/get-pip.py и сохраните его где-нибудь. После загрузки вызовите командную строку, перейдите в каталог с ``get-pip.py`` и выполните эту команду:
zh_cn: 要安装pip，请下载https://bootstrap.pypa.io/get-pip.py并将其保存到某个地方。下载后，调用命令提示符，转到带有“get-pip.py”的目录并运行以下命令：

source: Now :command:`pip` command is installed. From there we can go to the Sphinx install.
ja: これで :command:`pip` コマンドがインストールされました。次はSphinxのインストールです。
pl_pl: Teraz komenda :command:`pip` jest już zainstalowana. Skąd możemy przejść do instalacji Sphinksa.
pt_br: Agora o comando pip :command:`pip` está instalado. A partir daqui pode ser instalado o pacote Sphinx.
ru: Теперь команда :command:`pip` установлена. Оттуда мы можем перейти к установке Sphinx.
zh_cn: 现在安装:command: ' pip '命令，从这里我们可以进入Sphinx安装。

source: ``pip`` has been contained in the Python official installation after version of Python-3.4.0 or Python-2.7.9.
ja: ``pip`` はPython-3.4.0もしくはPython-2.7.9以降のバージョンのPythonの公式インストール物に含まれています。
pl_pl: ``pip`` został zawarty w oficjalnej instalacji Pythona po wersji Pythona 3.4.0 oraz Pythona 2.7.9.
pt_br: ``pip`` está contido na distribuição oficial Python a partir das versões Python-2.7.9 ou Python-3.4.0.
ru: `` pip`` содержится в официальной установке Python после версии Python-3.4.0 или Python-2.7.9.
zh_cn: 在Python-3.4.0或Python-2.7.9版本之后，“pip”已经包含在Python的官方安装中。

source: Installing Sphinx with pip
ja: pipでSphinxインストール
pl_pl: Instalacja Sphinksa pipem
pt_br: Instalando Sphinx com o comando pip
ru: Установка Sphinx с помощью pip
zh_cn: 使用pip安装Sphinx

source: If you finished the installation of pip, type this line in the command prompt:
ja: pipのインストールが完了したら、以下の内容をコマンド プロンプトで入力します:
pl_pl: Jeśli skończyłeś instalację pipa, wpisz tę linię w linię komend:
pt_br: Se a instalação do pip, terminou com sucesso, digite no prompt de comando:
ru: Если вы закончили установку pip - введите в командной строке следующую строку:
zh_cn: 如果您完成了pip的安装，请在命令提示符中键入如下：

source: After installation, type :command:`sphinx-build -h` on the command prompt. If everything worked fine, you will get a Sphinx version number and a list of options for this command.
ja: インストールが完了したら、 :command:`sphinx-build -h` をコマンドプロンプトに入力します。インストールが問題なく完了していれば、Sphinxのバージョン番号とこのコマンドのオプション一覧が表示されます。
pl_pl: Po instalacji wpisz :command:`sphinx-build -h` w wierszu poleceń. Jeśli wszystko pójdzie dobrze, zobaczysz numer wersji Sphinksa i listę opcji dla tej komendy.
pt_br: Após a instalação, digitar :command:`sphinx-build -h` na linha de comando. Se tudo correr bem, serão exibidas a versão do Sphinx e a lista de opções para esse comando.
ru: После установки введите :command:`sphinx-build -h` в командной строке. Если все работает нормально - вы получите номер версии Sphinx и список параметров для этой команды.
zh_cn: 安装之后，在命令提示符上键入:command: ' sphinx-build -h '。如果一切正常，您将获得这个命令的Sphinx版本号和选项列表。

source: That it. Installation is over. Head to :doc:`tutorial` to make a Sphinx project.
ja: インストール作業は以上です。次は :doc:`tutorial` に進んでください。
pl_pl: To wszystki. Instalacja zakończona. Idź do :doc:`samouczka <tutorial>`, aby stworzyć sphinksowy projekt.
pt_br: Isso é tudo. A instalação foi concluída. Ir para :doc:`tutorial` para rapidamente criar um projeto Sphinx.
ru: Вот и всё. Установка окончена. Отправляйтесь в :doc:`tutorial`, чтобы создать проект Sphinx.
zh_cn: 到这里安装结束，即可点击:doc:`教程`创建一个 Sphinx项目。
