Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/intl.po
Languages: pt_br, ru

source: Internationalization
pt_br: Internacionalização
ru: Локализация

source: Complementary to translations provided for Sphinx-generated messages such as navigation bars, Sphinx provides mechanisms facilitating *document* translations in itself. See the :ref:`intl-options` for details on configuration.
pt_br: Complementarmente às traduções fornecidas pelas mensagens geradas pelo Sphinx, algumas barras e botões de navegação, Sphinx provê mecanismos para facilitar a tradução propriamente dita do *documento*. Ver :ref:`intl-options` para detalhes na configuração
ru: В дополнение к переводам предоставляемых для сообщений сгенерированных Sphinx, таких как меню, Sphinx предоставляет механизмы облегчающие перевод *документации* самостоятельно. Смотрите :ref:`intl-options` для детальной информации о настройке.

source: Workflow visualization of translations in Sphinx. (The stick-figure is taken from an `XKCD comic <https://xkcd.com/779/>`_.)
ru: Визуализация рабочего процесса переводов в Sphinx. (Представленная схематичная картинка взята с `XKCD comic <https://xkcd.com/779/>`_.)

source: Sphinx internationalization details
pt_br: Detalhes da Internacionalização Sphinx
ru: Детали локализации Sphinx

source: **gettext** [1]_ is an established standard for internationalization and localization. It naively maps messages in a program to a translated string. Sphinx uses these facilities to translate whole documents.
pt_br: **gettext** [1]_ é um padrão para internacionalização e localização (acepção sua localidade). Nativamente mapeia mensagens em um programa para uma frase traduzida. Sphinx usa essas facilidades para todos os documentos.
ru: **gettext** [1]_ является установленным стандартом для интернационализации и локализации. Он просто сопоставляет сообщения в программе с переведенной строкой. Sphinx использует эти средства для полного перевода документов.

source: Initially project maintainers have to collect all translatable strings (also referred to as *messages*) to make them known to translators. Sphinx extracts these through invocation of ``sphinx-build -b gettext``.
pt_br: Inicialmente os mantenedores do projeto, coletam todas as palavras ou frases que serão traduzidas (também referidas como *mensagens*) para torná-las conhecidas para os tradutores. Sphinx extraí isso através da chamado do comando ``sphinx-build -b gettext``.
ru: Изначально разработчики проекта должны собрать все переводимые строки (также называемые *messages*), чтобы сделать их доступными переводчикам. Sphinx извлекает их через вызов ``sphinx-build -b gettex``.

source: Every single element in the doctree will end up in a single message which results in lists being equally split into different chunks while large paragraphs will remain as coarsely-grained as they were in the original document. This grants seamless document updates while still providing a little bit of context for translators in free-text passages. It is the maintainer's task to split up paragraphs which are too large as there is no sane automated way to do that.
pt_br: Cada simples elemento do (doctree raíz do documento) irá gerar uma simples mensagem a qual resultará em listas que serão igualmente quebradas em diferentes fragmentos, enquanto grandes parágrafos irão permanecer formatados como no documento original. Isso permite atualizações perfeitas dos documentos, enquanto são mantidos os contextos que os tradutores precisam para traduzir livremente os conteúdos. A tarefa do mantenedor é quebrar em parágrafos não muito longos para que isso seja racional, pois não há nenhuma automação para isso.
ru: Каждый элемент в структуре документа (doctree) будет помещен в отдельное сообщение, в результате получается список фрагментов, которые будут равнозначны фрагментам исходного документа хотя большие абзацы будут оставаться столь же крупными. Это дает бесшовные обновления документа обеспечивая контекст для переводчиков в свободной части текста. Задача сопровождающего-разбить абзацы, которые слишком велики, так как нет вменяемого автоматизированного способа сделать это.

source: After Sphinx successfully ran the :class:`~sphinx.builders.gettext.MessageCatalogBuilder` you will find a collection of ``.pot`` files in your output directory. These are **catalog templates** and contain messages in your original language *only*.
pt_br: Após o Sphinx executar :class:`~sphinx.builders.gettext.MessageCatalogBuilder` será encontrada uma coleção de arquivos ``.pot`` em seu diretório de saida. Essas mensagens são chamadas de **catálogos modelo** e *só* contêm mensagens no seu idioma original.
ru: После успешного вызова класса :class:`~sphinx.builders.gettext.MessageCatalogBuilder` вы сможете найти набор файлов ``.pot`` в выходном каталоге. Они являются **перечнем шаблонов** и содержат сообщения *только* на языке оригинала.

source: They can be delivered to translators which will transform them to ``.po`` files --- so called **message catalogs** --- containing a mapping from the original messages to foreign-language strings.
pt_br: Esses arquivos são enviados para os tradutores que irão transformá-los em arquivos ``.po`` --- chamados **catálogos de mensagens** --- contendo um mapeamento das mensagens originais para palavras-frases na língua estrangeira.
ru: Они могут быть предоставлены переводчикам, которые преобразуют их в файлы ``.po`` --- которые называются **каталогами сообщений** --- содержащими соответствие между оригинальными сообщениями и сообщениями на целевом языке.

source: Gettext compiles them into a binary format known as **binary catalogs** through :program:`msgfmt` for efficiency reasons. If you make these files discoverable with :confval:`locale_dirs` for your :confval:`language`, Sphinx will pick them up automatically.
pt_br: Gettext compila esses arquivos em formato binário, conhecidos como **catálogos binários** através do :program:`msgfmt` por razões e eficiência. O Sphinx pode reconhecer e usar esses arquivos automaticamente, basta declarar sua localidade :confval:`locale_dirs` e seu idioma :confval:`language
ru: Gettext компилирует их в бинарный формат, известный как **двоичные каталоги** с помощью программы :program:`msgfmt` для целей эффективности. Поместите эти файлы в каталог :confval:`locale_dirs` для вашего языка :confval:`language`, Sphinx возьмет их оттуда автоматически.

source: An example: you have a document ``usage.rst`` in your Sphinx project. The gettext builder will put its messages into ``usage.pot``. Imagine you have Spanish translations [2]_ on your hands in ``usage.po`` --- for your builds to be translated you need to follow these instructions:
pt_br: Como exemplo: Um documento ``usage.rst`` em seu Projeto Sphinx. O construtor gettext irá colocar suas mensagens em ``usage.pot``. Imagine que hajam traduções em Espanhol [2]_ em suas mãos, ``usage.po`` --- para suas montagens (builds) que serão traduzidas seguindo as instruções:
ru: Например: у вас есть документ ``usage.rst`` в вашем проекте Sphinx. Сборщик gettext поместит все сообщения в ``usage.pot``. Представим что у вас есть перевод на Испанский [2]_ в файле ``usage.po`` --- для сборки вашего перевода вам необходимо выполнить следующие действия:

source: Compile your message catalog to a locale directory, say ``locale``, so it ends up in ``./locale/es/LC_MESSAGES/usage.mo`` in your source directory (where ``es`` is the language code for Spanish.) ::
pt_br: Compilar catálogo de mensagem em um diretório específico, digamos ``locale`` o qual irá ficar em ``./locale/es/LC_MESSAGES/usage.mo`` em seu diretório fonte (onde ``es`` is the language code for Spanish.) ::
ru: Скомпилируйте ваш каталог сообщений (po) в локальную директорию, скажем в ``locale``. Так в результате двоичный каталог должен распологаться по адресу ``./locale/es/LC_MESSAGES/usage.mo`` относительно исходной директории (здесь ``es`` является кодом Испанского языка) ::

source: Set :confval:`locale_dirs` to ``["locale/"]``.
pt_br: Assinale :confval:`locale_dirs` para ``["locale/"]``.
ru: Установите параметр :confval:`locale_dirs` в ``["locale/"]``.

source: Set :confval:`language` to ``es`` (also possible via :option:`-D <sphinx-build -D>`).
pt_br: Definir :confval:`language` to ``es` (também possível via :option:`-D <sphinx-build -D>`).
ru: Установите параметр :confval:`language` в ``es`` (так же возможно через командную строку :option:`-D <sphinx-build -D>`).

source: Run your desired build.
pt_br: Execute sua montagem (executar sphinx para construir seu documento) desejada.
ru: Выполните необходимую сборку.

source: Translating with sphinx-intl
pt_br: Traduzindo com sphinx-intl
ru: Перевод через sphinx-intl

source: Quick guide
pt_br: Guia Rápido
ru: Краткое руководство

source: `sphinx-intl`_ is a useful tool to work with Sphinx translation flow. This section describe an easy way to translate with sphinx-intl.
ru: `sphinx-intl`_ полезный инструмент для работы с переводами Sphinx. Этот раздел описывает упрощенный способ перевода с использованием sphinx-intl.

source: Install `sphinx-intl`_ by :command:`pip install sphinx-intl`.
ru: Установите `sphinx-intl`_ выполнив :command:`pip install sphinx-intl`.

source: Add configurations to your `conf.py`::
pt_br: Adicionar personalizações em seu `conf.py`::
ru: Добавьте ваши настройки в файл `conf.py`::

source: This case-study assumes that :confval:`locale_dirs` is set to 'locale/' and :confval:`gettext_compact` is set to `False` (the Sphinx document is already configured as such).
pt_br: Nesse exemplo assume que :confval:`locale_dirs` está definido para 'locale/' e :confval:`gettext_compact` está definido para `False` (Documento Sphinx por padrão são configurados assim).
ru: В этом примере предпологается, что параметр :confval:`locale_dirs` имеет значение 'locale/' и :confval:`gettext_compact` установлен в `False` (документ Sphinx уже имеет необходимые настройки).

source: Extract document's translatable messages into pot files:
pt_br: Extraia os documentos que serão traduzidos em arquivos pot::
ru: Извлеките переводимые сообщения из документа в файл pot:

source: As a result, many pot files are generated under ``_build/gettext`` directory.
ru: В результате, множество файлов pot будут созданы в директории ``_build/gettext``.

source: Setup/Update your `locale_dir`:
pt_br: Configurar / Atualizar seu `locale_dir`::
ru: Установка/Обновление вашего `locale_dir`:

source: Done. You got these directories that contain po files:
pt_br: Feito. Nesses diretórios já teremos os arquivos po:
ru: Готово. Вы создали следующие дирректории содержащие po файлы:

source: Translate your po files under `./locale/<lang>/LC_MESSAGES/`.
pt_br: Traduza seues arquivos po sob o diretório `./locale/<lang>/LC_MESSAGES/`.
ru: Переведите ваши po в каталоге `./locale/<lang>/LC_MESSAGES/`.

source: make translated document.
pt_br: Construir documento traduzido.
ru: соберите переведенный документ.

source: You need a :confval:`language` parameter in ``conf.py`` or you may also specify the parameter on the command line (for BSD/GNU make):
ru: Вам нужно указать параметр :confval:`language` в файле конфигурации ``conf.py`` или вы можете определить этот параметр в командной строке (для BSD/GNU make):

source: command line (for Windows cmd.exe):
ru: командная строка (для Windows cmd.exe):

source: command line (for PowerShell):
ru: командная строка (для PowerShell):

source: Congratulations! You got the translated documentation in the ``_build/html`` directory.
pt_br: Parabéns! O documento traduzido está no diretório ``_build/html``.
ru: Поздравляем! Теперь ваша переведенная документация находится в каталоге ``_build/html``.

source: sphinx-build that is invoked by make command will build po files into mo files.
pt_br: sphinx-build o qual é chamado pelo comando make irá criar arquivos mo a partir de arquivos po.
ru: утилита sphinx-build вызываемая командой make транслирует ваши файлы po в двоичные файлы mo.

source: If you are using 1.2.x or earlier, please invoke ``sphinx-intl build`` command before make command.
pt_br: Se estiver usando versão 12.x ou posterior favor chamar ``sphinx-intl build`` antes do comando make.
ru: Если вы используете версию 1.2.x или более ранюю, пожалуйста вызовите команду ``sphinx-intl build`` перед командой make.

source: Translating
pt_br: Traduzindo
ru: Перевод

source: Translate po file under ``./locale/de/LC_MESSAGES`` directory. The case of builders.po file for sphinx document:
pt_br: Traduzindo arquivo po sob ``./locale/de/LC_MESSAGES``. Case de construtores de arquivo po para documentos Sphinx:
ru: Переведите файлы po расположенные в директории ``./locale/de/LC_MESSAGES``. В нашем случае это файл builders.po для документа sphinx:

source: Another case, msgid is multi-line text and contains reStructuredText syntax:
pt_br: Outro caso, msgid possui múltiplas linhas de texto e contém sintaxe reStructuredText:
ru: В другом случае, если msgid содержит многострочный текст содержащий синтаксические конструкции reStructuredText:

source: Please be careful not to break reST notation. Most po-editors will help you with that.
pt_br: Preste muita atenção para não quebrar a notação reST. Editores de arquivo po ajudam muito nisso.
ru: Пожалуйста будьте осторожны и не ломайте конструкции reST. Большинство po-редакторов поможет вам в этом.

source: Update your po files by new pot files
pt_br: Atualize seus arquivos po com os novos arquivos pot
ru: Обновите ваши po-файлы из новых файлов pot

source: If a document is updated, it is necessary to generate updated pot files and to apply differences to translated po files. In order to apply the updating difference of a pot file to po file, use the :command:`sphinx-intl update` command.
pt_br: Se um documento foi atualizado, será necessário gerar novos arquivos pot e aplicar as diferenças nos arquivos po. Para aplicar uma atualização diferente de um arquivo pot em um arquivo po, utilize :command:`sphinx-intl update`
ru: При обновлении документа, необходимо сгенерировать обновленные pot-файлы и применить различия к переведенным файлам po. Для применения различий из обновленных файлов pot, используйте команду :command:`sphinx-intl update`.

source: Using Transifex service for team translation
pt_br: Usando o Serviço Transifex para time tradutotes
ru: Использование сервиса Transifex для работы в команде

source: Transifex_ is one of several services that allow collaborative translation via a web interface. It has a nifty Python-based command line client that makes it easy to fetch and push translations.
pt_br: Transifex_ é um dos diversos serviços que permite tradução colaborativa via interface web. Possui diversos comandos Python base que permite que clientes baixem e devolvam traduções
ru: Transifex_ один из нескольких сервисов предоставляющих возможность совместной работы над переводами через web-интерфейс. Он имеет прекрасный Python-подобный клиент командной строки облегчающий получение и отправку переводов.

source: Install `transifex-client`_
ru: Установите `transifex-client`_

source: You need :command:`tx` command to upload resources (pot files).
pt_br: Utilizar o comando :command:`tx` para fazer upload de recursos arquivos pot.
ru: Выполните команду :command:`tx` для загрузки ваших ресурсов (файлов pot).

source: `Transifex Client documentation`_
ru: `Документация Transifex Client`_

source: Create your transifex_ account and create new project for your document
pt_br: Criar sua conta transifex_ e criar novo projeto para seu documento
ru: Зарегистрируйтесь на transifex_ и создайте новый проект для вашей документации

source: Currently, transifex does not allow for a translation project to have more than one version of the document, so you'd better include a version number in your project name.
pt_br: Atualmente transifex não permite a tradução de um projeto que tenha mais de uma versão de documento, por isso é melhor incluir o número da versão em seu nome de projeto.
ru: В настоящее время transifex не позволяет проекту перевода иметь более одной версии документа, поэтому лучше указать номер версии в имени проекта.

source: For example:
pt_br: Por exemplo:
ru: Например:

source: Project ID
ru: ID проекта

source: Project URL
ru: URL проекта

source: Create config files for tx command
pt_br: Criar arquivos config para comandos tx
ru: Создайте файл настроек для команды tx

source: This process will create ``.tx/config`` in the current directory, as well as a ``~/.transifexrc`` file that includes auth information.
pt_br: Esse processo irá criar ``.tx/config`` no diretório corrente, bem como um arquivo ``~/.transifexrc`` que inclui informação de auth.
ru: Этот процесс создаст ``.tx/config`` в текущей директории, а так же файл ``~/.transifexrc`` содержащий информацию для авторизации.

source: Upload pot files to transifex service
pt_br: Upload de arquivos pot para o serviço transifex
ru: Загрузите файлы pot на сервис transifex

source: Register pot files to ``.tx/config`` file:
pt_br: Registrar arquivos pot para arquivo ``.tx/config``
ru: Зарегистрируйте файлы pot в файле ``.tx/config``:

source: and upload pot files:
pt_br: e upload arquivos pot:
ru: и загрузите файлы pot:

source: Forward the translation on transifex
pt_br: Avançar na tradução no transifex
ru: Выполняйте перевод на transifex

source: Pull translated po files and make translated html
pt_br: Baixar arquivos po traduzidos e torná-los html traduzidos
ru: Скачайте переведенные файлы po и соберите переведенный html

source: Get translated catalogs and build mo files (ex. for 'de'):
pt_br: Obter catálogos traduzidos e construir arquivos mo (ex. para 'de'):
ru: Скачайте переведенные каталоги и соберите mo файлы (например, для 'de'):

source: Invoke make html (for BSD/GNU make):
ru: Вызовите команду make html (для BSD/GNU make):

source: That's all!
pt_br: Isso é tudo, Pessoal!
ru: И всё!

source: Translating locally and on Transifex
pt_br: Traduzindo localmente e no Transifex
ru: Локальный перевод и перевод на Transifex

source: If you want to push all language's po files, you can be done by using :command:`tx push -t` command. Watch out! This operation overwrites translations in transifex.
pt_br: Se for necessário baixar todos os arquivos po de todos idiomas, isso pode ser feito usando o comando :command:`tx push -t`. Olhos abertos! Essa operação sobrepõe traduções existentes no transifex.
ru: Если вы хотите загрузить po-файлы для всех языков, вы можете сделать это используя команду :command:`tx push -t`. Будьте осторожны! Эта операция заменит все переводы на transifex.

source: In other words, if you have updated each in the service and local po files, it would take much time and effort to integrate them.
pt_br: Em outras palavras, caso tenha atualizado cada um deles via serviço transifex e arquivos locais po, pode ser necessário muito esforço para integrá-los.
ru: Другими словами, если вы обновили каждый из файлов на сервисе и локальные po-файлы, может потребоваться много времени и сил чтобы объединить их.

source: Contributing to Sphinx reference translation
pt_br: Contribuindo para tradução Referência Sphinx
ru: Участие в переводе справочной информации Sphinx

source: The recommended way for new contributors to translate Sphinx reference is to join the translation team on Transifex.
pt_br: A maneira que recomendamos para novos contribuidores para traduzir o Sphinx é juntar-se a equipe e tradução do seu idioma do Transifex.
ru: Рекомендованным способом для новых переводчиков справочной информации Sphinx, является участие в команде переводчиков на Transifex.

source: There is `sphinx translation page`_ for Sphinx (master) documentation.
ru: Существующая `страница переводов sphinx`_ для (мастер) документации Sphinx.

source: Login to transifex_ service.
pt_br: Login serviço transifex_
ru: Авторизуйтесь в сервисе transifex_.

source: Go to `sphinx translation page`_.
pt_br: Ir para sphinx translation page`_.
ru: Перейдите `на страницу переводов sphinx`_.

source: Click ``Request language`` and fill form.
pt_br: Clique ``Request language`` e preencha o formulário.
ru: Кликните ``Запрос языка`` и заполните форму.

source: Wait acceptance by transifex sphinx translation maintainers.
pt_br: Aguarde o retorno com a aceitação vinda dos mantenedores do projeto.
ru: Дождитесь подтверждения от группы поддержки переводов sphinx на transifex.

source: (after acceptance) translate on transifex.
pt_br: (após aceitação) traduza no transifex.
ru: (после подтверждения) переводите на transifex.

source: Footnotes
pt_br: Notas de Rodapé
ru: Сноски

source: See the `GNU gettext utilities <https://www.gnu.org/software/gettext/manual/gettext.html#Introduction>`_ for details on that software suite.
ru: Смотрите `GNU gettext utilities <https://www.gnu.org/software/gettext/manual/gettext.html#Introduction>`_ для подробной информации о данном пакете программ.

source: Because nobody expects the Spanish Inquisition!
pt_br: Porque ninguém espera encontrar a Inquisição Espanhola!
ru: Никто не будет обращаться в Испанскую инквизицию!

source: Install `sphinx-intl`_ by :command:`pip install sphinx-intl` or :command:`easy_install sphinx-intl`.
pt_br: Instalar `sphinx-intl`_ através de :command:`pip install sphinx-intl` ou :command:`easy_install sphinx-intl`.
