Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/intro.po
Languages: pl_pl, zh_cn

source: Introduction
pl_pl: Wprowadzenie
zh_cn: 简介

source: This is the documentation for the Sphinx documentation builder. Sphinx is a tool that translates a set of reStructuredText_ source files into various output formats, automatically producing cross-references, indices, etc. That is, if you have a directory containing a bunch of reST-formatted documents (and possibly subdirectories of docs in there as well), Sphinx can generate a nicely-organized arrangement of HTML files (in some other directory) for easy browsing and navigation. But from the same source, it can also generate a PDF file using LaTeX.
pl_pl: To jest dokumentacja programu do budowania dokumentacji Sphinx. Sphinx jest narzędziem, które tłumaczy zestaw plików źródłowych reStructuredText_ do wielu formatów wyjścia, produkując automatycznie odsyłacze, indeksy itd. Więc jeśli masz katalog zawierający zestaw dokumentów w formacie reST (i być może także podkatalogi z dokumentacją), Sphinx może wygenerować ładnie zorganizowany układ plików HTML (w jakimś innym katalogu), który będzie można łatwo przeglądać i po nim nawigować. Z tych samych źródeł może wygenerować również plik PDF przy użyciu LaTeX-a.
zh_cn: 这是Sphinx文档生成器的文档。Sphinx是一个工具，它可以将一组RestructedText_U源文件转换为各种输出格式，自动生成交叉引用、索引等。也就是说，如果您有一个目录包含一堆reST格式的文档（可能还有文档的子目录），Sphinx可以生成HTML文件（在其他目录中），便于浏览和导航。但从同一个来源，它也可以生成一个PDF文件使用LaTeX。

source: The focus is on hand-written documentation, rather than auto-generated API docs. Though there is support for that kind of documentation as well (which is intended to be freely mixed with hand-written content), if you need pure API docs have a look at `Epydoc <http://epydoc.sourceforge.net/>`_, which also understands reST.
pl_pl: Akcent położony jest na ręcznie pisaną dokumentację, a nie na automatycznie generowaną dokumentację API. Chociaż jest również wsparcie dla tego rodzaju dokumentacji (który może być dowolnie mieszany z treścią napisaną ręcznie), jeśli potrzebujesz czystej dokumentacji API, spójrz na `Epydoc <http://epydoc.sourceforge.net/>`_, które również rozumie reST.
zh_cn: 本项目主要处理手工录入的文档，而不是自动生成的 API 文档。而且其实 API 文档也是支持的（甚至可以方便地插入到手工录入的文档内容之间），如果你只需要生成单纯的 API 文档，可以看看 `Epydoc <http://epydoc.sourceforge.net/>`_，它也能理解 reST 语法。

source: For a great "introduction" to writing docs in general -- the whys and hows, see also `Write the docs`_, written by Eric Holscher.
pl_pl: Polecamy wspaniałe ogólne „wprowadzenie” do pisania dokumentacji – dlaczego i jak, `Write the docs`_, napisane przez Erica Holschera.
zh_cn: 要了解一般编写文档的好“介绍”—为什么和如何编写文档，另请参见Eric Holscher撰写的“编写文档”。

source: Conversion from other systems
pl_pl: Konwersja z innych systemów
zh_cn: 从其他文档格式导入

source: This section is intended to collect helpful hints for those wanting to migrate to reStructuredText/Sphinx from other documentation systems.
pl_pl: Celem tej sekcji jest zebrać pomocne wskazówki dla tych, który chcą zmigrować do reStructuredText/Sphinksa z innych systemów dokumentacji.
zh_cn: 这个部分列举转换文档到 reStructuredText/Sphinx 的小技巧。

source: Gerard Flanagan has written a script to convert pure HTML to reST; it can be found at the `Python Package Index <https://pypi.org/project/html2rest/>`_.
pl_pl: Gerard Flanagan napisał skrypt do konwertowania czystego HTML-a do reST-a; można go znaleźć w `Python Package Index <https://pypi.org/project/html2rest/>`_.
zh_cn: Gerard Flanagan编写了一个将纯HTML转换为reST的脚本；可以在“Python包索引”中找到它<https://pypi.org/project/html2rest/>`_.

source: For converting the old Python docs to Sphinx, a converter was written which can be found at `the Python SVN repository <https://svn.python.org/projects/doctools/converter/>`_. It contains generic code to convert Python-doc-style LaTeX markup to Sphinx reST.
pl_pl: Do konwertowania starej dokumentacji Pythona na Sphinksa został napisany konwerter, który można znaleźć w `repozytorium SVN Pythona <https://svn.python.org/projects/doctools/converter/>`_. Zawiera generyczny kod do konwertowania znaczników Python-doc-style LaTeX-a do sphinksowego reST-a.
zh_cn: 为了将旧的Python文档转换为Sphinx，我们编写了一个转换器，可以在pythonsvn存储库中找到它<https://svn.python.org/projects/doctools/converter/>`_. 它包含将Python文档样式的LaTeX标记转换为Sphinx reST的通用代码。

source: Marcin Wojdyr has written a script to convert Docbook to reST with Sphinx markup; it is at `GitHub <https://github.com/wojdyr/db2rst>`_.
pl_pl: Marcin Wojdyr napisał skrypt do konwertowania Docbooka do reST-a ze znacznikami Sphinksa; jest na `GitHubie <https://github.com/wojdyr/db2rst>`_.
zh_cn: Marcin Wojdyr 写了一个脚本，可以把 Docbook 转换为 Sphinx 的 reST 格式，项目地址在 `GitHub <https://github.com/wojdyr/db2rst>`_。

source: Christophe de Vienne wrote a tool to convert from Open/LibreOffice documents to Sphinx: `odt2sphinx <https://pypi.org/project/odt2sphinx/>`_.
pl_pl: Christophe de Vienne napisał narzędzie do konwertowania z dokumentów Open/LibreOffice'a do Sphinksa: `odt2sphinx <https://pypi.org/project/odt2sphinx/>`_.
zh_cn: Christophe de Vienne编写了一个将Open/LibreOffice文档转换为Sphinx的工具：`odt2sphinx<https://pypi.org/project/odt2sphinx/>`_.

source: To convert different markups, `Pandoc <https://pandoc.org/>`_ is a very helpful tool.
pl_pl: Do konwertowania innych składni, `Pandoc <https://pandoc.org/>`_ jest bardzo pomocnym narzędziem.
zh_cn: 要转换不同的标记，`Pandoc<https://pandoc.org/>`_是一个非常有用的工具。

source: Use with other systems
pl_pl: Używanie z innymi systemami
zh_cn: 与其他系统集成

source: See the :ref:`pertinent section in the FAQ list <usingwith>`.
pl_pl: Zobacz :ref:`stosowną sekcję na liście częstych pytań <usingwith>`.
zh_cn: 参考 :ref:`FAQ 列表中的相关章节 <usingwith>`。

source: Prerequisites
pl_pl: Wymagania wstępne
zh_cn: 系统需求

source: Sphinx needs at least **Python 3.6** to run. It also depends on 3rd party libraries such as docutils_ and jinja2_, but they are automatically installed when sphinx is installed.
zh_cn: Sphinx至少需要**Python3.6**才能运行。它也依赖于 docutils_ 和 jinja2_ 等第三方库，不过它们会随着 sphinx 一起安装。

source: Usage
pl_pl: Użycie
zh_cn: 如何使用

source: See :doc:`/usage/quickstart` for an introduction. It also contains links to more advanced sections in this manual for the topics it discusses.
pl_pl: W :doc:`/usage/quickstart` znajdziesz wprowadzenie. Zawiera ono między innymi linki do bardziej zaawansowanych sekcji tego podręcznika dla tematów, które porusza.
zh_cn: 请参阅 :doc:`/usage/quickstart` 了解详情。它还含有指向本手册中讨论主题的更高级部分的链接。
