Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/invocation.po
Languages: ja, pt_br

source: Invocation of sphinx-quickstart
ja: sphinx-quickstartの起動
pt_br: Chamar o sphinx-quickstart

source: The :program:`sphinx-quickstart` script generates a Sphinx documentation set. It is called like this:
ja: Sphinxのドキュメントセットを生成するのは、 :program:`sphinx-quickstart` というプログラムです。これは次のように実行します:
pt_br: O script :program:`sphinx-quickstart` constrói o conjunto de documentação Sphinx. É chamado dessa maneira::

source: where *projectdir* is the Sphinx documentation set directory in which you want to place. If you omit *projectdir*, files are generated into current directory by default.
ja: *projectdir* はSphinxドキュメンテーションディレクトリをあなたが配置したい場所に 設定します。もし *projectdir* を削除した場合、ファイルはデフォルトでは現在のディレクトリへ生成されます。
pt_br: onde *projectdir* é local onde deseja criar o conjunto de diretórios da documentação Sphinx. Caso seja omitido *projectdir*, os arquivos serão gerados no diretório corrente.

source: The :program:`sphinx-quickstart` script has several options:
ja: :program:`sphinx-quickstart` スクリプトは次のようなオプションを持っています:
pt_br: O script :program:`sphinx-quickstart` tem várias opções:

source: Quiet mode that will skips interactive wizard to specify options. This option requires `-p`, `-a` and `-v` options.
ja: Quietモードはオプションを定義する対話式ウィザードをスキップします。このオプションは `-p`, `-a` および `-v` オプションを必要します。
pt_br: Modo quieto irá pular assistente interativo ao especificar as opções. Isso requer opções `-p`, `-a` e `-v`.

source: Display usage summary or Sphinx version.
ja: 簡単な使い方やSphinxのバージョンを表示します。
pt_br: Exibir sumário uso ou versão Sphinx.

source: Structure options
ja: 構成オプション
pt_br: Opção Estrutura

source: If specified, separate source and build directories.
ja: 記述した場合、ソースとビルドのディレクトリを分割します。
pt_br: Se especificado, separa diretório fonte e de construção.

source: Inside the root directory, two more directories will be created; "_templates" for custom HTML templates and "_static" for custom stylesheets and other static files. You can enter another prefix (such as ".") to replace the underscore.
ja: プロジェクトのルートディレクトリに 2以上のディレクトリが作成されます。カスタマイズしたHTMLテンプレート用の"_templates"ディレクトリと、カスタマイズしたスタイルシート等を置く"_static"ディレクトリがあります。これらのディレクトリは "_" で始まっていますが、別の文字("."など)で始まるように指定できます。
pt_br: Dentro do diretório raiz, mais dois outros diretórios serão criados; "_templates" para modelos HTML personalizados e "_static" para folhas de estilo (arquivos .css) e outros tipos estátivos de arquivos. Pode ser usado outros prefixos como (".") para substituir o underscore.

source: Project basic options
ja: プロジェクトの基本オプション
pt_br: Opções básicas do Projeto

source: Project name will be set. (see :confval:`project`).
ja: プロジェクト名を指定します ( :confval:`project` も参照)。
pt_br: Nome do projeto será utilizado. (ver :confval:`project`).

source: Author names. (see :confval:`copyright`).
ja: 著者名を指定します。 ( :confval:`copyright` も参照)。
pt_br: Nome autor. (ver :confval:`copyright`).

source: Version of project. (see :confval:`version`).
ja: プロジェクトのバージョンを指定します ( :confval:`version` も参照)。
pt_br: Versão do projeto. (ver :confval:`version`).

source: Release of project. (see :confval:`release`).
ja: プロジェクトのリリースを指定します ( :confval:`release` も参照)。
pt_br: Release do projeto. (ver :confval:`release`).

source: Document language. (see :confval:`language`).
ja: ドキュメント言語。 ( :confval:`language` 参照 )
pt_br: Idioma do Documento. (ver :confval:`language`).

source: Source file suffix. (see :confval:`source_suffix`).
ja: ソース・ファイルサフィックス。 ( :confval:`source_suffix` 参照)
pt_br: Sufixo arquivos fonte. (ver :confval:`source_suffix`).

source: Master document name. (see :confval:`master_doc`).
ja: マスタードキュメント名。 ( :confval:`master_doc` 参照)
pt_br: Nome documento mestre. (ver :confval:`master_doc`).

source: Use epub.
ja: epubを利用します。
pt_br: Usar epub.

source: Extension options
ja: 拡張オプション
pt_br: Opções Extensão

source: Enable `sphinx.ext.autodoc` extension.
ja: `sphinx.ext.autodoc` 拡張を有効にします。
pt_br: Habilitar extensão `sphinx.ext.autodoc`.

source: Enable `sphinx.ext.doctest` extension.
ja: `sphinx.ext.doctest` 拡張を有効にします。
pt_br: Habilitar extensão `sphinx.ext.doctest`.

source: Enable `sphinx.ext.intersphinx` extension.
ja: `sphinx.ext.intersphinx` 拡張を有効にします。
pt_br: Habilitar extensão `sphinx.ext.intersphinx`

source: Enable `sphinx.ext.todo` extension.
ja: `sphinx.ext.todo` 拡張を有効にします。
pt_br: Habilitar extensão `sphinx.ext.todo`

source: Enable `sphinx.ext.coverage` extension.
ja: `sphinx.ext.coverage` 拡張を有効にします。
pt_br: Habilitar extensão `sphinx.ext.coverage`.

source: Enable `sphinx.ext.imgmath` extension.
ja: `sphinx.ext.imgmath` 拡張を有効にします。
pt_br: Habilitar extensão `sphinx.ext.imgmath`.

source: Enable `sphinx.ext.mathjax` extension.
ja: `sphinx.ext.mathjax` 拡張を有効にします。
pt_br: Habilitar extensão `sphinx.ext.mathjax`.

source: Enable `sphinx.ext.ifconfig` extension.
ja: `sphinx.ext.ifconfig` 拡張を有効にします。
pt_br: Habilitar extensão `sphinx.ext.ifconfig`.

source: Enable `sphinx.ext.viewcode` extension.
ja: `sphinx.ext.viewcode` 拡張を有効にします。
pt_br: Habilitar extensão `sphinx.ext.viewcode`.

source: Enable arbitary extensions.
pt_br: Habilitar arbitrariamente extensões

source: Makefile and Batchfile creation options
ja: Makefileとbatファイルの生成オプション
pt_br: Opções criação Makefile e Batchfile

source: Makefile/make.bat uses (or not use) make-mode. Default is use.
ja: Makefile/make.bat の形式でmake-modeを利用します(または使いません)。デフォルトではmake-modeを使います。
pt_br: Makefile/make.bat usa (ou não usa) make-mode. Padrão é usar.

source: make-mode is default.
pt_br: make-mode é padrão.

source: Create (or not create) makefile.
ja: makefileの作成 (もしくは非作成)
pt_br: Criar (ou não criar) makefile

source: Create (or not create) batchfile
ja: batファイルの作成 (もしくは非作成)
pt_br: Criar (ou não criar) batchfile

source: Add various options for sphinx-quickstart invocation.
ja: sphinx-quickstartに複数の起動オプションを追加。
pt_br: Adicionar várias opções para chamar sphinx-quickstart.

source: Project templating
ja: プロジェクトテンプレート
pt_br: Projeto Modelo

source: Template directory for template files. You can modify the templates of sphinx project files generated by quickstart. Following Jinja2 template files are allowed:
pt_br: Diretório modelo para arquivos modelo. Pode ser modificado os arquivos modelo do projeto sphinx gerados por quickstart. Seguindo modelo arquivos Jinja2 é possível:

source: In detail, please refer the system template files Sphinx provides. (sphinx/templates/quickstart)
pt_br: Para detalhes, consulte sistema de arquivos modelo que o Sphinx fornece. (sphinx/templates/quickstart)

source: Define a template variable
pt_br: Definir variável no modelo

source: Project templating options for sphinx-quickstart
pt_br: Opções de projeto modelo para sphinx-quickstart

source: Invocation of sphinx-build
ja: sphinx-buildの起動
pt_br: Chamar o sphinx-build

source: The :program:`sphinx-build` script builds a Sphinx documentation set. It is called like this:
ja: Sphinxのドキュメント群を生成するのは、 :program:`sphinx-build` というプログラムです。これは次のように実行します:
pt_br: O script :program:`sphinx-build` constrói conjunto de documentação Sphinx. Pode ser chamado dessa maneira::

source: where *sourcedir* is the :term:`source directory`, and *builddir* is the directory in which you want to place the built documentation. Most of the time, you don't need to specify any *filenames*.
ja: *sourcedir* には :term:`ソースディレクトリ` が、 *builddir* にはビルドしたドキュメントを置きたいディレクトリを指定します。ほとんどの場合、 *ファイル名* は指定する必要はありません。
pt_br: onde *sourcedir* é o :term:`source directory`, *builddir* é o diretório no qual será construída a documentação. Na maioria das vezes, não será necessário especificar nenhum *filenames*.

source: The :program:`sphinx-build` script has several options:
ja: :program:`sphinx-build` スクリプトは次のようなオプションを持っています:
pt_br: O programa :program:`sphinx-build` tem várias opções:

source: The most important option: it selects a builder. The most common builders are:
ja: ビルダーを選択する、もっとも重要なオプションです。一般的に使用されるビルダーには次のような物があります。
pt_br: A opção mais importante: ela seleciona o construtor. Os mais comuns são:

source: Build HTML pages. This is the default builder.
ja: HTMLページをビルドします。デフォルトのビルダーです。
pt_br: Constrói páginas HTML. Esse é o construtor padrão.

source: Build HTML pages, but with a single directory per document. Makes for prettier URLs (no ``.html``) if served from a webserver.
ja: HTMLページをビルドしますが、ドキュメントごとにディレクトリが生成されます。ウェブサーバで提供する場合に、 ``.html`` がURLに付かないようにして、URLが分かりやすくなります。
pt_br: Constrói páginas HTML, mas em um simples diretório por documento. Torna simples URL (não há .html) quando servido de um webserver.

source: Build a single HTML with the whole content.
ja: すべてのコンテンツが含まれる、単一のHTMLを生成します。
pt_br: Constrói um único HTML com todo o conteúdo.

source: Build HTML files with additional information for building a documentation collection in one of these formats.
ja: フォーマットごとに、ドキュメントのコレクションを構築するのに必要な情報と一緒に、HTMLファイルにビルドします。
pt_br: Constrói arquivos HTML com informação adicional para construção de uma coleção em um ou mais formatos.

source: Build an Apple Help Book. Requires :program:`hiutil` and :program:`codesign`, which are not Open Source and presently only available on Mac OS X 10.6 and higher.
ja: Apple Help Bookを生成します。オープンソースではありませんが、Mac OS X 10.6以降でのみ使用できる :program:`hiutil` と :program:`codesign` が必要になります。
pt_br: Constrói um Apple Help Book. Requer :program:`hiutil` e o :program:`codesign`, os quais não são Open Source e atualmente estão disponíveis somente em Mac OS X 10.6 ou superior.

source: Build LaTeX sources that can be compiled to a PDF document using :program:`pdflatex`.
ja: :program:`pdflatex` を使用して、PDFドキュメントにコンパイルできるような、LaTeXのソースにビルドします。
pt_br: Constrói fontes LaTeX que serão compilados em um documento PDF usando o :program:`pdflatex`.

source: Build manual pages in groff format for UNIX systems.
ja: UNIX系システムで利用される、groffフォーマットのmanページをビルドします。
pt_br: Constrói páginas do manual no formato groff para sistemas UNIX.

source: Build Texinfo files that can be processed into Info files using :program:`makeinfo`.
ja: :program:`makeinfo` を使ってInfoファイルを生成するための、Texinfoファイルにビルドします。
pt_br: Constrói arquivos Texinfo que podem ser processados em arquivos Info usando :program:`makeinfo`.

source: Build plain text files.
ja: プレーンテキストファイルをビルドします。
pt_br: Constrói arquivos texto puro.

source: Build gettext-style message catalogs (``.pot`` files).
ja: gettextスタイルのメッセージカタログ(``.pot`` ファイル)にビルドします。
pt_br: Constrói catalogo de mensagens tipo gettext (arquivos ``.pot``).

source: Run all doctests in the documentation, if the :mod:`~sphinx.ext.doctest` extension is enabled.
ja: もしも :mod:`~sphinx.ext.doctest` 拡張が有効になっている場合には、ドキュメント内のすべてのdoctestを実行します。
pt_br: Executa todos doctests na documentação, se a extensão :mod:`~sphinx.ext.doctest` estiver habilitada

source: Check the integrity of all external links.
ja: すべての外部リンク先が存在しているか確認をします。
pt_br: Verifica a integridade dos links externos.

source: Build Docutils-native XML files.
ja: Docutilsが生成するXMLファイルをそのまま出力します。
pt_br: Constrói arquivos XML nativos Docutils.

source: Build compact pretty-printed "pseudo-XML" files displaying the internal structure of the intermediate document trees.
ja: コンパクトな整形された"pseudo-XML"を出力します。これは中間ドキュメントツリーの内部構造です。
pt_br: Constrói versão compacta dos arquivos "pseudo-XML" exibindo a estrutura interna intermediária do documento.

source: See :ref:`builders` for a list of all builders shipped with Sphinx. Extensions can add their own builders.
ja: Sphinxと一緒に提供されている、すべてのビルダーのリストは :ref:`builders` を参照してください。また、新しいビルダーを追加する拡張機能もあります。
pt_br: Ver :ref:`builders` para uma lista de todos construtores disponíveis com o Sphinx. Extensões podem adicionar seus próprios construtores.

source: If given, always write all output files. The default is to only write output files for new and changed source files. (This may not apply to all builders.)
ja: もしこのオプションが設定されると、すべての出力ファイルを書き出します。デフォルトでは新規に作成されたり、変更のあったソースファイルに関連する出力ファイルだけを出力します。このオプションはすべてのビルダーに適応するわけではありません。
pt_br: Se Informato, sempre grava todos arquivos de saída. O padrão é gravar somente arquivos de saída, que tiveram os fontes novos ou modificados (Isso pode não aplicar-se a todos construtores).

source: Don't use a saved :term:`environment` (the structure caching all cross-references), but rebuild it completely. The default is to only read and parse source files that are new or have changed since the last run.
ja: 保存されている :term:`環境` を使用しないで、完全に再構築する場合に利用します。環境にはクロスリファレンスの構造を保持しています。デフォルトでは新規に作成されたり、最後に実行してから変更のあったソースファイルだけを読み込んで、パースします。
pt_br: Não usar :term:`environment` salvo (a estrutura faz cache das ref. cruzadas), mas reconstruir completamente. O padrão é só ler e fazer parse dos arquivos fonte que forem novos ou foram atualizados desde a última execução.

source: Define the tag *tag*. This is relevant for :rst:dir:`only` directives that only include their content if this tag is set.
ja: *tag* というタグを定義します。これは、タグが設定されているときにだけ内容を取り込むという、 :rst:dir:`only` ディレクティブと関係があります。
pt_br: Definir o rótulo *tag*. Isso é relevante para diretivas :rst:dir:`only` que incluem somente seu conteúdo se esse rótulo é definido.

source: Since Sphinx has to read and parse all source files before it can write an output file, the parsed source files are cached as "doctree pickles". Normally, these files are put in a directory called :file:`.doctrees` under the build directory; with this option you can select a different cache directory (the doctrees can be shared between all builders).
ja: Sphinxは出力ファイルが書き込むことが可能になる前に、すべてのソースファイルを読み込むため、パースされたソースファイルは "doctree pickles"と呼ばれるディレクトリにキャッシュされます。通常は、これらのファイルはビルドディレクトリの下の :file:`.doctrees` と呼ばれるディレクトリに置かれます。このオプションを指定すると、キャッシュディレクトリを違う場所に設定できます。doctreeはすべてのビルダーで共有されます。
pt_br: Sphinx leu e fez parse de todos fontes antes de gravar saída nos arquivos, esses arquivos fontes são mantidos em cache como "doctree pickles". Normalmente, esses arquivos são gravados em um diretório chamado :file:`.doctrees` sob o diretório onde está sendo feito o build; com essa opção pode ser selecionado um diretório cache diferente (doctrees podem ser compartilhados entre vários construtores).

source: Distribute the build over *N* processes in parallel, to make building on multiprocessor machines more effective. Note that not all parts and not all builders of Sphinx can be parallelized.
ja: ビルドを *N* 個のプロセスで並列実行します。複数のCPUを搭載したコンピュータでより効率的にビルド出来るようになります。ただし、Sphinxの全てのビルダー・部分が並列実行されるわけではない事に注意して下さい。
pt_br: Distribuir sobre o build *N* processos em paralelo, para usar máquinas com múltiplos processadores mais efetivamente. Nota que nem todas as partes nem todos construtores do Sphinx podem ser executados em paralelo.

source: This option should be considered *experimental*.
ja: このオプションが *実験的* な機能であることに注意して下さい。
pt_br: Opção considerada *experimental*.

source: Don't look for the :file:`conf.py` in the source directory, but use the given configuration directory instead. Note that various other files and paths given by configuration values are expected to be relative to the configuration directory, so they will have to be present at this location too.
ja: ソースディレクトリ以下の :file:`conf.py` ではなく、オプションで指定されたコンフィグレーションディレクトリ以下の設定ファイルを利用するようにします。ただし、さまざまな他のファイル、パスなど、設定値で与えられたものに関しては、コンフィグレーションディレクトリからの相対パスで探索されることになるため、その状況になってもファイルがきちんと読めるようにしておく必要があります。
pt_br: Não procure pelo :file:`conf.py` no diretório fonte, mas use o diretório informado na configuração. Note que outros arquivos e caminhos obtidos pelos valores da configuração são esperados como relativos ao diretório da configuração, portanto também devem estar presentes nessa localização.

source: Don't look for a configuration file; only take options via the ``-D`` option.
ja: コンフィグファイルを無視します。設定は ``-D`` オプションを使って指定します。
pt_br: Não usar arquivo de configuração; obter opções via opção ``-D`` .

source: Override a configuration value set in the :file:`conf.py` file. The value must be a number, string, list or dictionary value.
ja: :file:`conf.py` ファイルで設定されたコンフィグを上書きします。この値は数値、文字列、リスト、もしくはディクショナリ型である必要があります。
pt_br: Sobrepôr valor da configuração definido no arquivo :file:`conf.py`. O valor deve ser número, string, lista ou dicionário.

source: For lists, you can separate elements with a comma like this: ``-D html_theme_path=path1,path2``.
ja: リストについては、コンマ区切りで次のように要素を分けることができます: ``-D html_theme_path=path1,path2``.
pt_br: Para listas, pode separar os elementos por vírgulas como esse: ``-D html_tema_caminho=caminho1,caminho2``.

source: For dictionary values, supply the setting name and key like this: ``-D latex_elements.docclass=scrartcl``.
ja: ディクショナリ型の値については、名前とキーを次のように与えます: ``-D latex_elements.docclass=scrartcl``.
pt_br: Para valores dicionário, forneça o nome opção e a chave como ``-D latex_elements.docclass=scrartcl``.

source: For boolean values, use ``0`` or ``1`` as the value.
ja: boolean型の値には、 ``0`` もしくは ``1`` を使って下さい。
pt_br: Para valores booleanos, use ``0`` ou ``1`` como valor.

source: The value can now be a dictionary value.
ja: 値に辞書型を指定出来るようになりました。
pt_br: O valor pode ser um valor de dicionário.

source: The value can now also be a list value.
ja: 値にリスト型を指定出来るようになりました。
pt_br: O valor pode ser um valor de lista.

source: Make the *name* assigned to *value* in the HTML templates.
ja: HTMLテンプレートの中の *name* を *value* に設定します。
pt_br: Tornar o *name* assinalado para *value* nos modelos HTML.

source: Run in nit-picky mode. Currently, this generates warnings for all missing references. See the config value :confval:`nitpick_ignore` for a way to exclude some references as "known missing".
ja: エラーチェックが厳格なモードで実行されます。現在では、すべての見つからない参照に対して警告を生成するような実装になっています。 :confval:`nitpick_ignore` は警告する必要の無いものを除外する設定です。
pt_br: Executar no modo nit-picky. Atualmente, isso gera avisos para todas as referências inexistentes. Ver valor config :confval:`nitpick_ignore` para não exibir referências conhecidas como "inexistentes conhecidos".

source: Do not emit colored output.
ja: カラー出力をしません。
pt_br: Não emitir saída colorida.

source: Increase verbosity (loglevel). This option can be given up to three times to get more debug logging output. It implies :option:`-T`.
ja: 表示の詳細度合い(ログレベル)を上げます。三回まで繰り返すことにより、ログ出力の詳細度合いが上がります。このオプションは暗黙のうちに :option:`-T` を指定します。
pt_br: Incrementar verborragia (loglevel). Essa opção pode ser dada até três vezes mais para maior detalhe de log na saída. Isso implica :option:`-T`.

source: Do not output anything on standard output, only write warnings and errors to standard error.
ja: 標準出力に何も出力しないようになります。警告やエラーのみが標準エラー出力に書き出されます。
pt_br: Não emitir saída nenhuma na saída padrão, só gravar avisos de erros na saída padrão de erros.

source: Do not output anything on standard output, also suppress warnings. Only errors are written to standard error.
ja: 標準出力に何も出力しないようになります。警告も抑制されます。エラーのみが標準エラー出力に書き出されます。
pt_br: Não emitir nenhuma saída na saída padrão, também suprimir avisos. Só erros serão exibidos na saída padrão de erros.

source: Write warnings (and errors) to the given file, in addition to standard error.
ja: 警告とエラーを指定されたファイルに書き出されます。なお、標準エラー出力にも同時に出力されます。
pt_br: Gravar avisos (e erros) para um determinado arquivo, em adição à saída de erro padrão.

source: Turn warnings into errors. This means that the build stops at the first warning and ``sphinx-build`` exits with exit status 1.
ja: 警告をエラーにします。最初の警告でビルドが中断され、 ``sphinx-build`` が終了値1を返すようになります。
pt_br: Tornar avisos em erros. Isso significa que a construção irá ser interrompida ao primeiro aviso e ``sphinx-build`` irá terminar e sair com situação (status) 1.

source: Display the full traceback when an unhandled exception occurs. Otherwise, only a summary is displayed and the traceback information is saved to a file for further analysis.
ja: 捕捉されない例外が発生した時、完全なトレースバックを表示します。このオプションがない場合、要約だけが表示され、トレースバックの情報は今後の解析のためにファイルとして保存されます。
pt_br: Exibir rastreabilidade completa quando uma exceção não tratada ocorrer. Caso contrário, só um resumo será exibido e a informação do rastreamento será salva em arquivo para análise posterior.

source: (Useful for debugging only.) Run the Python debugger, :mod:`pdb`, if an unhandled exception occurs while building.
ja: (Sphinx自体のデバッグをする人用) キャッチされない例外がビルド中に発生したら、Pythonデバッガの :mod:`pdb` を実行します。
pt_br: (Útil só para depuração). Executar debug Python, :mod:`pdb`, se excessão não tratada ocorrer enquanto constrói.

source: You can also give one or more filenames on the command line after the source and build directories. Sphinx will then try to build only these output files (and their dependencies).
ja: ソースディレクトリやビルドディレクトリの後ろにファイル名を1つ以上追加できます。追加すると、指定されたファイルと、その依存ファイルだけをビルドしようとします。
pt_br: Pode ser informado um ou mais arquivos na linha de comando após diretórios fonte e de construção. Sphinx irá tentar executar só esses arquivos de saída (e suas dependências).

source: Makefile options
ja: Makefileオプション
pt_br: Opções makefile

source: The :file:`Makefile` and :file:`make.bat` files created by :program:`sphinx-quickstart` usually run :program:`sphinx-build` only with the :option:`-b` and :option:`-d` options. However, they support the following variables to customize behavior:
ja: :program:`sphinx-quickstart` によって作成された :file:`Makefile` と :file:`make.bat` は通常、 :program:`sphinx-build` を :option:`-b` および :option:`-d` オプションだけで実行します。しかし、次のような変数を設定することで、動作をカスタマイズできます。
pt_br: Os arquivos :file:`Makefile` e :file:`make.bat` criados pelo :program:`sphinx-quickstart` normalmente executar :program:`sphinx-build` só com a opção :option:`-b` e :option:`-d`. Contudo suportam as seguintes variáveis para personalizar o comportamento:

source: The value for :confval:`latex_paper_size`.
ja: :confval:`latex_paper_size` です。
pt_br: O valor para :confval:`latex_paper_size`.

source: The command to use instead of ``sphinx-build``.
ja: ``sphinx-build`` の代わりに用いるコマンドです。
pt_br: O comando para usar em vez de ``sphinx-build``.

source: The build directory to use instead of the one chosen in :program:`sphinx-quickstart`.
ja: :program:`sphinx-quickstart` で選択した以外のビルドディレクトリを使用します。
pt_br: O diretório onde será construído em vez de um escolhido pelo :program:`sphinx-quickstart`.

source: Additional options for :program:`sphinx-build`.
ja: :program:`sphinx-build` に設定する追加オプションです。
pt_br: Opções adicionais para :program:`sphinx-build`.

source: Deprecation Warnings
pt_br: Avisos de Obsoleto

source: If any deprecation warning like ``RemovedInSphinxXXXWarning`` are displayed when building a user's document, some Sphinx extension is using deprecated features. In that case, please report it to author of the extension.
pt_br: Se qualquer aviso como ``RemovedInSphinxXXXWarning`` for exibido quando for construir o documento, e algumas extensões Sphinx estiverem referenciando funcionalidades tornadas obsoletas. Nesse caso favor entrar em contato com o autor da extensão.

source: To disable the deprecation warnings, please set ``PYTHONWARNINGS=`` environment variable to your environment. For example:
pt_br: Para desabilitar avisos de obsoleto, favor ver variável de ambiente ``PYTHONWARNINGS=``. Por exemplo:

source: ``export PYTHONWARNINGS=`` and do ``make html`` (Linux/Mac)
ja: ``export PYTHONWARNINGS=`` として、 ``make html`` を実行する(Linux/Mac)
pt_br: ``export PYTHONWARNINGS=`` e executar ``make html`` (Linux/Mac)

source: ``set PYTHONWARNINGS=`` and do ``make html`` (Windows)
ja: ``set PYTHONWARNINGS=`` として ``make html``を実行する(Windows)
pt_br: ``set PYTHONWARNINGS=`` e executar ``make html`` (Windows)

source: modify your Makefile/make.bat and set the environment variable
pt_br: modificar seu Makefile/make.bat e a variável de ambiente

source: Invocation of sphinx-apidoc
ja: sphinx-apidocの起動
pt_br: Chamada do sphinx-apidoc

source: The :program:`sphinx-apidoc` generates completely automatic API documentation for a Python package. It is called like this:
ja: :program:`sphinx-apidoc` は完全に自動でPythonパッケージ用のAPIを生成します。これは次のように実行します:
pt_br: O :program:`sphinx-apidoc` gera documentação completamente automática para o pacote da API Python. Pode ser chamado assim::
