Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/invocation.po
Languages: ja, pt_br

source: where *packagedir* is the path to the package to document, and *outputdir* is the directory where the generated sources are placed. Any *pathnames* given are paths to be excluded ignored during generation.
ja: *packagedir* はドキュメント化したいパッケージのパス、 *outputdir* は生成されたソースが置かれる場所です。 *pathnames* は生成中に無視されるパスです。
pt_br: onde *packagedir* é o caminho para o pacote do documento e *outputdir* é o diretório onde os fontes gerados serão gravados. Qualquer *pathnames* dados são caminhos que serão ignorados durante a geração.

source: ``sphinx-apidoc`` generates reST files that use :mod:`sphinx.ext.autodoc` to document all found modules. If any modules have side effects on import, these will be executed by ``autodoc`` when ``sphinx-build`` is run.
ja: ``sphinx-apidoc`` はreSTファイルを生成し、 :mod:`sphinx.ext.autodoc` を使って、見つけた全てのモジュールをドキュメント化します。もしインポートによる副作用があれば、 ``sphinx-build`` が実行されるとき ``autodoc`` により実行されます。
pt_br: Arquivos ``sphinx-apidoc`` reST são usados no :mod:`sphinx.ext.autodoc` para documentar todos os módulos encontrados. Se algum módulo tiver efeitos colaterais na importação, esses módulos serão executados pelo ``autodoc`` quando ``sphinx-build`` for executado.

source: If you document scripts (as opposed to library modules), make sure their main routine is protected by a ``if __name__ == '__main__'`` condition.
ja: もしあなたが (ライブラリモジュールではなく) スクリプトをドキュメント化したいのであれば、スクリプトのメインルーチンが ``if __name__ == '__main__'`` 条件により保護されていることを確認して下さい。
pt_br: Se os scripts do seu documento, (diferentemente de módulos de biblioteca), certificar-se que suas rotinas main estejam protegidas por um ``if __name__ == '__main__'`` condição.

source: The :program:`sphinx-apidoc` script has several options:
ja: :program:`sphinx-apidoc` スクリプトは次のようなオプションを持っています:
pt_br: O script :program:`sphinx-apidoc` tem várias opções:

source: Gives the directory in which to place the generated output.
ja: ファイルを生成するディレクトリを指定します。
pt_br: Define o diretório no qual será gravad a saída gerada.

source: Normally, sphinx-apidoc does not overwrite any files. Use this option to force the overwrite of all files that it generates.
ja: 通常はsphinx-apidocはどんなファイルも上書きしません。このオプションを指定すると上書きするようになります。
pt_br: Normalmente, sphinx-apidoc não sobrepõe quaisquer arquivos. Use essa opção para forçar a sobreposição de todos arquivos gerados.

source: With this option given, no files will be written at all.
ja: このオプションが与えられた場合は、いかなるファイルにも記述がなされません
pt_br: Com essa opção informada, nenhum arquivo será sobreposto.

source: This option selects the file name suffix of output files. By default, this is ``rst``.
ja: このオプションにより出力ファイルのファイル拡張子を選択します。デフォルトでは ``rst`` です。
pt_br: Essa opção seleciona o sufixo do nome do arquivo nos arquivos de saida. Por padrão usa ``rst``.

source: This sets the maximum depth of the table of contents, if one is generated.
ja: 目次を生成する最大の深さを設定します。
pt_br: Isso configura o máximo de níveis da tabela de conteúdo, se uma for gerada.

source: This option makes sphinx-apidoc follow symbolic links when recursing the filesystem to discover packages and modules. You may need it if you want to generate documentation from a source directory managed by `collective.recipe.omelette <https://pypi.python.org/pypi/collective.recipe.omelette/>`_. By default, symbolic links are skipped.
ja: パッケージとモジュールを探すためにファイルシステムを再帰的に辿りますが、このオプションにより sphinx-apidoc はシンボリックも辿るようになります。 `collective.recipe.omelette <https://pypi.python.org/pypi/collective.recipe.omelette/>`_ を使ったソースディレクトリからドキュメントを生成する場合に必要になります。デフォルトではシンボリックリンクは無視されます。
pt_br: Essa opção faz sphinx-apidoc seguir links simbólicos quando o sistema de arquivo usar recurso recursivo para descobrir pacotes e módulos. Pode haver escolha para gerar documentação de uma fonte de documentação gerenciada por `collective.recipe.omelette <https://pypi.python.org/pypi/collective.recipe.omelette/>`_. Por padrão links simbólicos são desprezados.

source: This prevents the generation of a table-of-contents file ``modules.rst``. This has no effect when :option:`--full` is given.
ja: このオプションをつけるとTOCファイルの ``modules.rst`` を生成しません。ただし、 :option:`--full` オプションが渡された場合には無効となり生成されます。
pt_br: Isso previne a geração de tabela-de-conteúdo arquivo ``modules.rst``. Não há efeito quando a opção :option:`--full` é usada.

source: This option makes sphinx-apidoc create a full Sphinx project, using the same mechanism as :program:`sphinx-quickstart`. Most configuration values are set to default values, but you can influence the most important ones using the following options.
ja: このオプションをつけると sphinx-apidoc は :program:`sphinx-quickstart` と同じように完全なSphinxプロジェクトを生成します。ほとんどの設定値はデフォルトに設定されますが、以下のオプションを使って最も重要な値を自分で設定出来ます。
pt_br: Essa opção faz sphinx-apidoc criar um projeto Sphinx completo, usando o mesmo mecanismo de :program:`sphinx-quickstart`. A maioria dos valores de configuração definidos para valores padrões, mas podem ser modificados os mais importantes usando as seguintes opções.

source: By default sphinx-apidoc processes sys.path searching for modules only. Python 3.3 introduced :pep:`420` implicit namespaces that allow module path structures such as ``foo/bar/module.py`` or ``foo/bar/baz/__init__.py`` (notice that ``bar`` and ``foo`` are namespaces, not modules).
pt_br: Por padrão, sphinx-apidoc processa busca sys.path para módulos. Python 3.3 introduziu :pep:`420` namespaces implicitos que permitem path e estruturas de módulos como ``foo/bar/module.py`` ou ``foo/bar/baz/__init__.py`` (perceba que ``bar`` e ``foo`` são namespaces, não modulos).

source: Specifying this option interprets paths recursively according to PEP-0420.
pt_br: Especificações dessa opção interpretam paths recursivamente de acordo com PEP-0420.

source: This option makes sphinx-apidoc put module documentation before submodule documentation.
ja: このオプションはサブモジュールドキュメンテーションの前にsphinx-apidocがモジュールドキュメンテーションを行うようにします。
pt_br: Essa opção faz sphinx-apidoc colocar documentação dos módulos antes da documentação dos submódulos.

source: Append module_path to sys.path.
pt_br: Anexa ao final module_path em sys.path.

source: Sets the project name to put in generated files (see :confval:`project`).
ja: 生成したファイルに含めるプロジェクト名を指定します ( :confval:`project` も参照)。
pt_br: Configura o nome do projeto para ser gravado nos arquivos gerados (ver :confval:`project`).

source: Sets the author name(s) to put in generated files (see :confval:`copyright`).
ja: 生成したファイルに含める著者名を指定します ( :confval:`copyright` も参照)。
pt_br: Configura nome(s) do autor(es) para gerar arquivos (ver :confval:`copyright`).

source: Sets the project version to put in generated files (see :confval:`version`).
ja: 生成したファイルに含めるプロジェクトのバージョンを指定します ( :confval:`version` も参照)。
pt_br: Configura versão do projeto a ser colocada nos arquivos gerados (ver :confval:`version`).

source: Sets the project release to put in generated files (see :confval:`release`).
ja: 生成したファイルに含めるプロジェクトのリリースを指定します ( :confval:`release` も参照)。
pt_br: Define o nome do release do projeto para ser colocado nos arquivos gerados (ver :confval:`release`).
