Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/sphinx.po
Languages: ja, pl_pl, zh_cn

source: Overview
ja: 概要
pl_pl: Przegląd
zh_cn: 概述

source: Welcome
ja: ようこそ!
pl_pl: Witamy
zh_cn: 欢迎

source: What users say:
ja: ユーザの声:
pl_pl: Co mówią użytkownicy:
zh_cn: 用户评论：

source: &#8220;Cheers for a great tool that actually makes programmers <b>want</b> to write documentation!&#8220;
ja: &#8220;プログラマーにドキュメントを本当に書きたくさせる、優れたツールを応援しましょう！&#8220;
pl_pl: „Wiwat dla wspaniałego narzędzia, które w zasadzie sprawia, że programiści <b>chcą</b> pisać dokumentację!”
zh_cn: “欢呼！这个伟大的工具让程序员<b>愿意</b>去写文档了！”

source: Sphinx is a tool that makes it easy to create intelligent and beautiful documentation, written by Georg Brandl and licensed under the BSD license.
ja: Sphinxは知的で美しいドキュメントを簡単に作れるようにするツールです。Georg Brandlによって開発され、BSDライセンスのもとで公開されています。
pl_pl: Sphinx jest narzędziem, które pozwala w prosty sposób tworzyć inteligentną i piękną dokumentację, napisanym przez Georga Brandla i udostępnianym na licencji BSD.
zh_cn: Sphinx 是一个文档创建工具，它可以方便地创建智能而美观的文档，作者是 Georg Brandl，发布的协议是BSD协议。

source: It was originally created for <a href="https://docs.python.org/">the Python documentation</a>, and it has excellent facilities for the documentation of software projects in a range of languages. Of course, this site is also created from reStructuredText sources using Sphinx! The following features should be highlighted:
ja: このツールはもともと、<a href="https://docs.python.org/">Python のドキュメンテーション</a>用に作られました、今では幅広い言語のプロジェクトでドキュメント作成を容易にするツールとして利用されています。もちろん、このサイトもreStructuredText からSphinxで作成されています! 次に特徴を紹介します:
pl_pl: Pierwotnie zostało stworzone dla <a href="https://docs.python.org/">dokumentacji Pythona</a> i jest doskonale wyposażone dla dokumentacji projektów oprogramowania w wielu językach. Oczywiście ta strona jest również stworzona ze źródeł reStructuredText przy użyciu Sphinksa! Następujące cechy powinny zostać wyróżnione:
zh_cn: 本项目最初是为了制作和维护<a href="https://docs.python.org/">Python官方文档</a>，它对各种软件文档的支持都非常棒。当然，本网站也是使用 reStructuredText 源码写成，并使用 Sphinx 生成的！ 它具有以下特色：

source: <b>Output formats:</b> HTML (including Windows HTML Help), LaTeX (for printable PDF versions), ePub, Texinfo, manual pages, plain text
ja: <b>出力形式:</b> HTML (WIndowsのHTMLヘルプを含む)、LaTeX(印刷可能なPDFバージョン)、ePub、Texinfo、man、プレーンテキスト
pl_pl: <b>Formaty wyjściowe:</b> HTML (włączając Windows HTML Help), LaTeX (dla wersji PDF do druku), ePub, Texinfo, strony manuala, czysty tekst
zh_cn: <b>输出格式：</b>HTML（包括 Windows HTML 帮助文件），LaTeX（用于生成可打印的PDF文档），ePub，Texinfo，manpages，纯文本格式

source: <b>Extensive cross-references:</b> semantic markup and automatic links for functions, classes, citations, glossary terms and similar pieces of information
ja: <b>多岐にわたる相互参照:</b> 意味のマークアップと、関数、クラス、引用、用語解説、似たような情報に対する自動リンク
pl_pl: <b>Kompleksowe mechanizmy odniesień:</b> semantyczna składnia i automatyczne linki do funkcji, klas, cytatów, terminów słownika i podobnych części informacji
zh_cn: 交叉引用：对函数、类、引用、词汇表，以及类似的内容提供语义标记并自动建立链接

source: <b>Hierarchical structure:</b> easy definition of a document tree, with automatic links to siblings, parents and children
ja: <b>階層構造:</b> 簡単にドキュメントツリーを定義でき、兄弟、親、子供のドキュメントに対してリンクが貼れます
pl_pl: <b>Hierarchiczna struktura:</b> łatwa definicja drzewa dokumentu, z automatycznymi linkami do rodzeństwa, rodziców i dzieci
zh_cn: <b>组织结构：</b>易于上手的文档树结构，自动链接到当前级别、上级、下级的其他内容

source: <b>Automatic indices:</b> general index as well as a language-specific module indices
ja: <b>自動インデックス作成:</b> 全体インデックスと、言語特有のモジュールインデックス
pl_pl: <b>Automatyczne indeksy:</b> indeks ogólny jak również specyficzne dla języka indeksy modułów
zh_cn: <b>建立索引：</b>文档目录，以及针对特定语言的模块索引

source: <b>Code handling:</b> automatic highlighting using the <a href="http://pygments.org">Pygments</a> highlighter
ja: <b>ソースコードの対応:</b> <a href="http://pygments.org">Pygments</a>を使った自動ハイライト
pl_pl: <b>Obsługa kodu:</b> automatyczne podświetlanie pisowni przy użyciu <a href="http://pygments.org">Pygments</a>
zh_cn: <b>代码样式：</b>使用 <a href="http://pygments.org">Pygments</a> 自动高亮代码

source: <b>Extensions:</b> automatic testing of code snippets, inclusion of docstrings from Python modules (API docs), and <a href="%(path)s#builtin-sphinx-extensions">more</a>
ja: <b>拡張:</b> コードスニペットを使った自動テスト, Pythonモジュールのdocstringのインクルード(APIドキュメント作成), <a href="%(path)s#builtin-sphinx-extensions">他には</a>
pl_pl: <b>Rozszerzenia:</b> automatyczne testy fragmentów kodu, zaciąganie docstringów z modułów Pythona (docs API) i <a href="%(path)s#builtin-sphinx-extensions">jeszcze więcej</a>
zh_cn: <b>扩展功能：</b>自动测试代码片断，引入其他 Python 模块 API 文档中的 docstring，以及<a href="%(path)s#builtin-sphinx-extensions">更多内容</a>

source: <b>Contributed extensions:</b> dozens of extensions <a href="%(path)s#third-party-extensions">contributed by users</a>; most of them installable from PyPI
zh_cn: <b>用户扩展：</b> 数十个<a href="%(path)s#third-party-extensions">由用户贡献的扩展</a>；其中大部分都可以从 PyPI 安装

source: Sphinx uses <a href="http://docutils.sourceforge.net/rst.html">reStructuredText</a> as its markup language, and many of its strengths come from the power and straightforwardness of reStructuredText and its parsing and translating suite, the <a href="http://docutils.sourceforge.net/">Docutils</a>.
ja: Sphinxは<a href="http://docutils.sourceforge.net/rst.html">reStructuredText</a>をマークアップ言語として使用しています。Sphinxの強さの多くの部分はreStructuredTextと、そのパース、変換プログラム群である、<a href="http://docutils.sourceforge.net/">Docutils</a>からきています。
pl_pl: Sphinx używa składni <a href="http://docutils.sourceforge.net/rst.html">reStructuredText</a> i wiele jego mocnych stron pochodzi z siły oraz bezpośredniości reStructuredText i jego zestawu narzędzi parsowania oraz tłumaczenia, <a href="http://docutils.sourceforge.net/">Docutils</a>.
zh_cn: Sphinx 使用 <a href="http://docutils.sourceforge.net/rst.html">reStructuredText</a> 作为标记语言，很多强大的功能都直接来自于 reStructuredText，以及它使用的编译工具包，<a href="http://docutils.sourceforge.net/">Docutils</a>。

source: Documentation
ja: ドキュメント
pl_pl: Dokumentacja
zh_cn: 文档

source: First steps with Sphinx
ja: Sphinx最初の一歩
pl_pl: Pierwsze kroki ze Sphinksem
zh_cn: 使用 Sphinx 的第一步

source: overview of basic tasks
ja: 基本的なタスクの概要紹介
pl_pl: przegląd podstawowych poleceń
zh_cn: 基本任务概览

source: Search page
ja: 検索ページ
pl_pl: Strona wyszukiwania
zh_cn: 搜索页面

source: search the documentation
ja: ドキュメントの検索
pl_pl: przeszukaj dokumentację
zh_cn: 在文档中搜索

source: Contents
ja: 目次
pl_pl: Spis treści
zh_cn: 目录

source: for a complete overview
ja: すべてのドキュメントはこちら
pl_pl: dla pełnego przeglądu
zh_cn: 要查看完整的概览

source: General Index
ja: 全体インデックス
pl_pl: Indeks ogólny
zh_cn: 总目录

source: all functions, classes, terms
ja: すべての関数、クラス、用語
pl_pl: wszystkie funkcje, klasy, terminy
zh_cn: 所有函数，类及术语

source: Changes
ja: 変更点
pl_pl: Zmiany
zh_cn: 历史变更

source: release history
ja: リリース履歴
pl_pl: historia wydań
zh_cn: 版本历史

source: You can also download PDF/EPUB versions of the Sphinx documentation from pop up menu on lower right corner.
ja: Sphinx ドキュメンテーションのPDF/EPUB 版についても、右下のポップアップメニューからダウンロードすることができます。
zh_cn: 您也可以从右下角的弹出菜单下载 Sphinx 文档的 PDF/EPUB 版本。

source: Examples
ja: サンプル
pl_pl: Przykłady
zh_cn: 例子

source: Links to documentation generated with Sphinx can be found on the <a href="%(path)s">Projects using Sphinx</a> page.
ja: <a href="%(path)s">Sphinxを使用しているプロジェクト</a>のページから、Sphinxを使って生成されたドキュメントを見に行くことができます。
pl_pl: Linki do dokumentacji wygenerowanych przy pomocy Sphinksa można znaleźć na stronie <a href="%(path)s">Projekty używające Sphinksa</a>.
zh_cn: 使用 Sphinx 生成其文档的相关项目，可以在<a href="%(path)s">使用 Sphinx 的项目</a>页面查看。

source: For examples of how Sphinx source files look, use the &#8220;Show source&#8221; links on all pages of the documentation apart from this welcome page.
ja: サンプルのドキュメントのソースを見たければ、このトップページ以外のすべてのドキュメントのページにある、&#8220;Show source(ソースを表示)&#8221;のリンクをクリックしてみてください。
pl_pl: Aby obejrzeć przykłady jak wyglądają pliki źródłowe Sphinksa, używaj linków „Pokaż źródło” na wszystkich stronach dokumentacji poza tą stroną powitalną.
zh_cn: 要查看当前页面对应的 Sphinx 源文件，点击 &#8220;本页：显示源代码&#8221; 的链接即可，除了你现在看到的欢迎页面，其他页面都会显示这个链接。

source: You may also be interested in the very nice <a href="http://matplotlib.sourceforge.net/sampledoc/">tutorial</a> on how to create a customized documentation using Sphinx written by the matplotlib developers.
ja: また、matplotlibの開発者によって書かれた、Sphinxを使ったカスタマイズされたドキュメントの作り方に関する<a href="http://matplotlib.sourceforge.net/sampledoc/">チュートリアル</a>にも皆さんは関心を持たれるかもしれません。
pl_pl: Możesz być również zainteresowany bardzo fajnym <a href="http://matplotlib.sourceforge.net/sampledoc/">samouczkiem</a> dotyczącym tworzenia własnych dokumentacji przy użyciu Sphinksa, napisanym przez deweloperów matplotliba.
zh_cn: 你可能对 matplotlib 开发者编写的精致的<a href="http://matplotlib.sourceforge.net/sampledoc/">教程</a>感兴趣，它讲解了如何使用 Sphinx 编写定制化的文档。

source: There is a translation team in <a href="https://www.transifex.com/sphinx-doc/sphinx-doc/dashboard/">Transifex</a> of this documentation, thanks to the Sphinx document translators.
zh_cn: 这个文档在<a href="https://www.transifex.com/sphinx-doc/sphinx-doc/dashboard/">Transifex</a>上有一个翻译团队，感谢 sphinx 的文档翻译者。

source: A Japanese book about Sphinx has been published by O'Reilly: <a href="https://www.oreilly.co.jp/books/9784873116488/">Sphinxをはじめよう / Learning Sphinx</a>.
ja: Sphinxに関する日本語の本がO'Reillyより出版されました: <a href="https://www.oreilly.co.jp/books/9784873116488/">Sphinxをはじめよう/ Learning Sphinx</a>．
pl_pl: O'Reilly opublikowało japońską książkę o Sphinksie: <a href="https://www.oreilly.co.jp/books/9784873116488/">Sphinxをはじめよう / Learning Sphinx</a>.
zh_cn: 关于 sphinx 的一本日语书籍，由 O'Reilly 出版：<a href="https://www.oreilly.co.jp/books/9784873116488/">sphinxをはじめよう/Learning sphinx</a>。

source: In 2019 the second edition of a German book about Sphinx was published: <a href="https://literatur.hasecke.com/post/software-dokumentation-mit-sphinx/">Software-Dokumentation mit Sphinx</a>.
ja: 2019年にドイツ語によるSphinx本の第2版が出版されました: <a href="https://literatur.hasecke.com/post/software-dokumentation-mit-sphinx/">Software-Dokumentation mit Sphinx</a>.
zh_cn: 关于 sphinx 的一本德语书籍在 2019 年出版了第二版：<a href="https://literatur.hasecke.com/post/software-dokumentation-mit-sphinx/">Dokumentation mit Sphinx </a>。

source: Hosting
ja: ホスティング
zh_cn: 文档页面托管

source: Need a place to host your Sphinx docs? <a href="https://readthedocs.org/">readthedocs.org</a> hosts a lot of Sphinx docs already, and integrates well with projects' source control. It also features a powerful built-in search that exceeds the possibilities of Sphinx' JavaScript-based offline search.
ja: Sphinx ドキュメントをホストする場所が必要ですか? <a href="https://readthedocs.org/">readthedocs.org</a> は、すでに多くのSphinx ドキュメントをホストしていて、 プロジェクトのソース管理がうまく統合されています。また、このサイトの特長としては SphinxのJavaScriptベースによるオフライン検索機能を上回る、強力なビルトイン検索を有していることがあります。
pl_pl: Potrzebujesz miejsca na hosting twojej dokumentacji Sphinx? <a href="https://readthedocs.org/">readthedocs.org</a> hostuje już wiele dokumentacji Sphinksa i dobrze integruje się z kontrolą źródeł projektów. Ma również skuteczne wbudowane wyszukiwanie, lepsze od opartego na JavaScripcie wyszukiwania offline Sphinksa.
zh_cn: 需要一个网页空间展示你的 Sphinx 文档？ <a href="https://readthedocs.org/">readthedocs.org</a>网站上已经有大量的 Sphinx 制作的文档了，它可以很好地与源码管理软件配合起来工作。 这个网站不仅可以使用 Sphinx 生成的基于 JavaScript 的搜索，还另外支持更加强大的全文搜索。

source: Contributor Guide
ja: コントリビューターガイド
pl_pl: Przewodnik kontrybutora
zh_cn: 贡献指南

source: If you want to contribute to the project, this part of the documentation is for you.
ja: もしあなたがプロジェクトに貢献したい場合、この章はまさにあなたのためのものです。
pl_pl: Jeśli chcesz pomóc w rozwoju projektu, ta część dokumentacji jest dla ciebie.
zh_cn: 如果你想为这个项目做贡献，就应该阅读这部分文档。

source: <a href="%(path)s">Sphinx Contributors’s Guide</a></li>
zh_cn: <a href="%(path)s"> Sphinx贡献者指南 </a></li>

source: <a href="%(path)s">Sphinx Authors</a></li>
ja: <a href="%(path)s">Sphinx 作成者</a></li>
pl_pl: <a href="%(path)s">Autorzy Sphinksa</a></li>
zh_cn: <a href="%(path)s">Sphinx作者</a></li>

source: Code of Conduct
ja: 行動規範
zh_cn: 行为准则

source: Please adhere to our <a href="%(path)s">Code of Conduct</a>.
ja: 我々の<a href="%(path)s">行動規範</a>を遵守してください。
zh_cn: 请遵守我们的<a href="%(path)s">行为准则</a>。

source: project
pl_pl: projekt
zh_cn: 项目成员

source: Current version: <a href="https://pypi.org/project/Sphinx/" alt="PyPI"><img src="https://img.shields.io/pypi/v/sphinx.svg"></a>
ja: 現行のバージョン: <a href="https://pypi.org/project/Sphinx/" alt="PyPI"><img src="https://img.shields.io/pypi/v/sphinx.svg"></a>
zh_cn: 当前版本： <a href="https://pypi.org/project/Sphinx/" alt="PyPI"><img src="https://img.shields.io/pypi/v/sphinx.svg"></a>

source: Install Sphinx with:
ja: Sphinxのインストール:
zh_cn: 安装sphinx：

source: Questions? Suggestions?
ja: 疑問? 意見?
pl_pl: Pytania? Sugestie?
zh_cn: 疑问？建议？

source: Join the <a href="https://groups.google.com/group/sphinx-users">sphinx-users</a> mailing list on Google Groups:
ja: Google グループの <a href="https://groups.google.com/group/sphinx-users">sphinx-users</a> メーリングリストへの参加 :
pl_pl: Dołącz do listy mailingowej <a href="https://groups.google.com/group/sphinx-users">sphinx-users</a> na Google Groups:
zh_cn: 加入谷歌群组的<a href="https://groups.google.com/group/sphinx-users">spinx-users</a>邮件列表：

source: or come to the <tt>#sphinx-doc</tt> channel on FreeNode.
ja: もしくは、FreeNodeの<tt>#sphinx-doc</tt>チャンネルへどうぞ。
pl_pl: lub wejdź na kanał <tt>#sphinx-doc</tt> na FreeNode.
zh_cn: 或者来 FreeNode 网站的 <tt>#sphinx-doc</tt>频道找到我们。

source: You can also open an issue at the <a href="https://github.com/sphinx-doc/sphinx/issues">tracker</a>.
ja: 何か気づいたことがあれば、<a href="https://github.com/sphinx-doc/sphinx/issues">issue tracker</a>を使用して報告することもできます。
pl_pl: Możesz też otworzyć zgłoszenie w <a href="https://github.com/sphinx-doc/sphinx/issues">systemie zgłoszeń</a>.
zh_cn: 你也可以在<a href="https://github.com/sphinx-doc/sphinx/issues">GitHub Issue</a>打开新的话题。

source: <b>Contributed extensions:</b> more than 50 extensions <a href="%(path)s#extensions">contributed by users</a> in a second repository; most of them installable from PyPI
ja: <b>寄贈された拡張:</b> 50以上の拡張が <a href="%(path)s#extensions">ユーザによって寄贈されています</a>。 sphinx-contribリポジトリ内にあり、ほとんどの拡張はPyPIよりインストール可能
pl_pl: <b>Rozszerzenia użytkowników:</b> ponad 50 rozszerzeń <a href="%(path)s#extensions">stworzonych przez użytkowników</a> w drugim repozytorium; większość z nich można zainstalować z PyPI

source: There is a <a href="http://docs.sphinx-users.jp/">Japanese translation</a> of this documentation, thanks to the Japanese Sphinx user group.
ja: このドキュメントは<a href="http://docs.sphinx-users.jp/">日本語に翻訳</a>されています。日本のSphinxユーザグループのみなさん、ありがとう。

source: <a href="%(path)s">Sphinx Developer’s Guide</a></li>
ja: <a href="%(path)s">Sphinx開発者ガイド</a></li>
pl_pl: <a href="%(path)s">Przewodnik dewelopera Sphinksa</a></li>
