Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/changes/6.0.po
Languages: pt_br

source: Release 6.0.1 (released Jan 05, 2023)
pt_br: Versão 6.0.1 (lançada em 05 jan 2023)

source: Dependencies
pt_br: Dependências

source: Require Pygments 2.13 or later.
pt_br: Requer Pygments 2.13 ou posterior.

source: Bugs fixed
pt_br: Erros corrigidos

source: #10944: imgmath: Fix resolving image paths for files in nested folders.
pt_br: #10944: imgmath: Corrige resolução de caminhos de imagem para arquivos em pastas aninhadas.

source: Release 6.0.0 (released Dec 29, 2022)
pt_br: Versão 6.0.0 (lançada em 29 dez 2022)

source: #10468: Drop Python 3.6 support
pt_br: #10468: Descarta o suporte a Python 3.6

source: #10470: Drop Python 3.7, Docutils 0.14, Docutils 0.15, Docutils 0.16, and Docutils 0.17 support. Patch by Adam Turner
pt_br: #10470: Remove o suporte ao Python 3.7, Docutils 0.14, Docutils 0.15, Docutils 0.16 e Docutils 0.17. Patch de Adam Turner

source: Incompatible changes
pt_br: Atualizações incompatíveis

source: #7405: Removed the jQuery and underscore.js JavaScript frameworks.
pt_br: #7405: Removidas os frameworks JavaScript jQuery e underscore.js.

source: These frameworks are no longer be automatically injected into themes from Sphinx 6.0. If you develop a theme or extension that uses the ``jQuery``, ``$``, or ``$u`` global objects, you need to update your JavaScript to modern standards, or use the mitigation below.
pt_br: Esses frameworks não serão mais injetados automaticamente em temas do Sphinx 6.0. Se você desenvolver um tema ou extensão que use os objetos globais ``jQuery``, ``$`` ou ``$u``, você precisa atualizar seu JavaScript para padrões modernos ou usar a mitigação abaixo.

source: The first option is to use the sphinxcontrib.jquery_ extension, which has been developed by the Sphinx team and contributors. To use this, add ``sphinxcontrib.jquery`` to the ``extensions`` list in ``conf.py``, or call ``app.setup_extension("sphinxcontrib.jquery")`` if you develop a Sphinx theme or extension.
pt_br: A primeira opção é usar a extensão sphinxcontrib.jquery_, que foi desenvolvida pela equipe e contribuidores do Sphinx. Para usar isso, adicione ``sphinxcontrib.jquery`` à lista ``extensions`` em ``conf.py``, ou chame ``app.setup_extension("sphinxcontrib.jquery")`` se você desenvolver um tema ou extensão do Sphinx.

source: The second option is to manually ensure that the frameworks are present. To re-add jQuery and underscore.js, you will need to copy ``jquery.js`` and ``underscore.js`` from `the Sphinx repository`_ to your ``static`` directory, and add the following to your ``layout.html``:
pt_br: A segunda opção é garantir manualmente que os frameworks estejam presentes. Para adicionar novamente jQuery e underscore.js, você precisará copiar ``jquery.js`` e ``underscore.js`` do `repositório Sphinx`_ para seu diretório ``static`` e adicionar o seguinte ao seu ``layout.html``:

source: Patch by Adam Turner.
pt_br: Patch de Adam Turner.

source: #10471, #10565: Removed deprecated APIs scheduled for removal in Sphinx 6.0. See :ref:`dev-deprecated-apis` for details. Patch by Adam Turner.
pt_br: #10471, #10565: APIs descontinuadas removidas programadas para remoção no Sphinx 6.0. Veja :ref:`dev-deprecated-apis` para detalhes. Patch de Adam Turner.

source: #10901: C Domain: Remove support for parsing pre-v3 style type directives and roles. Also remove associated configuration variables ``c_allow_pre_v3`` and ``c_warn_on_allowed_pre_v3``. Patch by Adam Turner.
pt_br: #10901: Domínio C: Remove o suporte para análise de diretivas e papéis de tipo de estilo pré-v3. Remova também as variáveis ​​de configuração associadas ``c_allow_pre_v3`` e ``c_warn_on_allowed_pre_v3``. Patch de Adam Turner.

source: Features added
pt_br: Funcionalidades adicionadas

source: #10924: LaTeX: adopt better looking defaults for tables and code-blocks. See :confval:`latex_table_style` and the ``pre_border-radius`` and ``pre_background-TeXcolor`` :ref:`additionalcss` for the former defaults and how to re-enact them if desired.
pt_br: #10924: LaTeX: adota padrões de melhor aparência para tabelas e blocos de código. Veja :confval:`latex_table_style` e as :ref:`additionalcss` ``pre_border-radius`` e ``pre_background-TeXcolor`` para os padrões anteriores e como recriá-los, se desejado.

source: #10984: LaTeX: Document :confval:`latex_additional_files` behavior for files with ``.tex`` extension.
pt_br: #10984: LaTeX: Comportamento do documento :confval:`latex_additional_files` para arquivos com extensão ``.tex``.
