Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/changes/7.4.po
Languages: pt_br

source: Release 7.4.7 (released Jul 20, 2024)
pt_br: Versão 7.4.7 (lançada em 20 jul 2024)

source: Bugs fixed
pt_br: Erros corrigidos

source: #12096: Warn when files are overwritten in the build directory. Patch by Adam Turner and Bénédikt Tran.
pt_br: #12096: Avisa quando os arquivos são sobrescritos no diretório de construção. Patch de Adam Turner e Bénédikt Tran.

source: #12620: Ensure that old-style object description options are respected. Patch by Adam Turner.
pt_br: #12620: Certifica-se de que as opções de descrição do objeto no estilo antigo sejam respeitadas. Patch de Adam Turner.

source: #12601, #12625: Support callable objects in :py:class:`~typing.Annotated` type metadata in the Python domain. Patch by Adam Turner.
pt_br: #12601, #12625: Suporte a objetos chamáveis em metadados do tipo :py:class:`~typing.Annotated` no domínio Python. Patch de Adam Turner.

source: #12601, #12622: Resolve :py:class:`~typing.Annotated` warnings with ``sphinx.ext.autodoc``, especially when using :mod:`dataclasses` as type metadata. Patch by Adam Turner.
pt_br: #12601, #12622: Resolve avisos :py:class:`~typing.Annotated` com ``sphinx.ext.autodoc``, especialmente ao usar :mod:`dataclasses` como metadados de tipo. Patch de Adam Turner.

source: #12589, #12626: autosummary: Fix warnings with :rst:role:`!autolink`. Patch by Adam Turner.
pt_br: #12589, #12626: autosummary: Corrige avisos com :rst:role:`!autolink`. Patch de Adam Turner.

source: Release 7.4.6 (released Jul 18, 2024)
pt_br: Versão 7.4.6 (lançada em 18 jul 2024)

source: #12589, #9743, #12609: autosummary: Do not add the package prefix when generating autosummary directives for modules within a package. Patch by Adam Turner.
pt_br: #12589, #9743, #12609: autosummary: Não adiciona o prefixo do pacote ao gerar diretivas de autosummary para módulos dentro de um pacote. Patch de Adam Turner.

source: #12613: Reduce log severity for ambiguity detection during inventory loading. Patch by James Addison.
pt_br: #12613: Reduz a gravidade do log para detecção de ambiguidade durante o carregamento do inventário. Patch de James Addison.

source: Release 7.4.5 (released Jul 16, 2024)
pt_br: Versão 7.4.5 (lançada em 16 jul 2024)

source: #12593, #12600: Revert coercing the type of selected :confval:`html_sidebars` values to a list. Log an error message when string values are detected. Patch by Adam Turner.
pt_br: #12593, #12600: Reverte a coerção do tipo de valores :confval:`html_sidebars` selecionados para uma lista. Registra uma mensagem de erro quando valores de string forem detectados. Patch de Adam Turner.

source: #12594: LaTeX: since 7.4.0, :rst:dir:`seealso` and other "light" admonitions now break PDF builds if they contain a :dudir:`figure` directive; and also if they are contained in a table cell (rendered by ``tabulary``). Patch by Jean-François B.
pt_br: #12594: LaTeX: desde 7.4.0, :rst:dir:`seealso` e outras admonições "leves" agora quebram construções de PDF se contiverem uma diretiva :dudir:`figure`; e também se estiverem contidos em uma célula de tabela (renderizada por ``tabulary``). Patch de Jean-François B.

source: Release 7.4.4 (released Jul 15, 2024)
pt_br: Versão 7.4.4 (lançada em 15 jul 2024)

source: #12585, #12586: Do not warn when an intersphinx inventory contains case-insensitively ambiguous duplicate items. Patch by James Addison.
pt_br: #12585, #12586: Não avisa quando um inventário intersphinx contém itens duplicados ambíguos e que não diferenciam maiúsculas de minúsculas. Patch de James Addison.

source: Release 7.4.3 (released Jul 15, 2024)
pt_br: Versão 7.4.3 (lançada em 15 jul 2024)

source: #12582: Restore support for list-styled :confval:`source_suffix` values with extensions that register parsers. Patch by Adam Turner.
pt_br: #12582: Restaura o suporte para valores :confval:`source_suffix` em estilo de lista com extensões que registram analisadores. Patch de Adam Turner.

source: Release 7.4.2 (released Jul 15, 2024)
pt_br: Versão 7.4.2 (lançada em 15 jul 2024)

source: #12580, #12583: Resolve failures with the C domain on incremental builds with Sphinx 7.3.7 and earlier. Patch by Adam Turner.
pt_br: #12580, #12583: Resolve falhas com o domínio C em construções incrementais com o Sphinx 7.3.7 e versões anteriores. Patch de Adam Turner.

source: Release 7.4.1 (released Jul 15, 2024)
pt_br: Versão 7.4.1 (lançada em 15 jul 2024)

source: Fix invalid HTML when a rubric node with invalid ``heading-level`` is used. Patch by Adam Turner.
pt_br: Corrige HTML inválido quando um nó de rubric com ``heading-level`` inválido é usado. Patch de Adam Turner.

source: #12579, #12581: Restore support for ``typing.ParamSpec`` in autodoc. Patch by Adam Turner.
pt_br: #12579, #12581: Restaura o suporte para ``typing.ParamSpec`` no autodoc. Patch de Adam Turner.

source: Release 7.4.0 (released Jul 15, 2024)
pt_br: Versão 7.4.0 (lançada em 15 jul 2024)

source: Dependencies
pt_br: Dependências

source: #12555: Drop Docutils 0.18.1 and Docutils 0.19 support. Patch by Adam Turner.
pt_br: #12555: Descarta o suporte para Docutils 0.18.1 e Docutils 0.19. Patch de Adam Turner.

source: LaTeX: the ``xcolor`` package is now required (but is for example part of Ubuntu ``texlive-latex-recommended`` which has always been required).
pt_br: LaTeX: o pacote ``xcolor`` agora é necessário (mas é, por exemplo, parte do Ubuntu ``texlive-latex-recommended`` que sempre foi necessário).

source: LaTeX: the ``fontawesome5`` LaTeX package is needed for the default choices of icons now used in admonition titles in PDF output; but if unavailable the PDF build will simply silently omit rendering such icons. Check the documentation of the ``iconpackage`` key of :ref:`'sphinxsetup' <latexsphinxsetup>` for more.
pt_br: LaTeX: o pacote LaTeX ``fontawesome5`` é necessário para as escolhas padrão de ícones agora usados ​​em títulos de admonição na saída de PDF; mas se não estiver disponível, a construção de PDF simplesmente omitirá silenciosamente a renderização de tais ícones. Confira a documentação da chave ``iconpackage`` de :ref:`'sphinxsetup' <latexsphinxsetup>` para mais informações.

source: Deprecated
pt_br: Descontinuada

source: LaTeX: the ``sphinxlightbox`` environment is not used anymore, all types of admonitions use (by default) only ``sphinxheavybox``.
pt_br: LaTeX: o ambiente ``sphinxlightbox`` não é mais usado, todos os tipos de admonições usam (por padrão) apenas ``sphinxheavybox``.

source: Features added
pt_br: Funcionalidades adicionadas

source: #11165: Support the `officially recommended`_ ``.jinja`` suffix for template files. Patch by James Addison and Adam Turner
pt_br: #11165: Suporte a ``.jinja`` `oficialmente recomendado`_ para arquivos de modelo. Patch de James Addison e Adam Turner

source: #12325: Flatten ``Union[Literal[T], Literal[U], ...]`` to ``Literal[T, U, ...]`` when turning annotations into strings. Patch by Adam Turner.
pt_br: #12325: Achata ``Union[Literal[T], Literal[U], ...]`` para ``Literal[T, U, ...]`` ao transformar anotações em strings. Patch de Adam Turner.

source: #12319: ``sphinx.ext.extlinks``: Add ``extlink-{name}`` CSS class to links. Patch by Hugo van Kemenade.
pt_br: #12319: ``sphinx.ext.extlinks``: Adiciona a classe CSS ``extlink-{name}`` aos links. Patch de Hugo van Kemenade.

source: #12387: Improve CLI progress message, when copying assets. Patch by INADA Nakoi and Bénédikt Tran.
pt_br: #12387: Melhora a mensagem de progresso da CLI ao copiar ativos. Patch de INADA Nakoi e Bénédikt Tran.

source: #12361: Add :attr:`.BuildEnvironment.parser`. Patch by Chris Sewell.
pt_br: #12361: Adiciona :attr:`.BuildEnvironment.parser`. Patch de Chris Sewell.

source: #12358: Add :attr:`.Sphinx.fresh_env_used`. Patch by Chris Sewell.
pt_br: #12358: Adiciona :attr:`.Sphinx.fresh_env_used`. Patch de Chris Sewell.

source: #12329: Add detection of ambiguous ``std:label`` and ``std:term`` references during loading and resolution of Intersphinx targets. Patch by James Addison.
pt_br: #12329: Adiciona detecção de referências ambíguas ``std:label`` e ``std:term`` durante o carregamento e resolução de alvos de intersphinx. Patch de James Addison.

source: #12422: Do not duplicate "navigation" in aria-label of built-in themes. Patch by Thomas Weißschuh
pt_br: #12422: Não duplica "navegação" no rótulo aria de temas embutidos. Patch de Thomas Weißschuh

source: #12421: Include project name in ``logo_alt`` of built-in themes. Patch by Thomas Weißschuh
pt_br: #12421: Inclui o nome do projeto em ``logo_alt`` dos temas embutidos. Patch de Thomas Weißschuh

source: #12448: Add :option:`sphinx-apidoc --remove-old` option. Patch by Chris Sewell.
pt_br: #12448: Adiciona a opção :option:`sphinx-apidoc --remove-old`. Patch de Chris Sewell.

source: #12456: Add :option:`sphinx-autogen --remove-old` option. Patch by Chris Sewell.
pt_br: #12456: Adiciona a opção :option:`sphinx-autogen --remove-old`. Patch de Chris Sewell.

source: #12479: Add warning subtype ``toc.no_title``. Patch by Ondřej Navrátil.
pt_br: #12479: Adiciona o subtipo de aviso ``toc.no_title``. Patch de Ondřej Navrátil.

source: #12492: Add helper methods for parsing reStructuredText content into nodes from within a directive.
pt_br: #12492: Adiciona métodos auxiliares para analisar o conteúdo reStructuredText em nós de dentro de uma diretiva.

source: :py:meth:`~sphinx.util.docutils.SphinxDirective.parse_content_to_nodes()` parses the directive's content and returns a list of Docutils nodes.
pt_br: :py:meth:`~sphinx.util.docutils.SphinxDirective.parse_content_to_nodes()` analisa o conteúdo da diretiva e retorna uma lista de nós Docutils.

source: :py:meth:`~sphinx.util.docutils.SphinxDirective.parse_text_to_nodes()` parses the provided text and returns a list of Docutils nodes.
pt_br: :py:meth:`~sphinx.util.docutils.SphinxDirective.parse_text_to_nodes()` analisa o texto fornecido e retorna uma lista de nós Docutils.

source: :py:meth:`~sphinx.util.docutils.SphinxDirective.parse_inline()` parses the provided text into inline elements and text nodes.
pt_br: :py:meth:`~sphinx.util.docutils.SphinxDirective.parse_inline()` analisa o texto fornecido em elementos embutidos e nós de texto.

source: Patch by Adam Turner.
pt_br: Patch de Adam Turner.

source: #12258: Support ``typing_extensions.Unpack`` Patch by Bénédikt Tran and Adam Turner.
pt_br: #12258: Suporte a ``typing_extensions.Unpack`` Patch de Bénédikt Tran e Adam Turner.

source: #12524: Add a ``class`` option to the :rst:dir:`toctree` directive. Patch by Tim Hoffmann.
pt_br: #12524: Adiciona uma opção ``class`` à diretiva :rst:dir:`toctree`. Patch de Tim Hoffmann.

source: #12536: Add the :rst:dir:`confval` directive. Patch by Adam Turner.
pt_br: #12536: Adiciona a diretiva :rst:dir:`confval`. Patch de Adam Turner.

source: #12537: :confval:`c_id_attributes`, :confval:`c_paren_attributes`, :confval:`cpp_id_attributes`, and :confval:`cpp_paren_attributes` can now be a tuple of strings. :confval:`c_extra_keywords`, :confval:`gettext_additional_targets`, :confval:`html_domain_indices`, :confval:`latex_domain_indices`, and :confval:`texinfo_domain_indices`, can now be a set of strings. Patch by Adam Turner.
pt_br: #12537: :confval:`c_id_attributes`, :confval:`c_paren_attributes`, :confval:`cpp_id_attributes` e :confval:`cpp_paren_attributes` agora podem ser uma tupla de strings. :confval:`c_extra_keywords`, :confval:`gettext_additional_targets`, :confval:`html_domain_indices`, :confval:`latex_domain_indices` e :confval:`texinfo_domain_indices` agora podem ser um conjunto de strings. Patch de Adam Turner.

source: #12523: Added configuration option, :confval:`math_numsep`, to define the separator for math numbering. Patch by Thomas Fanning
pt_br: #12523: Adicionada opção de configuração, :confval:`math_numsep`, para definir o separador para numeração matemática. Patch de Thomas Fanning

source: #11592: Add :confval:`coverage_modules` to the coverage builder to allow explicitly specifying which modules should be documented. Patch by Stephen Finucane.
pt_br: #11592: Adiciona :confval:`coverage_modules` ao construtor de cobertura para permitir especificar explicitamente quais módulos devem ser documentados. Patch de Stephen Finucane.

source: #7896, #11989: Add a :rst:dir:`py:type` directive for documenting type aliases, and a :rst:role:`py:type` role for linking to them. Patch by Ashley Whetter.
pt_br: #7896, #11989: Adiciona uma diretiva :rst:dir:`py:type` para documentar apelidos de tipo e um papel :rst:role:`py:type` para vincular a eles. Patch de Ashley Whetter.

source: #12549: Add optional ``description`` argument to :meth:`.Sphinx.add_config_value`. Patch by Chris Sewell.
pt_br: #12549: Adiciona o argumento opcional ``description`` a :meth:`.Sphinx.add_config_value`. Patch de Chris Sewell.

source: #6792: Prohibit module import cycles in :mod:`sphinx.ext.autosummary`. Patch by Trevor Bekolay.
pt_br: #6792: Proíbe ciclos de importação de módulos em :mod:`sphinx.ext.autosummary`. Patch de Trevor Bekolay.

source: #12508: LaTeX: Revamped styling of all admonitions, with addition of a title row with icon. Patch by Jean-François B.
pt_br: #12508: LaTeX: Renovado o estilo de todas as admoniçẽos, com adição de uma linha de título com ícone. Patch de Jean-François B.

source: #11773: Display :py:class:`~typing.Annotated` annotations with their metadata in the Python domain. Patch by Adam Turner and David Stansby.
pt_br: #11773: Exibe anotações :py:class:`~typing.Annotated` com seus metadados no domínio Python. Patch de Adam Turner e David Stansby.

source: #12506: Add ``heading-level`` option to :rst:dir:`rubric` directive. Patch by Chris Sewell.
pt_br: #12506: Adiciona a opção ``heading-level`` à diretiva :rst:dir:`rubric`. Patch de Chris Sewell.

source: #12567: Add the :event:`write-started` event. Patch by Chris Sewell.
pt_br: #12567: Adiciona o evento :event:`write-started`. Patch de Chris Sewell.

source: #12314: Properly format ``collections.abc.Callable`` in annotations. Patch by Adam Turner.
pt_br: #12314: Formata corretamente ``collections.abc.Callable`` nas anotações. Patch de Adam Turner.

source: #12162: Fix a performance regression in the C domain that has been present since version 3.0.0. Patch by Donald Hunter.
pt_br: #12162: Correção de uma regressão de desempenho no domínio C que está presente desde a versão 3.0.0. Patch de Donald Hunter.

source: #12320: Fix removal of anchors from search summaries (regression in 7.3.0). Patch by Will Lachance.
pt_br: #12320: Corrige a remoção de âncoras dos resumos de pesquisa (regressão em 7.3.0). Patch de Will Lachance.

source: #12251: Fix ``merge_domaindata()`` in ``sphinx.ext.duration``. Patch by Matthias Geier.
pt_br: #12251: Corrige ``merge_domaindata()`` em ``sphinx.ext.duration``. Patch de Matthias Geier.

source: #12224: Properly detect WebP files. Patch by Benjamin Cabé.
pt_br: #12224: Detecta arquivos WebP corretamente. Patch de Benjamin Cabé.

source: #12380: LaTeX: Avoid footnote markers ``Page N`` when ``N`` is already the current page number. Patch by Jean-François B.
pt_br: #12380: LaTeX: Evita marcadores de nota de rodapé ``Page N`` quando ``N`` já for o número da página atual. Patch de Jean-François B.

source: #12410: LaTeX: for French and ``'lualatex'`` as :confval:`latex_engine` use ``babel`` as with ``'xelatex'`` (and not ``polyglossia``). Patch by Jean-François B.
pt_br: #12410: LaTeX: para francês e ``'lualatex'`` como :confval:`latex_engine`, usa ``babel`` como com ``'xelatex'`` (e não ``polyglossia``). Patch de Jean-François B.

source: #12520: LaTeX: let :rst:dir:`todolist` produce correct hyperlinks in PDF. Patch by Jean-François B.
pt_br: #12520: LaTeX: deixa :rst:dir:`todolist` produzir hiperlinks corretos em PDF. Patch de Jean-François B.

source: #12416: Ensure that configuration setting aliases are always synchronised when one value or the other is modified. Patch by Bénédikt Tran.
pt_br: #12416: Certifica-se de que os apelidos das definições de configuração estejam sempre sincronizados quando um valor ou outro for modificado. Patch de Bénédikt Tran.

source: #12220: Fix loading custom template translations for ``en`` locale. Patch by Nicolas Peugnet.
pt_br: #12220: Corrige o carregamento de traduções de modelos personalizados para a localidade ``en``. Patch de Nicolas Peugnet.

source: #12459: Add valid-type arguments to the ``linkcheck_rate_limit_timeout`` configuration setting. Patch by James Addison.
pt_br: #12459: Adiciona argumentos de tipo válido à configuração ``linkcheck_rate_limit_timeout``. Patch de James Addison.

source: #12331: Resolve data-URI-image-extraction regression from v7.3.0 affecting builders without native support for data-URIs in their output format. Patch by James Addison.
pt_br: #12331: Resolve a regressão de extração de imagem de URI de dados da v7.3.0 que afeta construtores sem suporte nativo para URIs de dados em seu formato de saída. Patch de James Addison.

source: #12494: Fix invalid genindex.html file produced with translated docs (regression in 7.1.0). Patch by Nicolas Peugnet.
pt_br: #12494: Corrige o arquivo genindex.html inválido produzido com documentos traduzidos (regressão em 7.1.0). Patch de Nicolas Peugnet.

source: #11961: Omit anchor references from document title entries in the search index, removing duplication of search results. Patch by James Addison.
pt_br: #11961: Omite referências âncoras das entradas de títulos de documentos no índice de pesquisa, removendo a duplicação dos resultados da pesquisa. Patch de James Addison.

source: #12425: Use Docutils' SVG processing in the HTML builder and remove Sphinx's custom logic. Patch by Tunç Başar Köse.
pt_br: #12425: Usa o processamento SVG do Docutils no construtor HTML e remove a lógica personalizada do Sphinx. Patch de Tunç Başar Köse.

source: #12391: Adjust scoring of matches during HTML search so that document main titles tend to rank higher than subsection titles. In addition, boost matches on the name of programming domain objects relative to title/subtitle matches. Patch by James Addison and Will Lachance.
pt_br: #12391: Ajusta a pontuação das correspondências durante a pesquisa HTML para que os títulos principais dos documentos tendam a ter uma classificação mais elevada do que os títulos das subseções. Além disso, aumenta as correspondências no nome dos objetos de domínio de programação em relação às correspondências de título/subtítulo. Patch de James Addison e Will Lachance.

source: #9634: Do not add a fallback language by stripping the country code. Patch by Alvin Wong.
pt_br: #9634: Não adiciona um idioma substituto retirando o código do país. Patch de Alvin Wong.

source: #12352: Add domain objects to the table of contents in the same order as defined in the document. Previously, each domain used language-specific nesting rules, which removed control from document authors. Patch by Jakob Lykke Andersen and Adam Turner.
pt_br: #12352: Adiciona objetos de domínio ao índice na mesma ordem definida no documento. Anteriormente, cada domínio usava regras de aninhamento específicas do idioma, o que removia o controle dos autores dos documentos. Patch de Jakob Lykke Andersen e Adam Turner.

source: #11041: linkcheck: Ignore URLs that respond with non-Unicode content. Patch by James Addison.
pt_br: #11041: linkcheck: Ignora URLs que respondem com conteúdo não Unicode. Patch de James Addison.

source: #12543: Fix :pep:`695` formatting for LaTeX output. Patch by Bénédikt Tran.
pt_br: #12543: Corrige a formatação da :pep:`695` para saída LaTeX. Patch de Bénédikt Tran.

source: Testing
pt_br: Testes

source: karma: refactor HTML search tests to use fixtures generated by Sphinx. Patch by James Addison.
pt_br: karma: refatora testes de pesquisa HTML para usar fixtures gerados pelo Sphinx. Patch de James Addison.
