Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/tutorial/automatic-doc-generation.po
Languages: pt_br

source: Automatic documentation generation from code
pt_br: Geração automática de documentação a partir do código

source: In the :ref:`previous section <tutorial-describing-objects>` of the tutorial you manually documented a Python function in Sphinx. However, the description was out of sync with the code itself, since the function signature was not the same. Besides, it would be nice to reuse :pep:`Python docstrings <257#what-is-a-docstring>` in the documentation, rather than having to write the information in two places.
pt_br: Na :ref:`seção anterior <tutorial-describing-objects>` do tutorial você documentou manualmente uma função Python no Sphinx. No entanto, a descrição estava fora de sincronia com o próprio código, pois a assinatura da função não era a mesma. Além disso, seria bom reutilizar :pep:`Python docstrings <257#what-is-a-docstring>` na documentação, ao invés de ter que escrever as informações em dois lugares.

source: Fortunately, :doc:`the autodoc extension </usage/extensions/autodoc>` provides this functionality.
pt_br: Felizmente, :doc:`a extensão autodoc </usage/extensions/autodoc>` fornece essa funcionalidade.

source: Reusing signatures and docstrings with autodoc
pt_br: Reutilizando assinaturas e docstrings com autodoc

source: To use autodoc, first add it to the list of enabled extensions:
pt_br: Para usar o autodoc, primeiro adicione-o à lista de extensões habilitadas:

source: Next, move the content of the ``.. py:function`` directive to the function docstring in the original Python file, as follows:
pt_br: Em seguida, mova o conteúdo da diretiva ``.. py:function`` para a função docstring no arquivo Python original, como segue:

source: Finally, replace the ``.. py:function`` directive from the Sphinx documentation with :rst:dir:`autofunction`:
pt_br: Finalmente, substitua a diretiva ``.. py:function`` da documentação do Sphinx por :rst:dir:`autofunction`:

source: If you now build the HTML documentation, the output will be the same! With the advantage that it is generated from the code itself. Sphinx took the reStructuredText from the docstring and included it, also generating proper cross-references.
pt_br: Se você agora construir a documentação HTML, a saída será a mesma! Com a vantagem de ser gerado a partir do próprio código. Sphinx pegou o reStructuredText da docstring e o incluiu, também gerando referências cruzadas apropriadas.

source: You can also autogenerate documentation from other objects. For example, add the code for the ``InvalidKindError`` exception:
pt_br: Você também pode gerar automaticamente a documentação de outros objetos. Por exemplo, adicione o código para a exceção ``Invalid KindError``:

source: And replace the ``.. py:exception`` directive with :rst:dir:`autoexception` as follows:
pt_br: E substitua a diretiva ``.. py:exception`` por :rst:dir:`autoexception` da seguinte forma:

source: And again, after running ``make html``, the output will be the same as before.
pt_br: E novamente, depois de executar ``make html``, a saída será a mesma de antes.

source: Generating comprehensive API references
pt_br: Gerando referências de API abrangentes

source: While using ``sphinx.ext.autodoc`` makes keeping the code and the documentation in sync much easier, it still requires you to write an ``auto*`` directive for every object you want to document. Sphinx provides yet another level of automation: the :doc:`autosummary </usage/extensions/autosummary>` extension.
pt_br: Enquanto usar ``sphinx.ext.autodoc`` torna muito mais fácil manter o código e a documentação em sincronia, ainda requer que você escreva uma diretiva ``auto*`` para cada objeto que você deseja documentar. Sphinx fornece ainda outro nível de automação: a extensão :doc:`autosummary </usage/extensions/autosummary>`.

source: The :rst:dir:`autosummary` directive generates documents that contain all the necessary ``autodoc`` directives. To use it, first enable the autosummary extension:
pt_br: A diretiva :rst:dir:`autosummary` gera documentos que contêm todas as diretivas ``autodoc`` necessárias. Para usá-la, primeiro habilite a extensão autosummary:

source: Next, create a new ``api.rst`` file with these contents:
pt_br: Em seguida, crie um novo arquivo ``api.rst`` com este conteúdo:

source: Remember to include the new document in the root toctree:
pt_br: Lembre-se de incluir o novo documento na toctree raiz:

source: Finally, after you build the HTML documentation running ``make html``, it will contain two new pages:
pt_br: Finalmente, depois de construir a documentação HTML executando ``make html``, ela conterá duas novas páginas:

source: ``api.html``, corresponding to ``docs/source/api.rst`` and containing a table with the objects you included in the ``autosummary`` directive (in this case, only one).
pt_br: ``api.html``, correspondente a ``docs/source/api.rst`` e contendo uma tabela com os objetos que você incluiu na diretiva ``autosummary`` (neste caso, apenas um).

source: ``generated/lumache.html``, corresponding to a newly created reST file ``generated/lumache.rst`` and containing a summary of members of the module, in this case one function and one exception.
pt_br: ``generated/lumache.html``, correspondendo a um arquivo reST recém-criado ``generated/lumache.rst`` e contendo um resumo dos membros do módulo, neste caso uma função e uma exceção.

source: Summary page created by autosummary
pt_br: Página de resumo criada por autosummary

source: Each of the links in the summary page will take you to the places where you originally used the corresponding ``autodoc`` directive, in this case in the ``usage.rst`` document.
pt_br: Cada um dos links na página de resumo irá levá-lo aos lugares onde você originalmente usou a diretiva ``autodoc`` correspondente, neste caso no documento ``usage.rst``.

source: The generated files are based on `Jinja2 templates <https://jinja2docs.readthedocs.io/>`_ that :ref:`can be customized <autosummary-customizing-templates>`, but that is out of scope for this tutorial.
pt_br: Os arquivos gerados são baseados em `templates Jinja2 <https://jinja2docs.readthedocs.io/>`_ que :ref:`podem ser personalizados <autosummary-customizing-templates>`, mas isso está fora do escopo deste tutorial.
