Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/tutorial/describing-code.po
Languages: pt_br

source: Describing code in Sphinx
pt_br: Descrevendo código no Sphinx

source: In the :doc:`previous sections of the tutorial </tutorial/index>` you can read how to write narrative or prose documentation in Sphinx. In this section you will describe code objects instead.
pt_br: Nas :doc:`seções anteriores do tutorial </tutorial/index>` você pode ler como escrever documentação narrativa ou em prosa no Sphinx. Nesta seção você descreverá objetos código.

source: Sphinx supports documenting code objects in several languages, namely Python, C, C++, JavaScript, and reStructuredText. Each of them can be documented using a series of directives and roles grouped by :doc:`domain </usage/domains/index>`. For the remainder of the tutorial you will use the Python domain, but all the concepts seen in this section apply for the other domains as well.
pt_br: Sphinx oferece suporte à documentação de objetos código em várias linguagens, inclusive Python, C, C++, JavaScript e reStructuredText. Cada um deles pode ser documentado usando uma série de diretivas e de papéis agrupados por :doc:`domínio </usage/domains/index>`. No restante do tutorial você usará o domínio Python, mas todos os conceitos vistos nesta seção também se aplicam aos outros domínios.

source: Documenting Python objects
pt_br: Documentando objetos Python

source: Sphinx offers several roles and directives to document Python objects, all grouped together in :doc:`the Python domain </usage/domains/python>`. For example, you can use the :rst:dir:`py:function` directive to document a Python function, as follows:
pt_br: O Sphinx oferece vários papéis e diretivas para documentar objetos Python, todos agrupados no :doc:`domínio Python </usage/domains/python>`. Por exemplo, você pode usar a diretiva :rst:dir:`py:function` para documentar uma função Python da seguinte forma:

source: Which will render like this:
pt_br: Que será renderizado assim:

source: HTML result of documenting a Python function in Sphinx
pt_br: Resultado em HTML da documentação de uma função Python no Sphinx

source: The rendered result of documenting a Python function in Sphinx
pt_br: O resultado renderizado da documentação de uma função Python no Sphinx

source: Notice several things:
pt_br: Observe várias coisas:

source: Sphinx parsed the argument of the ``.. py:function`` directive and highlighted the module, the function name, and the parameters appropriately.
pt_br: Sphinx analisou o argumento da diretiva ``.. py:function`` e destacou o módulo, o nome da função e os parâmetros apropriadamente.

source: The directive content includes a one-line description of the function, as well as an :ref:`info field list <info-field-lists>` containing the function parameter, its expected type, the return value, and the return type.
pt_br: O conteúdo da diretiva inclui uma descrição de uma linha da função, bem como uma :ref:`lista de campos de informações <info-field-lists>` contendo o parâmetro da função, seu tipo esperado, o valor de retorno e o tipo de retorno.

source: The ``py:`` prefix specifies the :term:`domain`. You may configure the default domain so you can omit the prefix, either globally using the :confval:`primary_domain` configuration, or use the :rst:dir:`default-domain` directive to change it from the point it is called until the end of the file. For example, if you set it to ``py`` (the default), you can write ``.. function::`` directly.
pt_br: O prefixo ``py:`` especifica o :term:`domínio`. Você pode configurar o domínio padrão para poder omitir o prefixo, seja globalmente usando a configuração :confval:`primary_domain`, ou use a diretiva :rst:dir:`default-domain` para alterá-lo desde o ponto em que é chamado até o final do arquivo. Por exemplo, se você definir como ``py`` (o padrão), você pode escrever ``.. function::`` diretamente.

source: Cross-referencing Python objects
pt_br: Referência cruzada de objetos Python

source: By default, most of these directives generate entities that can be cross-referenced from any part of the documentation by using :ref:`a corresponding role <python-xref-roles>`. For the case of functions, you can use :rst:role:`py:func` for that, as follows:
pt_br: Por padrão, a maioria dessas diretivas geram entidades que podem ser referenciadas de qualquer parte da documentação usando :ref:`o papel correspondente <python-xref-roles>`. Para o caso de funções, você pode usar :rst:role:`py:func` para isso, da seguinte forma:

source: When generating code documentation, Sphinx will generate a cross-reference automatically just by using the name of the object, without you having to explicitly use a role for that. For example, you can describe the custom exception raised by the function using the :rst:dir:`py:exception` directive:
pt_br: Ao gerar a documentação do código, o Sphinx irá gerar automaticamente uma referência cruzada apenas usando o nome do objeto, sem que você precise usar explicitamente um papel para isso. Por exemplo, você pode descrever a exceção personalizada gerada pela função usando a diretiva :rst:dir:`py:exception`:

source: Then, add this exception to the original description of the function:
pt_br: Em seguida, adicione esta exceção à descrição original da função:

source: And finally, this is how the result would look:
pt_br: E por fim, o resultado ficaria assim:

source: HTML result of documenting a Python function in Sphinx with cross-references
pt_br: Resultado HTML da documentação de uma função Python no Sphinx com referências cruzadas

source: HTML result of documenting a Python function in Sphinx with cross-references
pt_br: Resultado HTML da documentação de uma função Python no Sphinx com referências cruzadas

source: Beautiful, isn't it?
pt_br: Lindo, não é?

source: Including doctests in your documentation
pt_br: Incluindo doctests em sua documentação

source: Since you are now describing code from a Python library, it will become useful to keep both the documentation and the code as synchronized as possible. One of the ways to do that in Sphinx is to include code snippets in the documentation, called *doctests*, that are executed when the documentation is built.
pt_br: Como agora você está descrevendo o código de uma biblioteca Python, será útil manter a documentação e o código o mais sincronizados possível. Uma das maneiras de fazer isso no Sphinx é incluir trechos de código na documentação, chamados *doctests*, que são executados quando a documentação é construída.

source: To demonstrate doctests and other Sphinx features covered in this tutorial, Sphinx will need to be able to import the code. To achieve that, write this at the beginning of ``conf.py``:
pt_br: Para demonstrar doctests e outros recursos do Sphinx abordados neste tutorial, o Sphinx precisará ser capaz de importar o código. Para conseguir isso, escreva isto no início do ``conf.py``:

source: An alternative to changing the :py:data:`sys.path` variable is to create a ``pyproject.toml`` file and make the code installable, so it behaves like any other Python library. However, the ``sys.path`` approach is simpler.
pt_br: Uma alternativa para alterar a variável :py:data:`sys.path` é criar um arquivo ``pyproject.toml`` e tornar o código instalável, para que ele se comporte como qualquer outra biblioteca Python. Entretanto, a abordagem ``sys.path`` é mais simples.

source: Then, before adding doctests to your documentation, enable the :doc:`doctest </usage/extensions/doctest>` extension in ``conf.py``:
pt_br: Então, antes de adicionar doctests à sua documentação, habilite a extensão :doc:`doctest </usage/extensions/doctest>` em ``conf.py``:

source: Next, write a doctest block as follows:
pt_br: A seguir, escreva um bloco de doctest da seguinte forma:

source: Doctests include the Python instructions to be run preceded by ``>>>``, the standard Python interpreter prompt, as well as the expected output of each instruction. This way, Sphinx can check whether the actual output matches the expected one.
pt_br: Doctests incluem as instruções Python a serem executadas precedidas por ``>>>``, o prompt padrão do interpretador Python, bem como a saída esperada de cada instrução. Dessa forma, o Sphinx pode verificar se a saída real corresponde à esperada.

source: To observe how a doctest failure looks like (rather than a code error as above), let's write the return value incorrectly first. Therefore, add a function ``get_random_ingredients`` like this:
pt_br: Para observar como uma falha do doctest se parece (em vez de um erro de código como acima), vamos primeiro escrever o valor de retorno incorretamente. Portanto, adicione uma função ``get_random_ingredients`` como esta:

source: You can now run ``make doctest`` to execute the doctests of your documentation. Initially this will display an error, since the actual code does not behave as specified:
pt_br: Agora você pode executar ``make doctest`` para executar os doctests da sua documentação. Inicialmente isso exibirá um erro, já que o código real não se comporta conforme especificado:

source: As you can see, doctest reports the expected and the actual results, for easy examination. It is now time to fix the function:
pt_br: Como você pode ver, o doctest relata os resultados esperados e reais, para facilitar o exame. Agora é hora de corrigir a função:

source: And finally, ``make doctest`` reports success!
pt_br: E finalmente, ``make doctest`` relata sucesso!

source: For big projects though, this manual approach can become a bit tedious. In the next section, you will see :doc:`how to automate the process </tutorial/automatic-doc-generation>`.
pt_br: Porém, para grandes projetos, essa abordagem manual pode se tornar um pouco tediosa. Na próxima seção, você verá :doc:`como automatizar o processo </tutorial/automatic-doc-generation>`.

source: Other languages (C, C++, others)
pt_br: Outras linguagens (C, C++, outros)

source: Documenting and cross-referencing objects
pt_br: Documentando e fazendo referência cruzada de objetos

source: Sphinx also supports documenting and cross-referencing objects written in other programming languages. There are four additional built-in domains: C, C++, JavaScript, and reStructuredText. Third-party extensions may define domains for more languages, such as
pt_br: O Sphinx também oferece suporte a documentação e referência cruzada de objetos escritos em outras linguagens de programação. Existem quatro domínios embutidos adicionais: C, C++, JavaScript e reStructuredText. Extensões de terceiros podem definir domínios para mais linguagens, como

source: `Julia <https://bastikr.github.io/sphinx-julia>`_, or
pt_br: `Julia <https://bastikr.github.io/sphinx-julia>`_, ou

source: For example, to document a C++ type definition, you would use the built-in :rst:dir:`cpp:type` directive, as follows:
pt_br: Por exemplo, para documentar uma definição de tipo C++, você usaria a diretiva embutida :rst:dir:`cpp:type`, como segue:

source: Which would give the following result:
pt_br: O que daria o seguinte resultado:

source: A typedef-like declaration of a type.
pt_br: Uma declaração semelhante a typedef de um tipo.

source: All such directives then generate references that can be cross-referenced by using the corresponding role. For example, to reference the previous type definition, you can use the :rst:role:`cpp:type` role as follows:
pt_br: Todas essas diretivas geram referências que podem ser referenciadas usando o papel correspondente. Por exemplo, para fazer referência à definição de tipo anterior, você pode usar o papel :rst:role:`cpp:type` da seguinte forma:

source: Which would produce a hyperlink to the previous definition: :cpp:type:`CustomList`.
pt_br: O que produziria um hiperlink para a definição anterior: :cpp:type:`CustomList`.
