Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/tutorial/first-steps.po
Languages: fr, pt_br

source: First steps to document your project using Sphinx
fr: Générer votre projet avec Sphinx
pt_br: Primeiros passos para documentar seu projeto usando Sphinx

source: Building your HTML documentation
fr: Générer votre documentation au format HTML
pt_br: Construindo sua documentação HTML

source: The ``index.rst`` file that ``sphinx-quickstart`` created has some content already, and it gets rendered as the front page of your HTML documentation. It is written in reStructuredText, a powerful markup language.
fr: Le fichier ``index.rst`` créé par ``sphinx-quickstart`` possède déjà du contenu et il est généré comme page de couverture de votre documentation HTML. Il est écrit en reStructuredText, un puissant langage de balisage.
pt_br: O arquivo ``index.rst`` que o ``sphinx-quickstart`` criou já tem algum conteúdo e é renderizado como a primeira página da sua documentação HTML. Está escrito em reStructuredText, uma linguagem de marcação poderosa.

source: Modify the file as follows:
fr: Modifiez le fichier comme suit :
pt_br: Modifique o arquivo da seguinte forma:

source: This showcases several features of the reStructuredText syntax, including:
fr: Ceci présente plusieurs fonctionnalités de la syntaxe reStructuredText, y compris :
pt_br: Isso mostra vários recursos da sintaxe reStructuredText, incluindo:

source: a **section header** using ``===`` for the underline,
fr: Un **titre de section** utilisant ``===`` pour le soulignement,
pt_br: um **cabeçalho de seção** usando ``===`` para o sublinhado,

source: two examples of :ref:`rst-inline-markup`: ``**strong emphasis**`` (typically bold) and ``*emphasis*`` (typically italics),
fr: deux exemples d':ref:`rst-inline-markup`: ``**emphase forte**`` (généralement en caractères gras) et d'``*emphase*`` (généralement en italique).
pt_br: dois exemplos de :ref:`rst-inline-markup`: ``**ênfase forte**`` (normalmente em negrito) e ``*ênfase*`` (normalmente em itálico),

source: an **inline external link**,
fr: un **lien externe en ligne**,
pt_br: um **link externo em linha**,

source: and a ``note`` **admonition** (one of the available :ref:`directives <rst-directives>`)
fr: et une **admonition** en forme de ``note`` (une des :ref:`directives <rst-directives>` disponibles).
pt_br: e uma ``nota`` **advertência** (uma das :ref:`diretivas <rst-directives>` disponíveis)

source: Now to render it with the new content, you can use the ``sphinx-build`` command as before, or leverage the convenience script as follows:
fr: Maintenant, pour le générer avec son nouveau contenu, vous pouvez utiliser la commande ``sphinx-build`` comme précédemment, ou profiter du script de confort de la manière suivante :
pt_br: Agora, para renderizá-la com o novo conteúdo, você pode usar o comando ``sphinx-build`` como antes, ou aproveitar o script de conveniência da seguinte forma:

source: After running this command, you will see that ``index.html`` reflects the new changes!
fr: Après avoir exécuté cette commande, vous constaterez que ``index.html`` reflète les nouveaux changements !
pt_br: Após executar este comando, você verá que ``index.html`` reflete as novas alterações!

source: Building your documentation in other formats
fr: Générer votre documentation dans d'autres formats
pt_br: Construindo sua documentação em outros formatos

source: Sphinx supports a variety of formats apart from HTML, including PDF, EPUB, :ref:`and more <builders>`. For example, to build your documentation in EPUB format, run this command from the ``docs`` directory:
fr: Sphinx supporte divers formats en plus du HTML, y compris PDF, EPUB, :ref:`et autres <builders>`. Par exemple, pour générer votre documentation au format EPUB, exécutez la commande suivante depuis le répertoire ``docs·`` :
pt_br: Sphinx oferece suporte a uma variedade de formatos além de HTML, incluindo PDF, EPUB :ref:`e mais <builders>`. Por exemplo, para construir sua documentação no formato EPUB, execute este comando no diretório ``docs``:

source: After that, you will see the files corresponding to the e-book under ``docs/build/epub/``. You can either open ``Lumache.epub`` with an EPUB-compatible e-book viewer, like `Calibre <https://calibre-ebook.com/>`_, or preview ``index.xhtml`` on a web browser.
fr: Après cela, vous trouverez les fichiers correspondant au e-book dans ``docs/build/epub/``. Vous pouvez alors soit ouvrir ``Lumache.epub`` avec un lecteur de e-book compatible avec le format EPUB, tel que `Calibre <https://calibre-ebook.com/>`_, ou prévisualiser ``index.html`` dans un navigateur Web.
pt_br: Depois disso, você verá os arquivos correspondentes ao e-book em ``docs/build/epub/``. Você pode abrir ``Lumache.epub`` com um visualizador de e-book compatível com EPUB, como `Calibre <https://calibre-ebook.com/>`_ ou visualizar ``index.xhtml`` em um navegador web.

source: To quickly display a complete list of possible output formats, plus some extra useful commands, you can run :code:`make help`.
fr: Pour afficher la liste complète des formats de sortie disponibles, plus quelques commandes utiles supplémentaires, vous pouvez exécuter :code:`make help`.
pt_br: Para exibir rapidamente uma lista completa de possíveis formatos de saída, além de alguns comandos extras úteis, você pode executar :code:`make help`.

source: Each output format has some specific configuration options that you can tune, :ref:`including EPUB <epub-options>`. For instance, the default value of :confval:`epub_show_urls` is ``inline``, which means that, by default, URLs are shown right after the corresponding link, in parentheses. You can change that behavior by adding the following code at the end of your ``conf.py``:
fr: Chaque format de sortie possède des options de configuration spécifiques que vous pouvez ajuster, y compris :ref:`including EPUB <epub-options>`. Entre autres, la valeur par défaut de :confval:`epub_show_urls` est ``inline``, ce qui signifie que les URLs apparaissent juste après le lien correspondant, entre parenthèses. Vous pouvez modifier ce comportement en ajoutant le code suivant à la fin de votre fichier ``conf.py`` :
pt_br: Cada formato de saída possui algumas opções de configuração específicas que você pode ajustar, :ref:`incluindo EPUB <epub-options>`. Por exemplo, o valor padrão de :confval:`epub_show_urls` é ``inline``, o que significa que, por padrão, as URLs são mostradas logo após o link correspondente, entre parênteses. Você pode mudar esse comportamento adicionando o seguinte código no final do seu ``conf.py``:

source: With this configuration value, and after running ``make epub`` again, you will notice that URLs appear now as footnotes, which avoids cluttering the text. Sweet! Read on to explore :doc:`other ways to customize Sphinx </tutorial/more-sphinx-customization>`.
fr: Avec cette valeur, et après avoir exécuté ``make epub`` à nouveau, vous remarquerez que les URLs apparaissent désormais comme des notes de bas de page, évitant ainsi d'encombrer le texte. Joli ! Continuez à lire pour explorer :doc:`d'autres façons de personnaliser Sphinx </tutorial/more-sphinx-customization>`.
pt_br: Com este valor de configuração, e após executar novamente ``make epub``, você notará que as URLs aparecem agora como notas de rodapé, o que evita sobrecarregar o texto. Legal! Continue lendo para explorar :doc:`outras maneiras de personalizar o Sphinx </tutorial/more-sphinx-customization>`.

source: Generating a PDF using Sphinx can be done running ``make latexpdf``, provided that the system has a working LaTeX installation, as explained in the documentation of :class:`sphinx.builders.latex.LaTeXBuilder`. Although this is perfectly feasible, such installations are often big, and in general LaTeX requires careful configuration in some cases, so PDF generation is out of scope for this tutorial.
fr: Générer un PDF en utilisant Sphinx peut se faire en exécutant ``make latexpdf``, pourvu que votre système possède une installation fonctionnelle de LaTeX, tel qu'expliqué dans la documentation de :class:`sphinx.builders.latex.LaTeXBuilder`. Malgré que cela soit parfaitement faisable, de telles installations sont souvent volumineuses et, en général, LaTeX nécessite une configuration soigneuse dans certains cas, mettant la génération de PDF hors du champ de ce tutoriel.
pt_br: A geração de um PDF usando o Sphinx pode ser feita executando ``make latexpdf``, desde que o sistema tenha uma instalação LaTeX funcional, conforme explicado na documentação de :class:`sphinx.builders.latex.LaTeXBuilder`. Embora isso seja perfeitamente viável, tais instalações costumam ser grandes e, em geral, o LaTeX requer configuração cuidadosa em alguns casos, portanto a geração de PDF está fora do escopo deste tutorial.
