Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/tutorial/getting-started.po
Languages: fr, pt_br

source: Getting started
fr: Démarrer avec Sphinx
pt_br: Primeiros passos

source: Setting up your project and development environment
fr: Configurer votre projet et votre environnement de développement
pt_br: Configurando seu projeto e ambiente de desenvolvimento

source: In a new directory, create a file called ``README.rst`` with the following content.
fr: Dans un nouveau répertoire, créer un fichier appelé ``README.rst`` avec le contenu suivant :
pt_br: Em um novo diretório, crie um arquivo chamado ``README.rst`` com o seguinte conteúdo.

source: It is a good moment to create a Python virtual environment and install the required tools. For that, open a command line terminal, ``cd`` into the directory you just created, and run the following commands:
fr: Le moment est venu de créer un environnement virtuel Python et d'installer les outils requis. Pour cela, ouvrez un terminal, ``cd`` dans le répertoire que vous venez de créer, et exécutez les commandes suivantes :
pt_br: É um bom momento para criar um ambiente virtual Python e instalar as ferramentas necessárias. Para isso, abra um terminal de linha de comando, ``cd`` no diretório que você acabou de criar, e execute os seguintes comandos:

source: The installation method used above is described in more detail in :ref:`install-pypi`. For the rest of this tutorial, the instructions will assume a Python virtual environment.
fr: La méthode d'installation utilisée ci-dessus est décrite plus en détails dans :ref:`install-pypi` . Pour le reste de ce tutoriel, les instructions supposeront un environnement virtuel Python.
pt_br: O método de instalação usado acima é descrito com mais detalhes em :ref:`install-pypi`. No restante deste tutorial, as instruções presumirão estar um ambiente virtual Python.

source: If you executed these instructions correctly, you should have the Sphinx command line tools available. You can do a basic verification running this command:
fr: Si vous avez correctement exécuté les instructions, vous devriez disposer des outils en ligne de commande de Sphinx. Vous pouvez le vérifiez simplement en exécutant la commande :
pt_br: Se você executou essas instruções corretamente, deverá ter as ferramentas de linha de comando do Sphinx disponíveis. Você pode fazer uma verificação básica executando este comando:

source: If you see a similar output, you are on the right path!
fr: Si une sortie similaire est affichée, vous êtes en bonne voie !
pt_br: Se você vir uma saída semelhante, você está no caminho certo!

source: Creating the documentation layout
fr: Créer la structure de la documentation
pt_br: Criando o layout da documentação

source: Then from the command line, run the following command:
fr: Ensuite, depuis la ligne de commande, exécutez la commande suivante :
pt_br: Em seguida, na linha de comando, execute o seguinte comando:

source: This will present to you a series of questions required to create the basic directory and configuration layout for your project inside the ``docs`` folder. To proceed, answer each question as follows:
fr: Celle-ci vous posera une série de questions nécessaires à la création de la structure de base de répertoires et de configuration pour le projet dans le dossier ``docs``. Pour continuer, répondez à chaque question de la manière suivante :
pt_br: Isto apresentará a você uma série de perguntas necessárias para criar o diretório básico e o layout de configuração do seu projeto dentro da pasta ``docs``. Para prosseguir, responda a cada pergunta da seguinte forma:

source: ``> Separate source and build directories (y/n) [n]``: Write "``y``" (without quotes) and press :kbd:`Enter`.
fr: ``> Séparer les répertoires source et de sortie (y/n) [n]``: Tapez "``y``" (sans guillemets) et pressez :kbd:`Entrée`.
pt_br: ``> Separar os diretórios de origem e de construção (y/n) [n]``: Escreva "``y``" (sem aspas) e pressione :kbd:`Enter`.

source: ``> Project name``: Write "``Lumache``" (without quotes) and press :kbd:`Enter`.
fr: ``> Nom du projet``: Saisissez "``Lumache``" (sans guillemets) et pressez :kbd:`Entrée`.
pt_br: ``> Nome do projeto``: Escreva "``Lumache``" (sem aspas) e pressione :kbd:`Enter`.

source: ``> Author name(s)``: Write "``Graziella``" (without quotes) and press :kbd:`Enter`.
fr: ``> Nom(s) de(s) l'auteur(s)``: Écrivez "``Graziella``" (sans guillemets) et pressez :kbd:`Entrée`.
pt_br: ``> Nome(s) de autor(es)``: Escreva "``Graziella``" (sem aspas) e pressione :kbd:`Enter`.

source: ``> Project release []``: Write "``0.1``" (without quotes) and press :kbd:`Enter`.
fr: ``> Version du projet []``: Saisissez "``0.1``" (sans guillemets) et pressez :kbd:`Entrée`.
pt_br: ``> Lançamento do projeto []``: Escreva "``0.1``" (sem aspas) e pressione :kbd:`Enter`.

source: ``> Project language [en]``: Leave it empty (the default, English) and press :kbd:`Enter`.
fr: ``> Langue du projet [en]``: Laissez vide (par défaut, Anglais) et pressez :kbd:`Entrée`.
pt_br: ``> Idioma do projeto [en]``: Deixe vazio (o padrão, inglês) e pressione :kbd:`Enter`.

source: After the last question, you will see the new ``docs`` directory with the following content.
fr: Passé la dernière question, vous verrez le répertoire ``docs`` avec le contenu suivant :
pt_br: Após a última pergunta, você verá o novo diretório ``docs`` com o seguinte conteúdo.

source: The purpose of each of these files is:
fr: L'objet de chacun de ces fichiers est :
pt_br: O objetivo de cada um desses arquivos é:

source: An empty directory (for now) that will hold the rendered documentation.
fr: Un dossier vide (pour le moment) qui recevra la documentation générée
pt_br: Um diretório vazio (por enquanto) que conterá a documentação renderizada.

source: ``make.bat`` and ``Makefile``
fr: ``make.bat`` et ``Makefile``
pt_br: ``make.bat`` e ``Makefile``

source: Convenience scripts to simplify some common Sphinx operations, such as rendering the content.
fr: Scripts pratiques pour simplifier certaines opérations Sphinx courantes, telles que générer le contenu.
pt_br: Scripts de conveniência para simplificar algumas operações comuns do Sphinx, como renderizar o conteúdo.

source: A Python script holding the configuration of the Sphinx project. It contains the project name and release you specified to ``sphinx-quickstart``, as well as some extra configuration keys.
fr: Un script Python contenant la configuration du projet Sphinx. Il inclut le nom du projet et la version donnés à ``sphinx-quickstart``, ainsi que quelques paramètres supplémentaires.
pt_br: Um script Python que contém a configuração do projeto Sphinx. Ele contém o nome do projeto e a versão que você especificou em ``sphinx-quickstart``, bem como algumas chaves de configuração extras.

source: The :term:`root document` of the project, which serves as welcome page and contains the root of the "table of contents tree" (or *toctree*).
fr: Le :term:`document racine` du projet, qui sert de page d'accueil et contient la racine de "l'arborescence de la table des matières" (ou *toctree*).
pt_br: O :term:`documento raiz` do projeto, que serve como página de boas-vindas e contém a raiz da "árvore do índice" (ou *toctree*).

source: Thanks to this bootstrapping step, you already have everything needed to render the documentation as HTML for the first time. To do that, run this command:
fr: Grâce à cette étape d'initialisation, vous avez déjà tout ce qu'il faut pour générer la documentation au format HTML pour la première fois. Pour cela, exécutez cette commande :
pt_br: Graças a esta etapa de inicialização, você já tem tudo o que precisa para renderizar a documentação como HTML pela primeira vez. Para fazer isso, execute este comando:

source: And finally, open ``docs/build/html/index.html`` in your browser. You should see something like this:
fr: Et finalement, ouvrez le fichier ``docs/build/html/index.html`` dans votre navigateur. Vous devriez voir affichée une page comme celle-ci :
pt_br: E finalmente, abra ``docs/build/html/index.html`` em seu navegador. Você deverá ver algo assim:

source: Freshly created documentation of Lumache
fr: La documentation fraîchement crée de Lumache
pt_br: Documentação recém-criada de Lumache

source: There we go! You created your first HTML documentation using Sphinx. Now you can start :doc:`customizing it </tutorial/first-steps>`.
fr: Nous y voilà ! Vous venez de créer votre première documentation HTML avec Sphinx. Maintenant, vous pouvez commencer à :doc:`la personnaliser </tutorial/first-steps>`.
pt_br: Aqui vamos nós! Você criou sua primeira documentação HTML usando o Sphinx. Agora você pode começar a :doc:`personalizá-la </tutorial/first-steps>`.
