Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/tutorial/more-sphinx-customization.po
Languages: fr, pt_br

source: More Sphinx customization
fr: Personnaliser votre projet Sphinx
pt_br: Mais personalização do Sphinx

source: There are two main ways to customize your documentation beyond what is possible with core Sphinx: extensions and themes.
fr: Il existe deux méthodes principales de personnaliser votre documentation au-delà de ce qu'il est possible avec le noyau Sphinx: les extensions et les thèmes.
pt_br: Existem duas maneiras principais de personalizar sua documentação além do que é possível com o Sphinx base: extensões e temas.

source: Enabling a built-in extension
fr: Activer une extension intégrée
pt_br: Habilitando uma extensão embutida

source: In addition to these configuration values, you can customize Sphinx even more by using :doc:`extensions </usage/extensions/index>`. Sphinx ships several :ref:`builtin ones <builtin-extensions>`, and there are many more :ref:`maintained by the community <third-party-extensions>`.
fr: En plus de ses options de configuration, vous pouvez personnaliser Sphinx encore davantage en utilisant des :doc:`extensions </usage/extensions/index>`. Sphinx en livre :ref:`plusieurs intégrées <builtin-extensions>`, et il en existe bien plus encore :ref:`maintenues par la communauté <third-party-extensions>`.
pt_br: Além desses valores de configuração, você pode personalizar ainda mais o Sphinx usando :doc:`extensões </usage/extensions/index>`. O Sphinx inclui várias :ref:`extensões embutidas <builtin-extensions>` e há muitos mais :ref:`mantidas pela comunidade <third-party-extensions>`.

source: For example, to enable the :mod:`sphinx.ext.duration` extension, locate the ``extensions`` list in your ``conf.py`` and add one element as follows:
fr: Par exemple, pour activer l'extension :mod:`sphinx.ext.duration`, localisez la liste ``extensions`` dans votre fichier ``conf.py`` et ajoutez un élément comme suit :
pt_br: Por exemplo, para habilitar a extensão :mod:`sphinx.ext.duration`, localize a lista ``extensions`` em seu ``conf.py`` e adicione um elemento como segue:

source: After that, every time you generate your documentation, you will see a short durations report at the end of the console output, like this one:
fr: Après cela, chaque fois que vous générez votre documentation, vous verrez un bref rapport de durées à la fin de la sortie sur la console, tel que celui-ci :
pt_br: Depois disso, toda vez que você gerar sua documentação, você verá um relatório de durações curtas no final da saída do console, como este:

source: Using a third-party HTML theme
fr: Utiliser un thème HTML tiers
pt_br: Usando um tema HTML de terceiros

source: Themes, on the other hand, are a way to customize the appearance of your documentation. Sphinx has several :ref:`builtin themes <builtin-themes>`, and there are also `third-party ones <https://sphinx-themes.org/>`_.
fr: Les thèmes, de leur côté, sont un moyen de personnaliser l'apparence de votre documentation. Sphinx possède plusieurs :ref:`thèmes intégrés <builtin-themes>`, et il existe aussi des :ref:`thèmes tiers <https://sphinx-themes.org/>`_.
pt_br: Os temas, por outro lado, são uma forma de personalizar a aparência da sua documentação. O Sphinx tem vários :ref:`temas embutidos <builtin-themes>` e também existem `temas de terceiros <https://sphinx-themes.org/>`_.

source: For example, to use the `Furo <https://pradyunsg.me/furo/>`_ third-party theme in your HTML documentation, first you will need to install it with ``pip`` in your Python virtual environment, like this:
fr: Par exemple, pour utiliser le thème tiers `Furo <https://pradyunsg.me/furo/>`_ pour votre documentation HTML, vous devrez d'abord l'installer avec ``pip`` dans votre environnement virtuel Python, comme ceci :
pt_br: Por exemplo, para usar o tema de terceiros `Furo <https://pradyunsg.me/furo/>`_ em sua documentação HTML, primeiro você precisará instalá-lo com ``pip`` em seu ambiente virtual Python, assim:

source: And then, locate the ``html_theme`` variable on your ``conf.py`` and replace its value as follows:
fr: Puis, localisez le paramètre ``html_theme`` dans votre fichier ``conf.py``, et remplacez sa valeur comme suit :
pt_br: E então, localize a variável ``html_theme`` em seu ``conf.py`` e substitua seu valor da seguinte forma:

source: With this change, you will notice that your HTML documentation has now a new appearance:
fr: Avec ce changement, vous constaterez que votre documentation présente une nouvelle apparence :
pt_br: Com esta mudança, você notará que sua documentação HTML agora está com uma nova aparência:

source: HTML documentation of Lumache with the Furo theme
fr: Documentation HTML de Lumache avec le thème Furo
pt_br: Documentação HTML do Lumache com o tema Furo

source: It is now time to :doc:`expand the narrative documentation and split it into several documents </tutorial/narrative-documentation>`.
fr: Il est maintenant temps :doc:`d'étendre le contenu de la documentation et de le séparer en plusieurs documents </tutorial/narrative-documentation>`.
pt_br: Agora é hora de :doc:`expandir a documentação narrativa e dividi-la em vários documentos </tutorial/narrative-documentation>`.
