Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/tutorial/narrative-documentation.po
Languages: fr, ja

source: Narrative documentation in Sphinx
fr: Documentation narrative dans Sphinx
ja: Sphinx におけるナラティブドキュメンテーション

source: Structuring your documentation across multiple pages
fr: Structurer votre documentation sur plusieurs pages
ja: 複数のページにまたがるドキュメンテーションを構造化することについて

source: The file ``index.rst`` created by ``sphinx-quickstart`` is the :term:`root document`, whose main function is to serve as a welcome page and to contain the root of the "table of contents tree" (or *toctree*). Sphinx allows you to assemble a project from different files, which is helpful when the project grows.
fr: Le fichier ``index.rst`` créé par ``sphinx-quickstart`` est le :term:`document racine`, dont la fonction essentielle est de servir de page d'accueil et decontenir la racine de "l'arborescence de la table des matières" (ou *toctree*). Sphinx vous permet d'assembler votre projet à partir de différents fichiers, ce qui s'avère utile lorsque le projet grandit.
ja: ``sphinx-quickstart`` によって作成されたファイル ``index.rst`` は :term:`root document` であり、その主な機能は、ウェルカムページの役目を果たすこと、そして「目次ツリー」 (もしくは *toctree*) のルートを含むこと、です。 Sphinx を使用すると、異なる複数のファイルから一つのプロジェクトを構築することができます。これは、プロジェクトの規模が拡大する場合に役立ちます。

source: As an example, create a new file ``docs/source/usage.rst`` (next to ``index.rst``) with these contents:
fr: À titre d'exemple, créez un fichier ``docs/source/usage.rst`` (à côté de ``index.rst``) avec le contenu suivant :
ja: 例として、 ``docs/source/usage.rst`` を (``index.rst`` と同じディレクトリに) 下記の内容で作成してみましょう:

source: This new file contains two :ref:`section <rst-sections>` headers, normal paragraph text, and a :rst:dir:`code-block` directive that renders a block of content as source code, with appropriate syntax highlighting (in this case, generic ``console`` text).
fr: Ce fichier contient deux titres de :ref:`section <rst-sections>`, un paragraphe de texte normal, et une directive :rst:dir:`code-block` qui restitue un bloc de contenu sous la forme de code source, avec la coloration syntaxique appropriée (dans ce cas, texte de ``console`` générique).
ja: この新しいファイルは2つの :ref:`section` 見出しと普通の段落テキスト、そして1つの :rst:dir:`code-block` ディレクティブを持っています。:rst:dir:`code-block` ディレクティブはそのブロックの内容を文法的に適切なシンタックスハイライトを付けてソースコードとしてレンダリングします (この場合、 一般的な ``console`` テキストのハイライトになります)。

source: The structure of the document is determined by the succession of heading styles, which means that, by using ``---`` for the "Installation" section after ``===`` for the "Usage" section, you have declared "Installation" to be a *subsection* of "Usage".
fr: La structure du document est déterminée par la succession de styles de titres, ce qui signifie que, en utilisant ``---``` pour la section "Installation" après ``===`` pour la section "Usage", vous avez déclaré que "Installation" était une sous-section de "Usage".
ja: ドキュメントの構造は、一連の見出しスタイルによって決定されます。それは 「使用法」セクションのための「===」の後に、「インストール」セクションのための「---」を使用することで、あなたが 「使用法」の *サブセクション* として「インストール」セクションを宣言していることになります。

source: To complete the process, add a ``toctree`` :ref:`directive <rst-directives>` at the end of ``index.rst`` including the document you just created, as follows:
fr: Pour compléter la procédure, ajoutez une :ref:`directive <rst-directives>` ``toctree`` à la fin du fichier ``index.rst`` en y incluant le document juste créé, comme suit :
ja: プロセスを終わらせるために、 あなたが今ちょうど作成したドキュメントを含むように ``toctree`` :ref:`directive` を ``index.rst`` の終わりに下記のように追加してみましょう:

source: This step inserts that document in the root of the *toctree*, so now it belongs to the structure of your project, which so far looks like this:
fr: Cette étape insère le document à la racine de la *toctree*, qui fait désormais parti de la structure de votre projet, qui à ce stade se présente comme ceci :
ja: このステップは、そのドキュメントを *toctree* のルートに挿入します。 そのため今そのドキュメントは、プロジェクトの構造に属するようになっています。今までで、次のように見えるようになっているでしょう:

source: If you build the HTML documentation running ``make html``, you will see that the ``toctree`` gets rendered as a list of hyperlinks, and this allows you to navigate to the new page you just created. Neat!
fr: Si vous générez la documentation HTML en exécutant ``make html``, vous verrez que ``toctree`` est rendu comme une liste d'hyperliens, ce qui vous permet de naviguer vers la page nouvellement créée. Propre !
ja: ``make html`` を実行してHTMLのドキュメンテーションを作成すると、 ``toctree`` がハイパーリンクのリストとしてレンダリングされることがわかります。これにより、作成したばかりの新しいページにナビゲートできるようになりました。整っていますね！

source: Documents outside a *toctree* will result in ``WARNING: document isn't included in any toctree`` messages during the build process, and will be unreachable for users.
fr: Les documents en dehors de la *toctree* provoquerons un message ``WARNING: Le document n'est inclus dans aucune toctree.`` pendant le processus de génération, et sera inaccessibles pour le lecteur.
ja: *toctree* の外にあるドキュメントは、ビルドプロセス中に ``WARNING: document isn't included in any toctree`` というメッセージになり、ユーザーには手の届かないものとなります。

source: Adding cross-references
fr: Ajouter des références croisées
ja: クロスリファレンスを追加することについて

source: One powerful feature of Sphinx is the ability to seamlessly add :ref:`cross-references <xref-syntax>` to specific parts of the documentation: a document, a section, a figure, a code object, etc. This tutorial is full of them!
fr: Une des puissantes fonctionnalités de Sphinx est la possibilité d'ajouter facilement des :ref:`références croisées <xref-syntax>` vers des éléments spécifiques de la documentation : un document, une section, une illustration, un objet code, etc. Le tutoriel en est plein !
ja: Sphinxの強力な機能の1つは、ドキュメンテーションの特定の部分: ドキュメント、セクション、図、コードオブジェクトなど に :ref:`cross-references <xref-syntax>`をシームレスに追加できる能力です。このチュートリアルはそれらでいっぱいです！

source: To add a cross-reference, write this sentence right after the introduction paragraph in ``index.rst``:
fr: Pour ajouter une référence croisée, ajoutez cette phrase juste après le paragraphe d'introduction dans ``index.rst`` :
ja: クロスリファレンスを追加するには、 ``index.rst`` のイントロダクションの段落の直後に次の文を書きます:

source: The :rst:role:`doc` :ref:`role <rst-roles-alt>` you used automatically references a specific document in the project, in this case the ``usage.rst`` you created earlier.
fr: Le :ref:`rôle <rst-roles-alt>`` :rst:role:`doc` utilisé référence automatiquement un document spécifique dans le projet, dans ce cas le fichier ``usage.rst`` créé précédemment.
ja: あなたが使用した :rst:role:`doc` :ref:`role<rst-roles-alt>`は、プロジェクト内の特定のドキュメント、この場合は前に作成した ``usage.rst`` を自動的に参照します。

source: Alternatively, you can also add a cross-reference to an arbitrary part of the project. For that, you need to use the :rst:role:`ref` role, and add an explicit *label* that acts as :duref:`a target <hyperlink-targets>`.
fr: Par ailleurs, vous pouvez aussi ajouter une référence croisée vers une partie quelconque du projet. Pour cela, vous devez utiliser le rôle :rst:role:`ref`, et ajouter une *étiquette* faisant office de :duref:`cible <hyperlink-targets>`.
ja: または、プロジェクトの任意の部分にクロスリファレンスを追加することもできます。そのためには、 :rst:role:`ref` ロールを使用し、 :duref:`a target` として機能する明示的な *ラベル* を追加する必要があります。

source: For example, to reference the "Installation" subsection, add a label right before the heading, as follows:
fr: Par exemple, pour référencer la sous-section "Installation", ajoutez une étiquette juste avant le titre, comme suit :
ja: たとえば、「インストール」サブセクションを参照するには、次のように、見出しの直前にラベルを追加します:

source: And make the sentence you added in ``index.rst`` look like this:
fr: Et modifiez la phrase ajoutée au fichier ``index.rst`` comme ceci :
ja: そして、 あなたが ``index.rst`` に追加した文を次のようにします:

source: Notice a trick here: the ``install`` part specifies how the link will look like (we want it to be a specific word, so the sentence makes sense), whereas the ``<installation>`` part refers to the actual label we want to add a cross-reference to. If you do not include an explicit title, hence using ``:ref:`installation```, the section title will be used (in this case, ``Installation``). Both the ``:doc:`` and the ``:ref:`` roles will be rendered as hyperlinks in the HTML documentation.
fr: Notez une astuce ici : la partie ``install`` précise la façon dont apparaîtra le lien (nous voulons un texte précis, afin que la phrase ait un sens), alors que la partie ``<installation>`` renvoie véritablement à l'étiquette vers laquelle nous voulons ajouter une référence croisée. Si vous n'incluez pas un titre explicitement, utilisant donc :ref:``installation``, le titre de la section sera utilisé par défaut (dans ce cas, "Installation"). Les rôles ``:doc:`` et ``:ref:`` seront tous deux rendus comme des hyperliens dans la documentation HTML.
ja: ここでのトリックに注意してください: ``install`` の部分はリンクがどのように見えるかを指定します (特定の単語にしたいので、その文は筋が通っています)。 一方、 ``<installation>`` の部分は私たちがクロスリファレンスを追加したい実際のラベルを参照します。 明示的なタイトルを含めない場合、``:ref:`installation``` を使用すると、そのセクションタイトルが使用されます (この場合は、``Installation``)。 ``:doc``: と ``:ref:`` の両方は、HTML ドキュメンテーション でハイパーリンクとしてレンダリングされます。

source: What about :doc:`documenting code objects in Sphinx </tutorial/describing-code>`? Read on!
fr: Qu'en est-il de la :doc:`documentation d'objets de code dans Sphinx </tutorial/describing-code>` ? Lisez la suite !
ja: :doc:`documenting code objects in Sphinx </tutorial/describing-code>` のコードオブジェクトのドキュメント化についてはどうですか？読んでみてください。
