Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/authors.po
Languages: pt_br

source: Sphinx authors
pt_br: Autores do Sphinx

source: Maintainers
pt_br: Mantenedores

source: *Listed alphabetically in forename, surname order*
pt_br: *Listado alfabeticamente na ordem nome e sobrenome*

source: Contributors
pt_br: Contribuidores

source: Aaron Carlisle -- basic theme and templating improvements
pt_br: Aaron Carlisle -- melhorias no tema básico e na modelagem

source: Adam Dangoor -- improved static typing
pt_br: Adam Dangoor -- melhorada a tipagem estática

source: Adrián Chaves (Gallaecio) -- coverage builder improvements
pt_br: Adrián Chaves (Gallaecio) -- melhorias na cobertura do construtor

source: Alastair Houghton -- Apple Help builder
pt_br: Alastair Houghton -- construtor Ajuda Apple

source: Alex Gaynor -- linkcheck retry on errors
pt_br: Alex Gaynor -- retentativa em caso de erros no linkcheck

source: Alexander Todorov -- inheritance_diagram tests and improvements
pt_br: Alexander Todorov -- melhorias e testes em inheritance_diagram

source: Andi Albrecht -- agogo theme
pt_br: Andi Albrecht -- tema agogo

source: Antonio Valentino -- qthelp builder, docstring inheritance
pt_br: Antonio Valentino -- construtor qthelp, herança de docstring

source: Antti Kaihola -- doctest extension (skipif option)
pt_br: Antti Kaihola -- extensão de doctest (opção skipif)

source: Barry Warsaw -- setup command improvements
pt_br: Barry Warsaw -- melhorias no comando setup

source: Bart Kamphorst -- warning improvements
pt_br: Bart Kamphorst -- melhorias em avisos

source: Ben Egan -- Napoleon improvements & viewcode improvements
pt_br: Ben Egan -- melhorias em Napoleon e melhorias no viewcode

source: Blaise Laflamme -- pyramid theme
pt_br: Blaise Laflamme -- tema pyramid

source: Brecht Machiels -- builder entry-points
pt_br: Brecht Machiels -- pontos de entrada de construtor

source: Bruce Mitchener -- Minor epub improvement
pt_br: Bruce Mitchener -- pequena melhoria em epub

source: Buck Evan -- dummy builder
pt_br: Buck Evan -- construtor dummy

source: Charles Duffy -- original graphviz extension
pt_br: Charles Duffy -- extensão graphviz original

source: Chris Barrick -- Napoleon type preprocessing logic
pt_br: Chris Barrick -- Lógica de preprocessamento de tipos do Napoleon

source: Chris Holdgraf -- improved documentation structure
pt_br: Chris Holdgraf -- melhoria na estrutura da documentação

source: Chris Lamb -- reproducibility fixes
pt_br: Chris Lamb -- correções de reprodutibilidade

source: Christopher Perkins -- autosummary integration
pt_br: Christopher Perkins -- integração do autosummary

source: Dan MacKinlay -- metadata fixes
pt_br: Dan MacKinlay -- correções de metadados

source: Daniel Bültmann -- todo extension
pt_br: Daniel Bültmann -- extensão todo

source: Daniel Eades -- improved static typing
pt_br: Daniel Eades -- melhoria de tipagem estática

source: Daniel Hahler -- testing and CI improvements
pt_br: Daniel Hahler -- melhorias nos testes e CI

source: Daniel Pizetta -- inheritance diagram improvements
pt_br: Daniel Pizetta -- Melhorias no diagrama de herança

source: Dave Hoese -- ``sphinx.ext.viewcode`` and ``sphinx.ext.apidoc`` bug fixes
pt_br: Dave Hoese -- correções de bugs de ``sphinx.ext.viewcode`` e ``sphinx.ext.apidoc``

source: Dave Kuhlman -- original LaTeX writer
pt_br: Dave Kuhlman -- escritor do LaTeX original

source: Dimitri Papadopoulos Orfanos -- linting and spelling
pt_br: Dimitri Papadopoulos Orfanos -- linting e ortogafia

source: Dmitry Shachnev -- modernisation and reproducibility
pt_br: Dmitry Shachnev -- modernização e reprodutibilidade

source: Doug Hellmann -- graphviz improvements
pt_br: Doug Hellmann -- melhorias no graphviz

source: Eric Larson -- better error messages
pt_br: Eric Larson -- melhores mensagens de erro

source: Eric N. Vander Weele -- autodoc improvements
pt_br: Eric N. Vander Weele -- melhorias no autodoc

source: Eric Wieser -- autodoc improvements
pt_br: Eric Wieser -- melhorias de autodoc

source: Erik Bedard -- config options for :mod:`sphinx.ext.duration`
pt_br: Erik Bedard -- opções de configuração para :mod:`sphinx.ext.duration`

source: Etienne Desautels -- apidoc module
pt_br: Etienne Desautels -- módulo apidoc

source: Ezio Melotti -- collapsible sidebar JavaScript
pt_br: Ezio Melotti -- barra lateral retrátil JavaScript

source: Filip Vavera -- napoleon todo directive
pt_br: Filip Vavera -- diretiva todo do napoleon

source: Florian Best -- log improvements
pt_br: Florian Best -- melhoria nos registros

source: Glenn Matthews -- python domain signature improvements
pt_br: Glenn Matthews -- melhorias na assinatura de domínio Python

source: Gregory Szorc -- performance improvements
pt_br: Gregory Szorc -- melhoria de desempenho

source: Henrique Bastos -- SVG support for graphviz extension
pt_br: Henrique Bastos -- Suporte a SVG para extensão graphviz

source: Hernan Grecco -- search improvements
pt_br: Hernan Grecco -- melhorias no mecanismo busca

source: Hong Xu -- svg support in imgmath extension and various bug fixes
pt_br: Hong Xu -- suporte svg na extensão imgmath e várias correções erros

source: Horst Gutmann -- internationalization support
pt_br: Horst Gutmann -- suporte à internacionalização

source: Hugo van Kemenade -- support FORCE_COLOR and NO_COLOR
pt_br: Hugo van Kemenade -- suporte a FORCE_COLOR e NO_COLOR

source: Ian Hunt-Isaak -- typealias reference improvement
pt_br: Ian Hunt-Isaak -- melhoria na referência de typealias

source: Ian Lee -- quickstart improvements
pt_br: Ian Lee -- melhorias no quickstart

source: Jacob Mason -- websupport library (GSOC project)
pt_br: Jacob Mason -- biblioteca websupport (projeto GSOC)

source: James Addison -- linkcheck and HTML search improvements
pt_br: James Addison -- melhorias no linkcheck e na pesquisa HTML

source: Jeppe Pihl -- literalinclude improvements
pt_br: Jeppe Pihl -- melhorias no literalinclude

source: Jeremy Maitin-Shepard -- C++ domain improvements
pt_br: Jeremy Maitin-Shepard -- melhorias no domínio C++

source: Joel Wurtz -- cellspanning support in LaTeX
pt_br: Joel Wurtz -- suporte a cellspanning em LaTeX

source: John Waltman -- Texinfo builder
pt_br: John Waltman -- construtor Texinfo

source: Jon Dufresne -- modernisation
pt_br: Jon Dufresne -- modernização

source: Josip Dzolonga -- coverage builder
pt_br: Josip Dzolonga -- construtor coverage

source: Juan Luis Cano Rodríguez -- new tutorial (2021)
pt_br: Juan Luis Cano Rodríguez -- novo tutorial (2021)

source: Julien Palard -- Colspan and rowspan in text builder
pt_br: Julien Palard -- colspan e rowspan no construtor text

source: Justus Magin -- napoleon improvements
pt_br: Justus Magin -- melhorias no napoleon

source: Kazuya Take -- ``sphinx.testing.path`` bug fix
pt_br: Kazuya Take -- correção de bugs de ``sphinx.testing.path``

source: Kevin Dunn -- MathJax extension
pt_br: Kevin Dunn -- extensão MathJax

source: KINEBUCHI Tomohiko -- typing Sphinx as well as docutils
pt_br: KINEBUCHI Tomohiko -- tipando o Sphinx assim como o docutils

source: Kurt McKee -- documentation updates
pt_br: Kurt McKee -- atualização da documentação

source: Lars Hupfeldt Nielsen - OpenSSL FIPS mode md5 bug fix
pt_br: Lars Hupfeldt Nielsen - correção de bugs no md5 do modo OpenSSL FIPS

source: Louis Maddox -- better docstrings
pt_br: Louis Maddox -- melhores docstrings

source: Łukasz Langa -- partial support for autodoc
pt_br: Łukasz Langa -- suporte parcial para autodoc

source: Marco Buttu -- doctest extension (pyversion option)
pt_br: Marco Buttu -- extensão doctest (opção pyversion)

source: Mark Ostroth -- semantic HTML contributions
pt_br: Mark Ostroth -- contribuições semânticas do HTML

source: Martin Hans -- autodoc improvements
pt_br: Martin Hans -- melhorias no autodoc

source: Martin Larralde -- additional napoleon admonitions
pt_br: Martin Larralde -- advertências adicionais no napoleon

source: Martin Liška -- option directive and role improvements
pt_br: Martin Liška -- diretiva de opção e melhorias de função

source: Martin Mahner -- nature theme
pt_br: Martin Mahner -- tema nature

source: Martin Matouš -- initial support for PEP 695
pt_br: Martin Matouš -- suporte inicial para PEP 695

source: Matthew Fernandez -- todo extension fix
pt_br: Matthew Fernandez -- correções da extensão todo

source: Matthew Woodcraft -- text output improvements
pt_br: Matthew Woodcraft -- melhorias na saída de texto

source: Matthias Geier -- style improvements
pt_br: Matthias Geier -- melhorias de estilo

source: Michael Droettboom -- inheritance_diagram extension
pt_br: Michael Droettboom -- extensão inheritance_diagram

source: Michael Wilson -- Intersphinx HTTP basic auth support
pt_br: Michael Wilson -- suporte a autenticação HTTP básica no intersphinx

source: Nathan Damon -- bugfix in validation of static paths in html builders
pt_br: Nathan Damon -- correção de bugs na validação de caminhos estáticos em construtores html

source: Nils Kattenbeck -- pygments dark style
pt_br: Nils Kattenbeck -- estilo escuro de pygments

source: Pauli Virtanen -- autodoc improvements, autosummary extension
pt_br: Pauli Virtanen -- melhorias no autodoc, extensão autosummary

source: Rafael Fontenelle -- internationalisation
pt_br: Rafael Fontenelle -- internacionalização

source: \A. Rafey Khan -- improved intersphinx typing
pt_br: \A. Rafey Khan -- tipagem intersphinx melhorada

source: Rui Pinheiro -- Python 3.14 forward references support
pt_br: Rui Pinheiro -- Suporte a referências futuras do Python 3.14

source: Roland Meister -- epub builder
pt_br: Roland Meister -- construtor epub

source: Sebastian Wiesner -- image handling, distutils support
pt_br: Sebastian Wiesner -- manipulação de imagens, suporte distutils

source: Slawek Figiel -- additional warning suppression
pt_br: Slawek Figiel -- supressão de aviso adicional

source: Stefan Seefeld -- toctree improvements
pt_br: Stefan Seefeld -- melhorias no toctree

source: Stefan van der Walt -- autosummary extension
pt_br: Stefan van der Walt -- extensão autosummary

source: Steve Piercy -- documentation improvements
pt_br: Steve Piercy -- melhorias na documentação

source: Szymon Karpinski -- intersphinx improvements
pt_br: Szymon Karpinski -- melhoria em intersphinx

source: \T. Powers -- HTML output improvements
pt_br: \T. Powers -- HTML output melhoria

source: Taku Shimizu -- epub3 builder
pt_br: Taku Shimizu -- construtor epub3

source: Tamika Nomara -- bug fixes
pt_br: Tamika Nomara -- correções de bugs

source: Thomas Lamb -- linkcheck builder
pt_br: Thomas Lamb -- construtor linkcheck

source: Thomas Waldmann -- apidoc module fixes
pt_br: Thomas Waldmann -- correções no módulo apidoc

source: Till Hoffmann -- doctest option to exit after first failed test
pt_br: Till Hoffmann -- opção de doctest para sair após o primeiro teste com falha

source: Tim Hoffmann -- theme improvements
pt_br: Tim Hoffmann -- melhorias no tema

source: Victor Wheeler -- documentation improvements
pt_br: Victor Wheeler -- melhorias na documentação

source: Vince Salvino -- JavaScript search improvements
pt_br: Vince Salvino -- melhorias na pesquisa JavaScript

source: Will Maier -- directory HTML builder
pt_br: Will Maier -- construtor diretório HTML

source: Zac Hatfield-Dodds -- doctest reporting improvements, intersphinx performance
pt_br: Zac Hatfield-Dodds -- melhorias de relatórios de doctext, desempenho do intersphinx

source: Former maintainers
pt_br: Antigos mantenedores

source: Former maintainers are those who haven't committed in the last two years. Those on the list below may become active maintainers again at any time.
pt_br: Antigos mantenedores são aqueles que não se comprometeram nos últimos dois anos. Aqueles na lista abaixo podem se tornar mantenedores ativos novamente a qualquer momento.

source: Many thanks for all contributions!
pt_br: Muito Obrigado a todas contribuições!
