Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/index.po
Languages: ru

source: The Basics
ru: Основы

source: User guide
ru: Руководство пользователя

source: Community
ru: Сообщество

source: Reference
ru: Ссылки

source: Create intelligent and beautiful documentation with ease
ru: С легкостью создавайте понятную и наглядную документацию

source: 📝 Rich Text Formatting
ru: 📝 Форматирование расширенного текста

source: Author in :ref:`reStructuredText <rst-primer>` or :ref:`MyST Markdown <markdown>` to create highly structured technical documents, including tables, highlighted code blocks, mathematical notations, and more.
ru: Разрабатывайте документацию, используя :ref:`reStructuredText <rst-primer>` или :ref:`MyST Markdown <markdown>`, чтобы создать высокоструктурированные технические документы, которые включают таблицы, выделенные блоки кода, математические обозначения и многое другое.

source: 🔗 Powerful Cross-Referencing
ru: 🔗 Система перекрестных ссылок

source: Create :ref:`cross-references <xref>` within your project, and even across :ref:`different projects <ext-intersphinx>`. Include references to sections, figures, tables, citations, glossaries, code objects, and more.
ru: Создавайте :ref:`перекрестные ссылки <xref>` внутри и между :ref:`своими проектами <ext-intersphinx>`. Доступно добавление ссылок на разделы, изображения, таблицы, цитаты, глоссарии, объекты кода и другое.

source: 📚 Versatile Documentation Formats
ru: 📚 Универсальные форматы документации

source: Generate documentation in the preferred formats of your audience, including HTML, LaTeX (for PDF), ePub, Texinfo, :ref:`and more <builders>`.
ru: Создавайте документацию в форматах, предпочтительных для вашей аудитории, включая HTML, LaTeX (для PDF), ePub, Texinfo, и :ref:`другие <builders>`.

source: 🎨 Extensive Theme Support
ru: 🎨 Расширенная поддержка тем

source: Create visually appealing documentation, with a wide choice of :ref:`built-in <builtin-themes>` and :ref:`third-party <third-party-themes>` HTML themes and the ability to customize or :ref:`create new themes <extension-html-theme>`.
ru: Широкий выбор :ref:`встроенных <builtin-themes>` и :ref:`сторонних <third-party-themes>` HTML-тем, а также возможностью настраивать или :ref:`создавать новые темы <extension-html-theme>` помогает создавать наглядную и легкочитаемую документацию.

source: 🔌 Fully Extensible
ru: 🔌 Полная расширяемость

source: Add custom functionality, via robust :ref:`extension mechanisms <extending-sphinx>` with numerous :ref:`built-in <builtin-extensions>` and :ref:`third-party <third-party-extensions>` extensions available for tasks like creating diagrams, testing code, and more.
ru: Добавляйте :ref:`новые функции <extending-sphinx>` с помощью множества :ref:`встроенных <builtin-extensions>` и :ref:`сторонних <third-party-extensions>` расширений, предназначенных для создания диаграмм, тестирования кода и других задач.

source: 🛠️ Automatic API Documentation
ru: 🛠️ Автоматическая документация API

source: Generate API documentation for Python, C++ and other :ref:`software domains <usage-domains>`, manually or :ref:`automatically from docstrings <ext-autodoc>`, ensuring your code documentation stays up-to-date with minimal effort.
ru: Ручное и :ref:`автоматическое <ext-autodoc>` создание документации API (используя docstrings) доступно для Python, C++ и других :ref:`доменов <usage-domains>`, что обеспечивает актуальность документации вашего кода при минимальных усилиях.

source: 🌍 Internationalization (i18n)
ru: 🌍 Интернационализация (i18n)

source: Add documentation :ref:`translations <intl>` multiple languages to reach a global audience.
ru: Добавляйте :ref:`переводы <intl>` документации на несколько языков, чтобы охватить глобальную аудиторию.

source: 🌟 Active Community and Support
ru: 🌟 Активное сообщество и поддержка

source: Benefit from an :ref:`active community <support-index>`, with numerous resources, tutorials, forums, and examples.
ru: Воспользуйтесь преимуществами :ref:`сообщества Sphinx <support-index>` - его многочисленными источниками информации, туториалами, форумами и примерами.

source: As used by:
ru: Используется в:

source: See below for how to navigate Sphinx's documentation.
ru: Ниже приведена информация о том, как ориентироваться в документации Sphinx.

source: The `Sphinx documentation Table of Contents <contents.html>`_ has a full list of this site's pages.
ru: Полный список страниц этого сайта можно найти в `Содержании <contents.html>`_.

source: Get started
ru: Начало работы

source: These sections cover the basics of getting started with Sphinx, including creating and building your own documentation from scratch.
ru: В этих разделах рассматриваются основы начала работы с Sphinx, включая создание и разработку собственной документации с нуля.

source: These sections cover various topics in using and extending Sphinx for various use-cases. They are a comprehensive guide to using Sphinx in many contexts and assume more knowledge of Sphinx. If you are new to Sphinx, we recommend starting with :ref:`get-started`.
ru: Эти разделы охватывают различные темы по практическому использованию и расширению Sphinx. Они представляют собой полное руководство по использованию Sphinx для разных целей и предполагают наличие глубоких знаний о Sphinx. Если вы новичок в Sphinx, рекомендуем начать с :ref:`get-started`.

source: Community guide
ru: Руководство сообщества

source: Sphinx is community supported and welcomes contributions from anybody. The sections below should help you get started joining the Sphinx community as well as contributing.
ru: Sphinx поддерживается сообществом и приветствует вклад от каждого. Разделы ниже помогут присоединиться к сообществу Sphinx, а также внести свой вклад.

source: See the :doc:`Sphinx contributors' guide <internals/contributing>` if you would like to contribute to the project.
ru: Если вы хотите внести свой вклад в проект, ознакомьтесь с :doc:`этим руководством <internals/contributing>`.

source: Reference guide
ru: Справочное руководство

source: Reference documentation is more complete and programmatic in nature, it is a collection of information that can be quickly referenced. If you would like usecase-driven documentation, see :ref:`get-started` or :ref:`user-guides`.
ru: Справочная документация имеет более полный и программный характер; она содержит информацию, к которой можно быстро обратиться. Если вам нужна документация, основанная на примерах использования (usecase-driven), см. разделы :ref:`get-started` или :ref:`user-guides`.
