Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/man/sphinx-autogen.po
Languages: pt_br, zh_cn

source: Synopsis
pt_br: Sinopse
zh_cn: 概要

source: Description
pt_br: Descrição
zh_cn: 说明

source: :program:`sphinx-autogen` is a tool for automatic generation of Sphinx sources that, using the :rst:dir:`autodoc` extension, document items included in :rst:dir:`autosummary` listing(s).
pt_br: :program:`sphinx-autogen` é uma ferramente para geração automática de código fonte Sphinx que, usando extensões :rst:dir:`autodoc` , documenta itens incluídos na lista(s) :rst:dir:`autosummary`.
zh_cn: :program:`sphinx-autogen` 是一个自动生成Sphinx源的工具，使用:rst:dir:`autodoc` 扩展，记录包含在 :rst:dir:`autosummary`列表中的项。

source: *sourcefile* is the path to one or more reStructuredText documents containing :rst:dir:`autosummary` entries with the ``:toctree::`` option set. *sourcefile* can be an :py:mod:`fnmatch`-style pattern.
pt_br: *sourcefile* é o caminho para um ou mais documentos reStructuredText contendo entradas :rst:dir:`autosummary` com a opção ``:toctree::``. *sourcefile* Pode ser um padrão estilo :py:mod:`fnmatch`.
zh_cn: *sourcefile*是一个或多个reStructuredText文档的路径，该文档包含:rst:dir:`autosummary` 条目，并带有“:toctree::”'选项集。*sourcefile*可以遵循 :py:mod:`fnmatch`样式。

source: Options
pt_br: Opções
zh_cn: 选项

source: Directory to place the output file. If it does not exist, it is created. Defaults to the value passed to the ``:toctree:`` option.
pt_br: Diretório para ser gravado no arquivo de saida. Se não existir será criado. Padrão o valor é passado para opção ``:toctree:``.
zh_cn: 放置输出文件的目录。如果不存在，则创建一个目录。默认为传达给“:toctree:”选项的值。

source: Default suffix to use for generated files. Defaults to ``rst``.
pt_br: Padrão sufixo usado para arquivos gerados. Padrão ``rst``.
zh_cn: 用于生成文件的默认后缀。默认为“rst” 。

source: Custom template directory. Defaults to ``None``.
pt_br: Diretório Modelos Configurados. Padrão ``None``.
zh_cn: 自定义模板目录。默认为“None”。

source: Document imported members.
pt_br: Membros de Documentos importados.
zh_cn: 记录导入的成员。

source: Example
pt_br: Exemplo
zh_cn: 示例

source: Given the following directory structure::
pt_br: Dada a seguinte estrutura de diretórios::
zh_cn: 给定以下目录结构：

source: and assuming ``docs/index.rst`` contained the following:
pt_br: e assumindo que ``docs/index.rst`` contenha:
zh_cn: 并假设“docs/index.rst”包含以下内容：

source: If you run the following:
pt_br: Se executar o seguinte:
zh_cn: 如果您运行以下内容：

source: then the following stub files will be created in ``docs``::
pt_br: então os seguintes arquivos serão criados em ``docs``::
zh_cn: 然后将在“docs:”中创建以下存根文件::

source: and each of those files will contain a :rst:dir:`autodoc` directive and some other information.
pt_br: em cada um dos arquivos irá conter diretiva :rst:dir:`autodoc` e alguma outra informação.
zh_cn: 每个文件都包含一个 :rst:dir:`autodoc` 指令和一些其他信息。

source: See also
pt_br: Ver também
zh_cn: 另请参阅
