Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/man/sphinx-apidoc.po
Languages: pt_br, zh_cn

source: Synopsis
pt_br: Sinopse
zh_cn: 概要

source: **sphinx-apidoc** [*OPTIONS*] -o <*OUTPUT_PATH*> <*MODULE_PATH*> [*EXCLUDE_PATTERN* ...]
pt_br: **sphinx-apidoc** [*OPÇÕES*] -o <*CAMINHO_SAÍDA*> <*CAMINHO_MÓDULO*> [*PADRÃO_EXCLUSÃO* ...]

source: Description
pt_br: Descrição
zh_cn: 说明

source: :program:`sphinx-apidoc` is a tool for automatic generation of Sphinx sources that, using the :py:mod:`~sphinx.ext.autodoc` extension, document a whole package in the style of other automatic API documentation tools.
pt_br: :program:`sphinx-apidoc` é uma ferramenta para geração automática de código-fonte Sphinx que, usando a extensão :py:mod:`~sphinx.ext.autodoc`, documenta um pacote inteiro no estilo de outras ferramentas de documentação automática da API.

source: *MODULE_PATH* is the path to a Python package to document, and *OUTPUT_PATH* is the directory where the generated sources are placed. Any *EXCLUDE_PATTERN*\s given are `fnmatch-style`_ file and/or directory patterns that will be excluded from generation.
pt_br: *MODULE_PATH* é o path para um pacote do Python para documentar, e *OUTPUT_PATH* é o diretório onde as fontes geradas são colocadas. Quaisquer *EXCLUDE_PATTERN*\s são dados do arquivo `fnmatch-style`_ e/ou padrões de diretório que serão excluídos da geração.
zh_cn: *MODULE_PATH*是Python包文档的路径，*OUTPUT_PATH*是所生成源代码所在的目录。任何*EXCLUDE_PATTERN*\s都是`fnmatch-style`_ 文件和（或）目录模式，这些模式将被排除在生成过程之外。

source: ``sphinx-apidoc`` generates source files that use :mod:`sphinx.ext.autodoc` to document all found modules. If any modules have side effects on import, these will be executed by ``autodoc`` when ``sphinx-build`` is run.
pt_br: ``sphinx-apidoc`` gera arquivos de origem que usam :mod:`sphinx.ext.autodoc` para documentar todos os módulos encontrados. Se algum módulo tiver efeitos colaterais na importação, eles serão executados pelo ``autodoc`` quando ``sphinx-build`` for executada.
zh_cn: ``sphinx-apidoc`` 生成源文件，这些文件使用:mod: ' sphinx.ext.的来记录所有找到的模块。如果任何模块对导入有副作用，则在运行“sphinx-build”时，将由“autodoc”执行这些副作用。

source: If you document scripts (as opposed to library modules), make sure their main routine is protected by a ``if __name__ == '__main__'`` condition.
pt_br: Se os scripts do seu documento, (diferentemente de módulos de biblioteca), certificar-se que suas rotinas main estejam protegidas por um ``if __name__ == '__main__'`` condição.
zh_cn: 如果你要引入脚本（而不是库模块），确保主程序 main 有这个条件保护：“if __name__ == '__main__'”。

source: Options
pt_br: Opções
zh_cn: 选项

source: Directory to place the output files. If it does not exist, it is created.
pt_br: Diretório para colocar os arquivos de saída. Se não existir, será criado.
zh_cn: 放置输出文件的目录。如果它不存在，就创建它。

source: Do not output anything on standard output, only write warnings and errors to standard error.
pt_br: Não emitir saída nenhuma na saída padrão, só gravar avisos de erros na saída padrão de erros.
zh_cn: 不要在标准输出中输出任何东西，只在标准错误中写入警告和错误。

source: Force overwriting of any existing generated files.
pt_br: Forçar a sobrescrita de quaisquer arquivos gerados existentes.
zh_cn: 强制覆盖任何现有生成的文件。

source: Follow symbolic links. Defaults to ``False``.
pt_br: Segue links simbólicos. O padrão é ``False``.

source: Do not create or remove any files.
pt_br: Não cria nem remove quaisquer arquivos.

source: Suffix for the source files generated. Defaults to ``rst``.
pt_br: Sufixo para os arquivos de origem gerados. O padrão é ``rst``.
zh_cn: 生成的源文件的后缀。默认为“rst”。

source: Maximum depth for the generated table of contents file. Defaults to ``4``.
pt_br: Profundidade máxima para o arquivo da tabela de conteúdo gerada. O padrão é ``4``.

source: Filename for a table of contents file. Defaults to ``modules``.
pt_br: Nome de arquivo para um arquivo de índice. O padrão é ``modules``.
zh_cn: 目录文件的文件名。默认为“modules” 。

source: Do not create a table of contents file. Ignored when :option:`--full` is provided.
pt_br: Não crie um arquivo de índice. Ignorado quando :option:`--full` é fornecido.
zh_cn: 不要创建目录文件。忽略提供的:option:`——full`。

source: Remove existing files in the output directory that are not created anymore. Not compatible with :option:`--full`.
pt_br: Remove os arquivos existentes no diretório de saída que não são mais criados. Não é compatível com :option:`--full`.

source: Generate a full Sphinx project (``conf.py``, ``Makefile`` etc.) using the same mechanism as :program:`sphinx-quickstart`.
pt_br: Gere um projeto completo do Sphinx (``conf.py``, ``Makefile`` etc.) usando o mesmo mecanismo que :program:`sphinx-quickstart`.
zh_cn: 使用与:program:`sphinx-quickstart`相同的机制生成一个完整的Sphinx项目（``conf.py``， ``Makefile`` 等）。

source: Put documentation for each module on its own page.
pt_br: Coloque documentação para cada módulo em sua própria página.
zh_cn: 将每个模块的文档放在自己的页面上。

source: Do not create headings for the modules/packages. This is useful, for example, when docstrings already contain headings.
pt_br: Não crie cabeçalhos para os módulos/pacotes. Isso é útil, por exemplo, quando as ``docstrings`` já contêm títulos.
zh_cn: 不要为模块/包创建标题。这是有用的，例如，当文档字符串已经包含标题。

source: Include "_private" modules.
pt_br: Inclua módulos ``_private``.
zh_cn: 包括 “_private” 模块。

source: By default sphinx-apidoc processes sys.path searching for modules only. Python 3.3 introduced :pep:`420` implicit namespaces that allow module path structures such as ``foo/bar/module.py`` or ``foo/bar/baz/__init__.py`` (notice that ``bar`` and ``foo`` are namespaces, not modules).
pt_br: Por padrão, sphinx-apidoc processa busca sys.path para módulos. Python 3.3 introduziu :pep:`420` namespaces implicitos que permitem path e estruturas de módulos como ``foo/bar/module.py`` ou ``foo/bar/baz/__init__.py`` (perceba que ``bar`` e ``foo`` são namespaces, não modulos).
zh_cn: 默认情况下，sphinx-apidoc 只处理 sys.path 中找到的模块。从 Python 3.3 起，引入了 :pep:`420` 隐式命名空间，允许模块路径结构，比如“foo/bar/module.py”或者 “foo/bar/baz/__init__.py” （注意这里的“foo”和“bar”都用来表示命名空间，并不是模块）。

source: Interpret paths recursively according to PEP-0420.
pt_br: Interprete os paths recursivamente de acordo com a *pep-0420*.
zh_cn: 根据PEP-0420递归地解释路径。

source: Put module documentation before submodule documentation.
pt_br: Coloque a documentação do módulo antes da documentação do submódulo.
zh_cn: 在子模块文档之前放置模块文档。

source: These options are used when :option:`--full` is specified:
pt_br: Essas opções são usadas quando :option:`--full` é especificado:
zh_cn: 在以下情况下使用这些选项 :option:`--full`：

source: Append module_path to sys.path.
pt_br: Anexa ao final module_path em sys.path.
zh_cn: 把 module_path 添加到 sys.path。

source: Sets the project name to put in generated files (see :confval:`project`).
pt_br: Configura o nome do projeto para ser gravado nos arquivos gerados (ver :confval:`project`).
zh_cn: 设置要放入生成文件的项目名称，参阅:confval:`project`。

source: Sets the author name(s) to put in generated files (see :confval:`copyright`).
pt_br: Configura nome(s) do autor(es) para gerar arquivos (ver :confval:`copyright`).
zh_cn: 设置要放入生成文件的作者姓名，参阅 :confval:`copyright`。

source: Sets the project version to put in generated files (see :confval:`version`).
pt_br: Configura versão do projeto a ser colocada nos arquivos gerados (ver :confval:`version`).
zh_cn: 设置要放入生成文件的项目版本，请参见 :confval:`version`。

source: Sets the project release to put in generated files (see :confval:`release`).
pt_br: Define o nome do release do projeto para ser colocado nos arquivos gerados (ver :confval:`release`).
zh_cn: 设置项目发布以放入生成的文件，参见 :confval:`release`。

source: Project templating
pt_br: Projeto Modelo
zh_cn: 项目模板

source: Project templating options for sphinx-apidoc
pt_br: Opções de modelagem de projeto para sphinx-apidoc
zh_cn: sphinx-apidoc的项目模板选项

source: Template directory for template files. You can modify the templates of sphinx project files generated by apidoc. Following Jinja2 template files are allowed:
pt_br: Diretório de modelo para arquivos de modelo. Você pode modificar os modelos de arquivos de projeto sphinx gerados pelo apidoc. Os seguintes arquivos de modelo Jinja2 são permitidos:
zh_cn: 模板文件的模板目录。您可以修改apidoc生成的sphinx项目文件的模板。允许以下Jinja2模板文件：

source: In detail, please refer the system template files Sphinx provides. (``sphinx/templates/apidoc`` and ``sphinx/templates/quickstart``)
pt_br: Em detalhes, consulte os arquivos de modelo do sistema que a Sphinx fornece. (``sphinx/templates/apidoc`` e ``sphinx/templates/quickstart``)
zh_cn: 详细信息，请参考Sphinx提供的系统模板文件。(“sphinx/模板/apidoc”和“sphinx/模板/快速入门”)

source: Environment
pt_br: Ambiente de Desenvolvimento
zh_cn: 环境

source: A comma-separated list of option to append to generated ``automodule`` directives. Defaults to ``members,undoc-members,show-inheritance``.
pt_br: Uma lista separada por vírgula de opção para anexar às diretivas ``automodule`` geradas. O padrão é ``members,undoc-members,show-inheritance``.
zh_cn: 一个逗号分隔的选项列表，附加到生成的“automodule”指令。默认为“members,undoc-members,show-inheritance”。

source: See also
pt_br: Ver também
zh_cn: 另请参阅

source: :program:`sphinx-apidoc` is a tool for automatic generation of Sphinx sources that, using the :rst:dir:`autodoc` extension, document a whole package in the style of other automatic API documentation tools.
zh_cn: :program:`sphinx-apidoc`是一个自动生成Sphinx源的工具，它使用:rst:dir:`autodoc` 扩展，以其他自动API文档工具的方式记录整个包。

source: Follow symbolic links.
zh_cn: 遵循符号链接。

source: Do not create any files.
zh_cn: 不要创建任何文件。

source: Maximum depth for the generated table of contents file.
zh_cn: 生成的目录文件表的最大容量。
