Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/coverage.po
Languages: ja, pt_br, zh_cn

source: :mod:`sphinx.ext.coverage` -- Collect doc coverage stats
ja: :mod:`sphinx.ext.coverage` -- ドキュメントのカバレッジの状況を収集します
pt_br: :mod:`sphinx.ext.coverage` -- Coleta estatísticas de cobertura da documentação
zh_cn: ：模式：`sphinx.ext.coverage`--收集文档覆盖率统计

source: This extension features one additional builder, the :class:`CoverageBuilder`.
ja: この拡張機能には :class:`CoverageBuilder` という追加のビルダーが一つ含まれます。
pt_br: Essa extensão tem funcionalidades para construtor adicional, :class:`CoverageBuilder`.
zh_cn: 这个扩展还有一个生成器：class:`CoverageBuilder`。

source: Todo
pt_br: Por fazer
zh_cn: 待处理

source: Write this section.
ja: このセクションを書くこと
pt_br: Escrever essa seção.
zh_cn: 撰写本章节

source: If you document scripts (as opposed to library modules), make sure their main routine is protected by a ``if __name__ == '__main__'`` condition.
pt_br: Se os scripts do seu documento, (diferentemente de módulos de biblioteca), certificar-se que suas rotinas principais estejam protegidas por uma condição ``if __name__ == '__main__'``.

source: Configuration
pt_br: Configuração

source: Several configuration values can be used to specify what the builder should check:
ja: ビルダーがチェックすべきものを決定するための、いくつかの設定値も追加されます:
pt_br: Vários valores de configuração podem ser usados para especificar o que o construtor deve verificar:
zh_cn: 可以使用多个配置值来指定生成器应检查的内容：

source: List of `Python regular expressions`_.
ja: `Python正規表現`_ のリスト。
pt_br: Lista de `expressões regulares do Python`_.
zh_cn: “Python正则表达式”列表。

source: If any of these regular expressions matches any part of the full import path of a Python object, that Python object is excluded from the documentation coverage report.
ja: これらの正規表現のいずれかがPythonオブジェクトのインポートフルパスのいずれかの部分と一致する場合、そのPythonオブジェクトはドキュメントカバレッジのレポートから除外されます。
pt_br: Se alguma dessas expressões regulares corresponder a qualquer parte do caminho completo de importação de um objeto Python, esse objeto Python será excluído do relatório de cobertura de documentação.
zh_cn: 如果这些正则表达式中的任何一个与Python对象的完整导入路径的任何部分匹配，那么该Python对象将从文档覆盖率报告中排除。

source: Set to ``False`` to not write headlines.
ja: もし ``False`` が設定されると、ヘッドラインを出力しなくなります。
pt_br: Defina como ``False`` para não escrever títulos.
zh_cn: 设置为“False”不写标题。

source: Skip objects that are not documented in the source with a docstring. ``False`` by default.
ja: docstringが書かれておらず、ソースにドキュメントがないオブジェクトはスキップします。デフォルトは ``False`` です。
pt_br: Pula objetos que não estejam documentados no fonte com docstring. ``Falso`` por padrão.
zh_cn: 跳过源文件中没有用docstring记录的对象。``默认情况下为False。

source: Print objects that are missing to standard output also. ``False`` by default.
ja: 欠落しているオブジェクトも標準出力に出力します。デフォルトでは ``False`` です。
pt_br: Imprime também objetos que estão faltando na saída padrão. ``False`` por padrão.
zh_cn: 打印标准输出中缺少的对象。``默认情况下为False。

source: Print a tabular report of the coverage statistics to the coverage report. ``True`` by default.
pt_br: Imprime um relatório tabular das estatísticas de cobertura no relatório de cobertura. ``True`` por padrão.

source: Example output:
pt_br: Exemplo de saída:

source: Print a tabular report of the coverage statistics to standard output. ``False`` by default.
pt_br: Imprime um relatório tabular das estatísticas de cobertura na saída padrão. ``Falso`` por padrão.

source: To use this builder, activate the coverage extension in your configuration file and give ``-b coverage`` on the command line.
ja: このビルダーを使用するには、coverage拡張を設定ファイルに登録して使用できるようにしたあとで、コマンドラインのオプションとして ``-b coverage`` を渡してください。
zh_cn: 要使用这个构建器，请激活配置文件中的覆盖范围扩展，并在命令行中提供“-b coverage”。
