Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/doctest.po
Languages: pt_br, zh_cn

source: :mod:`sphinx.ext.doctest` -- Test snippets in the documentation
pt_br: :mod:`sphinx.ext.doctest` -- Trechos de teste na documentação
zh_cn: ：模式：`sphinx.ext.doctest`--文档中的测试片段

source: It is often helpful to include snippets of code in your documentation and demonstrate the results of executing them. But it is important to ensure that the documentation stays up-to-date with the code.
zh_cn: 在文档中包含代码片段并演示执行它们的结果通常很有帮助。但是确保文档与代码保持最新是很重要的。

source: This extension allows you to test such code snippets in the documentation in a natural way. If you mark the code blocks as shown here, the ``doctest`` builder will collect them and run them as doctest tests.
zh_cn: 此扩展允许您以自然的方式测试文档中的此类代码片段。如果您按此处所示标记代码块，则“doctest”生成器将收集它们并将其作为doctest测试运行。

source: Within each document, you can assign each snippet to a *group*. Each group consists of:
zh_cn: 在每个文档中，可以将每个代码段分配给一个*组*。每组包括：

source: zero or more *setup code* blocks (e.g. importing the module to test)
pt_br: zero ou mais blocos *setup code* (por exemplo, importando o módulo para teste)
zh_cn: 零个或多个*设置代码*块（例如导入要测试的模块）

source: one or more *test* blocks
pt_br: um ou mais blocos *test*
zh_cn: 一个或多个*测试*块

source: When building the docs with the ``doctest`` builder, groups are collected for each document and run one after the other, first executing setup code blocks, then the test blocks in the order they appear in the file.
pt_br: Ao construir os documentos com o construtor ``doctest``, os grupos são coletados para cada documento e executados um após o outro, executando primeiro os blocos de códigos de configuração e, em seguida, os blocos de teste na ordem em que aparecem no arquivo.
zh_cn: 当使用“doctest”构建器构建文档时，将为每个文档收集组并逐个运行，首先执行安装代码块，然后按它们在文件中出现的顺序执行测试块。

source: There are two kinds of test blocks:
pt_br: Existem dois tipos de blocos de teste:
zh_cn: 有两种测试块：

source: *doctest-style* blocks mimic interactive sessions by interleaving Python code (including the interpreter prompt) and output.
pt_br: Os blocos *doctest-style* imitam as sessões interativas intercalando o código *Python* (incluindo o prompt do interpretador) e a saída.
zh_cn: *doctest style*块通过交错Python代码（包括解释器提示）和输出来模拟交互式会话。

source: *code-output-style* blocks consist of an ordinary piece of Python code, and optionally, a piece of output for that code.
pt_br: Os blocos *code-output-style* consistem em uma parte ordinária do código *Python* e, opcionalmente, uma saída para esse código.
zh_cn: *代码输出样式*块由一段普通的Python代码和一段可选的该代码的输出组成。

source: Directives
pt_br: Diretivas
zh_cn: 指令

source: The *group* argument below is interpreted as follows: if it is empty, the block is assigned to the group named ``default``. If it is ``*``, the block is assigned to all groups (including the ``default`` group). Otherwise, it must be a comma-separated list of group names.
pt_br: O argumento *grupo* abaixo é interpretado da seguinte forma: se estiver vazio, o bloco será atribuído ao grupo denominado ``default``. Se for ``*``, o bloco é atribuído a todos os grupos (incluindo o grupo ``default``). Caso contrário, deve ser uma lista separada por vírgulas de nomes de grupos.
zh_cn: 下面的*group*参数解释如下：如果它为空，则块被分配给名为“default”的组。如果它是`*`，则块被分配给所有组（包括``default``组）。否则，它必须是以逗号分隔的组名列表。

source: A setup code block. This code is not shown in the output for other builders, but executed before the doctests of the group(s) it belongs to.
pt_br: Um bloco de código de configuração. Este código não é mostrado na saída para outros construtores, mas executado antes dos *doctests* do (s) grupo (s) ao qual ele pertence.
zh_cn: 设置代码块。此代码不会显示在其他生成器的输出中，而是在它所属组的doctest之前执行。

source: A cleanup code block. This code is not shown in the output for other builders, but executed after the doctests of the group(s) it belongs to.
pt_br: Um bloco de código de limpeza. Este código não é mostrado na saída para outros construtores, mas executado após os *doctests* do (s) grupo (s) ao qual ele pertence.
zh_cn: 清除代码块。此代码不会显示在其他生成器的输出中，而是在它所属组的doctest之后执行。

source: A doctest-style code block. You can use standard :mod:`doctest` flags for controlling how actual output is compared with what you give as output. The default set of flags is specified by the :confval:`doctest_default_flags` configuration variable.
pt_br: Um bloco de código de estilo ``doctest``. Você pode usar ``flags`` padrão :mod:`doctest` para controlar como a saída real é comparada com o que você fornece como saída. O conjunto padrão de ``flags`` é especificado pela variável de configuração :confval:`doctest_default_flags`.
zh_cn: doctest样式的代码块。您可以使用标准：mod:`doctest`标志来控制实际输出与输出结果的比较方式。默认标志集由：confval:`doctest_default_flags`配置变量指定。

source: This directive supports five options:
zh_cn: 该指令支持五个选项：

source: ``hide``, a flag option, hides the doctest block in other builders. By default it is shown as a highlighted doctest block.
pt_br: ``hide``, uma opção de ``flag``, oculta o bloco *doctest* em outros construtores. Por padrão, ele é mostrado como um bloco *doctest* realçado.
zh_cn: ``hide```，一个标志选项，在其他构建器中隐藏doctest块。默认情况下，它显示为高亮显示的doctest块。

source: ``options``, a string option, can be used to give a comma-separated list of doctest flags that apply to each example in the tests. (You still can give explicit flags per example, with doctest comments, but they will show up in other builders too.)
pt_br: ``options``, uma opção string, pode ser usada para fornecer uma lista separada por vírgulas das ``flags`` *doctest* que se aplicam a cada exemplo nos testes. (Você ainda pode fornecer ``flags`` explícitas por exemplo, com comentários *doctest*, mas eles também serão exibidos em outros construtores.)
zh_cn: ``options```，一个字符串选项，可用于提供一个逗号分隔的doctest标志列表，该列表适用于测试中的每个示例。（您仍然可以为每个示例提供显式标志，并带有doctest注释，但它们也会显示在其他构建器中。）

source: The following operands are supported:
pt_br: Os seguintes operandos são suportados:
zh_cn: 支持以下操作数：

source: ``~=``: Compatible release clause
pt_br: ``~=``: Cláusula de liberação compatível
zh_cn: ``~=```：兼容释放子句

source: ``==``: Version matching clause
pt_br: ``==``: Cláusula de correspondência de versão
zh_cn: ``=```：版本匹配子句

source: ``!=``: Version exclusion clause
pt_br: ``!=``: Cláusula de exclusão de versão
zh_cn: `=``：版本排除子句

source: ``<=``, ``>=``: Inclusive ordered comparison clause
pt_br: ``<=``, ``>=``: Cláusula de comparação ordenada inclusiva
zh_cn: ``<=``，`>=``：包含有序比较子句

source: ``<``, ``>``: Exclusive ordered comparison clause
pt_br: ``<``, ``>``: Cláusula de comparação ordenada exclusiva
zh_cn: ``<``，`>``：排他有序比较子句

source: ``===``: Arbitrary equality clause.
pt_br: ``===``: Cláusula de igualdade arbitrária.
zh_cn: ``==```：任意等式子句。

source: Supported PEP-440 operands and notations
pt_br: Operandos e notações da *PEP-440* suportados
zh_cn: 支持的PEP-440操作数和符号

source: ``trim-doctest-flags`` and ``no-trim-doctest-flags``, a flag option, doctest flags (comments looking like ``# doctest: FLAG, ...``) at the ends of lines and ``<BLANKLINE>`` markers are removed (or not removed) individually. Default is ``trim-doctest-flags``.
zh_cn: ``trim doctest flags``和``no trim doctest flags``，一个标志选项，行末的doctest标志（看起来像``doctest:flag，```）和``1``标记分别删除（或不删除）。默认值为“trim doctest flags”。

source: Note that like with standard doctests, you have to use ``<BLANKLINE>`` to signal a blank line in the expected output. The ``<BLANKLINE>`` is removed when building presentation output (HTML, LaTeX etc.).
pt_br: Observe que, assim como nos *doctests* padrão, você precisa usar ``<BLANKLINE>`` para sinalizar uma linha em branco na saída esperada. O ``<BLANKLINE>`` é removido ao criar a saída da apresentação (HTML, LaTeX etc.).
zh_cn: 注意，与标准doctest一样，您必须使用````在预期输出中发出空行信号。生成表示输出（HTML、LaTeX等）时，会删除“``”。

source: Also, you can give inline doctest options, like in doctest::
pt_br: Além disso, você pode dar opções de *doctest* em linha, como em *doctest*::
zh_cn: 此外，还可以提供内联doctest选项，如doctest:：

source: They will be respected when the test is run, but stripped from presentation output.
pt_br: Elas serão respeitados quando o teste for executado, mas retirados da saída da apresentação.
zh_cn: 当测试运行时，它们将被尊重，但从表示输出中剥离。

source: A code block for a code-output-style test.
pt_br: Um bloco de código para um teste de estilo de saída de código.
zh_cn: When the tests run, they are respected, but separated from the presentation output.

source: This directive supports three options:
pt_br: Esta diretiva suporta três opções:
zh_cn: 此指令支持三个选项：

source: ``hide``, a flag option, hides the code block in other builders. By default it is shown as a highlighted code block.
pt_br: ``hide``, uma opção de *flag*, oculta o bloco de códigos em outros construtores. Por padrão, é mostrado como um bloco de códigos realçado.
zh_cn: ``hide```，一个标志选项，在其他生成器中隐藏代码块。默认情况下，它显示为高亮显示的代码块。

source: Code in a ``testcode`` block is always executed all at once, no matter how many statements it contains. Therefore, output will *not* be generated for bare expressions -- use ``print``. Example::
pt_br: O código em um bloco ``testcode`` é sempre executado de uma só vez, não importa quantas instruções ele contenha. Portanto, a saída *não* será gerada para expressões simples -- use ``print``. Exemplo::
zh_cn: “testcode”块中的代码总是一次执行，不管它包含多少条语句。因此，将*不*为裸表达式生成输出--使用“print”。例子：：

source: Also, please be aware that since the doctest module does not support mixing regular output and an exception message in the same snippet, this applies to testcode/testoutput as well.
pt_br: Além disso, esteja ciente de que, como o módulo *doctest* não suporta a mixagem de saída regular e uma mensagem de exceção no mesmo *snippet*, isso também se aplica a ``testcode``/``testoutput``.
zh_cn: 另外，请注意，由于doctest模块不支持在同一代码段中混合常规输出和异常消息，这也适用于testcode/testoutput。

source: The corresponding output, or the exception message, for the last :rst:dir:`testcode` block.
pt_br: A saída correspondente, ou a mensagem de exceção, para o último bloco :rst:dir:`testcode`.
zh_cn: 最后一个的相应输出或异常消息：rst:方向：`testcode`块。

source: This directive supports four options:
zh_cn: 该指令支持四个选项：

source: ``hide``, a flag option, hides the output block in other builders. By default it is shown as a literal block without highlighting.
pt_br: ``hide``, uma opção de *flag*, oculta o bloco de saída em outros construtores. Por padrão, é mostrado como um bloco literal sem destacar.
zh_cn: ``hide```，一个标志选项，在其他构建器中隐藏输出块。默认情况下，它显示为不加亮显的文本块。

source: ``options``, a string option, can be used to give doctest flags (comma-separated) just like in normal doctest blocks.
pt_br: ``options``, uma opção de string, pode ser usada para fornecer ``flags`` *doctest* (separados por vírgulas) como nos blocos *doctest* normais.
zh_cn: ``options```，一个字符串选项，可用于提供doctest标志（逗号分隔），就像在普通doctest块中一样。

source: Example::
pt_br: Exemplo::
zh_cn: 例如：

source: The following is an example for the usage of the directives. The test via :rst:dir:`doctest` and the test via :rst:dir:`testcode` and :rst:dir:`testoutput` are equivalent. ::
pt_br: O seguinte é um exemplo para o uso das diretivas. O teste via :rst:dir:`doctest` e o teste via :rst:dir:`testcode` e :rst:dir:`testoutput` são equivalentes::
zh_cn: 下面是指令用法的示例。测试通过：rst:方向：`doctest`和测试通过：rst:方向：`testcode`和：rst:方向：`testoutput`是等效的。::

source: Skipping tests conditionally
pt_br: Ignorando testes condicionalmente
zh_cn: 有条件地跳过测试

source: ``skipif``, a string option, can be used to skip directives conditionally. This may be useful e.g. when a different set of tests should be run depending on the environment (hardware, network/VPN, optional dependencies or different versions of dependencies). The ``skipif`` option is supported by all of the doctest directives. Below are typical use cases for ``skipif`` when used for different directives:
pt_br: ``skipif``, uma opção de string, pode ser usada para ignorar diretivas condicionalmente. Isto pode ser útil, e. quando um conjunto diferente de testes deve ser executado dependendo do ambiente (hardware, rede/VPN, dependências opcionais ou diferentes versões de dependências). A opção ``skipif`` é suportada por todas as diretivas *doctest*. Abaixo estão os casos de uso típicos de ``skipif`` quando usados para diretivas diferentes:
zh_cn: ``skipif```，一个字符串选项，可用于有条件地跳过指令。这可能很有用，例如，根据环境（硬件、网络/VPN、可选依赖项或依赖项的不同版本）运行不同的测试集。所有doctest指令都支持“skipif”选项。以下是“skipif”在用于不同指令时的典型用例：

source: :rst:dir:`testsetup` and :rst:dir:`testcleanup`
pt_br: :rst:dir:`testsetup` e :rst:dir:`testcleanup`
zh_cn: :rst:dir:`testsetup` 和:rst:dir:`testcleanup`

source: conditionally skip test setup and/or cleanup
pt_br: condicionalmente pular a configuração do teste e/ou a limpeza
zh_cn: 有条件地跳过测试设置和/或清理

source: customize setup/cleanup code per environment
pt_br: personalizar o código de configuração/limpeza por ambiente
zh_cn: 根据环境自定义安装/清理代码

source: conditionally skip both a test and its output verification
pt_br: condicionalmente pular um teste e sua verificação de saída
zh_cn: 有条件地跳过测试及其输出验证

source: conditionally skip a test
pt_br: condicionalmente pular um teste
zh_cn: 有条件地跳过测试

source: customize test code per environment
pt_br: personalizar código de teste por ambiente
zh_cn: 每个自定义测试环境的代码

source: conditionally skip output assertion for a skipped test
pt_br: condicionalmente ignorar a declaração de saída para um teste ignorado
zh_cn: 有条件地跳过跳过测试的输出断言

source: expect different output depending on the environment
pt_br: esperar saída diferente dependendo do ambiente
zh_cn: 根据环境的不同预期不同的输出

source: The value of the ``skipif`` option is evaluated as a Python expression. If the result is a true value, the directive is omitted from the test run just as if it wasn't present in the file at all.
pt_br: O valor da opção ``skipi`` é avaliado como uma expressão *Python*. Se o resultado for um valor verdadeiro, a diretiva é omitida da execução de teste, como se ela não estivesse presente no arquivo.
zh_cn: 将Python`的值计算为'skif`表达式。如果结果是真值，则从测试运行中忽略该指令，就像它根本不存在于文件中一样。

source: Instead of repeating an expression, the :confval:`doctest_global_setup` configuration option can be used to assign it to a variable which can then be used instead.
pt_br: Em vez de repetir uma expressão, a opção de configuração :confval:`doctest_global_setup` pode ser usada para atribuí-la a uma variável que pode ser usada em seu lugar.
zh_cn: 可以使用：confval:`doctest_global_setup`配置选项将表达式分配给一个变量，然后可以使用该变量来代替该变量。

source: Here's an example which skips some tests if Pandas is not installed:
pt_br: Aqui está um exemplo que pula alguns testes se o *Pandas* não estiver instalado:
zh_cn: 下面是一个例子，如果没有安装Pandas，它会跳过一些测试：

source: Configuration
pt_br: Configuração
zh_cn: 配置

source: The doctest extension uses the following configuration values:
pt_br: A extensão *doctest* usa os seguintes valores de configuração:
zh_cn: doctest扩展使用以下配置值：

source: By default, these options are enabled:
pt_br: Por padrão, essas opções estão ativadas:
zh_cn: 默认情况下，这些选项处于启用状态：

source: ``ELLIPSIS``, allowing you to put ellipses in the expected output that match anything in the actual output;
pt_br: ``ELLIPSIS``, permitindo colocar elipses na saída esperada que correspondam a qualquer coisa na saída real;
zh_cn: ``ELLIPSIS``，允许您将省略号放在与实际输出中的任何内容匹配的预期输出中；

source: ``IGNORE_EXCEPTION_DETAIL``, causing everything following the leftmost colon and any module information in the exception name to be ignored;
pt_br: ``IGNORE_EXCEPTION_DETAIL``, fazendo com que tudo seguindo os dois pontos mais à esquerda e qualquer informação do módulo no nome da exceção seja ignorada;
zh_cn: ``IGNORE_EXCEPTION_DETAIL``，导致忽略最左边冒号后面的所有内容以及异常名称中的任何模块信息；

source: ``DONT_ACCEPT_TRUE_FOR_1``, rejecting "True" in the output where "1" is given -- the default behavior of accepting this substitution is a relic of pre-Python 2.2 times.
pt_br: ``DONT_ACCEPT_TRUE_FOR_1``, rejeitando ``True`` na saída onde `1` é dado -- o comportamento padrão de aceitar essa substituição é uma relíquia de 2.2 vezes antes do Python.
zh_cn: ``不要接受“1”的“TRUE”，拒绝在给定“1”的输出中的“TRUE”――接受此替换的默认行为是Python之前的2.2倍的产物。

source: A list of directories that will be added to :data:`sys.path` when the doctest builder is used. (Make sure it contains absolute paths.)
pt_br: Uma lista de diretórios que serão incluídos no :data:`sys.path` quando o construtor *doctest* for usado. (Certifique-se de que contém paths absolutos.)
zh_cn: 将添加到的目录列表：data:`搜索路径`当使用doctest构建器时。（确保它包含绝对路径。）

source: Python code that is treated like it were put in a ``testsetup`` directive for *every* file that is tested, and for every group. You can use this to e.g. import modules you will always need in your doctests.
pt_br: Código Python tratado como se fosse colocado em uma diretiva ``testsetup`` para *cada* arquivo testado e para cada grupo. Você pode usar isso para, por exemplo, módulos de importação que você sempre precisará em seus *doctests*.
zh_cn: 对于每个被测试的*文件和每个组，它被当作放在“testsetup”指令中的Python代码。您可以使用它来导入您的doctest中始终需要的模块。

source: Python code that is treated like it were put in a ``testcleanup`` directive for *every* file that is tested, and for every group. You can use this to e.g. remove any temporary files that the tests leave behind.
pt_br: Código *Python* tratado como se fosse colocado numa diretiva ``testcleanup`` para *cada* arquivo testado e para cada grupo. Você pode usar isso para, por exemplo, remover todos os arquivos temporários que os testes deixam para trás.
zh_cn: 对于每个测试的*文件和每个组，Python代码被视为放在“testcleanup”指令中。你可以用它来删除测试留下的任何临时文件。

source: (Note that no special ``::`` is used to introduce a doctest block; docutils recognizes them from the leading ``>>>``. Also, no additional indentation is used, though it doesn't hurt.)
pt_br: (Observe que nenhum ``::`` especial é usado para introduzir um bloco *doctest*; os *docutils* os reconhecem do ``>>>`` inicial. Além disso, nenhuma indentação adicional é usado, embora não atrapalhe.)
zh_cn: （请注意，没有特殊的“`:：`”用于引入doctest块；docutils从前导的“>>>”中识别它们。此外，不会使用额外的缩进，尽管不会造成伤害。）

source: If this value is left at its default value, the above snippet is interpreted by the doctest builder exactly like the following::
pt_br: Se este valor for deixado em seu valor padrão, o trecho acima será interpretado pelo construtor *doctest* exatamente como o seguinte::
zh_cn: 如果将此值保留为默认值，则doctest构建器将对上面的代码段进行如下解释：

source: This feature makes it easy for you to test doctests in docstrings included with the :mod:`~sphinx.ext.autodoc` extension without marking them up with a special directive.
pt_br: Esse recurso torna mais fácil para você testar *doctests* em *docstrings* incluídos com a extensão :mod:`~sphinx.ext.autodoc` sem marcá-los com uma diretiva especial.
zh_cn: 此功能使您可以轻松地测试：mod:`~sphinx.ext.autodoc`没有用特殊指令标记的扩展。

source: ``pyversion``, a string option, can be used to specify the required Python version for the example to be tested. For instance, in the following case the example will be tested only for Python versions greater than 3.3::
pt_br: ``pyversion``, uma opção string, pode ser usada para especificar a versão necessária do *Python* para o exemplo ser testado. Por exemplo, no caso a seguir, o exemplo será testado apenas para versões do *Python* maiores que 3.3:

source: If this is a nonempty string (the default is ``'default'``), standard reST doctest blocks will be tested too. They will be assigned to the group name given.
pt_br: Se esta for uma string não vazia (o padrão é ``'default'``), os blocos padrão *reST doctest* também serão testados. Eles serão atribuídos ao nome do grupo fornecido.

source: reST doctest blocks are simply doctests put into a paragraph of their own, like so::
pt_br: Os blocos *reST* do *doctest* são simplesmente *doctests* colocados em um parágrafo próprio, assim:

source: Note though that you can't have blank lines in reST doctest blocks. They will be interpreted as one block ending and another one starting. Also, removal of ``<BLANKLINE>`` and ``# doctest:`` options only works in :rst:dir:`doctest` blocks, though you may set :confval:`trim_doctest_flags` to achieve that in all code blocks with Python console content.
pt_br: Note que você não pode haver linhas em branco nos blocos *reST doctest*. Eles serão interpretados como sendo inicialmente um **bloco finalizado** e o outro como sendo um **bloco iniciado**. Além disso, a remoção das opções ``<BLANKLINE>`` e ``#doctest:`` só funciona em blocos :rst:dir:`doctest`, embora você possa definir :confval:`trim_doctest_flags` para conseguir isso em todos os blocos de código com o conteúdo do console *Python*.
