Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/extlinks.po
Languages: fr, ja, pt_br, zh_cn

source: :mod:`sphinx.ext.extlinks` -- Markup to shorten external links
fr: mod:`sphinx.ext.ext.extlinks' -- Balisage pour raccourcir les liens externes
ja: :mod:`sphinx.ext.extlinks` -- 外部リンクを短縮表記させるマークアップ
pt_br: :mod:`sphinx.ext.extlinks` -- Marcação para encurtar links externos
zh_cn: ：模式：`sphinx.ext.extlinks`--标记以缩短外部链接

source: This extension is meant to help with the common pattern of having many external links that point to URLs on one and the same site, e.g. links to bug trackers, version control web interfaces, or simply subpages in other websites. It does so by providing aliases to base URLs, so that you only need to give the subpage name when creating a link.
fr: Cette extension est destinée à aider avec un modèle commun d'avoir beaucoup de liens externes qui pointent vers des URLs sur un seul et même site, par exemple des liens vers des trackers de bugs, des interfaces web de contrôle de version, ou simplement des sous-pages dans d'autres sites. Pour ce faire, il fournit des alias aux URL de base, de sorte que vous n'avez qu'à donner le nom de la sous-page lors de la création d'un lien.
ja: この拡張を利用すると、同一のウェブサイト内にある多くの外部参照リンクを利用する際に、共通部分をパターン化できます。例えば、バグトラッカーや、バージョン管理システムのウェブインタフェース、他のウェブサイトの中のサブページなどです。この拡張機能は、ベースとなるURLのエイリアスを提供します。サブのページの名前をつけるだけで、リンクを作成できるようになります。
pt_br: Essa extensão facilita a existência de um padrão comum para diversos links que apontam para uma URL em um site, ex. links para rastrear erros, controle de versão na web ou simples páginas de outros sites. Não fornece apelidos para URLs portanto só é preciso informar o nome da sub-página quando criar o link.
zh_cn: 此扩展旨在帮助实现一种常见模式，即有许多指向同一站点上url的外部链接，例如指向bug追踪器、版本控制web界面的链接，或者只是其他网站中的子页面的链接。它通过为基本url提供别名来实现这一点，因此您只需要在创建链接时提供子页面名称。

source: Let's assume that you want to include many links to issues at the Sphinx tracker, at :samp:`https://github.com/sphinx-doc/sphinx/issues/{num}`. Typing this URL again and again is tedious, so you can use :mod:`~sphinx.ext.extlinks` to avoid repeating yourself.
fr: Supposons que vous souhaitiez inclure de nombreux liens vers des problèmes sur le tracker Sphinx, sur :samp:`https://github.com/sphinx-doc/sphinx/issues/{num}`. Taper cette URL encore et encore est fastidieux, donc vous pouvez utiliser :mod:`~sphinx.ext.ext.extlinks` pour éviter de vous répéter.
ja: Sphinxのissueトラッカー上の項目に対して、多くのリンクを作成したいとしましょう。各ページのURLは、 :samp:`https://github.com/sphinx-doc/sphinx/issues/{num}` です。このURLを何度も何度もタイプするのは疲れますが、 :mod:`~sphinx.ext.extlinks` を使うと、この繰り返し作業から解法されます。
pt_br: Vamos supor que deseja incluir diversos links para solicitações no Sphinx tracker, em :samp:`https://github.com/sphinx-doc/sphinx/issues/{num}`. Digitando esse URL novamente em diversos lugares torna-se cansativo, então usar :mod:`~sphinx.ext.extlinks` para evitar repetições.
zh_cn: 假设您希望在Sphinx tracker上包含许多指向问题的链接，地址：samp:`https://github.com/sphinx-doc/sphinx/issues/{num}`。一次又一次地键入此URL是很乏味的，因此可以使用：mod:`~sphinx.ext.extlinks`为了避免重复你自己。

source: The extension adds a config value:
pt_br: A extensão adiciona um valor de configuração:
zh_cn: 该插件添加了一个配置值：

source: This config value must be a dictionary of external sites, mapping unique short alias names to a *base URL* and a *caption*. For example, to create an alias for the above mentioned issues, you would add ::
pt_br: Esse valor configurado pode ser um dicionário de sites, mapeamentos únicos para nomes alternativos para uma *URL base* e uma *legenda*. Por exemplo, para criar um apelido para os casos acima, podemos adicionar::

source: Now, you can use the alias name as a new role, e.g. ``:issue:`123```. This then inserts a link to https://github.com/sphinx-doc/sphinx/issues/123. As you can see, the target given in the role is substituted in the *base URL* in the place of ``%s``.
pt_br: Agora, você pode usar o nome do apelido como um novo papel, por exemplo, ``:issue:`123```. Isso insere um link para https://github.com/sphinx-doc/sphinx/issues/123. Como você pode ver, o destino dado na função é substituído na *base URL* no lugar de ``%s``.

source: The link caption depends on the second item in the tuple, the *caption*:
pt_br: A legenda do link depende do segundo item da tupla, a *caption*:

source: If *caption* is ``None``, the link caption is the full URL.
pt_br: Se *caption* for ``None``, a legenda do link será a URL completa.

source: If *caption* is a string, then it must contain ``%s`` exactly once. In this case the link caption is *caption* with the partial URL substituted for ``%s`` -- in the above example, the link caption would be ``issue 123``.
pt_br: Se *caption* for uma string, então deve conter ``%s`` exatamente uma vez. Neste caso, a legenda do link é *caption* com a URL parcial substituída por ``%s`` -- no exemplo acima, a legenda do link seria ``issue 123``.

source: To produce a literal ``%`` in either *base URL* or *caption*, use ``%%``::
pt_br: Para produzir um ``%`` literal em *base URL* ou *caption*, use ``%%``::

source: You can also use the usual "explicit title" syntax supported by other roles that generate links, i.e. ``:issue:`this issue <123>```. In this case, the *caption* is not relevant.
pt_br: Você também pode usar a sintaxe usual de "título explícito" suportada por outras funções que geram links, ou seja, ``:issue:`this issue <123>```. Nesse caso, *caption* não é relevante.

source: Support to substitute by '%s' in the caption.
pt_br: Suporte para substituto por '%s' na legenda.

source: Since links are generated from the role in the reading stage, they appear as ordinary links to e.g. the ``linkcheck`` builder.
fr: Puisque les liens sont générés à partir du rôle à l'étape de la lecture, ils apparaissent comme des liens ordinaires vers, par exemple, le constructeur ``linkcheck``.
ja: 読み込み段階でロールからリンクが生成されるため、 ``linkcheck`` ビルダーなどでは通常のリンクとして扱われます。
pt_br: Como os links são gerados a partir da leitura da regra em outro estágio, podem aparecer como links comuns ex. construtor ``linkcheck``.
zh_cn: 由于链接是从阅读阶段的角色生成的，因此它们看起来像是普通链接，例如“linkcheck”构建器。

source: If enabled, extlinks emits a warning if a hardcoded link is replaceable by an extlink, and suggests a replacement via warning. It defaults to ``False``.
pt_br: Se ativado, o extlinks emite um aviso se um link codificado permanentemente for substituível por um extlink e sugere uma substituição por meio de um aviso. O padrão é ``False``.

source: The extension adds one new config value:
ja: この拡張は新しい設定値を追加します。:

source: This config value must be a dictionary of external sites, mapping unique short alias names to a base URL and a *prefix*. For example, to create an alias for the above mentioned issues, you would add ::
fr: Cette valeur de configuration doit être un dictionnaire de sites externes, mappant les noms d'alias courts uniques à une URL de base et un *préfixe*. Par exemple, pour créer un alias pour les problèmes mentionnés ci-dessus, vous pouvez ajouter : :
ja: この設定値は、外部サイト情報を持つ辞書になります。ユニークな短いエイリアス名をキーに持ち、 ベースのURLと *prefix* を値に持ちます。例えば、上記で挙げたissueトラッカーを表現する場合には、次のように設定します:
zh_cn: 此配置值必须是外部站点的字典，将唯一的短别名映射到基URL和*前缀*。例如，要为上述问题创建别名，可以添加：

source: Now, you can use the alias name as a new role, e.g. ``:issue:`123```. This then inserts a link to https://github.com/sphinx-doc/sphinx/issues/123. As you can see, the target given in the role is substituted in the base URL in the place of ``%s``.
fr: Maintenant, vous pouvez utiliser le nom d'alias comme un nouveau rôle, par exemple ``\:issue\:issue\:`123```. Ceci insère ensuite un lien vers https\://github.com/sphinx-doc/sphinx/issues/123. Comme vous pouvez le voir, la cible donnée dans le rôle est substituée dans l'URL de base à la place de ``%s''.
ja: すると、新しいロールとして別名を使用できます。例： ``:issue:`123``` 。これは、その後 https://github.com/sphinx-doc/sphinx/issues/123 へのリンクを挿入します。見て分かる通り、ロールの中で与えられたターゲットはベース URL の中の ``%s`` の場所に置換されます。
zh_cn: 现在，您可以将别名用作新角色，例如“`：问题：`123``”。然后插入一个指向https://github.com/sphinx-doc/sphinx/issues/123。如您所见，角色中给定的目标在基URL中替换为````。

source: The link *caption* depends on the second item in the tuple, the *prefix*:
fr: Le lien *caption* dépend du deuxième élément du tuple, le *préfixe* :
ja: リンクの *キャプション* は、タプルの2つ目の要素の *prefix* によって表記が異なります。
zh_cn: 链接*标题*取决于元组中的第二项，*前缀*：

source: If the prefix is ``None``, the link caption is the full URL.
fr: Si le préfixe vaut ``None``, alors le titre du lien est l'URL complète.
ja: もし *prefix* が ``None`` であれば、リンクのキャプションは完全なURLになります。
zh_cn: 如果前缀是“None”，则链接标题是完整的URL。

source: If the prefix is the empty string, the link caption is the partial URL given in the role content (``123`` in this case.)
fr: Si le préfixe est la chaîne vide, la légende du lien est l'URL partielle donnée dans le contenu du rôle (``123`` dans ce cas).
ja: もし *prefix* が空文字列であれば、リンクのキャプションはロールのターゲットの中身の、URLの一部になります。この例では ``123`` になります。
zh_cn: 如果前缀是空字符串，则链接标题是角色内容中给定的部分URL（本例中为“123”）

source: If the prefix is a non-empty string, the link caption is the partial URL, prepended by the prefix -- in the above example, the link caption would be ``issue 123``.
fr: Si le préfixe est une chaîne non vide, la légende du lien est l'URL partielle, précédée du préfixe -- dans l'exemple ci-dessus, la légende du lien serait "Issue 123".
ja: もし *prefix* に空でない文字列が指定されたら、 *prefix* + ロールのターゲットになります。上記の例であれば、 ``issue 123`` となります。
zh_cn: 如果前缀是非空字符串，则链接标题是部分URL，前缀是前缀——在上面的示例中，链接标题将是“issue 123”。

source: You can also use the usual "explicit title" syntax supported by other roles that generate links, i.e. ``:issue:`this issue <123>```. In this case, the *prefix* is not relevant.
fr: Vous pouvez également utiliser la syntaxe habituelle de "titre explicite" supportée par d'autres rôles qui génèrent des liens, par exemple ``\:issue\:``cette édition <123>```. Dans ce cas, le *préfixe* n'est pas significatif.
ja: 他の相互リンクのためのロールのように、 ``:issue:`この問題 <123>``` という、明示的な名前を指定する書き方も使うことができます。この場合、 *prefix* は利用されません。
zh_cn: 您还可以使用生成链接的其他角色支持的通常的“显式标题”语法，即“`:issue:`this issue 1``”。在本例中，*前缀*不相关。
