Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/graphviz.po
Languages: ja, pt_br, zh_cn

source: :mod:`sphinx.ext.graphviz` -- Add Graphviz graphs
ja: :mod:`sphinx.ext.graphviz` -- Graphvizのグラフを追加
pt_br: :mod:`sphinx.ext.graphviz` -- Adiciona Gráficos Graphviz
zh_cn: ：模式：`sphinx.ext.graphviz`--添加Graphviz图

source: This extension allows you to embed `Graphviz <https://graphviz.org/>`_ graphs in your documents.
ja: この拡張モジュールを使用すると、 `Graphviz <https://graphviz.org/>`_ のグラフをドキュメント内に埋め込むことができるようになります。
pt_br: Esta extensão permite incorporar gráficos `Graphviz <https://graphviz.org/>`_ em seus documentos.
zh_cn: 此插件允许嵌入'Graphviz<https://graphviz.org/>`_文档中的图表。

source: It adds these directives:
ja: この拡張モジュールは以下のディレクティブを提供します:
pt_br: Acrescente estas diretivas:
zh_cn: 它添加了以下指令：

source: Directive to embed graphviz code. The input code for ``dot`` is given as the content. For example::
ja: Graphvizのコードをドキュメント内に直接記述するためのディレクティブです。 ここでコンテンツとして入力された内容は、 ``dot`` コマンドで処理されます。 例::
pt_br: Directiva para incorporar o código *graphviz*. O código de entrada para ``dot`` é fornecido como o conteúdo. Por exemplo::
zh_cn: 用于嵌入graphviz代码的指令。“点”的输入代码作为内容给出。例如：：

source: In HTML output, the code will be rendered to a PNG or SVG image (see :confval:`graphviz_output_format`). In LaTeX output, the code will be rendered to an embeddable PDF file.
ja: HTML出力されるときには、PNGのイメージファイルや、SVGイメージとしてレンダリングされます。 LaTeX出力時にはこのコードは埋め込み可能なPDFファイルとしてレンダリングされます。( :confval:`graphviz_output_format` を参照してください。)
pt_br: Na saída *HTML*, o código será renderizado para uma imagem *PNG* ou *SVG* (consulte :confval:`graphviz_output_format`). Na saída do *LaTeX*, o código será renderizado em um arquivo *PDF* que pode ser incorporado.
zh_cn: 在HTML输出中，代码将呈现为PNG或SVG图像（请参见：confval:`graphviz_output_format`）。在LaTeX输出中，代码将呈现为可嵌入的PDF文件。

source: You can also embed external dot files, by giving the file name as an argument to :rst:dir:`graphviz` and no additional content::
ja: :rst:dir:`graphviz` ディレクティブの引数にファイル名を与えて、コンテンツを空にすることで、外部のdotファイルを埋め込むこともできます::
pt_br: Você também pode incorporar arquivos *dot* externos, dando o nome do arquivo como um argumento para :rst:dir:`graphviz` e sem conteúdo adicional::
zh_cn: 也可以通过将文件名作为参数嵌入外部点文件：rst:方向：`graphviz`且没有其他内容：：

source: As for all file references in Sphinx, if the filename is absolute, it is taken as relative to the source directory.
ja: Sphinx内の他のファイル参照と同様に、絶対パスのファイル名はソースディレクトリからの相対パスとして扱われます。
pt_br: Quanto a todas as referências de arquivo no *Sphinx*, se o nome do arquivo for absoluto, ele será considerado relativo ao diretório de origem.
zh_cn: 对于Sphinx中的所有文件引用，如果文件名是绝对的，则将其视为相对于源目录的。

source: Added support for external files.
ja: 外部ファイルのサポートを追加。
pt_br: Adicionado suporte para arquivos externos.
zh_cn: 添加了对外部文件的支持。

source: options
zh_cn: 选项

source: The alternate text of the graph. By default, the graph code is used to the alternate text.
zh_cn: 图形的替代文本。默认情况下，图形代码用于替换文本。

source: The horizontal alignment of the graph.
zh_cn: 图形的水平对齐。

source: The caption of the graph.
zh_cn: 图表的标题。

source: The layout of the graph (ex. ``dot``, ``neato`` and so on). A path to the graphviz commands are also allowed. By default, :confval:`graphviz_dot` is used.
zh_cn: 图形的布局（例如“点”、“neato”等等）。也允许graphviz命令的路径。默认情况下，使用：confval:`graphviz_dot'。

source: Renamed from ``graphviz_dot``
zh_cn: 从“graphviz”dot重命名``

source: The label of the graph.
zh_cn: 图形的标签。

source: The class name of the graph.
zh_cn: 图形的类名。

source: Directive for embedding a single undirected graph. The name is given as a directive argument, the contents of the graph are the directive content. This is a convenience directive to generate ``graph <name> { <content> }``.
ja: 無向グラフをひとつ埋め込むのに使用するディレクティブです。 グラフの名前はディレクティブ引数として渡します。ディレクティブのコンテンツがそのままグラフ作成に使用されます。 このディレクティブは ``graph <名前> { <コンテンツ> }`` というグラフを作成するための便利機能です。
pt_br: Diretiva para incorporação de um único gráfico não direcionado. O nome é dado como um argumento de diretiva, o conteúdo do gráfico é o conteúdo da diretiva. Esta é uma diretiva de conveniência para gerar ``graph <name> { <content> }``.
zh_cn: 用于嵌入单个无向图的指令。名称作为指令参数给定，图形的内容是指令内容。这是生成``graph 1 {2} ``的便利指令。

source: For example::
ja: 例えば::
pt_br: Por exemplo::
zh_cn: 例如：

source: The graph name is passed unchanged to Graphviz. If it contains non-alphanumeric characters (e.g. a dash), you will have to double-quote it.
ja: グラフの名前はそのままGraphvizに渡されます。名前に英数字でないもの(例えば、ダッシュ記号)が含まれているなら、それをダブルクオートで囲まなければならないでしょう。
pt_br: O nome do gráfico é passado inalterado para *Graphviz*. Se ele contiver caracteres não-alfanuméricos (por exemplo, um traço), você terá que aspas duplas.
zh_cn: 图形名被原封不动地传递给Graphviz。如果它包含非字母数字字符（如破折号），则必须双引号。

source: Same as :rst:dir:`graphviz`.
zh_cn: 和rst:dir:`graphviz`.一样

source: Directive for embedding a single directed graph. The name is given as a directive argument, the contents of the graph are the directive content. This is a convenience directive to generate ``digraph <name> { <content> }``.
ja: 有向グラフをひとつ埋め込むために使用するディレクティブです。 グラフの名前はディレクティブ引数として渡します。ディレクティブのコンテンツがそのままグラフ作成に使用されます。 このディレクティブは ``digraph <名前> { <コンテンツ> }`` というグラフを作成するための便利機能です。
pt_br: Diretiva para incorporação de um único gráfico direcionado. O nome é dado como um argumento de diretiva, o conteúdo do gráfico é o conteúdo da diretiva. Esta é uma diretiva de conveniência para gerar ``digraph <name> { <content> }``.
zh_cn: 用于嵌入单个有向图的指令。名称作为指令参数给定，图形的内容是指令内容。这是生成“有向图{}`”的方便指令。

source: There are also these config values:
pt_br: Existem também estes valores de configuração:
zh_cn: 还有以下配置值：

source: The command name with which to invoke ``dot``. The default is ``'dot'``; you may need to set this to a full path if ``dot`` is not in the executable search path.
ja: ``dot`` を呼び出すときに使用するコマンド名です。デフォルトでは ``'dot'`` です。 もしも ``dot`` コマンドが実行時の検索パスに存在していなくて、フルパスを設定する必要がある場合にはこの設定値を変更してください。
pt_br: O nome do comando com o qual invocar ``dot``. O padrão é ``'dot'``; talvez seja necessário definir isso para um caminho completo se ``dot`` não estiver no caminho de pesquisa executável.
zh_cn: 用于调用“dot”的命令名。默认值为“dot”；如果“dot”不在可执行搜索路径中，则可能需要将其设置为完整路径。

source: Since this setting is not portable from system to system, it is normally not useful to set it in ``conf.py``; rather, giving it on the :program:`sphinx-build` command line via the :option:`-D <sphinx-build -D>` option should be preferable, like this::
ja: この設定はシステム間で共通にはできないため、``conf.py`` の中で設定することは通常行いません。むしろ、次のように :program:`sphinx-build` コマンドの :option:`-D <sphinx-build -D>` オプションとして与えるほうが望ましいでしょう。 ::
pt_br: Como essa configuração não é portável de um sistema para outro, não é muito útil configurar no ``conf.py``; em vez disso, use o comando do :program:`sphinx-build` via :option:`-D <sphinx-build -D>` é mais eficaz, como isso::
zh_cn: 由于此设置在系统之间不可移植，因此通常设置它是没有用的``配置文件``；相反，在：program:`sphinxbuild`命令行中通过：option:`-D`选项给出它应该更可取，如下所示：

source: Additional command-line arguments to give to dot, as a list. The default is an empty list. This is the right place to set global graph, node or edge attributes via dot's ``-G``, ``-N`` and ``-E`` options.
ja: ``dot`` コマンドに渡す、追加のコマンドライン引数です。デフォルト値は空のリストです。 ``-G``, ``-N``, ``-E`` オプションを使用して、ドキュメント内のすべてのGraphvizのグラフの、グラフ、ノード、エッジの属性を変更する場合にはこのオプションを使用してください。
pt_br: Argumentos adicionais de linha de comando para fornecer ao *dot*, como uma lista. O padrão é uma lista vazia. Este é o lugar certo para definir atributos globais de gráfico, nó ou borda através das opções ``-G``, ``-N`` e ``-E`` do *dot*.
zh_cn: 以列表形式提供给dot的其他命令行参数。默认为空列表。这是通过dot的`-G``、`-N``和`-E``选项设置全局图、节点或边缘属性的正确位置。

source: The output format for Graphviz when building HTML files. This must be either ``'png'`` or ``'svg'``; the default is ``'png'``. If ``'svg'`` is used, in order to make the URL links work properly, an appropriate ``target`` attribute must be set, such as ``"_top"`` and ``"_blank"``. For example, the link in the following graph should work in the svg output: ::
ja: HTMLファイルを作成するときのGraphvizの出力形式。これは ``'png'`` か ``'svg'`` のどちらかでなければなりません。デフォルトは ``'png'`` です。 ``'svg'`` を使用する場合、URLリンクを正しく動作させるには、 ``"_top"`` や ``"_blank"`` などの適切な ``target`` 属性を設定する必要があります。たとえば、次のグラフのリンクはsvg出力で機能します。
pt_br: O formato de saída do *Graphviz* ao criar arquivos *HTML*. Isso deve ser ``'png'`` ou ``'svg'``; o padrão é ``'png'``. Se ``'svg'`` for usada, para fazer com que os links de *URL* funcionem corretamente, um atributo ``target`` apropriado deve ser definido, como ``"_top"`` e ``"_blank"``. Por exemplo, o link no gráfico a seguir deve funcionar na saída SVG:
zh_cn: 生成HTML文件时Graphviz的输出格式。它必须是“png”或“svg”；默认值为“png”。如果使用了“svg”，为了使URL链接正常工作，必须设置适当的“target”属性，例如“top”和“blank”。例如，下图中的链接应该在svg输出中起作用：：：

source: Previously, output always was PNG.
ja: 以前は出力はPNGしかありませんでした。
pt_br: Anteriormente, a saída sempre era *PNG*.
zh_cn: 以前，输出总是PNG。
