Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/index.po
Languages: ja, pt_br, zh_cn

source: Extensions
ja: 拡張
pt_br: Extensões
zh_cn: 插件

source: Since many projects will need special features in their documentation, Sphinx allows adding "extensions" to the build process, each of which can modify almost any aspect of document processing.
ja: たくさんのプロジェクトではそのドキュメントに独自の機能を必要としているため、Sphinxでは "拡張" をビルド中に加える事が出来ます。拡張により、ドキュメント処理中のほぼすべての場面に変更を加える事が出来ます。
pt_br: Diversos projetos necessitam funcionalidades especiais em sua documentação, O Sphinx permite adicionar "extensões" ao processo de construção da documentação e cada qual pode modificar aspectos individualizados no processamento.
zh_cn: 由于许多项目在其文档中需要特殊特性，Sphinx允许在构建过程中添加“扩展”，每个扩展几乎可以修改文档处理的任何方面。

source: This chapter describes the extensions bundled with Sphinx. For the API documentation on writing your own extension, refer to :ref:`dev-extensions`.
ja: この章ではSphinxに標準で付属している拡張について説明します。ご自身の拡張を実装するときに必要なAPIドキュメントは、 :ref:`dev-extensions` を参照してください。
pt_br: Este capítulo descreve as extensões incluídas no ``Sphinx``. Para a documentação da API sobre como escrever sua própria extensão, consulte o :ref:`dev-extensions`.
zh_cn: 本章介绍与Sphinx捆绑的插件。有关编写自己的扩展的API文档，请参阅：ref:`dev extensions`。

source: Built-in extensions
ja: 組み込みの拡張
pt_br: Extensões internas
zh_cn: 内置插件

source: These extensions are built in and can be activated by respective entries in the :confval:`extensions` configuration value:
ja: これらの拡張機能はすべてSphinxに組み込まれています。設定ファイルの :confval:`extensions` のリストの中に名前を書くことで使用できるようになります:
pt_br: Essas extensões são construidas e pode ser ativadas através das respectivas entradas e valores na configuração :confval:`extensions` :
zh_cn: 这些插件是内置的，可以通过：confval:`extensions`配置值中的相应条目激活：

source: Third-party extensions
ja: サードパーティ製の拡張機能
pt_br: Extensões Terceiros
zh_cn: 第三方插件

source: Todo
pt_br: Por fazer
zh_cn: 待处理

source: This should reference the GitHub organization now
pt_br: Isso deve fazer referência à organização do GitHub agora
zh_cn: 现在应该引用GitHub组织

source: You can find several extensions contributed by users in the `Sphinx Contrib`_ repository. It is open for anyone who wants to maintain an extension publicly; just send a short message asking for write permissions.
ja: 多くのコントリビューターによる拡張機能を、 `Sphinx Contrib`_ リポジトリで見つけることができます。このリポジトリは、拡張機能をオープンな場でメンテナンスしたい人に公開しています。必要な方は、Georgまで書き込み権限の追加をお願いするメッセージを送ってください。
pt_br: Podem ser encontradas diversas extensões de contribuidores e usuários no repositório `Sphinx Contrib`_ . É aberto para que qualquer um que desejar manter uma extensão públicamente, apenas envie uma mensagem perguntando sobre permissões.
zh_cn: 您可以在“Sphinx Contrib”存储库中找到几个由用户提供的扩展。它对任何想公开维护扩展的人都是开放的；只需发送一条短消息请求写权限。

source: There are also several extensions hosted elsewhere. The `Sphinx extension survey <https://sphinxext-survey.readthedocs.io/>`__ and `awesome-sphinxdoc <https://github.com/yoloseem/awesome-sphinxdoc>`__ contains a comprehensive list.
ja: 多くの拡張が各所で公開もされています。`Sphinx extension survey <https://sphinxext-survey.readthedocs.io/>`__ と `awesome-sphinxdoc <https://github.com/yoloseem/awesome-sphinxdoc>`__ には包括的なリストが掲載されています.
pt_br: Existem também várias extensões hospedadas em outros lugares. O `Sphinx extension survey <https://sphinxext-survey.readthedocs.io/>`__ e `awesome-sphinxdoc <https://github.com/yoloseem/awesome-sphinxdoc>`__ contém uma lista abrangente.
zh_cn: 其他地方也有一些扩展。Sphinx插件调查<https://sphinxext-survey.readthedocs.io/>`__还有超棒的sphinx文档<https://github.com/yoloseem/awesome-sphinxdoc>`__包含一个全面的列表。

source: If you write an extension that you think others will find useful or you think should be included as a part of Sphinx, please write to the project mailing list (`join here <https://groups.google.com/forum/#!forum/sphinx-dev>`_).
ja: もしあなたが作成した拡張が他の人にも有用だと思う、あるいはSphinxの一部として含めるべきだと思うのであれば、 Sphinxのメーリングリストに投稿してください。 ( `ここから参加してください <https://groups.google.com/forum/#!forum/sphinx-dev>`_ )
pt_br: Caso escreve uma extensão e ache que seja útil a outros e desejar que seja incluída como parte do Sphinx, favor escrever para forum de email (`entre aqui <https://groups.google.com/forum/#!forum/sphinx-dev>`_).
zh_cn: 如果你写了一个你认为其他人会觉得有用的插件，或者你认为应该包含在sphinx的一部分，请写信到项目邮件列表（`join here<https://groups.google.com/forum/#！forum/sphinx-dev>`_）。

source: Where to put your own extensions?
ja: 自分自身の拡張機能はどこに置くべき？
pt_br: Onde colocar suas próprias extensões?
zh_cn: 你自己的插件放在哪里？

source: Extensions local to a project should be put within the project's directory structure. Set Python's module search path, ``sys.path``, accordingly so that Sphinx can find them. For example, if your extension ``foo.py`` lies in the ``exts`` subdirectory of the project root, put into :file:`conf.py`::
ja: あるプロジェクトに固有の拡張は、そのプロジェクトのディレクトリ構造内に置かれるべきです。Pythonのモジュール検索パス``sys.path``を設定してSphinxがそれらの拡張を見つけられるようにしてください。例えば、ご自身の拡張機能が ``foo.py``という名前で、プロジェクトのルート配下のサブディレクトリ``exts`` に置かれていた場合には、 :file:`conf.py` の中に以下のような記述をします::
pt_br: Extensões locais para um projeto devem ser colocadas dentro da estrutura de diretório do projeto. Defina o path de pesquisa do módulo do Python, ``sys.path``, de forma que o ``Sphinx`` possa localizá-los. Por exemplo, se sua extensão ``foo.py`` estiver no subdiretório ``exts`` da raiz do projeto, coloque em :file:`conf.py`::
zh_cn: 项目的本地扩展应该放在项目的目录结构中。设置Python的模块搜索路径``搜索路径``，这样斯芬克斯才能找到他们。例如，如果您的分机``食品``位于项目根目录的“exts”子目录中，放入：文件：`conf.py`::

source: You can also install extensions anywhere else on ``sys.path``, e.g. in the ``site-packages`` directory.
ja: ``sys.path``\ を使う以外の方法では、\ ``site-packages``\ ディレクトリの中にインストールするという方法などもあります。
pt_br: Também pode instalar extensões em qualquer outro lugar do ``sys.path``, ex.. diretórios ``site-packages``.
zh_cn: 您也可以在任何其他地方安装插件``搜索路径``，例如在“站点包”目录中。
