Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/inheritance.po
Languages: pt_br, zh_cn

source: :mod:`sphinx.ext.inheritance_diagram` -- Include inheritance diagrams
pt_br: :mod:`sphinx.ext.inheritance_diagram` -- Incluir diagramas de herança
zh_cn: ：模式：`sphinx.ext.继承图`--包括继承关系图

source: This extension allows you to include inheritance diagrams, rendered via the :mod:`Graphviz extension <sphinx.ext.graphviz>`.
pt_br: Esta extensão permite incluir diagramas de herança, renderizados através do :mod:`Graphviz extension <sphinx.ext.graphviz>`.
zh_cn: 此插件允许包含通过：mod:`Graphviz插件呈现的继承关系图<sphinx.ext.graphviz>`.

source: It adds this directive:
pt_br: Acrescente esta diretiva:
zh_cn: 它添加了以下指令：

source: This directive has one or more arguments, each giving a module or class name. Class names can be unqualified; in that case they are taken to exist in the currently described module (see :rst:dir:`py:module`).
pt_br: Esta diretiva possui um ou mais argumentos, cada um dando um nome de módulo ou classe. Nomes de classes podem ser desqualificados; Nesse caso, eles são levados a existir no módulo descrito atualmente (consulte :rst:dir:`py:module`).
zh_cn: 这个指令有一个或多个参数，每个参数都给出一个模块或类名。类名可以是非限定的；在这种情况下，它们被认为存在于当前描述的模块中（参见：rst:方向：`py:module`）。

source: For each given class, and each class in each given module, the base classes are determined. Then, from all classes and their base classes, a graph is generated which is then rendered via the graphviz extension to a directed graph.
pt_br: Para cada classe fornecida e cada classe em cada módulo fornecido, as classes base são determinadas. Então, de todas as classes e suas classes base, um gráfico é gerado, o qual é então renderizado através da extensão ``graphviz`` para um grafo direcionado.
zh_cn: 对于每个给定的类，以及每个给定模块中的每个类，确定基类。然后，从所有类及其基类生成一个图，然后通过graphviz扩展将其呈现为有向图。

source: This directive supports an option called ``parts`` that, if given, must be an integer, advising the directive to keep that many dot-separated parts in the displayed names (from right to left). For example, ``parts=1`` will only display class names, without the names of the modules that contain them.
pt_br: Essa diretiva suporta uma opção chamada ``parts`` que, se fornecida, deve ser um inteiro, aconselhando a diretiva a manter tantas partes separadas por pontos nos nomes exibidos (da direita para a esquerda). Por exemplo, ``parts=1`` exibirá apenas nomes de classes, sem os nomes dos módulos que os contêm.
zh_cn: 此指令支持一个名为“parts”的选项，如果给定该选项，该选项必须是一个整数，建议该指令在显示的名称中保留这些以点分隔的部分（从右到左）。例如，``parts=1``将只显示类名，而不显示包含类名的模块的名称。

source: The value of for ``parts`` can also be negative, indicating how many parts to drop from the left. For example, if all your class names start with ``lib.``, you can give ``:parts: -1`` to remove that prefix from the displayed node names.
pt_br: O valor de ``parts`` também pode ser negativo, indicando quantas partes devem ser descartadas da esquerda. Por exemplo, se todos os nomes de classes começarem com ``lib.``, você poderá fornecer ``:parts: -1`` para remover esse prefixo dos nomes de nós exibidos.
zh_cn: for“parts”的值也可以是负数，表示从左边删除多少个部分。例如，如果所有类名都以“lib.”开头，则可以给“`:parts:-1”从显示的节点名中删除该前缀。

source: The directive also supports a ``private-bases`` flag option; if given, private base classes (those whose name starts with ``_``) will be included.
pt_br: A diretiva também suporta uma opção de flag ``private-base``; se dado, classes de base privadas (aquelas cujo nome começa com ``_``) serão incluídas.
zh_cn: 该指令还支持一个“private bases”标志选项；如果给定了该选项，则将包括私有基类（名称以“`”开头的基类）。

source: You can use ``caption`` option to give a caption to the diagram.
pt_br: Você pode usar a opção ``caption`` para dar uma legenda ao diagrama.
zh_cn: 您可以使用“caption”选项为图表提供标题。

source: Added ``private-bases`` option; previously, all bases were always included.
pt_br: Adicionado a opção ``private-bases``; anteriormente, todas as bases eram sempre incluídas.
zh_cn: 添加了“private bases”选项；以前，总是包含所有的基。

source: Added ``caption`` option
pt_br: Adicionado a opção ``caption``
zh_cn: 添加了“caption”选项

source: It also supports a ``top-classes`` option which requires one or more class names separated by comma. If specified inheritance traversal will stop at the specified class names. Given the following Python module::
pt_br: Ele também suporta uma opção ``top-classes`` que requer um ou mais nomes de classes separados por vírgula. Se o percurso de herança especificado for interrompido nos nomes das classes especificadas. Dado o seguinte módulo *Python*::
zh_cn: 它还支持“顶级类”选项，该选项需要一个或多个用逗号分隔的类名。如果指定继承，则遍历将在指定的类名处停止。给定以下Python模块：

source: If you have specified a module in the inheritance diagram like this::
pt_br: Se você especificou um módulo no diagrama de herança assim::
zh_cn: 如果您在继承关系图中指定了如下模块：

source: any base classes which are ancestors to ``top-classes`` and are also defined in the same module will be rendered as stand alone nodes. In this example class A will be rendered as stand alone node in the graph. This is a known issue due to how this extension works internally.
pt_br: quaisquer classes base que sejam ancestrais de ``top-classes`` e também estejam definidas no mesmo módulo serão renderizadas como nós independentes. Neste exemplo, a classe ``A`` será renderizada como nó independente no gráfico. Esse é um problema conhecido devido a como essa extensão funciona internamente.
zh_cn: 作为“顶级类”的祖先并在同一模块中定义的任何基类都将呈现为独立节点。在本例中，类A将在图中呈现为独立节点。这是一个已知的问题，因为这个扩展是如何在内部工作的。

source: If you don't want class A (or any other ancestors) to be visible then specify only the classes you would like to generate the diagram for like this::
pt_br: Se você não quiser que a classe ``A`` (ou qualquer outro ancestral) esteja visível, especifique apenas as classes para as quais você gostaria de gerar o diagrama::
zh_cn: 如果不希望类A（或任何其他祖先）可见，则只指定要为其生成关系图的类，如下所示：

source: Added ``top-classes`` option to limit the scope of inheritance graphs.
pt_br: Adicionado a opção ``top-classes`` para limitar o escopo de gráficos de herança.
zh_cn: 添加了“顶级类”选项以限制继承图的范围。

source: Examples
pt_br: Exemplos
zh_cn: 实际案例

source: The following are different inheritance diagrams for the internal ``InheritanceDiagram`` class that implements the directive.
pt_br: A seguir estão os diferentes diagramas de herança para a classe interna ``InheritanceDiagram`` que implementa a diretiva.
zh_cn: 以下是实现指令的内部“InheritanceDiagram”类的不同继承关系图。

source: With full names::
pt_br: Com nomes completos::
zh_cn: 全名：

source: Showing class names only::
pt_br: Mostrando apenas nomes de classes::
zh_cn: 仅显示类名：

source: Stopping the diagram at :class:`sphinx.util.docutils.SphinxDirective` (the highest superclass still part of Sphinx), and dropping the common left-most part (``sphinx``) from all names::
pt_br: Parando o diagrama em :class:`sphinx.util.docutils.SphinxDirective` (a maior superclasse ainda parte do Sphinx), e soltando a parte mais comum à esquerda (``sphinx``) de todos os nomes:
zh_cn: 在以下位置停止关系图：类：`sphinx.util.docutils.SphinxDirective`（最高的超类仍然是Sphinx的一部分），并从所有名称中删除最左边的公共部分（`Sphinx``）：

source: Configuration
pt_br: Configuração
zh_cn: 配置

source: A dictionary of graphviz graph attributes for inheritance diagrams.
pt_br: Um dicionário de atributos ``graphviz`` ``graphv para diagramas de herança.
zh_cn: 继承图的graphviz图属性字典。

source: For example::
pt_br: Por exemplo::
zh_cn: 例如：

source: A dictionary of graphviz node attributes for inheritance diagrams.
pt_br: Um dicionário de atributos do nó ``graphviz`` para diagramas de herança.
zh_cn: 继承图的graphviz节点属性字典。

source: A dictionary of graphviz edge attributes for inheritance diagrams.
pt_br: Um dicionário de atributos ``graphviz`` ``edge`` para diagramas de herança.
zh_cn: graphviz节点的字典的属性是继承关系图。

source: Allows mapping the full qualified name of the class to custom values (useful when exposing the underlying path of a class is not desirable, e.g. it's a private class and should not be instantiated by the user).
pt_br: Permite mapear o nome completo qualificado da classe para valores personalizados (útil quando a exposição do path subjacente de uma classe não é desejável, por exemplo, é uma classe privada e não deve ser instanciada pelo usuário).
zh_cn: 允许将类的完整限定名映射到自定义值（当不需要公开类的基础路径时，非常有用，例如，它是一个私有类，不应由用户实例化）。
