Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/intersphinx.po
Languages: fr, ja, zh_cn

source: :mod:`sphinx.ext.intersphinx` -- Link to other projects' documentation
fr: mod:`sphinx.ext.ext.intersphinx` -- Lien vers la documentation d'autres projets
ja: :mod:`sphinx.ext.intersphinx` -- 他のプロジェクトのドキュメントへのリンク
zh_cn: ：模式：`sphinx.ext.intersphinx`--链接到其他文档

source: This extension can generate automatic links to the documentation of objects in other projects.
fr: Cette extension peut générer des liens automatiques dans la documentation des objets d'autres projets.
ja: この拡張機能は他のプロジェクトのオブジェクトのドキュメントに対して、自動リンクを生成できるようになります。
zh_cn: 此插件可以自动生成指向其他项目中对象文档的链接。

source: Usage is simple: whenever Sphinx encounters a cross-reference that has no matching target in the current documentation set, it looks for targets in the documentation sets configured in :confval:`intersphinx_mapping`. A reference like ``:py:class:`zipfile.ZipFile``` can then link to the Python documentation for the ZipFile class, without you having to specify where it is located exactly.
fr: L'utilisation est simple : chaque fois que Sphinx rencontre une référence croisée qui n'a pas de cible correspondante dans le jeu de documentation courant, il cherche des cibles dans les jeux de documentation configurés dans :confval:`intersphinx_mapping`. Une référence comme ``:py:class:``zipfile.ZipFile``` peut alors être liée à la documentation Python de la classe ZipFile, sans que vous ayez à spécifier où elle se trouve exactement.
ja: 使用方法はシンプルで、Sphinxがクロスリファレンスの参照を解決しようとして、現在のドキュメントの中から見つけられなかった場合には、 :confval:`intersphinx_mapping` で設定されたドキュメント集の中を探索しにいくようになります。 ``:py:class:`zipfile.ZipFile``` という参照があった場合には、そのドキュメントの詳細な場所を知らなくても、Pythonの標準ライブラリのドキュメントの、ZipFileクラスに対してリンクが張られます。
zh_cn: 用法很简单：每当Sphinx遇到当前文档集中没有匹配目标的交叉引用时，它会在confval:`intersphinx_mapping`中配置的文档集中查找目标。类似“py:class:`zipfile.zipfile文件```然后可以链接到ZipFile类的Python文档，而不必指定它的确切位置。

source: When using the "new" format (see below), you can even force lookup in a foreign set by prefixing the link target appropriately. A link like ``:ref:`comparison manual <python:comparisons>``` will then link to the label "comparisons" in the doc set "python", if it exists.
fr: Lorsque vous utilisez le "nouveau" format (voir ci-dessous), vous pouvez même forcer la recherche dans un ensemble étranger en préfixant la cible de lien de manière appropriée. Un lien comme ``\:ref\:``comparison manual <python\:comparisons>``` sera alors lié à l'étiquette "comparisons" dans le jeu de documentation "python", si elle existe.
ja: もし、「新しい」フォーマット(後述)を使用する場合、リンクターゲット名に特定のプリフィックスを付けることで、強制的に外部ドキュメントを探索しにいくように設定できます。 ``:ref:`比較マニュアル <python:comparisons>``` というリンクがあれば、もし"python"という名前のドキュメントセットが設定されていたとすると、その中の"comparisons"というラベルを探索しに行きます。
zh_cn: 当使用“new”格式（见下文）时，您甚至可以通过适当地给链接目标加前缀来强制查找外部集合。一个像' ':ref: ' comparison manual ' ' '这样的链接会链接到文档集“python”中的“compare”标签，如果它存在的话。

source: Behind the scenes, this works as follows:
fr: Dans les coulisses, cela fonctionne comme suit :
ja: この仕組みの背後では、次のようなことが行われています。
zh_cn: 在幕后，它的工作原理如下：

source: Each Sphinx HTML build creates a file named :file:`objects.inv` that contains a mapping from object names to URIs relative to the HTML set's root.
fr: Chaque compilation HTML de Sphinx crée un fichier nommé :file:`objects.inv` qui contient un mappage des noms d'objets aux URIs par rapport à la racine de l'ensemble HTML.
ja: Sphinxを使って生成されたHTMLの中には :file:`objects.inv` というファイルがあります。このファイルの中にはオブジェクト名と、HTMLのルートからの相対URLのマッピング情報が含まれます。
zh_cn: 每个Sphinx HTML构建都会创建一个名为：file:`objects.inv`包含从对象名到相对于HTML集根的uri的映射。

source: Projects using the Intersphinx extension can specify the location of such mapping files in the :confval:`intersphinx_mapping` config value. The mapping will then be used to resolve otherwise missing references to objects into links to the other documentation.
fr: Les projets utilisant l'extension Intersphinx peuvent spécifier l'emplacement de ces fichiers de mappage dans la valeur de configuration :confval:`intersphinx_mapping`. Le mappage sera ensuite utilisé pour résoudre les références manquantes aux objets dans les liens vers les autres documentations.
ja: intersphinx拡張を使用したプロジェクトは、 :confval:`intersphinx_mapping` という設定値を使って、そのマッピングファイルの場所を指定できます。このマッピング情報は、リンクが解決されていないオブジェクトの参照から、外部のドキュメントのリンクを張るために使用されます。
zh_cn: 使用Intersphinx扩展名的项目可以在：confval:`Intersphinx_mapping`配置值中指定此类映射文件的位置。然后，该映射将用于将其他缺少的对象引用解析为指向其他文档的链接。

source: By default, the mapping file is assumed to be at the same location as the rest of the documentation; however, the location of the mapping file can also be specified individually, e.g. if the docs should be buildable without Internet access.
fr: Par défaut, le fichier cartographique est supposé se trouver au même emplacement que le reste de la documentation ; cependant, l'emplacement du fichier cartographique peut également être spécifié individuellement, par exemple si les documents doivent pouvoir être construits sans accès Internet.
ja: デフォルトの設定では、マッピングファイルはドキュメントと同じ位置にあるとみなされます。マッピングファイルの場所は個別に指定できます。例えば、インターネットのアクセスができない環境でビルドできるようにする場合などです。
zh_cn: 默认情况下，假定映射文件与其余文档位于同一位置；但是，也可以单独指定映射文件的位置，例如，如果文档应该可以在不访问Internet的情况下生成。

source: Configuration
ja: 設定
zh_cn: 配置

source: This config value contains the locations and names of other projects that should be linked to in this documentation.
fr: Cette valeur de configuration contient les emplacements et les noms des autres projets qui doivent être liés dans cette documentation.
ja: この設定値には、このドキュメントからリンクさせる他のプロジェクトの場所と名前を設定します。
zh_cn: 此配置值包含应在此文档中链接到的其他项目的位置和名称。

source: Relative local paths for target locations are taken as relative to the base of the built documentation, while relative local paths for inventory locations are taken as relative to the source directory.
fr: Les chemins locaux relatifs pour les emplacements cibles sont considérés comme relatifs par rapport à la base de la documentation construite, tandis que les chemins locaux relatifs pour les emplacements d'inventaire sont considérés comme relatifs par rapport au répertoire source.
ja: 相対的なローカルパスがキーに設定された場合には、ビルドドキュメントに対して相対的な場所であるとみなされます。値側に相対パスが設定された場合には、ソースディレクトリからの相対パスになります。
zh_cn: 目标位置的相对本地路径被视为相对于构建文档的基础，而库存位置的相对本地路径被视为相对于源目录。

source: When fetching remote inventory files, proxy settings will be read from the ``$HTTP_PROXY`` environment variable.
fr: Lors de la récupération de fichiers d'inventaire distants, les paramètres proxy seront lus à partir de la variable d'environnement ``$HTTP_PROXY``.
ja: リモートでインベントリーファイルを取得する場合には、環境変数の ``$HTTP_PROXY`` を設定しておくと、プロキシーを経由してアクセスを行います。
zh_cn: 获取远程清单文件时，将从`$HTTP_proxy``环境变量中读取代理设置。

source: **Old format for this config value**
fr: ***Ancien format pour cette valeur de configuration **
ja: **この設定値の古いフォーマット**

source: This is the format used before Sphinx 1.0. It is still recognized.
fr: C'est le format utilisé avant Sphinx 1.0. C'est encore reconnu.
ja: このフォーマットはSphinx 1.0以前で使用されていました。これは現在でも使用できます。
zh_cn: 这是Sphinx1.0之前使用的格式。它仍然被认可。

source: A dictionary mapping URIs to either ``None`` or an URI. The keys are the base URI of the foreign Sphinx documentation sets and can be local paths or HTTP URIs. The values indicate where the inventory file can be found: they can be ``None`` (at the same location as the base URI) or another local or HTTP URI.
fr: Un dictionnaire mappant les URIs soit à ``Aucun`` soit à un URI. Les clés sont l'URI de base des jeux de documentation Sphinx étrangers et peuvent être des chemins locaux ou des URI HTTP. Les valeurs indiquent où se trouve le fichier d'inventaire : elles peuvent être ``Aucune`` (au même endroit que l'URI de base) ou une autre URI locale ou HTTP.
ja: この設定値はURI同士(値は場合によっては\ ``None``)をマッピングする辞書になります。キーは外部のSphinxのドキュメントのベースのURIを設定します。ローカルのパス、もしくはHTTPのURIが使用できます。値はインベントリファイル(.inv)がある場所を設定します。これに設定できるのは、\ ``None``\ (base UIと同じ場所にあるとみなされます)、もしくはローカルのパス、HTTPのURIのどれかになります。
zh_cn: 将URI映射到“None”或URI的字典。键是外部Sphinx文档集的基本URI，可以是本地路径或httpuri。这些值指示可以在何处找到清单文件：它们可以是“None”（与基URI位于同一位置）或另一个本地或HTTP URI。

source: **New format for this config value**
fr: **Nouveau format pour cette valeur de configuration**
ja: **この設定値の新しいフォーマット**

source: A dictionary mapping unique identifiers to a tuple ``(target, inventory)``. Each ``target`` is the base URI of a foreign Sphinx documentation set and can be a local path or an HTTP URI. The ``inventory`` indicates where the inventory file can be found: it can be ``None`` (at the same location as the base URI) or another local or HTTP URI.
ja: ユニークな識別子をキーにして、 ``(ターゲット, インベントリ)`` というタプルを値に持つ辞書のマッピングです。それぞれの ``ターゲット`` は外部のSphinxのドキュメントを表すベースのURIで、ローカルファイルパスもしくはHTTPのURIを指定できます。 ``インベントリ`` はインベントリファイル(.inv)がある場所を設定します。これに設定できるのは、\ ``None``\ (ベースURIと同じ場所にあるとみなされます)、もしくはローカルのパス、HTTPのURIのどれかになります。

source: The unique identifier can be used to prefix cross-reference targets, so that it is clear which intersphinx set the target belongs to. A link like ``:ref:`comparison manual <python:comparisons>``` will link to the label "comparisons" in the doc set "python", if it exists.
fr: L'identificateur exclusif peut être utilisé pour préfixer les cibles de référence croisée, de sorte qu'il soit clair à quel intersphinx défini la cible appartient. Un lien comme ``\:ref\:``comparison manual <python\:comparisons>``` sera lié à l'étiquette "comparisons" dans le jeu de documentation "python", si elle existe.
ja: ユニークな識別子は、クロスリファレンスのターゲットのプリフィックスとして使用されます。そのため、ターゲットの要素がintersphinxによって設定されたことが明確になります。たとえば、 ``:ref:`比較のマニュアル <python:comparisons>``` という項目があれば、この"comparisons"というラベルは"python"のドキュメントセットの中にあるドキュメントに対してリンクが作成されます。
zh_cn: 唯一标识符可用于给交叉引用目标加前缀，以便明确目标属于哪个interspinx集。类似“`:ref:`comparison manual 1``的链接将链接到文档集“python”中的标签“compariations”（如果存在的话）。

source: **Example**
fr: **Exemple**
ja: **サンプル**
zh_cn: **举例**

source: To add links to modules and objects in the Python standard library documentation, use::
fr: Pour ajouter des liens vers des modules et des objets dans la documentation de la bibliothèque standard Python, utilisez::
ja: Pythonの標準のライブラリドキュメントの中のモジュールやオブジェクトに対してリンクが張りたい場合には次のようにします::
zh_cn: 要在Python标准库文档中添加指向模块和对象的链接，请使用：

source: This will download the corresponding :file:`objects.inv` file from the Internet and generate links to the pages under the given URI. The downloaded inventory is cached in the Sphinx environment, so it must be re-downloaded whenever you do a full rebuild.
fr: Cela téléchargera le fichier :file:`objects.inv` correspondant depuis Internet et générera des liens vers les pages sous l'URI donnée. L'inventaire téléchargé est mis en cache dans l'environnement Sphinx, il doit donc être téléchargé à nouveau chaque fois que vous faites une reconstruction complète.
ja: これを設定すると、ソースディレクトリの中の :file:`objects.inv` からインベントリー情報を読み込み、 ``http://docs.python.org/3.4`` 以下のページに対するリンクを作成します。ダウンロードされたインベントリ情報はキャッシュされるので、もしもPythonのドキュメントに新しいオブジェクトが追加された場合には、自分でアップデートする必要があります。
zh_cn: 这将下载相应的：文件：`对象.inv`从Internet上创建文件并生成指向给定URI下的页面的链接。下载的资源清册缓存在Sphinx环境中，因此在进行完全重建时必须重新下载。

source: A second example, showing the meaning of a non-``None`` value of the second tuple item::
fr: Un deuxième exemple, montrant la signification d'une valeur non-``None``` du deuxième élément tuple: :
ja: 2番目のサンプルは、2つ目のタプルの要素に ``None`` ではない値を与える場合です::
zh_cn: 第二个示例显示了第二个元组项的非“None”值的含义：

source: This will read the inventory from :file:`python-inv.txt` in the source directory, but still generate links to the pages under ``https://docs.python.org/3``. It is up to you to update the inventory file as new objects are added to the Python documentation.
fr: Ceci lira l'inventaire à partir du fichier :file:`python-inv.txt` dans le répertoire source, mais générera toujours des liens vers les pages sous ``https://docs.python.org/3```. C'est à vous de mettre à jour le fichier d'inventaire au fur et à mesure que de nouveaux objets sont ajoutés à la documentation Python.
ja: これを設定すると、ソースディレクトリの中の :file:`python-inv.txt` からインベントリー情報を読み込みますが、先ほどの例と同じように ``https://docs.python.org/3`` 以下のページに対するリンクを作成します。もしもPythonのドキュメントに新しいオブジェクトが追加された場合には、自分でアップデートする必要があります。
zh_cn: 这将从以下位置读取清单：file:`python-inv.txt`在源目录中，但仍生成指向下页的链接``https://docs.python.org/3``. 当新对象添加到Python文档中时，由您来更新库存文件。

source: **Multiple target for the inventory**
ja: **インベントリへの複数ターゲット**

source: Alternative files can be specified for each inventory. One can give a tuple for the second inventory tuple item as shown in the following example. This will read the inventory iterating through the (second) tuple items until the first successful fetch. The primary use case for this to specify mirror sites for server downtime of the primary inventory::
fr: Des fichiers alternatifs peuvent être spécifiés pour chaque inventaire. On peut donner un tuple pour le deuxième élément du tuple d'inventaire comme le montre l'exemple suivant. Ceci lira l'itération de l'inventaire à travers le (second) tuple des items jusqu'à ce que le premier chargement soit réussi. Le cas d'utilisation principal pour ceci pour spécifier les sites miroirs pour les temps d'arrêt du serveur de l'inventaire primaire: :
ja: 各インベントリへの代替ファイルを指定できます。次の例に示すように、1つは、二番目のインベントリタプル項目に対してもタプルを与えることができます。これは最初に成功したフェッチまで、 (次の)タプルを反復処理で読みこみます。この記法の基本ユースケースはプライマリインベントリのサーバーダウン時用のミラーサイトを指定することです。
zh_cn: 可以为每个库存指定替代文件。可以为第二个inventory tuple项提供一个元组，如下例所示。这将读取遍历（第二个）元组项的库存，直到第一次成功获取。用于指定主资源清册服务器停机时间的镜像站点的主要使用情形：

source: The maximum number of days to cache remote inventories. The default is ``5``, meaning five days. Set this to a negative value to cache inventories for unlimited time.
fr: Le nombre maximum de jours pour mettre en cache les inventaires distants. La valeur par défaut est "5", c'est-à-dire cinq jours. Définissez cette valeur à une valeur négative pour mettre en cache les inventaires pour une durée illimitée.
ja: リモートのインベントリーをキャッシュする最長の日数を設定します。デフォルトは\ ``5``\ で、5日間という意味になります。マイナスの値を設定すると、インベントリーのキャッシュの日数による制限がなくなります。
zh_cn: 缓存远程资源清册的最大天数。默认值为“5”，表示五天。将此值设置为负值可无限时间缓存库存。

source: The number of seconds for timeout. The default is ``None``, meaning do not timeout.
fr: Le nombre de secondes pour le délai d'attente. La valeur par défaut est ``None'', ce qui signifie qu'il n'y a pas de délai d'attente.
ja: タイムアウトの秒数を設定します。デフォルトは ``None`` で、タイムアウトしません。
zh_cn: 超时的秒数。默认值为“None”，表示不超时。

source: timeout is not a time limit on the entire response download; rather, an exception is raised if the server has not issued a response for timeout seconds.
fr: timeout n'est pas une limite de temps sur l'ensemble du téléchargement de la réponse ; plutôt, une exception est levée si le serveur n'a pas émis une réponse pendant les secondes de timeout.
ja: タイムアウト時間は、通信時間全体の時間ではなく、サーバーが応答を返し始めるまでの時間です。指定した秒数位内に応答を開始しない場合、例外が発生します。
zh_cn: 超时不是对整个响应下载的时间限制；相反，如果服务器在超时秒数内未发出响应，则会引发异常。

source: Showing all links of an Intersphinx mapping file
fr: Afficher tous les liens d'un fichier de mappage Intersphinx
ja: Sphinx間のマッピングファイルにあるすべてのリンクを表示する
zh_cn: 显示内部sphinx映射文件的所有链接

source: To show all Intersphinx links and their targets of an Intersphinx mapping file, run ``python -msphinx.ext.intersphinx url-or-path``. This is helpful when searching for the root cause of a broken Intersphinx link in a documentation project. The following example prints the Intersphinx mapping of the Python 3 documentation::
fr: Pour afficher tous les liens Intersphinx et leurs cibles d'un fichier de mappage Intersphinx, exécutez ``python -msphinx.ext.intersphinx url-or-path``. Ceci est utile lors de la recherche de la cause fondamentale d'un lien Intersphinx rompu dans un projet de documentation. L'exemple suivant imprime le mapping Intersphinx de la documentation Python 3: :
ja: マッピングファイル内にあるSphinx間のリンクとそれらのターゲットをすべて表示するには、 ``python -msphinx.ext.intersphinx url-or-path`` を実行してください。これは、文書プロジェクトでSphinx間リンクが破損している主要因を探る際に有用です。次の例は、Python 3 文書におけるSphinx間のマッピングを打ち出すものです::
zh_cn: 要显示内部sphinx映射文件的所有内部sphinx链接及其目标，请运行“python”-msphinx.ext.interspinx url-or-path”。这在搜索文档项目中中断i内部sphinx链接的根本原因时非常有用。下面的示例打印python3文档的内部sphinx映射：

source: To use Intersphinx linking, add ``'sphinx.ext.intersphinx'`` to your :confval:`extensions` config value, and use these config values to activate linking:
zh_cn: 要使用Intersphinx链接，请添加“`”sphinx.ext.intersphinx景“``到您的：confval:`extensions”配置值，并使用这些配置值激活链接：

source: Using Intersphinx with inventory file under Basic Authorization
zh_cn: 在基本授权下使用Intersphinx和库存文件

source: Intersphinx supports Basic Authorization like this::
zh_cn: Intersphinx支持如下基本授权：

source: The user and password will be stripped from the URL when generating the links.
zh_cn: 生成链接时，用户和密码将从URL中删除。
