Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/math.po
Languages: pt_br, zh_cn

source: Math support for HTML outputs in Sphinx
pt_br: Suporte matemático para saídas HTML no ``Sphinx``
zh_cn: Sphinx中HTML输出的数学支持

source: Math support for non-HTML builders is integrated to sphinx-core. So mathbase extension is no longer needed.
pt_br: O suporte matemático para construtores não-HTML é integrado ao ``sphinx-core``. Portanto, a extensão ``mathbase`` não é mais necessária.
zh_cn: 对非HTML构建器的数学支持集成到sphinx核心中。所以不再需要mathbase扩展。

source: Since mathematical notation isn't natively supported by HTML in any way, Sphinx gives a math support to HTML document with several extensions. These use the reStructuredText math :rst:dir:`directive <math>` and :rst:role:`role <math>`.
pt_br: Como a notação matemática não é suportada nativamente pelo *HTML* de forma alguma, o *Sphinx* fornece um suporte matemático para o documento *HTML* com várias extensões. Estas usam o *reStructuredText* *math* :rst:dir:`directive <math>` e :rst:role:`role <math>`.
zh_cn: 由于HTML在任何方面都不支持数学表示法，Sphinx为HTML文档提供了数学支持，并提供了几个扩展名。这些方法使用了RestructedText数学：rst:方向：`directive 1`和：rst:角色：`role 2`。

source: :mod:`sphinx.ext.imgmath` -- Render math as images
pt_br: :mod:`sphinx.ext.imgmath` -- Renderizar math com imagens
zh_cn: ：模式：`sphinx.ext.imgmath`--将数学渲染为图像

source: This extension renders math via LaTeX and dvipng_ or dvisvgm_ into PNG or SVG images. This of course means that the computer where the docs are built must have both programs available.
pt_br: Essa extensão renderiza math via LaTeX e dvipng_ ou dvisvgm_ em imagens PNG ou SVG. Isso significa que no computador onde esses documentos serão construídos, devem ter esses programas disponíveis.
zh_cn: 这个插件通过LaTeX和dvipng或dvisvgm将数学呈现为PNG或SVG图像。这当然意味着生成文档的计算机必须同时具有这两个程序。

source: There are various configuration values you can set to influence how the images are built:
pt_br: Existem vários valores de configuração que você pode definir para influenciar como as imagens são construídas:
zh_cn: 您可以设置各种配置值来影响图像的构建方式：

source: The output image format. The default is ``'png'``. It should be either ``'png'`` or ``'svg'``. The image is produced by first executing ``latex`` on the TeX mathematical mark-up then (depending on the requested format) either `dvipng`_ or `dvisvgm`_.
pt_br: O formato da imagem de saída. O padrão é ``'png'``. Deve ser ``'png'`` ou ``'svg'``. A imagem é produzida pela primeira execução de ``latex`` na marcação matemática *TeX* então (dependendo do formato requisitado) ou `dvipng`_ ou `dvisvgm`_.
zh_cn: 输出图像格式。默认值为“png”。它应该是“png”或“svg”。首先对TeX数学标记执行“latex”，然后（取决于请求的格式）执行“dvipng”或“dvisvgm”来生成图像。

source: ``dvipng`` and ``dvisvgm`` both have the ability to collect from LaTeX the "depth" of the rendered math: an inline image should use this "depth" in a ``vertical-align`` style to get correctly aligned with surrounding text.
pt_br: ``dvipng`` e ``dvisvgm`` ambos têm a capacidade de coletar do *LaTeX* a *profundidade* da matemática renderizada: uma imagem inline deve usar essa *profundidade* em um estilo ``vertical-align`` para ficar corretamente alinhado com o texto ao redor.
zh_cn: ``dvipng``和``dvisvgm``都能够从LaTeX中收集渲染数学的“深度”：内联图像应该以“垂直对齐”样式使用此“深度”，以便与周围的文本正确对齐。

source: This mechanism requires the `LaTeX preview package`_ (available as ``preview-latex-style`` on Ubuntu xenial). Therefore, the default for this option is ``False`` but it is strongly recommended to set it to ``True``.
pt_br: Esse mecanismo requer o `LaTeX preview package`_ (disponível como ``preview-latex-style`` no Ubuntu xenial). Portanto, o padrão para essa opção é ``False``, mas é altamente recomendável configurá-la como ``True``.
zh_cn: 此机制需要“LaTeX preview包”（在Ubuntu xenial上作为“preview LaTeX style”提供）。因此，此选项的默认值为“False”，但强烈建议将其设置为“True”。

source: This option can be used with the ``'svg'`` :confval:`imgmath_image_format`.
pt_br: Esta opção pode ser usada com o ``'svg'`` :confval:`imgmath_image_format`.
zh_cn: 此选项可与“svg”一起使用：confval:`imgmath_image_format`。

source: Default: ``True``. If false, do not add the LaTeX code as an "alt" attribute for math images.
pt_br: Padrão ``True``. Se falso, não adicione código LaTeX com um atributo "alt" para imagens math.
zh_cn: 默认值：``True``。如果为false，请不要将LaTeX代码添加为数学图像的“alt”属性。

source: The font size (in ``pt``) of the displayed math. The default value is ``12``. It must be a positive integer.
pt_br: O tamanho do fonte (em ``pt``) para math exibido. O padrão é ``12``. Deve ser um número positivo.
zh_cn: 显示数学的字体大小（以“pt”为单位）。默认值为“12”。它必须是正整数。

source: The command name with which to invoke LaTeX. The default is ``'latex'``; you may need to set this to a full path if ``latex`` is not in the executable search path.
pt_br: O nome do comando com o qual chamamos LaTeX. O padrão é ``'latex'``; pode ser necessário configurar o caminho completo, caso não esteja na variável PATH.
zh_cn: 调用LaTeX的命令名。默认值为“latex”；如果“latex”不在可执行搜索路径中，则可能需要将其设置为完整路径。

source: Since this setting is not portable from system to system, it is normally not useful to set it in ``conf.py``; rather, giving it on the :program:`sphinx-build` command line via the :option:`-D <sphinx-build -D>` option should be preferable, like this::
pt_br: Como essa configuração não é portável de um sistema para outro, não é muito útil configurar no ``conf.py``; em vez disso, use o comando do :program:`sphinx-build` via :option:`-D <sphinx-build -D>` é mais eficaz, como isso::
zh_cn: 由于此设置在系统之间不可移植，因此通常设置它是没有用的``配置文件``；相反，在：program:`sphinxbuild`命令行中通过：option:`-D`选项给出它应该更可取，如下所示：

source: This value should only contain the path to the latex executable, not further arguments; use :confval:`imgmath_latex_args` for that purpose.
pt_br: Esse valor deve conter somente o PATH para o programa LaTeX executável, sem nenhum argumento; usar :confval:`imgmath_latex_args` para esse propósito.
zh_cn: 此值只应包含指向latex可执行文件的路径，而不应包含其他参数；为此，请使用：confval:`imgmath_latex_args'。

source: Some fancy LaTeX mark-up (an example was reported which used TikZ to add various decorations to the equation) require multiple runs of the LaTeX executable. To handle this, set this configuration setting to ``'latexmk'`` (or a full path to it) as this Perl script reliably chooses dynamically how many latex runs are needed.
zh_cn: 一些花哨的LaTeX标记（有一个例子是使用TikZ为等式添加各种装饰）需要多次运行LaTeX可执行文件。要处理此问题，请将此配置设置设置为“latexmk”（或指向它的完整路径），因为此Perl脚本可以可靠地动态选择所需的latex运行次数。

source: Additional arguments to give to latex, as a list. The default is an empty list.
pt_br: Argumentos adicionais passados para latex, como uma lista. O padrão é uma lista vazia.
zh_cn: 提供给latex的其他参数，如列表。默认为空列表。

source: Additional LaTeX code to put into the preamble of the LaTeX files used to translate the math snippets. This is left empty by default. Use it e.g. to add packages which modify the fonts used for math, such as ``'\\usepackage{newtxsf}'`` for sans-serif fonts, or ``'\\usepackage{fouriernc}'`` for serif fonts. Indeed, the default LaTeX math fonts have rather thin glyphs which (in HTML output) often do not match well with the font for text.
pt_br: Código *LaTeX* adicional para colocar no preâmbulo dos arquivos *LaTeX* usados para traduzir os trechos de *math*. Isso é deixado vazio por padrão. Use-o, por exemplo, para adicionar pacotes que modificam as fontes usadas para matemática, como ``'\\usepackage{newtxsf}'`` para fontes ``sans-serif`` ou ``'\\usepackage{fouriernc}'`` para fontes ``serif``. Na verdade, as fontes matemáticas padrão do *LaTeX* têm glifos bastante finos que (na saída *HTML*) geralmente não combinam bem com a fonte do texto.
zh_cn: 附加的LaTeX代码放入用于翻译数学片段的LaTeX文件的序言中。默认情况下为空。例如，添加修改用于数学的字体的包，如sans-serif字体的“\\\usepackage{newtxsf}”，或serif字体的“`\\usepackage{fouriernc}`”。实际上，默认的LaTeX数学字体具有相当薄的字形（在HTML输出中）通常与文本字体不匹配。

source: The command name to invoke ``dvipng``. The default is ``'dvipng'``; you may need to set this to a full path if ``dvipng`` is not in the executable search path. This option is only used when ``imgmath_image_format`` is set to ``'png'``.
pt_br: O nome do comando para invocar ``dvipng``. O padrão é ``'dvipng'``; talvez seja necessário definir isso para um caminho completo se ``dvipng`` não estiver no caminho de pesquisa executável. Esta opção só é usada quando ``imgmath_image_format`` é definido como ``'png'``.
zh_cn: 调用“dvipng”的命令名。默认值为“dvipng”；如果“dvipng”不在可执行搜索路径中，则可能需要将其设置为完整路径。此选项仅在“imgmath_image_format”设置为“png”时使用。

source: Additional arguments to give to dvipng, as a list. The default value is ``['-gamma', '1.5', '-D', '110', '-bg', 'Transparent']`` which makes the image a bit darker and larger then it is by default (this compensates somewhat for the thinness of default LaTeX math fonts), and produces PNGs with a transparent background. This option is used only when ``imgmath_image_format`` is ``'png'``.
pt_br: Argumentos adicionais para dar ao *dvipng*, como uma lista. O valor padrão é ``['-gamma', '1.5', '-D', '110', '-bg', 'Transparent']``, que torna a imagem um pouco mais escura e maior do que é por padrão (isso compensa um pouco a magreza das fontes matemáticas *LaTeX* padrão) e produz *PNGs* com um plano de fundo transparente. Esta opção é usada somente quando ``imgmath_image_format`` é ``'png'``.
zh_cn: 提供给dvipng的其他参数，如列表。默认值为“[”-gamma'、'1.5'、'-D'、'110'、'-bg'、'Transparent']``这会使图像比默认值更暗、更大（这在一定程度上补偿了默认LaTeX数学字体的粗细），并生成具有透明背景的png。此选项仅在“imgmath_image_format”为“png”时使用。

source: The command name to invoke ``dvisvgm``. The default is ``'dvisvgm'``; you may need to set this to a full path if ``dvisvgm`` is not in the executable search path. This option is only used when ``imgmath_image_format`` is ``'svg'``.
pt_br: O nome do comando para invocar ``dvisvgm``. O padrão é ``'dvisvgm'``; talvez seja necessário definir isso para um caminho completo se ``dvisvgm`` não estiver no caminho de pesquisa executável. Esta opção é usada somente quando ``imgmath_image_format`` é ``'svg'``.
zh_cn: 调用“dvisvgm”的命令名。默认值为“dvisvgm”；如果“dvisvgm”不在可执行搜索路径中，则可能需要将其设置为完整路径。此选项仅在“imgmath_image_format”为“svg”时使用。

source: Additional arguments to give to dvisvgm, as a list. The default value is ``['--no-fonts']``, which means that ``dvisvgm`` will render glyphs as path elements (cf the `dvisvgm FAQ`_). This option is used only when ``imgmath_image_format`` is ``'svg'``.
pt_br: Argumentos adicionais para dar ao *dvisvgm*, como uma lista. O valor padrão é ``['--no-fonts']``, o que significa que ``dvisvgm`` irá renderizar os glifos como elementos de caminho (cf o `dvisvgm FAQ`_). Esta opção é usada somente quando ``imgmath_image_format`` é ``'svg'``.
zh_cn: 以列表形式提供给dvisvgm的其他参数。默认值为“[”--无字体']`”，这意味着“dvisvgm”将把glyph呈现为路径元素（参见“dvisvgm FAQ`”）。此选项仅在“imgmath_image_format”为“svg”时使用。

source: :mod:`sphinx.ext.mathjax` -- Render math via JavaScript
pt_br: :mod:`sphinx.ext.mathjax` -- Renderizado via math JavaScript
zh_cn: ：模式：`sphinx.ext.mathjax`--通过JavaScript呈现数学

source: Version 4.0 changes the version of MathJax used to version 3. You may need to override ``mathjax_path`` to ``https://cdn.jsdelivr.net/npm/mathjax@2/MathJax.js?config=TeX-AMS-MML_HTMLorMML`` or update your configuration options for version 3 (see :confval:`mathjax3_config`).
zh_cn: 版本4.0将MathJax的版本更改为版本3。您可能需要重写``mathjax_path`` 来 ``https://cdn.jsdelivr.net/npm/mathjax@2/MathJax.js?config=TeX-AMS-MML_HTMLorMML`` 或更新版本3的配置选项 （参见 :confval:`mathjax3_config`）。

source: This extension puts math as-is into the HTML files. The JavaScript package MathJax_ is then loaded and transforms the LaTeX markup to readable math live in the browser.
pt_br: Essa extensão usa math as-is nos arquivos HTML. O pacote JavaScript MathJax_ é carregado e transforma marcações LaTeX em math lidas na hora no navegador.
zh_cn: 这个扩展将数学原样放入HTML文件中。然后加载JavaScript包MathJax_x，并在浏览器中将LaTeX标记转换为可读的math live。

source: Because MathJax (and the necessary fonts) is very large, it is not included in Sphinx but is set to automatically include it from a third-party site.
pt_br: Como o ``MathJax`` (e as fontes necessárias) é muito grande, ele não é incluído no Sphinx, mas é configurado para incluí-lo automaticamente em um site de terceiros.
zh_cn: 因为MathJax（以及必要的字体）非常大，所以Sphinx中没有包含它，而是设置为从第三方站点自动包含它。

source: You should use the math :rst:dir:`directive <math>` and :rst:role:`role <math>`, not the native MathJax ``$$``, ``\(``, etc.
pt_br: Você deve usar as contas :rst:dir:`directive <math>` e :rst:role:`role <math>`, não as nativas ``MathJax`` ``$$``, ``\(``, etc.
zh_cn: 你应该使用数学：rst:方向：`directive 1`和：rst:角色`（`$jax`，not``jax`，not``本机`。

source: The path to the JavaScript file to include in the HTML files in order to load MathJax.
pt_br: O caminho para arquivo JavaScript incluído no arquivo HTML que chama MathJax.
zh_cn: 要包含在HTML文件中以加载MathJax的JavaScript文件的路径。

source: The default is the ``https://`` URL that loads the JS files from the `jsdelivr`__ Content Delivery Network. See the `MathJax Getting Started page`__ for details. If you want MathJax to be available offline or without including resources from a third-party site, you have to download it and set this value to a different path.
zh_cn: 默认值是从“jsdeliver”内容传递网络加载JS文件的“https://”URL。有关详细信息，请参阅“MathJax入门页”。如果您希望MathJax可以脱机使用，或者不包含来自第三方站点的资源，则必须下载它并将该值设置为其他路径。

source: The path can be absolute or relative; if it is relative, it is relative to the ``_static`` directory of the built docs.
pt_br: O caminho pode ser absoluto ou relativo; se relativo, ele será em relação ao diretório ``_static`` onde foram construidos os documentos.
zh_cn: 路径可以是绝对路径，也可以是相对路径；如果是相对路径，则路径是相对于生成文档的“静态”目录。

source: For example, if you put MathJax into the static path of the Sphinx docs, this value would be ``MathJax/MathJax.js``. If you host more than one Sphinx documentation set on one server, it is advisable to install MathJax in a shared location.
pt_br: Por exemplo, se colocar MathJax no caminho estático dos documentos Sphinx, seu valor pode ser ``MathJax/MathJax.js``. Caso seu host possua mais de um Sphinx definidos em um único servidor, é aconselhável usar um local compartilhado.
zh_cn: 例如，如果将MathJax放入Sphinx文档的静态路径中，则该值将为``MathJax/MathJax.js``. 如果在一台服务器上托管多个Sphinx文档集，建议在共享位置安装MathJax。

source: You can also give a full ``https://`` URL different from the CDN URL.
pt_br: Você também pode fornecer uma URL ``https://`` completa diferente da URL da CDN.
zh_cn: 您还可以提供与CDN URL不同的完整的“https://`”URL。

source: The options to script tag for mathjax. For example, you can set integrity option with following setting::
pt_br: As opções para rotular tag para o ``mathjax``. Por exemplo, você pode definir a opção de integridade com a seguinte configuração::
zh_cn: 为mathjax编写标记脚本的选项。例如，可以使用以下设置设置设置完整性选项：

source: The default is empty (``{}``).
pt_br: O padrão é vazio (``{}``).
zh_cn: 默认值为空（`{}``）。

source: The default is empty (not configured).
pt_br: O padrão é vazio (não configurado).
zh_cn: 默认值为空（未配置）。

source: For example::
pt_br: Por exemplo::
zh_cn: 例如：

source: :mod:`sphinx.ext.jsmath` -- Render math via JavaScript
pt_br: :mod:`sphinx.ext.jsmath` -- Renderiza math via JavaScript
zh_cn: ：模式：`sphinx.ext.jsmath`--通过JavaScript呈现数学

source: This extension works just as the MathJax extension does, but uses the older package jsMath_. It provides this config value:
pt_br: Essa extensão trabalho como a extensão MathJax, mas usa antigo pacote jsMath_. Permite valor de config:
zh_cn: 此插件的工作方式与MathJax扩展相同，但使用旧的jsMath包。它提供以下配置值：

source: The path to the JavaScript file to include in the HTML files in order to load JSMath. There is no default.
pt_br: O caminho do arquivo JavaScript para incluir em arquivos HTML para carregar JSMath. Não há definição por padrão.
zh_cn: 要包含在HTML文件中以加载JSMath的JavaScript文件的路径。没有违约。

source: For example, if you put JSMath into the static path of the Sphinx docs, this value would be ``jsMath/easy/load.js``. If you host more than one Sphinx documentation set on one server, it is advisable to install jsMath in a shared location.
pt_br: Por exemplo, para colocar JSMAth no caminho estático dos documentos Sphinx, esse valor de ser ``jsMath/easy/load.js``. Se em seu host há diversos conjuntos de Documentação Sphinx, é aconselhável instalar jsMath em local compartilhado.
zh_cn: 例如，如果将JSMath放入Sphinx文档的静态路径中，则该值将为``JSMath/easy/加载.js``. 如果在一台服务器上托管多个Sphinx文档集，建议在共享位置安装jsMath。

source: The inline configuration options for mathjax. The value is used as a parameter of ``MathJax.Hub.Config()``. For more information, please read `Using in-line configuration options`_.
pt_br: As opções de configuração em linha para o ``mathjax``. O valor é usado como um parâmetro de ``MathJax.Hub.Config()``. Para mais informações, por favor leia `Using in-line configuration options`_.
