Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/napoleon.po
Languages: pt_br, zh_cn

source: :mod:`sphinx.ext.napoleon` -- Support for NumPy and Google style docstrings
pt_br: :mod:`sphinx.ext.napoleon` -- Suporte para *doctrings* de estilo *NumPy* e *Google*
zh_cn: ：模式：`sphinx.ext.napoleon`——支持NumPy和Google风格的文档字符串

source: Overview
pt_br: Visão Geral
zh_cn: 概述

source: Are you tired of writing docstrings that look like this::
pt_br: Você está cansado de escrever *docstrings* que se parecem com isso::
zh_cn: 你厌倦了写这样的文档字符串:：

source: Much more legible, no?
pt_br: Muito mais legível, não?
zh_cn: 更清晰，不是吗？

source: Napoleon is a :term:`extension` that enables Sphinx to parse both `NumPy`_ and `Google`_ style docstrings - the style recommended by `Khan Academy`_.
pt_br: *Napoleon* é uma :term:`extension` que permite que o *Sphinx* analise as documentações de estilo `NumPy`_ e `Google`_ -- o estilo recomendado por `Khan Academy`_.
zh_cn: Napoleon是一个：term:‘extension’，它使Sphinx能够解析“NumPy”和“Google”风格的docstrings，这是“Khan Academy”推荐的样式。

source: Napoleon is a pre-processor that parses `NumPy`_ and `Google`_ style docstrings and converts them to reStructuredText before Sphinx attempts to parse them. This happens in an intermediate step while Sphinx is processing the documentation, so it doesn't modify any of the docstrings in your actual source code files.
pt_br: *Napoleon* é um pré-processador que analisa *docstrings* de estilo `NumPy`_ e `Google`_ e os converte em *reStructuredText* antes que o *Sphinx* tente analisá-los. Isso acontece em uma etapa intermediária enquanto o *Sphinx* está processando a documentação, portanto, não modifica nenhuma das *docstrings* em seus arquivos de código-fonte reais.
zh_cn: Napoleon是一个预处理器，它可以解析“NumPy”和“Google”风格的docstring，并在Sphinx尝试解析它们之前将它们转换为reStructuredText。这发生在Sphinx处理文档的中间步骤中，因此它不会修改实际源代码文件中的任何文档字符串。

source: Getting Started
pt_br: Iniciando
zh_cn: 快速上手

source: After :doc:`setting up Sphinx </usage/quickstart>` to build your docs, enable napoleon in the Sphinx `conf.py` file::
pt_br: Depois de :doc:`setting up Sphinx </usage/quickstart>` para construir seus documentos, ative *napoleon* no arquivo `conf.py` do Sphinx::
zh_cn: 之后：文档：`setting up Sphinx 1 `要建立你的文档，请在Sphinx中启用拿破仑`conf.py`文件：：

source: Use `sphinx-apidoc` to build your API documentation::
pt_br: Use `sphinx-apidoc` para construir sua documentação da *API*::
zh_cn: 使用“sphinx apidoc”构建API文档：

source: Docstrings
zh_cn: 文档字符串

source: Napoleon interprets every docstring that :mod:`autodoc <sphinx.ext.autodoc>` can find, including docstrings on: ``modules``, ``classes``, ``attributes``, ``methods``, ``functions``, and ``variables``. Inside each docstring, specially formatted `Sections`_ are parsed and converted to reStructuredText.
pt_br: *Napoleon* interpreta todas as *docstrings* que :mod:`autodoc <sphinx.ext.autodoc>` pode encontrar, *incluindo* docstrings em: ``modules``, ``classes``, ``attributes``, ``methods``, ``functions``, e ``variables``. Dentro de cada *docstring*, as seções `formatadas`_ especialmente são analisadas e convertidas em reStructuredText.
zh_cn: 拿破仑解释每个文档字符串: mod:`autodoc<sphinx.ext.autodoc>`可以找到，包括文档字符串: `modules``、`classes```、`attributes`、``methods```、`functions``和`variables``。在每个文档字符串中，经过特殊格式化的“Sections”被解析并转换为restructedText。

source: All standard reStructuredText formatting still works as expected.
pt_br: Toda a formatação padrão do reStructuredText ainda funciona conforme o esperado.
zh_cn: 所有标准的RestructedText格式仍按预期工作。

source: Docstring Sections
pt_br: Seções Docstring
zh_cn: 文档字符串部分

source: All of the following section headers are supported:
pt_br: Todos os cabeçalhos de seção a seguir são suportados:
zh_cn: 支持以下所有节标题：

source: ``Arguments`` *(alias of Parameters)*
pt_br: ``Arguments`` *(alias de Parameters)*
zh_cn: ``Arguments`` *(参数别名)*

source: ``Attention``
zh_cn: ``注意``

source: ``Attributes``
zh_cn: ``属性``

source: ``Caution``
zh_cn: ``小心``

source: ``Danger``
zh_cn: ``危险``

source: ``Error``
zh_cn: ``错误``

source: ``Example``
zh_cn: ``示例``

source: ``Examples``
zh_cn: ``示例``

source: ``Hint``
zh_cn: ``提示``

source: ``Important``
zh_cn: ``重要``

source: ``Keyword Args`` *(alias of Keyword Arguments)*
pt_br: ``Keyword Args`` *(alias de Keyword Arguments)*
zh_cn: ``Keyword Args`` *(参数别名)*

source: ``Keyword Arguments``
zh_cn: ``关键字参数``

source: ``Methods``
zh_cn: ``方法``

source: ``Note``
zh_cn: ``笔记``

source: ``Notes``
zh_cn: ``笔记``

source: ``Other Parameters``
zh_cn: ``其他参数``

source: ``Parameters``
zh_cn: ``参数``

source: ``Return`` *(alias of Returns)*
pt_br: ``Return`` *(alias de Returns)*
zh_cn: ``返回`` *(返回别名)*

source: ``Returns``
zh_cn: ``返回``

source: ``Raise`` *(alias of Raises)*
pt_br: ``Raise`` *(apelido de Raises)*
zh_cn: ``Raise`` *(Raise别名)*

source: ``Raises``
zh_cn: ``提升``

source: ``References``
zh_cn: ``参考``

source: ``See Also``
zh_cn: ``请参阅``

source: ``Tip``
zh_cn: ``贴士``

source: ``Todo``
zh_cn: ``待办``

source: ``Warning``
zh_cn: ``警告``

source: ``Warnings`` *(alias of Warning)*
pt_br: ``Warnings`` *(alias de Warning)*
zh_cn: ``警告`` *(警告别名)*

source: ``Warn`` *(alias of Warns)*
pt_br: ``Warn`` *(apelido de Warns)*
zh_cn: ``Warn`` *(Warns别名)*

source: ``Warns``
zh_cn: ``警告``

source: ``Yield`` *(alias of Yields)*
pt_br: ``Yield`` *(alias de Yields)*
zh_cn: ``产量``*（产量别名）*

source: ``Yields``
zh_cn: ``产量``

source: Google vs NumPy
zh_cn: Google 和 NumPy

source: Napoleon supports two styles of docstrings: `Google`_ and `NumPy`_. The main difference between the two styles is that Google uses indentation to separate sections, whereas NumPy uses underlines.
pt_br: *Napoleon* suporta dois estilos de *docstrings*: `Google`_ e `NumPy`_. A principal diferença entre os dois estilos é que o *Google* usa indentação para separar seções, enquanto o *NumPy* usa *underscores*.
zh_cn: Napoleon支持两种docstring样式：“Google”和“NumPy”。这两种风格的主要区别在于Google使用缩进来分隔部分，而NumPy使用下划线。

source: Google style:
zh_cn: 谷歌的样式：

source: NumPy style:
zh_cn: NumPy的样式：

source: NumPy style tends to require more vertical space, whereas Google style tends to use more horizontal space. Google style tends to be easier to read for short and simple docstrings, whereas NumPy style tends be easier to read for long and in-depth docstrings.
pt_br: O estilo *NumPy* tende a exigir mais espaço vertical, enquanto o estilo do *Google* tende a usar mais espaço horizontal. O estilo do *Google* tende a ser mais fácil de ler para *docstrings* curtas e simples, enquanto o estilo *NumPy* tende a ser mais fácil de ler para *docstrings* longas e detalhadas.
zh_cn: NumPy风格倾向于需要更多的垂直空间，而Google风格倾向于使用更多的水平空间。对于简短的docstring，Google样式更容易阅读，而NumPy样式对于长而深入的docstring更容易阅读。

source: The choice between styles is largely aesthetic, but the two styles should not be mixed. Choose one style for your project and be consistent with it.
pt_br: A escolha entre estilos é em grande parte estética, mas os dois estilos não devem ser misturados. Escolha um estilo para o seu projeto e seja consistente com ele.
zh_cn: 风格之间的选择很大程度上是审美的，但这两种风格不应该混为一谈。为你的项目选择一种风格，并与之保持一致。

source: For complete examples:
pt_br: Para exemplos completos:
zh_cn: 完整示例：

source: Type Annotations
pt_br: Anotações de Tipos
zh_cn: 类型批注

source: Google style with Python 3 type annotations::
pt_br: Estilo do *Google* com anotações do tipo no *Python 3*::
zh_cn: 带有python3类型注释的Google样式：

source: Google style with types in docstrings::
pt_br: Estilo do *Google* com tipos em *docstrings*::
zh_cn: docstrings中类型的Google样式：

source: `Python 2/3 compatible annotations`_ aren't currently supported by Sphinx and won't show up in the docs.
pt_br: `Python 2/3 compatible annotations`_ não são atualmente suportados pelo *Sphinx* e não serão exibidos nos documentos.
zh_cn: `Sphinx目前不支持Python2/3兼容的注释，因此不会出现在文档中。

source: Configuration
pt_br: Configuração
zh_cn: 配置

source: Listed below are all the settings used by napoleon and their default values. These settings can be changed in the Sphinx `conf.py` file. Make sure that "sphinx.ext.napoleon" is enabled in `conf.py`::
pt_br: Abaixo estão listadas todas as configurações usadas por *napoleon* e seus valores padrão. Essas configurações podem ser alteradas no arquivo *Sphinx* `conf.py`. Certifique-se de que ``sphinx.ext.napoleon`` esteja ativado em `conf.py`::
zh_cn: 下面列出了拿破仑使用的所有设置及其默认值。这些设置可以在sphinx中更改`conf.py`文件。确保“sphinx.ext.napoleon“在中启用`conf.py`::

source: True to parse `Google style`_ docstrings. False to disable support for Google style docstrings. *Defaults to True.*
pt_br: ``True`` ao analisar *docstrings* `Google style`_ . ``False`` para desativar o suporte para as *doctrings* de estilo do *Google*. *O padrão é False.*
zh_cn: 若要分析“Google style”docstrings，则为True。False禁用对Google样式docstring的支持。*默认为True*

source: True to parse `NumPy style`_ docstrings. False to disable support for NumPy style docstrings. *Defaults to True.*
pt_br: ``True`` ao analisar *docstrings* `NumPy style`_ . ``False`` para desabilitar o suporte para *docstrings* de estilo *NumPy*. *O padrão é True.*
zh_cn: 若要分析“NumPy-style”docstrings，则为True。False禁用对NumPy样式docstring的支持。*默认为True*

source: True to list ``__init___`` docstrings separately from the class docstring. False to fall back to Sphinx's default behavior, which considers the ``__init___`` docstring as part of the class documentation. *Defaults to False.*
pt_br: ``True`` lista as *docstrings/ ``__init___`` separadamente da classe *docstring*. ``False`` para retornar ao comportamento padrão do *Sphinx*, que considera a *docstring* `` __init___ `` como parte da documentação da classe. *O padrão é False.*
zh_cn: 如果为True，则从类docstring中分别列出“``uUu init_Uu2;`docstring”。False返回到Sphinx的默认行为，该行为将“``uUu init_Uu2;”docstring视为类文档的一部分。*默认为False*

source: **If True**::
zh_cn: **如果为真**::

source: True to include private members (like ``_membername``) with docstrings in the documentation. False to fall back to Sphinx's default behavior. *Defaults to False.*
pt_br: ``True`` inclui membros privados (como ``_membername``) com *docstrings* na documentação. ``False`` para voltar ao comportamento padrão do Sphinx. *O padrão é False.*
zh_cn: 如果为True，则在文档中使用docstrings包含私有成员（如“`u membername```”）。False返回到Sphinx的默认行为。*默认为False*

source: True to include special members (like ``__membername__``) with docstrings in the documentation. False to fall back to Sphinx's default behavior. *Defaults to True.*
pt_br: ``True`` inclui membros especiais (como ``__membername__``) com *docstrings* na documentação. ``False`` para voltar ao comportamento padrão do Sphinx. *O padrão é True.*
zh_cn: 如果为True，则在文档中包含带有DocString的特殊成员（如“``uUu membername````”）的值。False返回到Sphinx的默认行为。*默认为True*

source: True to use the ``.. admonition::`` directive for the **Example** and **Examples** sections. False to use the ``.. rubric::`` directive instead. One may look better than the other depending on what HTML theme is used. *Defaults to False.*
pt_br: ``True`` usa a diretiva ``.. admonition::`` para as seções **Example** e **Examples**. ``False`` para usar a diretiva ``.. rubric::``. Um pode parecer melhor do que o outro, dependendo de qual tema *HTML* é usado. *O padrão é False.*
zh_cn: 如果要使用''. admonition::：``用于**示例**和**示例**部分的指令。使用`..改为：``指令。一个可能比另一个更好，这取决于使用了什么HTML主题。*默认为False*

source: This `NumPy style`_ snippet will be converted as follows::
pt_br: Este fragmento `NumPy style`_ será convertido da seguinte forma::
zh_cn: 此“NumPy-style”代码段将按如下方式转换：

source: **If False**::
zh_cn: **如果为假**::

source: True to use the ``.. admonition::`` directive for **Notes** sections. False to use the ``.. rubric::`` directive instead. *Defaults to False.*
pt_br: ``True`` utiliza a diretiva ``.. admonition::`` para as seções **Notes**. ``False`` para usar a diretiva ``.. rubric::``. *O padrão é False.*
zh_cn: 如果要使用''.. admonition:：``针对**注释**部分的指令。使用`..改为：``指令。*默认为False*

source: The singular **Note** section will always be converted to a ``.. note::`` directive.
pt_br: A seção singular **Note** sempre será convertida em uma diretiva ``.. note::``.
zh_cn: 单数的**注释**部分将始终转换为`..注意：``指令。

source: :attr:`napoleon_use_admonition_for_examples`
zh_cn: ：attr:`napoleon\u使用“警告”作为示例`

source: True to use the ``.. admonition::`` directive for **References** sections. False to use the ``.. rubric::`` directive instead. *Defaults to False.*
pt_br: ``True`` utiliza a diretiva ``.. admonition::`` para as seções **References**. ``False`` para usar a diretiva ``.. rubric::``. *O padrão é False.*
zh_cn: 如果要使用''..警告：``针对**引用**部分的指令。使用`..改为：``指令。*默认为False*

source: True to use the ``:ivar:`` role for instance variables. False to use the ``.. attribute::`` directive instead. *Defaults to False.*
pt_br: ``True`` utiliza a função ``:ivar:`` para variáveis de instância. ``False`` para usar a diretiva ``.. attribute::``. *O padrão é False.*
zh_cn: 如果为True，则将“%ivar:`”角色用于实例变量。使用`。。改为属性：：``指令。*默认为False*

source: True to use a ``:param:`` role for each function parameter. False to use a single ``:parameters:`` role for all the parameters. *Defaults to True.*
pt_br: ``True`` utiliza uma função ``:param:`` para cada parâmetro de função. ``False`` para usar uma única função ``:parameters:`` para todos os parâmetros. *O padrão é True.*
zh_cn: 如果为True，则为每个函数参数使用一个“`:param:`”角色。如果要对所有参数使用单个“参数：`”角色，则返回False。*默认为True*

source: True to use a ``:keyword:`` role for each function keyword argument. False to use a single ``:keyword arguments:`` role for all the keywords. *Defaults to True.*
pt_br: ``True`` para utilizar uma função ``:keyword:`` para cada argumento de palavra-chave de função. ``False`` para usar uma única função ``:keyword arguments:`` para todas as palavras-chave. *O padrão é True.*
zh_cn: 如果为True，则为每个函数关键字参数使用一个“`:keyword:`”角色。如果要对所有关键字使用单个“`:keyword参数：``角色”，则返回False。*默认为True*

source: This behaves similarly to :attr:`napoleon_use_param`. Note unlike docutils, ``:keyword:`` and ``:param:`` will not be treated the same way - there will be a separate "Keyword Arguments" section, rendered in the same fashion as "Parameters" section (type links created if possible)
zh_cn: 其行为类似于：attr:`napoleon_use_param`。注意与docutils不同的是，`：keyword:``和`:param:``的处理方式不同-将有一个单独的“keyword Arguments”部分，以与“Parameters”部分相同的方式呈现（如果可能，请创建类型链接）

source: True to use the ``:rtype:`` role for the return type. False to output the return type inline with the description. *Defaults to True.*
pt_br: ``True`` para utilizar a função ``:rtype:`` para o tipo de retorno. ``False`` para gerar o tipo de retorno em linha com a descrição. *Defaults to True.*
zh_cn: 如果为True，则对返回类型使用“`:rtype:`”角色。False以输出与描述内联的返回类型。*默认为True*

source: Do preprocess the Google style docstrings also.
pt_br: Pré-processa também as docstrings do estilo do Google.
zh_cn: 对Google风格的docstrings也进行预处理。

source: A mapping to translate type names to other names or references. Works only when ``napoleon_use_param = True``. *Defaults to None.*
pt_br: Um mapeamento para traduzir nomes de tipo para outros nomes ou referências. Funciona apenas quando ``napoleon_use_param = True``. *O padrão é None.*
zh_cn: 将类型名转换为其他名称或引用的映射。只有在“napoleon\u use_param=True”时才有效。*默认为“无”*

source: With::
pt_br: Com::
zh_cn: 和：：

source: This `NumPy style`_ snippet::
pt_br: Este trecho de `estilo NumPy`_::
zh_cn: 此“NumPy样式”片段：

source: becomes::
pt_br: se torna::
zh_cn: 变为：：

source: Add a list of custom sections to include, expanding the list of parsed sections. *Defaults to None.*
pt_br: Adiciona uma lista de seções personalizadas a serem incluídas, expandindo a lista de seções analisadas. *O padrão é None.*
zh_cn: 添加一个要包括的自定义章节列表，扩大解析的章节列表。*默认为None*。

source: The entries can either be strings or tuples, depending on the intention:
pt_br: As entradas podem ser strings ou tuplas, dependendo da intenção:
zh_cn: 这些条目既可以是字符串，也可以是元组，这取决于意图：

source: To create a custom "generic" section, just pass a string.
pt_br: Para criar uma seção "genérica" personalizada, basta passar uma string.
zh_cn: 要创建一个自定义的"generic"章节，只需传递一个字符串。

source: To create an alias for an existing section, pass a tuple containing the alias name and the original, in that order.
pt_br: Para criar um alias para uma seção existente, passe uma tupla contendo o nome do alias e o original, nessa ordem.
zh_cn: 要为一个现有的章节创建一个别名，请传递一个包含别名和原始名称的元组，按顺序排列。

source: To create a custom section that displays like the parameters or returns section, pass a tuple containing the custom section name and a string value, "params_style" or "returns_style".
pt_br: Para criar uma seção personalizada que seja exibida como a seção de parâmetros ou de retornos, passe uma tupla contendo o nome da seção personalizada e um valor de string, "params_style" ou "returns_style".
zh_cn: 要创建一个像参数或返回部分那样显示的自定义章节，请传递一个元组包含自定义章节名称和一个字符串值，"params_style" 或 "returns_style"。

source: If an entry is just a string, it is interpreted as a header for a generic section. If the entry is a tuple/list/indexed container, the first entry is the name of the section, the second is the section key to emulate. If the second entry value is "params_style" or "returns_style", the custom section will be displayed like the parameters section or returns section.
pt_br: Se uma entrada for apenas uma string, ela será interpretada como um cabeçalho para uma seção genérica. Se a entrada for um contêiner de tupla/lista/indexado, a primeira entrada será o nome da seção, a segunda será a chave de seção a ser emulada. Se o segundo valor de entrada for "params_style" ou "returns_style", a seção personalizada será exibida como a seção de parâmetros ou a seção de retornos.
zh_cn: 如果一个条目只是一个字符串，它将被解释为一个通用节的头。如果条目是一个元组/列表/索引容器，第一个条目是章节的名称，第二个是要模仿的章节键。如果第二个条目的值是 "params_style" 或 "returns_style"，自定义节将像参数部分或返回部分那样显示。

source: Support ``params_style`` and ``returns_style``
pt_br: Suporte a ``params_style`` a ``returns_style``
zh_cn: 支持 ``params_style``和``returns_style``

source: `reStructuredText`_ is great, but it creates visually dense, hard to read :pep:`docstrings <287>`. Compare the jumble above to the same thing rewritten according to the `Google Python Style Guide`_::
pt_br: `reStructuredText`_ é ótimo, mas cria visualmente denso, difícil de ler :pep:`docstrings <287>`. Compare a confusão acima com a mesma coisa reescrita de acordo com o `Google Python Style Guide`_::

source: ``Args`` *(alias of Parameters)*
pt_br: ``Args`` *(alias de Parameters)*

source: :pep:`484` introduced a standard way to express types in Python code. This is an alternative to expressing types directly in docstrings. One benefit of expressing types according to :pep:`484` is that type checkers and IDEs can take advantage of them for static code analysis. :pep:`484` was then extended by :pep:`526` which introduced a similar way to annotate variables (and attributes).
pt_br: :pep:`484` introduziu uma maneira padrão de expressar tipos no código Python. Esta é uma alternativa para expressar tipos diretamente em docstrings. Um benefício de expressar tipos de acordo com :pep:`484` é que verificadores de tipos e IDEs podem aproveitá-los para análise de código estático. :pep:`484` foi então estendido por :pep:`526` que introduziu uma maneira semelhante de anotar variáveis (e atributos).

source: True to convert the type definitions in the docstrings as references. Defaults to *False*.
pt_br: True para converter as definições de tipo nas docstrings como referências. O padrão é *False*.

source: True to allow using :pep:`526` attributes annotations in classes. If an attribute is documented in the docstring without a type and has an annotation in the class body, that type is used.
pt_br: True para permitir o uso de anotações de atributos :pep:`526` nas classes. Se um atributo estiver documentado na docstring sem um tipo e tiver uma anotação no corpo da classe, esse tipo será usado.
