Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/todo.po
Languages: ja, pt_br, zh_cn

source: :mod:`sphinx.ext.todo` -- Support for todo items
ja: :mod:`sphinx.ext.todo` -- Todoアイテムのサポート
pt_br: :mod:`sphinx.ext.todo` -- Suporta itens todo
zh_cn: ：模式：`sphinx.ext.todo`--支持todo项

source: There are two additional directives when using this extension:
ja: この拡張を使用すると、以下の二つのディレクティブが追加されます:
pt_br: Existem duas diretivas adicionais quando usamos essa extensão:
zh_cn: 使用此插件时有两个附加指令：

source: Use this directive like, for example, :rst:dir:`note`.
ja: このディレクティブは :rst:dir:`note` と同じように使用できます。
pt_br: Use essa diretivo, como por exemplo, :rst:dir:`note`.
zh_cn: 使用以下指令，例如：rst:方向：`注意'。

source: It will only show up in the output if :confval:`todo_include_todos` is ``True``.
ja: このディレクティブの内容は :confval:`todo_include_todos` が ``True`` の場合だけ表示されます。
pt_br: Somente será exibida saída se :confval:`todo_include_todos` is ``Verdadeiro``.
zh_cn: 只有当：confval:`todo_include_todos`为`True``时，它才会显示在输出中。

source: This directive supports an ``class`` option that determines the class attribute for HTML output. If not given, the class defaults to ``admonition-todo``.
ja: このディレクティブはHTML中のclass属性を指定するための``class``オプションをサポートします。指定しない場合、``admonition-todo``が適用されます。
pt_br: Essa diretiva suporta uma opção ``class`` que determina a classe dos atributos para saída HTML. Se não informado, a classe padrão será ``admonition-todo``.
zh_cn: 此指令支持用于确定HTML输出的class属性的“class”选项。如果未给定，则该类默认为“adminion todo”。

source: This directive is replaced by a list of all todo directives in the whole documentation, if :confval:`todo_include_todos` is ``True``.
ja: このディレクティブは、全ドキュメントのすべてのtodoディレクティブを含むリストで置換されます。 :confval:`todo_include_todos` が ``True`` になったときだけ表示されます。
pt_br: Essa diretiva é substituída por uma lista de todas as diretivas em toda a documentação, se :confval:`todo_include_todos` for ``True``.
zh_cn: 如果：confval:`todo_include_todos`为'`True``，则此指令将替换为整个文档中所有todo指令的列表。

source: These can be configured as seen below.
ja: ディレクティブの動作は設定で変更できます。
pt_br: Estes podem ser configurados como visto abaixo.
zh_cn: 这些配置如下所示。

source: Configuration
ja: 設定
pt_br: Configuração
zh_cn: 配置

source: If this is ``True``, :rst:dir:`todo` and :rst:dir:`todolist` produce output, else they produce nothing. The default is ``False``.
ja: もしもこの設定値が\ ``True``\ に設定されると、\ :rst:dir:`todo`\ と\ :rst:dir:`todolist`\ のディレクティブが出力を出すようになります。\ ``False``\ が設定されると何も出力されなくなります。デフォルトは\ ``False``\ です。
pt_br: Se for ``True``, :rst:dir:`todo` e :rst:dir:`todolist` produz saída, de outra maneira não produz nada. O padrão é ``False``.
zh_cn: 如果这是“真的”：rst:方向：`todo`和：rst:方向：`todolist'产生输出，否则它们什么也不产生。默认值为“False”。

source: If this is ``True``, :rst:dir:`todo` emits a warning for each TODO entries. The default is ``False``.
ja: この設定値が ``True`` に設定されると、 :rst:dir:`todo` は各TODOエントリーに警告を出します。デフォルトは ``False`` です。
pt_br: Se for ``True``, :rst:dir:`todo` emite um alerta para cada entrada TODO. O padrão é ``False``.
zh_cn: 如果这是“真的”：rst:方向：`todo`为每个todo项发出警告。默认值为“False”。

source: If this is ``True``, :rst:dir:`todolist` produce output without file path and line, The default is ``False``.
ja: この設定値が ``True`` に設定されると、 :rst:dir:`todolist` はファイルパスと行を含めずに出力を出します。デフォルトは ``False`` です。
pt_br: Se for ``True``, :rst:dir:`todolist` produz saída sem caminho do arquivo e linha. O padrão é ``False``.
zh_cn: 如果这是“真的”：rst:方向：`todolist`生成不带文件路径和行的输出，默认为“False”。

source: autodoc provides the following an additional event:
ja: autodoc では以下の追加イベントが提供されます:
pt_br: autodoc providência o seguinte evendo adicional:
zh_cn: autodoc提供以下附加事件：

source: Emitted when a todo is defined. *node* is the defined ``sphinx.ext.todo.todo_node`` node.
ja: todoが定義されたら発生します。 *node* は ``sphinx.ext.todo.todo_node`` です。
pt_br: Emitir quando um todo é definido. *node* é definido node ``sphinx.ext.todo.todo_node``.
zh_cn: 定义todo时发出。*节点*是定义的``sphinx.ext.todo.todo_node``节点。
