Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/extensions/viewcode.po
Languages: pt_br, zh_cn

source: :mod:`sphinx.ext.viewcode` -- Add links to highlighted source code
pt_br: :mod:`sphinx.ext.viewcode` -- Adiciona links ao código destacado
zh_cn: ：模式：`sphinx.ext.viewcode`--添加指向突出显示的源代码的链接

source: This extension looks at your Python object descriptions (``.. class::``, ``.. function::`` etc.) and tries to find the source files where the objects are contained. When found, a separate HTML page will be output for each module with a highlighted version of the source code, and a link will be added to all object descriptions that leads to the source code of the described object. A link back from the source to the description will also be inserted.
pt_br: Essa extensão exibe nas descrições do Objeto Python (``.. class::``, ``.. function::`` etc.) e tenta encontrar o arquivo fonte onde o objeto está contido. Quando encontrado, uma página separada HTML é criada para cada módulo com versão destacada no código fonte, e um link será adicionado em todas as descrições que levam ao código fonte do objeto descrito. Um link de retorno do fonte para a descrição também é inserido.
zh_cn: 这个扩展查看您的Python对象描述（``。。类：```，``。。函数：``etc.）并尝试查找包含对象的源文件。找到后，将为每个模块输出一个单独的HTML页面，其中突出显示源代码版本，并将向所有对象描述添加一个链接，该链接指向所描述对象的源代码。还将插入从源到描述的链接。

source: Basically, ``viewcode`` extension will import the modules being linked to. If any modules have side effects on import, these will be executed when ``sphinx-build`` is run.
pt_br: Basicamente, a extensão ``viewcode`` importará os módulos que estão sendo vinculados. Se algum módulo tiver efeitos colaterais na importação, eles serão executados quando o ``sphinx-build`` for executado.
zh_cn: 基本上，`viewcode`扩展将导入链接到的模块。如果任何模块对导入有副作用，则在运行“sphinx build”时将执行这些副作用。

source: If you document scripts (as opposed to library modules), make sure their main routine is protected by a ``if __name__ == '__main__'`` condition.
pt_br: Se os scripts do seu documento, (diferentemente de módulos de biblioteca), certificar-se que suas rotinas main estejam protegidas por um ``if __name__ == '__main__'`` condição.
zh_cn: 如果你要引入脚本（而不是库模块），确保主程序 main 有这个条件保护着：``if __name__ == '__main__'``。

source: In addition, if you don't want to import the modules by ``viewcode``, you can tell the location of the location of source code to ``viewcode`` using the :event:`viewcode-find-source` event.
pt_br: Além disso, se você não quiser importar os módulos por ``viewcode``, poderá informar a localização do local do código-fonte para ``viewcode`` usando o evento :event:`viewcode-find-source`.
zh_cn: 另外，如果不想通过“viewcode”导入模块，可以使用：event:`viewcode find source`事件将源代码的位置告知“viewcode”。

source: If :confval:`viewcode_follow_imported_members` is enabled, you will also need to resolve imported attributes using the :event:`viewcode-follow-imported` event.
pt_br: Se :confval:`viewcode_follow_imported_members` estiver ativada, você também precisará resolver os atributos importados usando o evento :event:`viewcode-follow-imported`.
zh_cn: 如果启用：confval:`viewcode_follow_imported_members'，则还需要使用：event:`viewcode follow imported`事件解析导入的属性。

source: This extension works only on HTML related builders like ``html``, ``applehelp``, ``devhelp``, ``htmlhelp``, ``qthelp`` and so on except ``singlehtml``. By default ``epub`` builder doesn't support this extension (see :confval:`viewcode_enable_epub`).
pt_br: A extensão funciona somente com construtores HTML e construtores como ``html``, ``applehelp``, ``devhelp``, ``htmlhelp``, ``qthelp`` e assim por diante, exceto ``singlehtml``. Através do padrão ``epub`` montador não suporta essa extensão (ver :confval:`viewcode_enable_epub`).
zh_cn: 此插件仅适用于与HTML相关的生成器，如“HTML”、“applehelp”、“devhelp”、“htmlhelp”、“qthelp”等等，但“singlehtml”除外。默认情况下，请参阅`epub`不支持`epu``扩展名。

source: Configuration
pt_br: Configuração
zh_cn: 配置

source: If this is ``True``, viewcode extension will emit :event:`viewcode-follow-imported` event to resolve the name of the module by other extensions. The default is ``True``.
pt_br: Se isso for ``True``, a extensão *viewcode* emitirá um evento :event:`viewcode-follow-imported` para resolver o nome do módulo por outras extensões. O padrão é ``True``.
zh_cn: 如果为“True”，则viewcode插件将发出：event:`viewcode follow imported`事件，通过其他插件解析模块的名称。默认值为“True”。

source: Renamed from ``viewcode_import`` to ``viewcode_follow_imported_members``.
pt_br: Renomeado de ``viewcode_import`` para ``viewcode_follow_imported_members``.
zh_cn: 已从“viewcode_import”重命名为“viewcode”follow“imported”members`。

source: If this is ``True``, viewcode extension is also enabled even if you use epub builders. This extension generates pages outside toctree, but this is not preferred as epub format.
pt_br: Se esse valor for ``Verdadeiro``, a extensão viewcode estará habilitada para usar com construtores epub. Essa extensão gera páginas fora de toctree, mas não é o formato preferencial do epub.
zh_cn: 如果为“True”，则即使使用epub生成器，也会启用viewcode扩展。此扩展在toctree之外生成页面，但这不是epub格式的首选。

source: Until 1.4.x, this extension is always enabled. If you want to generate epub as same as 1.4.x, you should set ``True``, but epub format checker's score becomes worse.
pt_br: Até 1.4.x, essa extensão sempre estava habilitada. Caso desejar gerar epub como na 1.4.x, pode habilitar ``Verdadeiro``, mas os verificadores formato epub serão degradados.
zh_cn: 在1.4.x之前，此插件始终处于启用状态。如果你想生成和1.4.x一样的epub，你应该设置True，但是epub格式检查器的分数会变差。

source: The default is ``False``.
pt_br: O padrão é ``False``.
zh_cn: 默认为“False”。

source: Not all epub readers support pages generated by viewcode extension. These readers ignore links to pages are not under toctree.
pt_br: Nem todas páginas de leitores epub são suportadas, através do código gerado por essa extensão. Esses leitores ignoram páginas que não estão sob toctree.
zh_cn: 并非所有epub阅读器都支持viewcode插件生成的页面。这些读者会忽略指向不在目录树下的页面的链接。

source: Some reader's rendering result are corrupted and `epubcheck <https://github.com/IDPF/epubcheck>`_'s score becomes worse even if the reader supports.
pt_br: Alguns leitores renderizam resultados corrompidos e `epubcheck <https://github.com/IDPF/epubcheck>`_ rankeia pior mesmo quando suportados.
zh_cn: 某些读取器的呈现结果已损坏，并且“epubcheck”<https://github.com/IDPF/epubcheck>`_即使读者支持，他的分数也会变得更糟。

source: Find the source code for a module. An event handler for this event should return a tuple of the source code itself and a dictionary of tags. The dictionary maps the name of a class, function, attribute, etc to a tuple of its type, the start line number, and the end line number. The type should be one of "class", "def", or "other".
pt_br: Encontre o código fonte para um módulo. Um manipulador de eventos para este evento deve retornar uma tupla do próprio código-fonte e um dicionário de tags. O dicionário mapeia o nome de uma classe, função, atributo, etc, para uma tupla de seu tipo, o número da linha inicial e o número da linha final. O tipo deve ser ``class``, ``def`` ou ``other``.
zh_cn: 查找模块的源代码。此事件的事件处理程序应返回源代码本身的元组和标记字典。字典将类、函数、属性等的名称映射到其类型、起始行号和结束行号的元组。类型应为“class”、“def”或“other”之一。

source: Parameters
pt_br: Parâmetros
zh_cn: 参数

source: The Sphinx application object.
pt_br: O objeto do aplicativo ``Sphinx``.
zh_cn: Sphinx应用程序对象。

source: The name of the module to find source code for.
pt_br: O nome do módulo para encontrar o código fonte para.
zh_cn: 要查找其源代码的模块的名称。

source: Find the name of the original module for an attribute.
pt_br: Encontre o nome do módulo original para um atributo.
zh_cn: 查找属性的原始模块的名称。

source: The name of the module that the attribute belongs to.
pt_br: O nome do módulo ao qual o atributo pertence.
zh_cn: 属性所属模块的名称。

source: The name of the member to follow.
pt_br: O nome do membro a seguir.
zh_cn: 要跟随的成员的名称。
