Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/domains/c.po
Languages: pt_br

source: The C Domain
pt_br: O domínio C

source: The C domain (name **c**) is suited for documentation of C API.
pt_br: O domínio C (nome **c**) é adequado para documentação de API C.

source: Describes a C struct member or variable. Example signature::
pt_br: Descreve uma variável ou um membro de struct C. Exemplo de assinatura::

source: The difference between the two directives is only cosmetic.
pt_br: A diferença entre as duas diretivas é apenas cosmética.

source: Describes a C function. The signature should be given as in C, e.g.::
pt_br: Descreve uma função C. A assinatura deve ser dada como em C, por exemplo::

source: Note that you don't have to backslash-escape asterisks in the signature, as it is not parsed by the reStructuredText inliner.
pt_br: Observe que você não precisa fazer a barra invertida para escapar asteriscos na assinatura, pois ela não é analisada pelo reStructuredText embutido.

source: In the description of a function you can use the following info fields (see also :ref:`info-field-lists`).
pt_br: Na descrição de uma função você pode usar os seguintes campos de informação (veja também :ref:`info-field-lists`).

source: ``param``, ``parameter``, ``arg``, ``argument``, Description of a parameter.
pt_br: ``param``, ``parameter``, ``arg``, ``argument``: Descrição de um parâmetro.

source: ``type``: Type of a parameter, written as if passed to the :rst:role:`c:expr` role.
pt_br: ``type``: Tipo de parâmetro, escrito como se fosse passado para o papel :rst:role:`c:expr`.

source: ``returns``, ``return``: Description of the return value.
pt_br: ``returns``, ``return``: Descrição do valor de retorno.

source: ``rtype``: Return type, written as if passed to the :rst:role:`c:expr` role.
pt_br: ``rtype``: Tipo de retorno, escrito como se fosse passado para o papel :rst:role:`c:expr`.

source: ``retval``, ``retvals``: An alternative to ``returns`` for describing the result of the function.
pt_br: ``retval``, ``retvals``: Uma alternativa a ``returns`` para descrever o resultado da função.

source: The ``retval`` field type.
pt_br: O tipo de campo ``retval``.

source: For example::
pt_br: Por exemplo::

source: which renders as
pt_br: que é renderizado como

source: Ensures that the function's parameters will be emitted on a single logical line, overriding :confval:`c_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os parâmetros da função serão emitidos em uma única linha lógica, substituindo :confval:`c_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Describes a C macro, i.e., a C-language ``#define``, without the replacement text.
pt_br: Descreve uma macro C, ou seja, uma ``#define`` da linguagem C, sem o texto de substituição.

source: In the description of a macro you can use the same info fields as for the :rst:dir:`c:function` directive.
pt_br: Na descrição de uma macro você pode usar os mesmos campos de informação da diretiva :rst:dir:`c:function`.

source: The function style variant.
pt_br: A variante de estilo de função.

source: Ensures that the macro's parameters will be emitted on a single logical line, overriding :confval:`c_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os parâmetros da macro serão emitidos em uma única linha lógica, substituindo :confval:`c_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Describes a C struct.
pt_br: Descreve um struct de C.

source: Describes a C union.
pt_br: Descreve uma union de C.

source: Describes a C enum.
pt_br: Descreve um enum de C.

source: Describes a C enumerator.
pt_br: Descreve um enumerador de C.

source: Describes a C type, either as a typedef, or the alias for an unspecified type.
pt_br: Descreve um tipo C, como typedef ou o alias de um tipo não especificado.

source: Cross-referencing C constructs
pt_br: Referência cruzadas a construções C

source: The following roles create cross-references to C-language constructs if they are defined in the documentation:
pt_br: Os papéis a seguir criam referências cruzadas para construções da linguagem C se forem definidas na documentação:

source: Reference a C declaration, as defined above. Note that :rst:role:`c:member`, :rst:role:`c:data`, and :rst:role:`c:var` are equivalent.
pt_br: Faz referência a uma declaração C, conforme definido acima. Observe que :rst:role:`c:member`, :rst:role:`c:data` e :rst:role:`c:var` são equivalentes.

source: The var, struct, union, enum, and enumerator roles.
pt_br: Os papéis de var, struct, união, enum e enumerador.

source: Anonymous Entities
pt_br: Entidades anônimas

source: C supports anonymous structs, enums, and unions. For the sake of documentation they must be given some name that starts with ``@``, e.g., ``@42`` or ``@data``. These names can also be used in cross-references, though nested symbols will be found even when omitted. The ``@...`` name will always be rendered as **[anonymous]** (possibly as a link).
pt_br: C oferece uniões, enums e structs anônimos. Para fins de documentação, eles devem receber algum nome que comece com ``@``, por exemplo, ``@42`` ou ``@data``. Esses nomes também podem ser usados ​​em referências cruzadas, embora símbolos aninhados sejam encontrados mesmo quando omitidos. O nome ``@...`` sempre será renderizado como **[anonymous]** (possivelmente como um link).

source: Example::
pt_br: Exemplo::

source: This will be rendered as:
pt_br: Isso será renderizado como:

source: Explicit ref: :c:var:`Data.@data.a`. Short-hand ref: :c:var:`Data.a`.
pt_br: Referência explícita: :c:var:`Data.@data.a`. Referência abreviada: :c:var:`Data.a`.

source: Aliasing Declarations
pt_br: Fazendo alias de declarações

source: Sometimes it may be helpful list declarations elsewhere than their main documentation, e.g., when creating a synopsis of an interface. The following directive can be used for this purpose.
pt_br: Às vezes, declarações de lista podem ser úteis em outros lugares além da documentação principal, por exemplo, ao criar uma sinopse de uma interface. A seguinte diretiva pode ser usada para esse propósito.

source: Insert one or more alias declarations. Each entity can be specified as they can in the :rst:role:`c:any` role.
pt_br: Insere uma ou mais declarações de alias. Cada entidade pode ser especificada como pode na função :rst:role:`c:any`.

source: becomes
pt_br: se torna

source: Options
pt_br: Opções

source: Insert nested declarations as well, up to the total depth given. Use 0 for infinite depth and 1 for just the mentioned declaration. Defaults to 1.
pt_br: Insere também declarações aninhadas, até a profundidade total fornecida. Use 0 para profundidade infinita e 1 apenas para a declaração mencionada. O padrão é 1.

source: Skip the mentioned declarations and only render nested declarations. Requires ``maxdepth`` either 0 or at least 2.
pt_br: Ignora as declarações mencionadas e renderiza apenas declarações aninhadas. Requer ``maxprofundidade`` 0 ou pelo menos 2.

source: Inline Expressions and Types
pt_br: Tipos e expressões em lniha

source: Insert a C expression or type either as inline code (``cpp:expr``) or inline text (``cpp:texpr``). For example::
pt_br: Insere uma expressão C ou digite como código embutido (``cpp:expr``) ou texto embutido (``cpp:texpr``). Por exemplo::

source: will be rendered as follows:
pt_br: será renderizado da seguinte maneira:

source: An expression: :c:expr:`a * f(a)` (or as text: :c:texpr:`a * f(a)`).
pt_br: Uma expressão: :c:expr:`a * f(a)` (ou como texto: :c:texpr:`a * f(a)`).

source: A type: :c:expr:`const Data*` (or as text :c:texpr:`const Data*`).
pt_br: Um tipo: :c:expr:`const Data*` (ou como texto :c:texpr:`const Data*`).

source: Namespacing
pt_br: Usando espaços de nomes

source: The C language it self does not support namespacing, but it can sometimes be useful to emulate it in documentation, e.g., to show alternate declarations. The feature may also be used to document members of structs/unions/enums separate from their parent declaration.
pt_br: A linguagem C em si não oferece suporte o uso de espaço de nomes, mas às vezes pode ser útil emulá-lo na documentação, por exemplo, para mostrar declarações alternativas. O recurso também pode ser usado para documentar membros de structs/uniões/enums separados de sua declaração mãe.

source: The current scope can be changed using three namespace directives. They manage a stack declarations where ``c:namespace`` resets the stack and changes a given scope.
pt_br: O escopo atual pode ser alterado usando três diretivas de espaço de nomes. Eles gerenciam declarações de pilha onde ``c:namespace`` redefine a pilha e altera um determinado escopo.

source: The ``c:namespace-push`` directive changes the scope to a given inner scope of the current one.
pt_br: A diretiva ``c:namespace-push`` altera o escopo para um determinado escopo interno do atual.

source: The ``c:namespace-pop`` directive undoes the most recent ``c:namespace-push`` directive.
pt_br: A diretiva ``c:namespace-pop`` desfaz a diretiva ``c:namespace-push`` mais recente.

source: Changes the current scope for the subsequent objects to the given scope, and resets the namespace directive stack. Note that nested scopes can be specified by separating with a dot, e.g.::
pt_br: Altera o escopo atual dos objetos subsequentes para o escopo especificado e redefine a pilha de diretivas de espaço de nomes. Observe que os escopos aninhados podem ser especificados separando-os com um ponto, por exemplo::

source: All subsequent objects will be defined as if their name were declared with the scope prepended. The subsequent cross-references will be searched for starting in the current scope.
pt_br: Todos os objetos subsequentes serão definidos como se seus nomes tivessem sido declarados com o escopo anexado. As referências cruzadas subsequentes serão pesquisadas a partir do escopo atual.

source: Using ``NULL`` or ``0`` as the scope will change to global scope.
pt_br: Usar ``NULL`` ou ``0`` como escopo mudará para escopo global.

source: Change the scope relatively to the current scope. For example, after::
pt_br: Altera o escopo relativamente ao escopo atual. Por exemplo, depois de::

source: the current scope will be ``A.B.C.D``.
pt_br: o escopo atual será ``A.B.C.D``.

source: Undo the previous ``c:namespace-push`` directive (*not* just pop a scope). For example, after::
pt_br: Desfaz a diretiva ``c:namespace-push`` anterior (*não* apenas abre um escopo). Por exemplo, depois de::

source: the current scope will be ``A.B`` (*not* ``A.B.C``).
pt_br: o escopo atual será ``A.B`` (*não* ``A.B.C``).

source: If no previous ``c:namespace-push`` directive has been used, but only a ``c:namespace`` directive, then the current scope will be reset to global scope. That is, ``.. c:namespace:: A.B`` is equivalent to::
pt_br: Se nenhuma diretiva ``c:namespace-push`` anterior tiver sido usada, mas apenas uma diretiva ``c:namespace``, então o escopo atual será redefinido para o escopo global. Ou seja, ``.. c:namespace:: A.B`` é equivalente a::

source: Configuration Variables
pt_br: Variáveis de configuração

source: See :ref:`c-config`.
pt_br: Veja :ref:`c-config`.
