Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/domains/cpp.po
Languages: pt_br

source: The C++ Domain
pt_br: O domínio C++

source: The C++ domain (name **cpp**) supports documenting C++ projects.
pt_br: O domínio C++ (nome **cpp**) oferece suporte a documentar projetos C++.

source: Directives for Declaring Entities
pt_br: Diretivas para declarar entidades

source: The following directives are available. All declarations can start with a visibility statement (``public``, ``private`` or ``protected``).
pt_br: As seguintes diretivas estão disponíveis. Todas as declarações podem começar com uma declaração de visibilidade (``public``, ``private`` ou ``protected``).

source: Describe a class/struct, possibly with specification of inheritance, e.g.,::
pt_br: Descreve uma classe/struct, possivelmente com especificação de herança, por exemplo::

source: The difference between :rst:dir:`cpp:class` and :rst:dir:`cpp:struct` is only cosmetic: the prefix rendered in the output, and the specifier shown in the index.
pt_br: A diferença entre :rst:dir:`cpp:class` e :rst:dir:`cpp:struct` é apenas cosmética: o prefixo renderizado na saída e o especificador mostrado no índice.

source: The class can be directly declared inside a nested scope, e.g.,::
pt_br: A classe pode ser declarada diretamente dentro de um escopo aninhado, por exemplo::

source: A class template can be declared::
pt_br: Um modelo de classe pode ser declarado::

source: or with a line break::
pt_br: ou com uma quebra de linha::

source: Full and partial template specialisations can be declared::
pt_br: As especializações de modelo completas e parciais podem ser declaradas::

source: The :rst:dir:`cpp:struct` directive.
pt_br: A diretiva :rst:dir:`cpp:struct`.

source: Describe a function or member function, e.g.,::
pt_br: Descreve uma função ou função-membro, por exemplo::

source: Function templates can also be described::
pt_br: Os modelos de função também podem ser descritos::

source: and function template specialisations::
pt_br: e especializações de modelo de função::

source: Ensures that the function's parameters will be emitted on a single logical line, overriding :confval:`cpp_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os parâmetros da função serão emitidos em uma única linha lógica, substituindo :confval:`cpp_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Describe a variable or member variable, e.g.,::
pt_br: Descreve uma variável ou variável de membro, por exemplo::

source: Variable templates can also be described::
pt_br: Os modelos de variáveis também podem ser descritos::

source: Describe a type as in a typedef declaration, a type alias declaration, or simply the name of a type with unspecified type, e.g.,::
pt_br: Descreve um tipo como em uma declaração de typedef, uma declaração de alias de tipo ou simplesmente o nome de um tipo com tipo não especificado, por exemplo::

source: A type alias can also be templated::
pt_br: Um alias de tipo também pode ser modelado::

source: The example are rendered as follows.
pt_br: Os exemplos são renderizados como demonstrado a seguir.

source: A typedef-like declaration of a type.
pt_br: Uma declaração semelhante a typedef de um tipo.

source: Declaration of a type alias with unspecified type.
pt_br: Declaração de um alias de tipo com tipo não especificado.

source: Declaration of a type alias.
pt_br: Declaração de um alias de tipo.

source: Describe a (scoped) enum, possibly with the underlying type specified. Any enumerators declared inside an unscoped enum will be declared both in the enum scope and in the parent scope. Examples::
pt_br: Descreve um enum (com escopo definido), possivelmente com o tipo subjacente especificado. Quaisquer enumeradores declarados dentro de um enum sem escopo serão declarados no escopo do enum e no escopo pai. Exemplos::

source: Describe an enumerator, optionally with its value defined, e.g.,::
pt_br: Descreve um enumerador, opcionalmente com seu valor definido, por exemplo::

source: Describe a union.
pt_br: Descreve uma união.

source: The support for concepts is experimental. It is based on the current draft standard and the Concepts Technical Specification. The features may change as they evolve.
pt_br: O suporte para conceitos é experimental. Baseia-se no projeto de padrão atual e na Especificação Técnica dos Conceitos. Os recursos podem mudar à medida que evoluem.

source: Describe a concept. It must have exactly 1 template parameter list. The name may be a nested name. Example::
pt_br: Descreve um conceito. Deve ter exatamente 1 lista de parâmetros de modelo. O nome pode ser um nome aninhado. Exemplo::

source: This will render as follows:
pt_br: Isso será renderizado da seguinte forma:

source: Options
pt_br: Opções

source: Some directives support options:
pt_br: Algumas diretivas oferecem suporte às opções:

source: ``:no-index-entry:`` and ``:no-contents-entry:``, see :ref:`basic-domain-markup`.
pt_br: ``:no-index-entry:`` e ``:no-contents-entry:``, veja :ref:`basic-domain-markup`.

source: ``:tparam-line-spec:``, for templated declarations. If specified, each template parameter will be rendered on a separate line.
pt_br: ``:tparam-line-spec:``, para declarações com modelo. Se especificado, cada parâmetro do modelo será renderizado em uma linha separada.

source: Anonymous Entities
pt_br: Entidades anônimas

source: C++ supports anonymous namespaces, classes, enums, and unions. For the sake of documentation they must be given some name that starts with ``@``, e.g., ``@42`` or ``@data``. These names can also be used in cross-references and (type) expressions, though nested symbols will be found even when omitted. The ``@...`` name will always be rendered as **[anonymous]** (possibly as a link).
pt_br: C++ oferece suporte a espaços de nomes, classes, enumerações e uniões anônimas. Para fins de documentação, eles devem receber algum nome que comece com ``@``, por exemplo, ``@42`` ou ``@data``. Esses nomes também podem ser usados ​​em referências cruzadas e expressões (de tipo), embora símbolos aninhados sejam encontrados mesmo quando omitidos. O nome ``@...`` sempre será renderizado como **[anonymous]** (possivelmente como um link).

source: Example::
pt_br: Exemplo::

source: This will be rendered as:
pt_br: Isso será renderizado como:

source: Aliasing Declarations
pt_br: Fazendo alias de declarações

source: Sometimes it may be helpful list declarations elsewhere than their main documentation, e.g., when creating a synopsis of a class interface. The following directive can be used for this purpose.
pt_br: Às vezes, declarações de lista podem ser úteis em outros lugares além da documentação principal, por exemplo, ao criar uma sinopse de uma interface de classe. A seguinte diretiva pode ser usada para esse propósito.

source: Insert one or more alias declarations. Each entity can be specified as they can in the :rst:role:`cpp:any` role. If the name of a function is given (as opposed to the complete signature), then all overloads of the function will be listed.
pt_br: Insere uma ou mais declarações de alias. Cada entidade pode ser especificada como pode no papel :rst:role:`cpp:any`. Se o nome de uma função for fornecido (em oposição à assinatura completa), todas as sobrecargas da função serão listadas.

source: For example::
pt_br: Por exemplo::

source: becomes
pt_br: se torna

source: whereas::
pt_br: enquanto::

source: Insert nested declarations as well, up to the total depth given. Use 0 for infinite depth and 1 for just the mentioned declaration. Defaults to 1.
pt_br: Insere também declarações aninhadas, até a profundidade total fornecida. Use 0 para profundidade infinita e 1 apenas para a declaração mencionada. O padrão é 1.

source: Skip the mentioned declarations and only render nested declarations. Requires ``maxdepth`` either 0 or at least 2.
pt_br: Ignora as declarações mencionadas e renderiza apenas declarações aninhadas. Requer ``maxprofundidade`` 0 ou pelo menos 2.

source: Constrained Templates
pt_br: Modelos restritos

source: Sphinx does not currently support ``requires`` clauses.
pt_br: O Sphinx atualmente não tem suporte a cláusulas ``requires``.

source: Placeholders
pt_br: Espaços reservados

source: Declarations may use the name of a concept to introduce constrained template parameters, or the keyword ``auto`` to introduce unconstrained template parameters::
pt_br: As declarações podem usar o nome de um conceito para introduzir parâmetros de modelo restritos, ou a palavra-chave ``auto`` para introduzir parâmetros de modelo irrestrito:

source: Template Introductions
pt_br: Introduções de modelos

source: Simple constrained function or class templates can be declared with a `template introduction` instead of a template parameter list::
pt_br: Modelos restritos simples de classe e função podem ser declarados com uma `introdução de modelo` em vez de uma lista de parâmetros de modelo::

source: They are rendered as follows.
pt_br: Eles são renderizados da seguinte maneira.

source: Note however that no checking is performed with respect to parameter compatibility. E.g., ``Iterator{A, B, C}`` will be accepted as an introduction even though it would not be valid C++.
pt_br: Observe, entretanto, que nenhuma verificação é realizada com relação à compatibilidade dos parâmetros. Por exemplo, ``Iterator{A, B, C}`` será aceito como uma introdução mesmo que não seja C++ válido.

source: Inline Expressions and Types
pt_br: Tipos e expressões em lniha

source: Insert a C++ expression or type either as inline code (``cpp:expr``) or inline text (``cpp:texpr``). For example::
pt_br: Insere uma expressão C++ ou digite como código embutido (``cpp:expr``) ou texto embutido (``cpp:texpr``). Por exemplo::

source: will be rendered as follows:
pt_br: será renderizado da seguinte maneira:

source: The :rst:role:`cpp:expr` role.
pt_br: O papel :rst:role:`cpp:expr`.

source: The :rst:role:`cpp:texpr` role.
pt_br: O papel :rst:role:`cpp:texpr`.

source: Namespacing
pt_br: Usando espaços de nomes

source: Declarations in the C++ domain are as default placed in global scope. The current scope can be changed using three namespace directives. They manage a stack declarations where ``cpp:namespace`` resets the stack and changes a given scope.
pt_br: As declarações no domínio C++ são colocadas por padrão no escopo global. O escopo atual pode ser alterado usando três diretivas de espaço de nomes. Eles gerenciam declarações de pilha onde ``cpp:namespace`` redefine a pilha e altera um determinado escopo.

source: The ``cpp:namespace-push`` directive changes the scope to a given inner scope of the current one.
pt_br: A diretiva ``cpp:namespace-push`` altera o escopo para um determinado escopo interno do atual.

source: The ``cpp:namespace-pop`` directive undoes the most recent ``cpp:namespace-push`` directive.
pt_br: A diretiva ``cpp:namespace-pop`` desfaz a diretiva ``cpp:namespace-push`` mais recente.

source: Changes the current scope for the subsequent objects to the given scope, and resets the namespace directive stack. Note that the namespace does not need to correspond to C++ namespaces, but can end in names of classes, e.g.,::
pt_br: Altera o escopo atual dos objetos subsequentes para o escopo especificado e redefine a pilha de diretivas de espaço de nomes. Observe que o espaço de nomes não precisa corresponder aos espaços de nomes C++, mas pode terminar em nomes de classes, por exemplo::

source: All subsequent objects will be defined as if their name were declared with the scope prepended. The subsequent cross-references will be searched for starting in the current scope.
pt_br: Todos os objetos subsequentes serão definidos como se seus nomes tivessem sido declarados com o escopo anexado. As referências cruzadas subsequentes serão pesquisadas a partir do escopo atual.

source: Using ``NULL``, ``0``, or ``nullptr`` as the scope will change to global scope.
pt_br: Usar ``NULL``, ``0`` ou ``nullptr`` como escopo mudará para escopo global.

source: A namespace declaration can also be templated, e.g.,::
pt_br: Uma declaração de espaço de nomes também pode ser modelada, por exemplo,::

source: declares ``size`` as a member function of the class template ``std::vector``. Equivalently this could have been declared using::
pt_br: declara ``size`` como uma função membro do modelo de classe ``std::vector``. De forma equivalente, isso poderia ter sido declarado usando::

source: or::
pt_br: ou::

source: Change the scope relatively to the current scope. For example, after::
pt_br: Altera o escopo relativamente ao escopo atual. Por exemplo, depois de::

source: the current scope will be ``A::B::C::D``.
pt_br: o escopo atual será ``A::B::C::D``.

source: Undo the previous ``cpp:namespace-push`` directive (*not* just pop a scope). For example, after::
pt_br: Desfaz a diretiva ``cpp:namespace-push`` anterior (*não* apenas abre um escopo). Por exemplo, depois de::

source: the current scope will be ``A::B`` (*not* ``A::B::C``).
pt_br: o escopo atual será ``A::B`` (*não* ``A::B::C``).

source: If no previous ``cpp:namespace-push`` directive has been used, but only a ``cpp:namespace`` directive, then the current scope will be reset to global scope. That is, ``.. cpp:namespace:: A::B`` is equivalent to::
pt_br: Se nenhuma diretiva ``cpp:namespace-push`` anterior tiver sido usada, mas apenas uma diretiva ``cpp:namespace``, então o escopo atual será redefinido para o escopo global. Ou seja, ``.. cpp:namespace:: A::B`` é equivalente a::

source: Info field lists
pt_br: Lista de campos de informações

source: All the C++ directives for declaring entities support the following info fields (see also :ref:`info-field-lists`):
pt_br: Todas as diretivas C++ para declaração de entidades têm suporte aos seguintes campos de informação (veja também :ref:`info-field-lists`):

source: ``tparam``: Description of a template parameter.
pt_br: ``tparam``: Descrição de um parâmetro de modelo.

source: The :rst:dir:`cpp:function` directive additionally supports the following fields:
pt_br: A diretiva :rst:dir:`cpp:function` tem suporte adicionalmente aos seguintes campos:

source: ``param``, ``parameter``, ``arg``, ``argument``: Description of a parameter.
pt_br: ``param``, ``parameter``, ``arg``, ``argument``: Descrição de um parâmetro.

source: ``returns``, ``return``: Description of a return value.
pt_br: ``returns``, ``return``: Descrição de um valor de retorno.

source: ``retval``, ``retvals``: An alternative to ``returns`` for describing the result of the function.
pt_br: ``retval``, ``retvals``: Uma alternativa a ``returns`` para descrever o resultado da função.

source: ``throws``, ``throw``, ``exception``: Description of a possibly thrown exception.
pt_br: ``throws``, ``throw``, ``exception``: Descrição de uma exceção possivelmente lançada.

source: The ``retval`` field type.
pt_br: O tipo de campo ``retval``.

source: Cross-referencing
pt_br: Fazendo referência cruzada

source: These roles link to the given declaration types:
pt_br: Esses papéis estão vinculados aos tipos de declaração fornecidos:

source: Reference a C++ declaration by name (see below for details). The name must be properly qualified relative to the position of the link.
pt_br: Faz referência a uma declaração C++ por nome (veja detalhes abaixo). O nome deve ser devidamente qualificado em relação à posição do link.

source: The :rst:role:`cpp:struct` role as alias for the :rst:role:`cpp:class` role.
pt_br: O papel :rst:role:`cpp:struct` como um alias para o papel :rst:role:`cpp:class`.

source: Note on References with Templates Parameters/Arguments
pt_br: Nota sobre referências com parâmetros/argumentos de modelos

source: These roles follow the Sphinx :ref:`xref-syntax` rules. This means care must be taken when referencing a (partial) template specialization, e.g. if the link looks like this: ``:cpp:class:`MyClass<int>```. This is interpreted as a link to ``int`` with a title of ``MyClass``. In this case, escape the opening angle bracket with a backslash, like this: ``:cpp:class:`MyClass\<int>```.
pt_br: Esses papéis seguem as regras de :ref:`xref-syntax` do Sphinx. Isso significa que deve-se ter cuidado ao fazer referência a uma especialização de modelo (parcial), por exemplo. se o link for assim: ``:cpp:class:`MinhaClasse<int>```. Isto é interpretado como um link para ``int`` com o título ``MinhaClasse``. Nesse caso, escape o sinal de maior que com uma barra invertida, como esta: ``:cpp:class:`MinhaClasse\<int>```.

source: When a custom title is not needed it may be useful to use the roles for inline expressions, :rst:role:`cpp:expr` and :rst:role:`cpp:texpr`, where angle brackets do not need escaping.
pt_br: Quando um título personalizado não é necessário, pode ser útil usar os papéis para expressões em linha, :rst:role:`cpp:expr` e :rst:role:`cpp:texpr`, onde os sinais de maior que não precisam de escape.

source: Declarations without template parameters and template arguments
pt_br: Declarações sem parâmetros de modelo e argumentos de modelo

source: For linking to non-templated declarations the name must be a nested name, e.g., ``f`` or ``MyClass::f``.
pt_br: Para vincular a declarações não modeladas, o nome deve ser um nome aninhado, por exemplo, ``f`` ou ``MinhaClasse::f``.

source: Overloaded (member) functions
pt_br: Funções (membro) sobrecarregadas

source: When a (member) function is referenced using just its name, the reference will point to an arbitrary matching overload. The :rst:role:`cpp:any` and :rst:role:`cpp:func` roles use an alternative format, which simply is a complete function declaration. This will resolve to the exact matching overload. As example, consider the following class declaration:
pt_br: Quando uma função (membro) é referenciada usando apenas seu nome, a referência apontará para uma sobrecarga de correspondência arbitrária. Os papéis :rst:role:`cpp:any` e :rst:role:`cpp:func` usam um formato alternativo, que é simplesmente uma declaração de função completa. Isso resolverá a sobrecarga de correspondência exata. Como exemplo, considere a seguinte declaração de classe:

source: References using the :rst:role:`cpp:func` role:
pt_br: Referências usando o papel :rst:role:`cpp:func`:

source: Arbitrary overload: ``C::f``, :cpp:func:`C::f`
pt_br: Sobrecarga arbitrária: ``C::f``, :cpp:func:`C::f`

source: Also arbitrary overload: ``C::f()``, :cpp:func:`C::f()`
pt_br: Também sobrecarga arbitrária: ``C::f()``, :cpp:func:`C::f()`

source: Specific overload: ``void C::f()``, :cpp:func:`void C::f()`
pt_br: Sobrecarga específica: ``void C::f()``, :cpp:func:`void C::f()`

source: Specific overload: ``void C::f(int)``, :cpp:func:`void C::f(int)`
pt_br: Sobrecarga específica: ``void C::f(int)``, :cpp:func:`void C::f(int)`

source: Specific overload: ``void C::f(double)``, :cpp:func:`void C::f(double)`
pt_br: Sobrecarga específica: ``void C::f(double)``, :cpp:func:`void C::f(double)`

source: Specific overload: ``void C::f(double) const``, :cpp:func:`void C::f(double) const`
pt_br: Sobrecarga específica: ``void C::f(double) const``, :cpp:func:`void C::f(double) const`

source: Note that the :confval:`add_function_parentheses` configuration variable does not influence specific overload references.
pt_br: Observe que a variável de configuração :confval:`add_function_parentheses` não influencia referências de sobrecarga específicas.

source: Templated declarations
pt_br: Declarações modeladas

source: Assume the following declarations.
pt_br: Considere as seguintes declarações.

source: In general the reference must include the template parameter declarations, and template arguments for the prefix of qualified names. For example:
pt_br: Em geral, a referência deve incluir as declarações de parâmetros do modelo e os argumentos do modelo para o prefixo dos nomes qualificados. Por exemplo:

source: Currently the lookup only succeed if the template parameter identifiers are equal strings. That is, ``template\<typename UOuter> Wrapper::Outer`` will not work.
pt_br: Atualmente, a pesquisa só é bem-sucedida se os identificadores dos parâmetros do modelo forem strings iguais. Ou seja, ``template\<typename UOuter> Wrapper::Outer`` não funcionará.

source: As a shorthand notation, if a template parameter list is omitted, then the lookup will assume either a primary template or a non-template, but not a partial template specialisation. This means the following references work as well:
pt_br: Como uma notação abreviada, se uma lista de parâmetros do modelo for omitida, a pesquisa presumirá um modelo primário ou um não modelo, mas não uma especialização parcial do modelo. Isso significa que as seguintes referências também funcionam:

source: (Full) Template Specialisations
pt_br: Especializações (completas) de modelos

source: In general the reference must include a template parameter list for each template argument list. The full specialisation above can therefore be referenced with ``template\<> Outer\<int>`` (:cpp:class:`template\<> Outer\<int>`) and ``template\<> template\<> Outer\<int>::Inner\<bool>`` (:cpp:class:`template\<> template\<> Outer\<int>::Inner\<bool>`). As a shorthand the empty template parameter list can be omitted, e.g., ``Outer\<int>`` (:cpp:class:`Outer\<int>`) and ``Outer\<int>::Inner\<bool>`` (:cpp:class:`Outer\<int>::Inner\<bool>`).
pt_br: Em geral, a referência deve incluir uma lista de parâmetros de modelo para cada lista de argumentos de modelo. A especialização completa acima pode, portanto, ser referenciada com ``template\<> Outer\<int>`` (:cpp:class:`template\<> Outer\<int>`) e ``template\<> template\<> Outer\<int>::Inner\<bool>`` (:cpp:class:`template\<> template\<> Outer\<int>::Inner\<bool>`). Como abreviação, a lista de parâmetros do modelo vazio pode ser omitida, por exemplo, ``Outer\<int>`` (:cpp:class:`Outer\<int>`) e ``Outer\<int>::Inner\<bool>`` (:cpp:class:`Outer\<int>::Inner\<bool>`).

source: Partial Template Specialisations
pt_br: Especializações parciais de modelo

source: Assume the following declaration.
pt_br: Considere a seguinte declaração.

source: References to partial specialisations must always include the template parameter lists, e.g., ``template\<typename T> Outer\<T*>`` (:cpp:class:`template\<typename T> Outer\<T*>`). Currently the lookup only succeed if the template parameter identifiers are equal strings.
pt_br: Referências a especializações parciais devem sempre incluir as listas de parâmetros do modelo, por exemplo, ``template\<typename T> Outer\<T*>`` (:cpp:class:`template\<typename T> Outer\<T*>` ). Atualmente, a pesquisa só é bem-sucedida se os identificadores dos parâmetros do modelo forem strings iguais.

source: Configuration Variables
pt_br: Variáveis de configuração

source: See :ref:`cpp-config`.
pt_br: Veja :ref:`cpp-config`.
