Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/domains/javascript.po
Languages: pt_br

source: The JavaScript Domain
pt_br: O domínio JavaScript

source: The JavaScript domain (name **js**) provides the following directives:
pt_br: O domínio JavaScript (nome **js**) fornece as seguintes diretivas:

source: This directive sets the module name for object declarations that follow after. The module name is used in the global module index and in cross references. This directive does not create an object heading like :rst:dir:`py:class` would, for example.
pt_br: Esta diretiva define o nome do módulo para declarações de objetos a seguir. O nome do módulo é usado no índice global de módulos e em referências cruzadas. Esta diretiva não cria um cabeçalho de objeto como :rst:dir:`py:class` faria, por exemplo.

source: By default, this directive will create a linkable entity and will cause an entry in the global module index, unless the ``no-index`` option is specified. If this option is specified, the directive will only update the current module name.
pt_br: Por padrão, esta diretiva criará uma entidade vinculável e causará uma entrada no índice global de módulos, a menos que a opção ``no-index`` seja especificada. Se esta opção for especificada, a diretiva atualizará apenas o nome do módulo atual.

source: Module directives support body content.
pt_br: Diretivas de módulo possuem suporte a conteúdo do corpo.

source: Describes a JavaScript function or method. If you want to describe arguments as optional use square brackets as :ref:`documented <signatures>` for Python signatures.
pt_br: Descreve uma função ou método JavaScript. Se você quiser descrever argumentos como opcionais, use colchetes como :ref:`documentado <signatures>` para assinaturas Python.

source: You can use fields to give more details about arguments and their expected types, errors which may be thrown by the function, and the value being returned::
pt_br: Você pode usar campos para fornecer mais detalhes sobre argumentos e seus tipos esperados, erros que podem ser lançados pela função e o valor retornado::

source: This is rendered as:
pt_br: Isso é renderizado como:

source: Arguments
pt_br: Argumentos

source: Throws
pt_br: Lança

source: Returns
pt_br: Retorna

source: Ensures that the function's parameters will be emitted on a single logical line, overriding :confval:`javascript_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os parâmetros da função serão emitidos em uma única linha lógica, substituindo :confval:`javascript_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: This directive is an alias for :rst:dir:`js:function`, however it describes a function that is implemented as a method on a class object.
pt_br: Esta diretiva é um apelido para :rst:dir:`js:function`, porém descreve uma função que é implementada como um método em um objeto de classe.

source: Describes a constructor that creates an object. This is basically like a function but will show up with a `class` prefix::
pt_br: Descreve um construtor que cria um objeto. Isto é basicamente como uma função, mas aparecerá com um prefixo `class`::

source: Describes a global variable or constant.
pt_br: Descreve uma variável ou constante global.

source: Describes the attribute *name* of *object*.
pt_br: Descreve o atributo *name* de *object*.

source: These roles are provided to refer to the described objects:
pt_br: Essas funções são fornecidas para fazer referência aos objetos descritos:
