Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/domains/python.po
Languages: pt_br

source: Note that you can combine the ``~`` and ``.`` prefixes: ``:py:meth:`~.TarFile.close``` will reference the ``tarfile.TarFile.close()`` method, but the visible link caption will only be ``close()``.
pt_br: Note que você pode combinar os prefixos ``~`` e ``.``: ``:py:meth:`~.TarFile.close``` fará referência ao método ``tarfile.TarFile.close()`` , mas a legenda do link visível será apenas ``close()``.
