Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/domains/python.po
Languages: pt_br

source: The Python Domain
pt_br: O Domínio Python

source: The Python domain (name **py**) provides the following directives for module declarations:
pt_br: O domínio Python (nome **py**) fornece as seguintes diretivas para declarações de módulo:

source: This directive marks the beginning of the description of a module (or package submodule, in which case the name should be fully qualified, including the package name). A description of the module such as the docstring can be placed in the body of the directive.
pt_br: Esta diretiva marca o início da descrição de um módulo (ou submódulo de pacote, caso em que o nome deve ser totalmente qualificado, incluindo o nome do pacote). Uma descrição do módulo, como a docstring, pode ser colocada no corpo da diretiva.

source: This directive will also cause an entry in the global module index.
pt_br: Esta diretiva também adicionará uma entrada no índice global de módulos.

source: Module directives support body content.
pt_br: Diretivas de módulo possuem suporte a conteúdo do corpo.

source: options
pt_br: opções

source: Indicate platforms which the module is available (if it is available on all platforms, the option should be omitted). The keys are short identifiers; examples that are in use include "IRIX", "Mac", "Windows" and "Unix". It is important to use a key which has already been used when applicable.
pt_br: Indica plataformas nas quais o módulo está disponível (se estiver disponível em todas as plataformas, a opção deve ser omitida). As chaves são identificadores curtos; exemplos que estão em uso incluem "IRIX", "Mac", "Windows" e "Unix". É importante usar uma chave que já foi usada quando aplicável.

source: Consist of one sentence describing the module's purpose -- it is currently only used in the Global Module Index.
pt_br: Consiste em em uma frase descrevendo o propósito do módulo -- atualmente ela é usada apenas no índice global de módulos.

source: Mark a module as deprecated; it will be designated as such in various locations then.
pt_br: Marca um módulo como descontinuado; ele será designado como tal em vários locais.

source: This directive tells Sphinx that the classes, functions etc. documented from here are in the given module (like :rst:dir:`py:module`), but it will not create index entries, an entry in the Global Module Index, or a link target for :rst:role:`py:mod`. This is helpful in situations where documentation for things in a module is spread over multiple files or sections -- one location has the :rst:dir:`py:module` directive, the others only :rst:dir:`py:currentmodule`.
pt_br: Esta diretiva diz ao Sphinx que as classes, funções, etc. documentadas a partir daqui estão no módulo fornecido (como :rst:dir:`py:module`), mas não criará entradas de índice, uma entrada no índice global de módulos ou um link de alvo para :rst:role:`py:mod`. Isso é útil em situações onde a documentação para coisas em um módulo é espalhada por vários arquivos ou seções -- um local tem a diretiva :rst:dir:`py:module`, os outros apenas :rst:dir:`py:currentmodule`.

source: The following directives are provided for module and class contents:
pt_br: As seguintes diretivas são fornecidas para o conteúdo do módulo e da classe:

source: Describes a module-level function. The signature should include the parameters, together with optional type parameters, as given in the Python function definition, see :ref:`signatures`. For example::
pt_br: Descreve uma função de nível de módulo. A assinatura deve incluir os parâmetros, junto com parâmetros de tipo opcionais, como fornecidos na definição da função Python, consulte :ref:`signatures`. Por exemplo::

source: For methods you should use :rst:dir:`py:method`.
pt_br: Para métodos, você deve usar :rst:dir:`py:method`.

source: The description normally includes information about the parameters required and how they are used (especially whether mutable objects passed as parameters are modified), side effects, and possible exceptions.
pt_br: A descrição normalmente inclui informações sobre os parâmetros necessários e como eles são usados (especialmente se os objetos mutáveis passados como parâmetros são modificados), efeitos colaterais e possíveis exceções.

source: This information can (in any ``py`` directive) optionally be given in a structured form, see :ref:`info-field-lists`.
pt_br: Esta informação pode (em qualquer diretiva ``py``) opcionalmente ser fornecida em uma forma estruturada, veja :ref:`info-field-lists`.

source: Indicate the function is an async function.
pt_br: Indica que a função é uma função assíncrona.

source: Describe the location where the object is defined if the object is imported from other modules
pt_br: Descreve o local onde o objeto está definido, se o objeto for importado de outros módulos

source: Ensures that the function's arguments will be emitted on a single logical line, overriding :confval:`python_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os argumentos da função serão emitidos em uma única linha lógica, substituindo :confval:`python_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Ensure that the function's type parameters are emitted on a single logical line, overriding :confval:`python_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os parâmetros de tipo da função sejam emitidos em uma única linha lógica, substituindo :confval:`python_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Describes global data in a module, including both variables and values used as "defined constants." Consider using :rst:dir:`py:type` for type aliases instead and :rst:dir:`py:attribute` for class variables and instance attributes.
pt_br: Descreve dados globais em um módulo, incluindo variáveis ​​e valores usados ​​como "constantes definidas". Considere usar :rst:dir:`py:type` para apelidos de tipo e :rst:dir:`py:attribute` para variáveis ​​de classe e atributos de instância.

source: This will be parsed as a Python expression for cross-referencing the type annotation. As such, the argument to ``:type:`` should be a valid `annotation expression`_.
pt_br: Isso será analisado como uma expressão Python para referência cruzada da anotação de tipo. Como tal, o argumento para ``:type:`` deve ser uma `expressão de anotação`_ válida.

source: The valid syntax for the ``:type:`` directive option differs from the syntax for the ``:type:`` `info field <info-field-lists_>`__. The ``:type:`` directive option does not understand reStructuredText markup or the ``or`` or ``of`` keywords, meaning unions must use ``|`` and sequences must use square brackets, and roles such as ``:ref:`...``` cannot be used.
pt_br: A sintaxe válida para a opção de diretiva ``:type:`` difere da sintaxe para o `campo de informações <info-field-lists_>`__ ``:type:``. A opção de diretiva ``:type:`` não entende a marcação reStructuredText ou as palavras-chave ``or`` ou ``of``, o que significa que as uniões devem usar ``|`` e as sequências devem usar colchetes, e papéis como ``:ref:`...``` não podem ser usadas.

source: Describes an exception class. The signature can, but need not include parentheses with constructor arguments, or may optionally include type parameters (see :pep:`695`).
pt_br: Descreve uma classe de exceção. A assinatura pode, mas não precisa incluir parênteses com argumentos do construtor, ou podem opcionalmente incluir parâmetros de tipo (veja :pep:`695`).

source: Indicate the class is a final class.
pt_br: Indica que a classe é uma classe final.

source: See :rst:dir:`py:class:single-line-parameter-list`.
pt_br: Veja :rst:dir:`py:class:single-line-parameter-list`.

source: See :rst:dir:`py:class:single-line-type-parameter-list`.
pt_br: Veja :rst:dir:`py:class:single-line-type-parameter-list`.

source: Describes a class. The signature can optionally include type parameters (see :pep:`695`) or parentheses with parameters which will be shown as the constructor arguments. See also :ref:`signatures`.
pt_br: Descreve uma classe. A assinatura pode opcionalmente incluir parâmetros de tipo (veja :pep:`695`) ou parênteses com parâmetros que serão mostrados como argumentos do construtor. Veja também :ref:`signatures`.

source: Methods and attributes belonging to the class should be placed in this directive's body. If they are placed outside, the supplied name should contain the class name so that cross-references still work. Example::
pt_br: Métodos e atributos pertencentes à classe devem ser colocados no corpo desta diretiva. Se forem colocados fora, o nome fornecido deve conter o nome da classe para que as referências cruzadas ainda funcionem. Exemplo::

source: The first way is the preferred one.
pt_br: A primeira maneira é a preferida.

source: Indicate that the class is an abstract base class. This produces the following output:
pt_br: Indica que a classe é uma classe base abstrata. Isso produz a seguinte saída:

source: Ensures that the class constructor's arguments will be emitted on a single logical line, overriding :confval:`python_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os argumentos do construtor da classe serão emitidos em uma única linha lógica, substituindo :confval:`python_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Ensure that the class type parameters are emitted on a single logical line, overriding :confval:`python_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os parâmetros de tipo da classe sejam emitidos em uma única linha lógica, substituindo :confval:`python_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Describes an object data attribute. The description should include information about the type of the data to be expected and whether it may be changed directly. Type aliases should be documented with :rst:dir:`py:type`.
pt_br: Descreve um atributo de dados do objeto. A descrição deve incluir informações sobre o tipo de dados esperados e se eles podem ser alterados diretamente. Apelidos de tipos devem ser documentos com :rst:dir:`py:type`.

source: Describes an object property.
pt_br: Descreve uma propriedade do objeto

source: Indicate the property is a classmethod.
pt_br: Indica que a propriedade é um método de classe.

source: Describe a :ref:`type alias <python:type-aliases>`.
pt_br: Descreve um :ref:`apelido de tipo <python:type-aliases>`.

source: The type that the alias represents should be described with the :rst:dir:`!canonical` option. This directive supports an optional description body.
pt_br: O tipo que o apelido representa deve ser descrito com a opção :rst:dir:`!canonical`. Esta diretiva oferece suporte a um corpo de descrição opcional.

source: For example:
pt_br: Por exemplo:

source: will be rendered as follows:
pt_br: será renderizado da seguinte maneira:

source: Represent a 64-bit positive integer.
pt_br: Representa um número inteiro positivo de 64 bits.

source: The canonical type represented by this alias, for example:
pt_br: O tipo canônico representado por este apelido, por exemplo:

source: This is rendered as:
pt_br: Isso é renderizado como:

source: Represent a regular expression or a compiled pattern.
pt_br: Representa uma expressão regular ou um padrão compilado.

source: Describes an object method. The parameters should not include the ``self`` parameter. The description should include similar information to that described for ``function``. See also :ref:`signatures` and :ref:`info-field-lists`.
pt_br: Descreve um método de objeto. Os parâmetros não devem incluir o parâmetro ``self``. A descrição deve incluir informações semelhantes às descritas para ``function``. Veja também :ref:`signatures` e :ref:`info-field-lists`.

source: Indicate the method is an async method.
pt_br: Indica que o método é um método async, isto é, assíncrono.

source: Indicate the method is a class method.
pt_br: Indica que o método é um método de classe.

source: Indicate the method is a final method.
pt_br: Indica que o método é um método final.

source: Ensures that the method's arguments will be emitted on a single logical line, overriding :confval:`python_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os argumentos do método serão emitidos em uma única linha lógica, substituindo :confval:`python_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Ensure that the method's type parameters are emitted on a single logical line, overriding :confval:`python_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os parâmetros de tipo do método sejam emitidos em uma única linha lógica, substituindo :confval:`python_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Indicate the method is a static method.
pt_br: Indica que o método é um método estático.

source: Like :rst:dir:`py:method`, but indicates that the method is a static method.
pt_br: Como :rst:dir:`py:method`, mas indica que o método é um método estático.

source: Like :rst:dir:`py:method`, but indicates that the method is a class method.
pt_br: Como :rst:dir:`py:method`, mas indica que o método é um método de classe.

source: Describes a decorator function. The signature should represent the usage as a decorator. For example, given the functions
pt_br: Descreve uma função de decorador. A assinatura deve representar o uso como decorador. Por exemplo, dadas as funções

source: the descriptions should look like this::
pt_br: as descrições devem se parecer com isso::

source: (as opposed to ``.. py:decorator:: removename(func)``.)
pt_br: (em oposição a ``.. py:decorator:: removename(func)``.)

source: Ensures that the decorator's arguments will be emitted on a single logical line, overriding :confval:`python_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os argumentos do decorador serão emitidos em uma única linha lógica, substituindo :confval:`python_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Ensure that the decorator's type parameters are emitted on a single logical line, overriding :confval:`python_maximum_signature_line_length` and :confval:`maximum_signature_line_length`.
pt_br: Garante que os parâmetros de tipo do decorador sejam emitidos em uma única linha lógica, substituindo :confval:`python_maximum_signature_line_length` e :confval:`maximum_signature_line_length`.

source: Same as :rst:dir:`py:decorator`, but for decorators that are methods.
pt_br: O mesmo que :rst:dir:`py:decorator`, mas para decoradores que são métodos.

source: Python Signatures
pt_br: Assinaturas Python

source: Info field lists
pt_br: Listas de campos de informações

source: meta fields are added.
pt_br: campos meta adicionados.

source: Inside Python object description directives, reStructuredText field lists with these fields are recognized and formatted nicely:
pt_br: Dentro das diretivas de descrição de objeto Python, as listas de campos reStructuredText com esses campos são reconhecidas e formatadas de maneira adequada:

source: ``param``, ``parameter``, ``arg``, ``argument``, ``key``, ``keyword``: Description of a parameter.
pt_br: ``param``, ``parameter``, ``arg``, ``argument``, ``key``, ``keyword``: Descrição de um parâmetro.

source: ``type``: Type of a parameter. Creates a link if possible.
pt_br: ``type``: Tipo de um parâmetro. Cria um link, se possível.

source: ``raises``, ``raise``, ``except``, ``exception``: That (and when) a specific exception is raised.
pt_br: ``raises``, ``raise``, ``except``, ``exception``: Que (e quando) uma exceção específica é levantada.

source: ``var``, ``ivar``, ``cvar``: Description of a variable.
pt_br: ``var``, ``ivar``, ``cvar``: Descrição de uma variável.

source: ``vartype``: Type of a variable. Creates a link if possible.
pt_br: ``vartype``: Tipo de uma variável. Cria um link, se possível.

source: ``returns``, ``return``: Description of the return value.
pt_br: ``returns``, ``return``: Descrição do valor de retorno.

source: ``rtype``: Return type. Creates a link if possible.
pt_br: ``rtype``: Tipo de retorno. Cria um link, se possível.

source: ``meta``: Add metadata to description of the python object. The metadata will not be shown on output document. For example, ``:meta private:`` indicates the python object is private member. It is used in :py:mod:`sphinx.ext.autodoc` for filtering members.
pt_br: ``meta``: Adiciona metadados à descrição do objeto python. Os metadados não serão mostrados no documento de saída. Por exemplo, ``:meta private:`` indica que o objeto python é um membro privado. É usado em :py:mod:`sphinx.ext.autodoc` para filtrar membros.

source: In current release, all ``var``, ``ivar`` and ``cvar`` are represented as "Variable". There is no difference at all.
pt_br: Na versão atual, todos ``var``, ``ivar`` e ``cvar`` são representados como "Variável". Não há diferença alguma.

source: The field names must consist of one of these keywords and an argument (except for ``returns`` and ``rtype``, which do not need an argument). This is best explained by an example::
pt_br: Os nomes dos campos devem consistir em uma dessas palavras-chave e um argumento (exceto para ``returns`` e ``rtype``, que não precisam de um argumento). Isso é melhor explicado por um exemplo::

source: This will render like this:
pt_br: Isso será renderizado como:

source: Send a message to a recipient
pt_br: Envia uma mensagem para um destinatário

source: Parameters
pt_br: Parâmetros

source: The person sending the message
pt_br: A pessoa enviando a mensagem

source: The recipient of the message
pt_br: O destinatário da mensagem

source: The body of the message
pt_br: O corpo da mensagem

source: The priority of the message, can be a number 1-5
pt_br: A prioridade da mensagem, pode ser um número de 1-5

source: Returns
pt_br: Retorna

source: the message id
pt_br: o id da mensagem

source: Return type
pt_br: Tipo de retorno

source: Raises
pt_br: Levanta

source: if the message_body exceeds 160 characters
pt_br: se message_body exceder 160 caracteres

source: if the message_body is not a basestring
pt_br: se message_body não for uma basestring

source: It is also possible to combine parameter type and description, if the type is a single word, like this::
pt_br: Também é possível combinar o tipo e descrição do parâmetro, se o tipo for uma única palavra, como isso::

source: Container types such as lists and dictionaries can be linked automatically using the following syntax::
pt_br: Tipos de contêineres tal como listas e dicionários podem ser vinculados automaticamente usando a seguinte sintaxe::

source: Cross-referencing Python objects
pt_br: Referência cruzada de objetos Python

source: The following roles refer to objects in modules and are possibly hyperlinked if a matching identifier is found:
pt_br: Os seguintes papéis fazem referência a objetos em módulos e são possivelmente alvos de hiperlink se um identificador correspondente for encontrado:

source: Reference a module; a dotted name may be used. This should also be used for package names.
pt_br: Referencia um módulo; um nome pontilhado pode ser usado. Isso também deve ser usado para nomes de pacotes.

source: Reference a Python function; dotted names may be used. The role text needs not include trailing parentheses to enhance readability; they will be added automatically by Sphinx if the :confval:`add_function_parentheses` config value is ``True`` (the default).
pt_br: Referencia uma função Python; nomes pontilhados podem ser usados. O texto do papel não precisa incluir parênteses ao final para melhorar a legibilidade; eles serão adicionados automaticamente pelo Sphinx se o valor da configuração :confval:`add_function_parentheses` for ``True`` (o padrão).

source: Reference a module-level variable.
pt_br: Referencia uma variável a nível de módulo.

source: Reference a "defined" constant. This may be a Python variable that is not intended to be changed.
pt_br: Referencia uma constante "definida". Isso pode ser uma variável Python que não é destinada a ser alterada.

source: Reference a class; a dotted name may be used.
pt_br: Referencia uma classe; um nome pontilhado pode ser usado.

source: Reference a method of an object. The role text can include the type name and the method name; if it occurs within the description of a type, the type name can be omitted. A dotted name may be used.
pt_br: Referencia um método de um objeto. O texto do papel pode incluir o nome do tipo e o nome do método; se ocorrer dentro da descrição de um tipo, o nome do tipo pode ser omitido. Um nome pontilhado pode ser usado.

source: Reference a data attribute of an object.
pt_br: Referencia um atributo de dados de um objeto.

source: The role is also able to refer to property.
pt_br: O papel também é capaz de fazer referência à propriedade.

source: Reference a type alias.
pt_br: Referência um apelido de tipo

source: Reference an exception. A dotted name may be used.
pt_br: Referencia uma exceção. Um nome pontilhado pode ser usado.

source: Reference an object of unspecified type. Useful e.g. as the :confval:`default_role`.
pt_br: Referencia um objeto de tipo não especificado. Útil, por exemplo, como :confval:`default_role`.

source: You may supply an explicit title and reference target: ``:py:mod:`mathematical functions <math>``` will refer to the ``math`` module, but the link text will be "mathematical functions".
pt_br: Você pode fornecer um título explícito e um alvo de referência: ``:py:mod:`mathematical functions <math>``` fará referência ao módulo ``math``, mas o texto do link será "mathematical functions".

source: If you prefix the content with an exclamation mark (``!``), no reference/hyperlink will be created.
pt_br: Se você prefixar o conteúdo com um ponto de exclamação ``!``, nenhuma referência/hiperlink será criada.

source: If you prefix the content with ``~``, the link text will only be the last component of the target. For example, ``:py:meth:`~queue.Queue.get``` will refer to ``queue.Queue.get`` but only display ``get`` as the link text.
pt_br: Se você prefixar o conteúdo com ``~``, o texto do link será apenas o último componente do alvo. Por exemplo, ``:py:meth:`~queue.Queue.get``` irá fazer referência a ``queue.Queue.get``, mas somente exibirá ``get`` como o texto do link.

source: A similar heuristic is used to determine whether the name is an attribute of the currently documented class.
pt_br: Uma heurística semelhante é usada para determinar se o nome é um atributo da classe documentada atualmente.

source: Also, if the name is prefixed with a dot, and no exact match is found, the target is taken as a suffix and all object names with that suffix are searched. For example, ``:py:meth:`.TarFile.close``` references the ``tarfile.TarFile.close()`` function, even if the current module is not ``tarfile``. Since this can get ambiguous, if there is more than one possible match, you will get a warning from Sphinx.
pt_br: Além disso, se o nome for prefixado com um ponto e nenhuma correspondência exata for encontrada, o alvo será considerado um sufixo e todos os nomes de objeto com esse sufixo serão pesquisados. Por exemplo, ``:py:meth:`.TarFile.close``` faz referência à função ``tarfile.TarFile.close()``, mesmo se o módulo atual não for ``tarfile``. Como isso pode ficar ambíguo, se houver mais de uma correspondência possível, você receberá um aviso do Sphinx.
