Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/domains/restructuredtext.po
Languages: pt_br, zh_cn

source: The reStructuredText Domain
pt_br: O domínio reStructuredText
zh_cn: reStructuredText域

source: The reStructuredText domain (name **rst**) provides the following directives:
pt_br: O domínio reStructuredText (nome **rst**) fornece as seguintes diretivas:
zh_cn: reStructuredText域(名称 **rst**)提供以下指令：

source: Describes a reStructuredText directive. The *name* can be a single directive name or actual directive syntax (`..` prefix and `::` suffix) with arguments that will be rendered differently. For example::
pt_br: Descreve uma diretiva reStructuredText. O *name* pode ser um único nome de diretiva ou uma sintaxe de diretiva real (prefixo `..` e sufixo `::`) com argumentos que serão renderizados de forma diferente. Por exemplo::
zh_cn: 描述一个reStructuredText指令。*name* 可以是单个指令名称或实际的指令语法（ ``..`` 前缀和 ``::`` 后缀），带有将以不同方式呈现的参数。例如：

source: will be rendered as:
pt_br: será renderizado como:
zh_cn: 将呈现为：

source: Describes an option for reStructuredText directive. The *name* can be a single option name or option name with arguments which separated with colon (``:``). For example::
pt_br: Descreve uma opção para a diretiva reStructuredText. O *name* pode ser um nome de opção única ou um nome de opção com argumentos separados por dois pontos (``:``). Por exemplo::
zh_cn: 描述reStructuredText指令的选项。*name* 可以是单个选项名称或带有参数的选项名称，参数用冒号(``:``)分隔。例如:

source: options
pt_br: opções
zh_cn: 选项

source: Describe the type of option value.
pt_br: Descreve o tipo de valor da opção.
zh_cn: 描述选项的值的类型。

source: For example::
pt_br: Por exemplo::
zh_cn: 例如：

source: Describes a reStructuredText role. For example::
pt_br: Descreve um papel reStructuredText. Por exemplo::
zh_cn: 描述一个reStructuredText角色。例如::

source: These roles are provided to refer to the described objects:
pt_br: Essas funções são fornecidas para fazer referência aos objetos descritos:
zh_cn: 提供这些角色是为了引用所描述的对象：

source: Reference directives and directive options. Examples:
zh_cn: 引用指令和指令选项。示例：

source: Use ``:rst:dir:`my-directive``` to reference a directive.
zh_cn: 使用 ``:rst:dir:`my-directive``` 引用一个指令。

source: Use ``:rst:dir:`my-directive:my-option``` to reference a directive option.
zh_cn: 使用 ``:rst:dir:`my-directive:my-option``` 引用一个指令选项。

source: Reference a role. Example: ``:rst:role:`my-role```.
zh_cn: 引用一个角色。示例：``:rst:role:`my-role```。
