Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/development/tutorials/adding_domain.po
Languages: pt_br, zh_cn

source: Adding a reference domain
pt_br: Adicionando um domínio de referência
zh_cn: 添加参考域

source: The objective of this tutorial is to illustrate roles, directives and domains. Once complete, we will be able to use this extension to describe a recipe and reference that recipe from elsewhere in our documentation.
pt_br: O objetivo deste tutorial é ilustrar papéis, diretivas e domínios. Depois de concluído, poderemos usar esta extensão para descrever uma receita e fazer referência a essa receita em outras partes de nossa documentação.
zh_cn: 本教程的目的是说明角色，指令和域。完成后，我们将能够使用此扩展来描述食谱并从我们文档的其他地方引用该食谱。

source: This tutorial is based on a guide first published on `opensource.com`_ and is provided here with the original author's permission.
pt_br: Este tutorial é baseado em um guia publicado pela primeira vez em `opensource.com`_ e é fornecido aqui com a permissão do autor original.
zh_cn: 本教程基于首先在 `opensource.com`_ 上发布的指南，并在得到原始作者许可的情况下提供。

source: Overview
pt_br: Visão geral
zh_cn: 概述

source: We want the extension to add the following to Sphinx:
pt_br: Queremos que a extensão adicione o seguinte ao Sphinx:
zh_cn: 我们希望扩展可以将以下内容添加到Sphinx中：

source: A ``recipe`` :term:`directive`, containing some content describing the recipe steps, along with a ``:contains:`` option highlighting the main ingredients of the recipe.
pt_br: Uma :term:`diretiva` ``recipe``, contendo algum conteúdo descrevendo as etapas da receita, junto com uma opção ``:contains:`` realçando os principais ingredientes da receita.
zh_cn: ``recipe`` :term:`directive`，包含一些描述食谱步骤的内容，及一个 ``:contains:`` 选项，突出显示食谱的主要成分。

source: A ``ref`` :term:`role`, which provides a cross-reference to the recipe itself.
pt_br: Um :term:`papel` ``ref``, que fornece uma referência cruzada para a própria receita.
zh_cn: ``ref`` :term:`role`，提供对食谱本身的交叉引用。

source: A ``recipe`` :term:`domain`, which allows us to tie together the above role and domain, along with things like indices.
pt_br: Um :term:`domínio` ``recipe``, que nos permite unir o papel e o domínio acima, junto com coisas como índices.
zh_cn: ``recipe`` :term:`domain`，它使我们可以将上述角色和领域以及索引等东西结合在一起。

source: For that, we will need to add the following elements to Sphinx:
pt_br: Para isso, precisaremos adicionar os seguintes elementos ao Sphinx:
zh_cn: 为此，我们需要在 Sphinx 中添加以下元素：

source: A new directive called ``recipe``
pt_br: Uma nova diretiva chamada ``recipe``
zh_cn: 一个名为 ``recipe`` 的新指令

source: New indexes to allow us to reference ingredient and recipes
pt_br: Novos índices para nos permitir referenciar ingredientes e receitas
zh_cn: 新索引使我们可以参考成分和食谱

source: A new domain called ``recipe``, which will contain the ``recipe`` directive and ``ref`` role
pt_br: Um novo domínio chamado ``recipe``, que conterá a diretiva ``recipe`` e o papel ``ref``
zh_cn: 一个名为 ``recipe`` 的新域，其中将包含 ``recipe`` 指令和 ``ref`` 角色

source: Prerequisites
pt_br: Pré-requisitos
zh_cn: 系统需求

source: We need the same setup as in :ref:`the previous extensions <tutorial-extend-build>`. This time, we will be putting out extension in a file called :file:`recipe.py`.
pt_br: Precisamos da mesma configuração que em :ref:`as extensões anteriores <tutorial-extend-build>`. Desta vez, colocaremos a extensão em um arquivo chamado :file:`recipe.py`.
zh_cn: 我们需要与 :ref:`上篇教程 <tutorial-extend-build>` 中相同的设置。这一次，我们将把扩展放在名为 :file:`recipe.py` 的文件中。

source: Here is an example of the folder structure you might obtain:
pt_br: Aqui está um exemplo da estrutura de pastas que você pode obter:
zh_cn: 这是您将获得的文件夹结构的示例：

source: Writing the extension
pt_br: Escrevendo a extensão
zh_cn: 编写插件

source: Open :file:`recipe.py` and paste the following code in it, all of which we will explain in detail shortly:
pt_br: Abra :file:`recipe.py` e cole o seguinte código nele, que explicaremos em detalhes em breve:
zh_cn: 打开 :file:`recipe.py` 并将以下代码粘贴到其中，我们将在稍后详细解释所有这些代码：

source: Let's look at each piece of this extension step-by-step to explain what's going on.
pt_br: Vejamos cada parte desta extensão passo a passo para explicar o que está acontecendo.
zh_cn: 让我们逐步看一下该扩展的每一部分，以解释发生了什么。

source: The directive class
pt_br: A classe da diretiva
zh_cn: 指令类

source: The first thing to examine is the ``RecipeDirective`` directive:
pt_br: A primeira coisa a examinar é a diretiva ``RecipeDirective``:
zh_cn: 首先要检查的是 ``RecipeDirective`` 指令：

source: Unlike :ref:`tutorial-extending-syntax` and :ref:`tutorial-extend-build`, this directive doesn't derive from :class:`docutils.parsers.rst.Directive` and doesn't define a ``run`` method. Instead, it derives from :class:`sphinx.directives.ObjectDescription` and defines ``handle_signature`` and ``add_target_and_index`` methods. This is because ``ObjectDescription`` is a special-purpose directive that's intended for describing things like classes, functions, or, in our case, recipes. More specifically, ``handle_signature`` implements parsing the signature of the directive and passes on the object's name and type to its superclass, while ``add_target_and_index`` adds a target (to link to) and an entry to the index for this node.
pt_br: Ao contrário de :ref:`tutorial-extending-syntax` e :ref:`tutorial-extend-build`, esta diretiva não deriva de :class:`docutils.parsers.rst.Directive` e não define um método ``run``. Em vez disso, ela deriva de :class:`sphinx.directives.ObjectDescription` e define os métodos ``handle_signature`` e ``add_target_and_index``. Isso ocorre porque ``ObjectDescription`` é uma diretiva de propósito especial que se destina a descrever coisas como classes, funções ou, no nosso caso, receitas. Mais especificamente, ``handle_signature`` implementa a análise da assinatura da diretiva e passa o nome e tipo do objeto para sua superclasse, enquanto ``add_target_and_index`` adiciona um alvo (para vincular) e uma entrada ao índice para este nó.
zh_cn: 与 :ref:`tutorial-extending-syntax` 和 :ref:`tutorial-extend-build` 不同，此指令不是从 :class:`docutils.parsers.rst.Directive` 派生的，也没有定义 ``run`` 方法。相反，它派生自 :class:`sphinx.directives.ObjectDescription` 并定义了 ``handle_signature`` 和 ``add_target_and_index`` 方法。这是因为 ``ObjectDescription`` 是一个专用指令，旨在描述类，函数或在我们的情况下，食谱等内容。更具体地说，``handle_signature`` 实现了解析指令的签名并将对象的名称和类型传递给其超类，而 ``add_target_and_index`` 则为此节点添加了一个目标（以链接到）和索引条目。

source: We also see that this directive defines ``has_content``, ``required_arguments`` and ``option_spec``. Unlike the ``TodoDirective`` directive added in the :ref:`previous tutorial <tutorial-extend-build>`, this directive takes a single argument, the recipe name, and an option, ``contains``, in addition to the nested reStructuredText in the body.
pt_br: Vemos também que esta diretiva define ``has_content``, ``required_arguments`` e ``option_spec``. Ao contrário da diretiva ``TodoDirective`` adicionada no :ref:`tutorial anterior <tutorial-extend-build>`, esta diretiva leva um único argumento, o nome da receita, e uma opção, ``contains``, além do reStructuredText aninhado no corpo.
zh_cn: 我们还看到该指令定义了 ``has_content``， ``required_arguments`` 和 ``option_spec``。与 :ref:`上篇教程 <tutorial-extend-build>` 中添加的 ``TodoDirective`` 指令不同，此指令采用单个参数，即食谱名称，以及一个选项 ``contains``，除了正文中的嵌套 reStructuredText 之外。

source: The index classes
pt_br: As classes de índices
zh_cn: 索引类

source: Todo
pt_br: Por fazer
zh_cn: 待处理

source: Add brief overview of indices
pt_br: Adicionar uma breve visão geral sobre índices
zh_cn: 新增索引的简要概述

source: Both ``IngredientIndex`` and ``RecipeIndex`` are derived from :class:`Index`. They implement custom logic to generate a tuple of values that define the index. Note that ``RecipeIndex`` is a simple index that has only one entry. Extending it to cover more object types is not yet part of the code.
pt_br: Ambos ``IngredientIndex`` e ``RecipeIndex`` são derivados de :class:`Index`. Eles implementam lógica personalizada para gerar uma tupla de valores que definem o índice. Observe que ``RecipeIndex`` é um índice simples que possui apenas uma entrada. Estendê-lo para cobrir mais tipos de objetos ainda não faz parte do código.
zh_cn: IngredientIndex 和 RecipeIndex 都是从 :class:`Index` 派生的。 它们实现自定义逻辑以生成定义索引的值的元组。 注意“RecipeIndex”是一个只有一个条目的简单索引。 扩展它以涵盖更多对象类型尚不是代码的一部分。

source: Both indices use the method :meth:`Index.generate` to do their work. This method combines the information from our domain, sorts it, and returns it in a list structure that will be accepted by Sphinx. This might look complicated but all it really is is a list of tuples like ``('tomato', 'TomatoSoup', 'test', 'rec-TomatoSoup',...)``. Refer to the :doc:`domain API guide </extdev/domainapi>` for more information on this API.
pt_br: Ambos os índices usam o método :meth:`Index.generate` para fazer seu trabalho. Este método combina as informações do nosso domínio, classifica-as e retorna-as em uma estrutura de lista que será aceita pelo Sphinx. Isso pode parecer complicado, mas tudo o que realmente é é uma lista de tuplas como ``('tomato', 'TomatoSoup', 'test', 'rec-TomatoSoup',...)``. Consulte o :doc:`guia da API de domínio </extdev/domainapi>` para obter mais informações sobre esta API.
zh_cn: 两个索引都使用方法 :meth:`Index.generate` 来完成工作。该方法将来自我们域的信息进行组合，排序，然后以Sphinx接受的列表结构返回。这看起来可能很复杂，但实际上只是一个元组列表，如 ``('tomato'，'TomatoSoup'，'test'，'rec-TomatoSoup'...)``。 有关此API的更多信息，请参阅 :doc:`domain API guide </extdev/domainapi>`。

source: These index pages can be referenced with the :rst:role:`ref` role by combining the domain name and the index ``name`` value. For example, ``RecipeIndex`` can be referenced with ``:ref:`recipe-recipe``` and ``IngredientIndex`` can be referenced with ``:ref:`recipe-ingredient```.
pt_br: Essas páginas de índice podem ser referenciadas com o papel :rst:role:`ref` combinando o nome de domínio e o valor do índice ``name``. Por exemplo, ``RecipeIndex`` pode ser referenciado com ``:ref:`recipe-recipe``` e ``IngredientIndex`` pode ser referenciado com ``:ref:`recipe-ingredient```.
zh_cn: 可以通过将域名和索引 ``name`` 值组合来使用 :rst:role:`ref` 角色引用这些索引页面。例如，``RecipeIndex`` 可以使用 ``:ref:`recipe-recipe``` 引用，``IngredientIndex`` 可以使用 ``:ref:`recipe-ingredient``` 引用。

source: The domain
pt_br: O domínio
zh_cn: 域

source: A Sphinx domain is a specialized container that ties together roles, directives, and indices, among other things. Let's look at the domain we're creating here.
pt_br: Um domínio do Sphinx é um contêiner especializado que une papéis, diretivas e índices, entre outras coisas. Vejamos o domínio que estamos criando aqui.
zh_cn: Sphinx 域是一个专门的容器，将角色，指令和索引等联系在一起。现在， 让我们一起看看我们在这里创建的域。

source: There are some interesting things to note about this ``recipe`` domain and domains in general. Firstly, we actually register our directives, roles and indices here, via the ``directives``, ``roles`` and ``indices`` attributes, rather than via calls later on in ``setup``. We can also note that we aren't actually defining a custom role and are instead reusing the :class:`sphinx.roles.XRefRole` role and defining the :class:`sphinx.domains.Domain.resolve_xref` method. This method takes two arguments, ``typ`` and ``target``, which refer to the cross-reference type and its target name. We'll use ``target`` to resolve our destination from our domain's ``recipes`` because we currently have only one type of node.
pt_br: Há algumas coisas interessantes a serem observadas sobre este domínio de ``recipe`` e sobre os domínios em geral. Primeiramente, nós registramos nossas diretivas, papéis e índices aqui, através dos atributos ``directives``, ``roles`` e ``indices``, ao invés de através de chamadas posteriores em ``setup``. Também podemos notar que não estamos realmente definindo um papel personalizado e, em vez disso, estamos reutilizando o papel :class:`sphinx.roles.XRefRole` e definindo o método :class:`sphinx.domains.Domain.resolve_xref`. Este método recebe dois argumentos, ``typ`` e ``target``, que se referem ao tipo de referência cruzada e seu nome de alvo. Usaremos ``target`` para resolver nosso alvo a partir de ``recipes`` de nosso domínio porque atualmente temos apenas um tipo de nó.
zh_cn: 关于此“recipe”域和一般域，需要注意一些有趣的事情。 首先，我们实际上通过“ directives”，“ roles”和“indices”属性在此处注册我们的指令，角色和索引，而不是通过稍后在“ setup”中进行调用。 我们还可以注意到，我们实际上不是在定义自定义角色，而是在重用 :class:`sphinx.roles.XRefRole` 角色并定义 :class:`sphinx.domains.Domain.resolve_xref` 方法。 此方法采用两个参数 ``typ`` 和 ``target``，它们引用交叉引用类型及其目标名称。因为我们目前只有一种类型的节点，所以我们将使用 ``target`` 来从域的 ``recipes`` 中解析出目的地。

source: Moving on, we can see that we've defined ``initial_data``. The values defined in ``initial_data`` will be copied to ``env.domaindata[domain_name]`` as the initial data of the domain, and domain instances can access it via ``self.data``. We see that we have defined two items in ``initial_data``: ``recipes`` and ``recipe_ingredients``. Each contains a list of all objects defined (i.e. all recipes) and a hash that maps a canonical ingredient name to the list of objects. The way we name objects is common across our extension and is defined in the ``get_full_qualified_name`` method. For each object created, the canonical name is ``recipe.<recipename>``, where ``<recipename>`` is the name the documentation writer gives the object (a recipe). This enables the extension to use different object types that share the same name. Having a canonical name and central place for our objects is a huge advantage. Both our indices and our cross-referencing code use this feature.
pt_br: Seguindo em frente, podemos ver que definimos ``initial_data``. Os valores definidos em ``initial_data`` serão copiados para ``env.domaindata[domain_name]`` como os dados iniciais do domínio, e as instâncias do domínio podem acessá-los via ``self.data``. Vemos que definimos dois itens em ``initial_data``: ``recipes`` e ``recipe_ingredients``. Cada um contém uma lista de todos os objetos definidos (ou seja, todas as receitas) e um hash que mapeia o nome de um ingrediente canônico para a lista de objetos. A forma como nomeamos objetos é comum em nossa extensão e é definida no método ``get_full_qualified_name``. Para cada objeto criado, o nome canônico é ``recipe.<recipename>``, onde ``<recipename>`` é o nome que o redator da documentação dá ao objeto (uma receita). Isso permite que a extensão use diferentes tipos de objetos que compartilham o mesmo nome. Ter um nome canônico e um local central para nossos objetos é uma grande vantagem. Tanto nossos índices quanto nosso código de referência cruzada usam esse recurso.
zh_cn: 继续前进，我们可以看到我们定义了 ``initial_data`` 。在 ``initial_data`` 中定义的值将被复制到 ``env.domaindata[domain_name]`` 作为域的初始数据，，域实例可以通过 ``self.data`` 访问它。我们看到我们在 ``initial_data`` 中定义了两个项目： ``recipes`` 和 ``recipe_ingredients`` 。每个都包含所有定义的对象的列表（即所有食谱）和将规范成分名称映射到对象列表的哈希。我们命名对象的方式在我们的扩展中是通用的，并且在 ``get_full_qualified_name`` 方法中定义。对于创建的每个对象，规范名称为 ``recipe.<recipename>``，其中 ``<recipename>`` 是文档编写者给对象（食谱）命名的名称。这使扩展能够使用共享同一名称的不同对象类型。拥有规范名称和对象的中心位置是一个巨大的优势。我们的索引和交叉引用代码都使用此功能。

source: The ``setup`` function
pt_br: A função ``setup``
zh_cn: setup()函数

source: :ref:`As always <tutorial-extend-build>`, the ``setup`` function is a requirement and is used to hook the various parts of our extension into Sphinx. Let's look at the ``setup`` function for this extension.
pt_br: :ref:`Como sempre <tutorial-extend-build>`, a função ``setup`` é um requisito e é usada para conectar as várias partes de nossa extensão ao Sphinx. Vejamos a função ``setup`` para esta extensão.
zh_cn: :ref:`As always <tutorial-extend-build>`， ``setup`` 函数是一个必需的函数，用于将扩展的各个部分连接到 Sphinx。让我们来看看此扩展的 ``setup`` 函数。

source: This looks a little different to what we're used to seeing. There are no calls to :meth:`~Sphinx.add_directive` or even :meth:`~Sphinx.add_role`. Instead, we have a single call to :meth:`~Sphinx.add_domain` followed by some initialization of the :doc:`standard domain </usage/domains/standard>`. This is because we had already registered our directives, roles and indexes as part of the directive itself.
pt_br: Isso parece um pouco diferente do que estamos acostumados a ver. Não há chamadas para :meth:`~Sphinx.add_directive` ou mesmo :meth:`~Sphinx.add_role`. Em vez disso, temos uma única chamada para :meth:`~Sphinx.add_domain` seguida por alguma inicialização do :doc:`domínio padrão </usage/domains/standard>`. Isso ocorre porque já havíamos registrado nossas diretivas, papéis e índices como parte da própria diretiva.
zh_cn: 这看起来与我们习惯看到的有些不同。没有对 :meth:`~Sphinx.add_directive` 或甚至 :meth:`~Sphinx.add_role` 的调用。相反，我们对 :meth:`~Sphinx.add_domain` 进行了单次调用，后跟对 :doc:`standard domain </usage/domains/standard>` 的一些初始化。这是因为我们已经将指令，角色和索引作为指令本身的一部分进行了注册。

source: Using the extension
pt_br: Usando a extensão
zh_cn: 使用扩展

source: You can now use the extension throughout your project. For example:
pt_br: Agora você pode usar a extensão em todo o seu projeto. Por exemplo:
zh_cn: 现在，您可以在整个项目中使用扩展名。例如：

source: The important things to note are the use of the ``:recipe:ref:`` role to cross-reference the recipe actually defined elsewhere (using the ``:recipe:recipe:`` directive).
pt_br: As coisas importantes a serem observadas são o uso do papel ``:recipe:ref:`` para fazer referência cruzada da receita realmente definida em outro lugar (usando a diretiva ``:recipe:recipe:``).
zh_cn: 需要注意的重要事项是使用 ``:recipe:ref:`` 角色来交叉引用实际上在其他地方定义的食谱（使用 ``:recipe:recipe:`` 指令）。

source: Further reading
pt_br: Leitura adicional
zh_cn: 延伸阅读

source: For more information, refer to the `docutils`_ documentation and :doc:`/extdev/index`.
pt_br: Para mais informações, consulte a documentação do `docutils`_ e de :doc:`/extdev/index`.
zh_cn: 有关更多信息，请参考 `docutils`_ 文档和 :doc:`/extdev/index`。

source: If you wish to share your extension across multiple projects or with others, check out the :ref:`third-party-extensions` section.
pt_br: Se você deseja compartilhar sua extensão entre vários projetos ou com outras pessoas, confira a seção :ref:`third-party-extensions`.
zh_cn: 如果您希望在多个项目或与其他人共享您的扩展，请查看 :ref:`third-party-extensions` 部分。
