Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/development/tutorials/autodoc_ext.po
Languages: pt_br

source: Developing autodoc extensions
pt_br: Desenvolvendo extensões autodoc

source: The objective of this tutorial is to create an extension that adds support for new type for autodoc. This autodoc extension will format the ``IntEnum`` class from Python standard library. (module ``enum``)
pt_br: O objetivo deste tutorial é criar uma extensão que adicione suporte a novos tipos de autodoc. Esta extensão autodoc irá formatar a classe ``IntEnum`` da biblioteca padrão do Python. (módulo ``enum``)

source: Overview
pt_br: Visão geral

source: We want the extension that will create auto-documentation for IntEnum. ``IntEnum`` is the integer enum class from standard library ``enum`` module.
pt_br: Queremos a extensão que criará documentação automática para IntEnum. ``IntEnum`` é a classe enum inteira do módulo ``enum`` da biblioteca padrão.

source: Currently this class has no special auto documentation behavior.
pt_br: Atualmente esta classe não possui nenhum comportamento especial de documentação automática.

source: We want to add following to autodoc:
pt_br: Queremos adicionar o seguinte ao autodoc:

source: A new ``autointenum`` directive that will document the ``IntEnum`` class.
pt_br: Uma nova diretiva ``autointenum`` que documentará a classe ``IntEnum``.

source: The generated documentation will have all the enum possible values with names.
pt_br: A documentação gerada terá todos os valores possíveis de enum com nomes.

source: The ``autointenum`` directive will have an option ``:hex:`` which will cause the integers be printed in hexadecimal form.
pt_br: A diretiva ``autointenum`` terá uma opção ``:hex:`` que fará com que os inteiros sejam impressos em formato hexadecimal.

source: Prerequisites
pt_br: Pré-requisitos

source: We need the same setup as in :ref:`the previous extensions <tutorial-extend-build>`. This time, we will be putting out extension in a file called :file:`autodoc_intenum.py`. The :file:`my_enums.py` will contain the sample enums we will document.
pt_br: Precisamos da mesma configuração que em :ref:`as extensões anteriores <tutorial-extend-build>`. Desta vez, colocaremos a extensão em um arquivo chamado :file:`autodoc_intenum.py`. O :file:`my_enums.py` vai conter a amostra de enums que vamos documentar.

source: Here is an example of the folder structure you might obtain:
pt_br: Aqui está um exemplo da estrutura de pastas que você pode obter:

source: Writing the extension
pt_br: Escrevendo a extensão

source: Start with ``setup`` function for the extension.
pt_br: Comece com a função ``setup`` para a extensão.

source: The :meth:`~sphinx.application.Sphinx.setup_extension` method will pull the autodoc extension because our new extension depends on autodoc. :meth:`~sphinx.application.Sphinx.add_autodocumenter` is the method that registers our new auto documenter class.
pt_br: O método :meth:`~sphinx.application.Sphinx.setup_extension` extrairá a extensão autodoc porque nossa nova extensão depende do autodoc. :meth:`~sphinx.application.Sphinx.add_autodocumenter` é o método que registra nossa nova classe de documentador automático.

source: We want to import certain objects from the autodoc extension:
pt_br: Queremos importar certos objetos da extensão autodoc:

source: There are several different documenter classes such as ``MethodDocumenter`` or ``AttributeDocumenter`` available in the autodoc extension but our new class is the subclass of ``ClassDocumenter`` which a documenter class used by autodoc to document classes.
pt_br: Existem várias classes documentadoras diferentes, como ``MethodDocumenter`` ou ``AttributeDocumenter`` disponíveis na extensão autodoc, mas nossa nova classe é a subclasse de ``ClassDocumenter`` que é uma classe documentadora usada pelo autodoc para documentar classes.

source: This is the definition of our new the auto-documenter class:
pt_br: Esta é a definição da nossa nova classe auto-documentadora:

source: Important attributes of the new class:
pt_br: Atributos importantes da nova classe:

source: This attribute determines the ``auto`` directive name. In this case the auto directive will be ``autointenum``.
pt_br: Este atributo determina o nome da diretiva ``auto``. Neste caso a diretiva auto será ``autointenum``.

source: This attribute sets the generated directive name. In this example the generated directive will be ``.. :py:class::``.
pt_br: Este atributo define o nome da diretiva gerada. Neste exemplo a diretiva gerada será ``.. :py:class::``.

source: the larger the number the higher is the priority. We want our documenter be higher priority than the parent.
pt_br: quanto maior o número, maior é a prioridade. Queremos que nosso documentador tenha maior prioridade que o pai.

source: option specifications. We copy the parent class options and add a new option *hex*.
pt_br: especificações da opção. Copiamos as opções da classe pai e adicionamos uma nova opção *hex*.

source: Overridden members:
pt_br: Membros substituídos:

source: This member is important to override. It should return *True* when the passed object can be documented by this class.
pt_br: É importante substituir esse membro. Deve retornar *True* quando o objeto passado puder ser documentado por esta classe.

source: This method generates the directive header. We add **:final:** directive option. Remember to call **super** or no directive will be generated.
pt_br: Este método gera o cabeçalho da diretiva. Adicionamos a opção de diretiva **:final:**. Lembre-se de chamar **super** ou nenhuma diretiva será gerada.

source: This method generates the body of the class documentation. After calling the super method we generate lines for enum description.
pt_br: Este método gera o corpo da documentação da classe. Depois de chamar o super método, geramos linhas para descrição de enum.

source: Using the extension
pt_br: Usando a extensão

source: You can now use the new autodoc directive to document any ``IntEnum``.
pt_br: Agora você pode usar a nova diretiva de autodoc para documentar qualquer ``IntEnum``.

source: For example, you have the following ``IntEnum``:
pt_br: Por exemplo, você tem o seguinte ``IntEnum``:

source: This will be the documentation file with auto-documentation directive:
pt_br: Este será o arquivo de documentação com diretiva de documentação automática:

source: Further reading
pt_br: Leitura adicional

source: If you wish to share your extension across multiple projects or with others, check out the :ref:`third-party-extensions` section.
pt_br: Se você deseja compartilhar sua extensão entre vários projetos ou com outras pessoas, confira a seção :ref:`third-party-extensions`.
