Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/ext/intersphinx.po
Languages: pt_br

source: :mod:`sphinx.ext.intersphinx` -- Link to other projects' documentation
pt_br: :mod:`sphinx.ext.intersphinx` -- Link para documentação outros projetos

source: This extension can generate automatic links to the documentation of objects in other projects.
pt_br: Essa extensão pode gerar automaticamente links para documetação de objetos em outros projetos.

source: Usage is simple: whenever Sphinx encounters a cross-reference that has no matching target in the current documentation set, it looks for targets in the documentation sets configured in :confval:`intersphinx_mapping`. A reference like ``:py:class:`zipfile.ZipFile``` can then link to the Python documentation for the ZipFile class, without you having to specify where it is located exactly.
pt_br: Usar é simples: onde o Sphinx encontrar referência cruzada que estiver atendida no corrente documento, irá buscar por alvos no conjunto de documentos configurados em :confval:`intersphinx_mapping`. Referência como ``:py:class:`zipfile.ZipFile``` irá referir a doc. Python de Classe ZipFile, sem conhecer onde ela está localizada.

source: When using the "new" format (see below), you can even force lookup in a foreign set by prefixing the link target appropriately. A link like ``:ref:`comparison manual <python:comparisons>``` will then link to the label "comparisons" in the doc set "python", if it exists.
pt_br: Quando usando o novo formato (ver abaixo), poderá ser forçada a busca conjunto estrangeiro, configurando apropriadamente o prefixo ao link alvo. Um link como ``:ref:`manual comparação <python:comparisons>``` irá ligar o label "comparação" no doc "python", se existir.

source: Behind the scenes, this works as follows:
pt_br: Por trás do palco, isso funciona como:

source: Each Sphinx HTML build creates a file named :file:`objects.inv` that contains a mapping from object names to URIs relative to the HTML set's root.
pt_br: Cada Sphinx HTML constrói um nome de arquivo chamado :file:`objects.inv` que contém o mapeamento dos nomes de objetos para URIs relativas a conjunto raiz HTML.

source: Projects using the Intersphinx extension can specify the location of such mapping files in the :confval:`intersphinx_mapping` config value. The mapping will then be used to resolve otherwise missing references to objects into links to the other documentation.
pt_br: Projetos usando extensão InterSphinx podem especificar a localização desses arquivos de mapeamento na configuração :confval:`intersphinx_mapping`. O mapeamento irá então ser usado para resolver referências a objetos inexistentes em links para outra documentação.

source: By default, the mapping file is assumed to be at the same location as the rest of the documentation; however, the location of the mapping file can also be specified individually, e.g. if the docs should be buildable without Internet access.
pt_br: Por padrão, o mapeamento arquivo é assumido como na mesma localização da documentação; entretanto o local do mapeamento do arquivo também pode ser especificado individualmente, ex. se o documento for construído sem acesso a internet.

source: To use intersphinx linking, add ``'sphinx.ext.intersphinx'`` to your :confval:`extensions` config value, and use these new config values to activate linking:
pt_br: Para usar link intersphinx, adicionar ``'sphinx.ext.intersphinx'`` em seus valores de :confval:`extensions` e usar esses novos valores para ativar os links:

source: This config value contains the locations and names of other projects that should be linked to in this documentation.
pt_br: Esse valor config. irá conter os locais e nomes de outros projetos que podem ser ligadas a essa documentação.

source: Relative local paths for target locations are taken as relative to the base of the built documentation, while relative local paths for inventory locations are taken as relative to the source directory.
pt_br: Caminhos e locais relativos são assumidos como relativos a documentação base, enquanto caminhos relativos em locais inventariados são relativos ao diretório fonte.

source: When fetching remote inventory files, proxy settings will be read from the ``$HTTP_PROXY`` environment variable.
pt_br: Quando recuperando arquivos remotos, configurações de proxy irão ser lidas da variável de ambiente ``$HTTP_PROXY``.

source: **Old format for this config value**
pt_br: **Formato antigo dessa configuração**

source: This is the format used before Sphinx 1.0. It is still recognized.
pt_br: Esse é o formato usado para config antes do Sphinx 1.0. E permanece válido.

source: A dictionary mapping URIs to either ``None`` or an URI. The keys are the base URI of the foreign Sphinx documentation sets and can be local paths or HTTP URIs. The values indicate where the inventory file can be found: they can be ``None`` (at the same location as the base URI) or another local or HTTP URI.
pt_br: Um dicionário mapeando URIs para ``None`` ou para uma URI. As chaves são base da URI para conjuntos de documentação Externa e poder ser caminhos locais ou URIs HTTP. Os valores indicam onde o arquivo de inventário pode ser encontrado: pode ser ``None`` (mesmo local da base URI) ou outro local ou URI HTTP.

source: **New format for this config value**
pt_br: **Novo formato para configurar valores**

source: A dictionary mapping unique identifiers to a tuple ``(target, inventory)``. Each ``target`` is the base URI of a foreign Sphinx documentation set and can be a local path or an HTTP URI. The ``inventory`` indicates where the inventory file can be found: it can be ``None`` (at the same location as the base URI) or another local or HTTP URI.
pt_br: Dicionário mapeando indicadores únicos para par ``(alvo, inventário)``. Cada ``alvo`` é a URI base da chave do conjunto externo da documentação Sphinx e pode ter caminho URI HTTP. Já ``inventário`` indica onde o arquivo pode ser encontrado: ele pode ser ``Nenhum`` (na mesma localização da base URI) ou outro local ou URI HTTP.

source: The unique identifier can be used to prefix cross-reference targets, so that it is clear which intersphinx set the target belongs to. A link like ``:ref:`comparison manual <python:comparisons>``` will link to the label "comparisons" in the doc set "python", if it exists.
pt_br: Um identificador único pode ser usado para prefixar alvos referências cruzadas, desde que esteja claro a qual conjunto intersphinx pertença. Um link como ``:ref:`comparação manual <python:comparação>``` irá ligar rótulo "comparação" no conjunto doc "python", caso exista.

source: **Example**
pt_br: **Exemplo**

source: To add links to modules and objects in the Python standard library documentation, use::
pt_br: Para adicionar ligações aos módulos e objetos na biblioteca documentação padrão Python, usar::

source: This will download the corresponding :file:`objects.inv` file from the Internet and generate links to the pages under the given URI. The downloaded inventory is cached in the Sphinx environment, so it must be re-downloaded whenever you do a full rebuild.
pt_br: Isso irá baixar arquivo correspondente a :file:`objects.inv` da internet e gerar links para as páginas sob determinada URI. O respectivo inventário é mantido em cache no ambiente Sphinx, portanto deve ser baixado novamente quando fizer um rebuild completo.

source: A second example, showing the meaning of a non-``None`` value of the second tuple item::
pt_br: Segundo exemplo, exibindo o significado de um valor não ``None`` no segundo item do par::

source: This will read the inventory from :file:`python-inv.txt` in the source directory, but still generate links to the pages under ``https://docs.python.org/3.4``. It is up to you to update the inventory file as new objects are added to the Python documentation.
pt_br: Isso irá ler o inventário do :file:`python-inv.txt` na pasta fonte mas irá gerar links para páginas sob ``https://docs.python.org/3.4``. Cada um deve atualizar seu arquivo de inventário quando novos objetos são adicionados na documentação Python.

source: **Multiple target for the inventory**
pt_br: **Múltiplos alvos para inventário**

source: Alternative files can be specified for each inventory. One can give a tuple for the second inventory tuple item as shown in the following example. This will read the inventory iterating through the (second) tuple items until the first successful fetch. The primary use case for this to specify mirror sites for server downtime of the primary inventory::
pt_br: Arquivos alternativos podem ser especificados para cada inventário. Alguém pode ter um par como segunda opção como no seguinte exemplo. Irá ler o inventário interagindo através do segundo par do conjunto até que ocorra a primeira recuperação com sucesso. Uso principal disso é para especificar espelhos quando o servidor primário estiver fora de serviço::

source: The maximum number of days to cache remote inventories. The default is ``5``, meaning five days. Set this to a negative value to cache inventories for unlimited time.
pt_br: O número máximo de dias para manter em cache inventários. O padrão é ``5``, cinco dias. Valores negativos indicam tempo indeterminado.

source: The number of seconds for timeout. The default is ``None``, meaning do not timeout.
pt_br: O número de segundos para o tempo limite. O padrão é ``None``, ou seja, não sem tempo de limite.

source: timeout is not a time limit on the entire response download; rather, an exception is raised if the server has not issued a response for timeout seconds.
pt_br: o tempo limite não é um limite de tempo para todo o download da resposta; em vez disso, uma exceção é gerada se o servidor não tiver emitido uma resposta para os segundos de tempo limite.
