Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/ext/linkcode.po
Languages: pt_br

source: :mod:`sphinx.ext.linkcode` -- Add external links to source code
pt_br: :mod:`sphinx.ext.linkcode` - Adiciona links externos ao código-fonte

source: This extension looks at your object descriptions (``.. class::``, ``.. function::`` etc.) and adds external links to code hosted somewhere on the web. The intent is similar to the ``sphinx.ext.viewcode`` extension, but assumes the source code can be found somewhere on the Internet.
pt_br: Essa extensão examina as descrições de objetos (``.. class::``, ``.. function::`` etc.) e adiciona links externos ao código hospedado em algum lugar da web. A intenção é semelhante à extensão ``sphinx.ext.viewcode``, mas assume que o código-fonte pode ser encontrado em algum lugar na Internet.

source: In your configuration, you need to specify a :confval:`linkcode_resolve` function that returns an URL based on the object.
pt_br: Em sua configuração, você precisa especificar uma função :confval:`linkcode_resolve` que retorna uma URL baseada no objeto.

source: This is a function ``linkcode_resolve(domain, info)``, which should return the URL to source code corresponding to the object in given domain with given information.
pt_br: Esta é uma função ``linkcode_resolve(domain, info)``, que deve retornar a URL para o código-fonte correspondente ao objeto em determinado domínio com informações dadas.

source: The function should return ``None`` if no link is to be added.
pt_br: A função deve retornar ``None`` se nenhum link for adicionado.

source: The argument ``domain`` specifies the language domain the object is in. ``info`` is a dictionary with the following keys guaranteed to be present (dependent on the domain):
pt_br: O argumento ``domain`` especifica o domínio da linguagem em que o objeto está. ``info`` é um dicionário com as seguintes chaves garantidas para estarem presentes (dependendo do domínio):

source: ``py``: ``module`` (name of the module), ``fullname`` (name of the object)
pt_br: ``py``: ``module`` (nome do módulo), ``fullname`` (nome do objeto)

source: ``c``: ``names`` (list of names for the object)
pt_br: ``c``: ``names`` (lista de nomes para o objeto)

source: ``cpp``: ``names`` (list of names for the object)
pt_br: ``cpp``: ``names`` (lista de nomes para o objeto)

source: ``javascript``: ``object`` (name of the object), ``fullname`` (name of the item)
pt_br: ``javascript``: ``object`` (nome do objeto), ``fullname`` (nome do item)

source: Example:
pt_br: Exemplo:
