Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/ext/math.po
Languages: ja, pt_br

source: Math support in Sphinx
ja: Sphinxにおける数式のサポート
pt_br: Suporte Math no Sphinx

source: Since mathematical notation isn't natively supported by HTML in any way, Sphinx supports math in documentation with several extensions.
ja: HTMLでは、ネイティブでは数式の記法はサポートされていません。Sphinxでは、ドキュメントの中に数式を表現するための拡張機能をいくつかサポートしています。
pt_br: Como notação matemática não é nativamente suportada por HTML, Sphinx suporta notação matemática em diversas extensões.

source: The basic math support is contained in :mod:`sphinx.ext.mathbase`. Other math support extensions should, if possible, reuse that support too.
ja: 基礎的な数式サポートは、 :mod:`sphinx.ext.mathbase` に含まれています。他に数式をサポートを行うための拡張機能を作成する場合には、使用できるのであれば、このモジュールを再利用してください。
pt_br: O suporte básico a matemática esta contido em :mod:`sphinx.ext.mathbase`. Suporte a outras extensões podem haver e se possível reutilize esse suporte.

source: :mod:`.mathbase` is not meant to be added to the :confval:`extensions` config value, instead, use either :mod:`sphinx.ext.imgmath` or :mod:`sphinx.ext.mathjax` as described below.
ja: :mod:`mathbase` は :confval:`extensions` の設定値に追加しないでください。追加するのは代わりに、これから説明を行う :mod:`sphinx.ext.imgmath` もしくは :mod:`sphinx.ext.mathjax` を設定してください。
pt_br: :mod:`.mathbase` não precisa ser necessariamente ter um valor em config :confval:`extensions`, ao invés pode ser usado :mod:`sphinx.ext.imgmath` ou :mod:`sphinx.ext.mathjax` como descrito abaixo.

source: The input language for mathematics is LaTeX markup. This is the de-facto standard for plain-text math notation and has the added advantage that no further translation is necessary when building LaTeX output.
ja: 数式の入力言語としてはLaTeXのマークアップを利用します。これはプレーンテキストで数式を表現する記法としてはデファクトスタンダードになっています。また、LaTeX出力を行う場合には、変換をしないでそのまま利用できるというメリットもあります。
pt_br: A linguagem de entrada para matemática é marcação LaTeX. É de fato um padrão para notação matemática em texto simples e possui a vantagem de não precisar de tradução adicional para saída LaTeX.

source: Keep in mind that when you put math markup in **Python docstrings** read by :mod:`autodoc <sphinx.ext.autodoc>`, you either have to double all backslashes, or use Python raw strings (``r"raw"``).
ja: :mod:`autodoc <sphinx.ext.autodoc>` で読み込まれた **Python docstrings** の中に数式を入れるときには、すべてのバックスラッシュを二重にするか、Pythonのraw strings (``r"raw"``) を使う必要があることに注意してください。
pt_br: Lembre-se quando introduzir simbolos matemáticos em **Python docstrings** lidas por :mod:`autodoc <sphinx.ext.autodoc>`, deve usar ou duplas barras invertidas ou usar string Python do tipo raw (``r"raw"``).

source: :mod:`.mathbase` provides the following config values:
ja: :mod:`.mathbase` では以下の値が設定できます:
pt_br: :mod:`.mathbase` fornece os seguintes valores de config:

source: Set this option to ``True`` if you want all displayed math to be numbered. The default is ``False``.
ja: もし表示されるすべての数式に番号を振りたい場合、このオプションを ``True`` にします。デフォルトでは ``False`` です。
pt_br: Defina essa opção para ``True`` se deseja exibir numeração. O padrão é ``False``.

source: A string that are used for format of label of references to equations. As a special character, ``{number}`` will be replaced to equaition number.
ja: 文字列は式への参照を示すラベル書式として扱われます。特別な文字として、``{number}``は式番号に置き換えられます。

source: Example: ``'Eq.{number}'`` is rendered as ``Eq.10``
ja: 例: ``'Eq.{number}'`` は ``Eq.10``として表示されます。

source: If ``True``, displayed math equations are numbered across pages when :confval:`numfig` is enabled. The :confval:`numfig_secnum_depth` setting is respected. The :rst:role:`eq`, not :rst:role:`numref`, role must be used to reference equation numbers. Default is ``True``.
ja: ``True`` にすると、:confval:`numfig` が有効になっているとき、表示される数式がページをまたいで番号づけられます。 :confval:`numfig_secnum_depth` 設定は尊重されます。数式の参照には、 :rst:role:`numref` ではなく、 :rst:role:`eq` ロールを使わなければなりません。デフォルトは ``True`` です。

source: :mod:`.mathbase` defines these new markup elements:
ja: :mod:`.mathbase` は以下の新しいマークアップの要素を定義しています:
pt_br: :mod:`.mathbase` define esses elementos novos de marcação.

source: Role for inline math. Use like this::
ja: インラインの数式のロールです。以下のようにして使用します::
pt_br: Role para math inline. Use assim::

source: Directive for displayed math (math that takes the whole line for itself).
ja: 数式を表示するディレクティブです。この数式は１行丸ごと使って表示されます。
pt_br: Diretiva para math exibida (math controla toda a linha por si).

source: The directive supports multiple equations, which should be separated by a blank line::
ja: このディレクティブは、複数行の等式をサポートしています。複数行に記述したい場合には、空行で区切ります::
pt_br: A diretiva suporta múltiplas equações, que devem estar separadas por linhas em branco::

source: In addition, each single equation is set within a ``split`` environment, which means that you can have multiple aligned lines in an equation, aligned at ``&`` and separated by ``\\``::
ja: それぞれの数式は ``分割された`` 環境にセットされます。もしも、複数行の等式をきれいに整列させたい場合には、 ``\\`` で区切って、 ``&`` 記号を使って整列させます::
pt_br: Adicionalmente, cada simples equação é configurada com ambiente ``split``, que significa que deve haver múltiplas linhas alinhadas na equação, alinhada em ``&`` e separada por ``\\``::

source: For more details, look into the documentation of the `AmSMath LaTeX package`_.
ja: もっと詳しく知りたい場合には `AmSMath LaTeX パッケージ`_ のドキュメントを参照してください。
pt_br: Para maiores detalhes, veja a documentação em `AmSMath LaTeX package`_.

source: When the math is only one line of text, it can also be given as a directive argument::
ja: 数式が一行のテキストに収まる場合には、ディレクティブの引数として記述もできます::
pt_br: Quando math é somente uma linha de texto, também pode ser usada como argumento de diretiva::

source: Normally, equations are not numbered. If you want your equation to get a number, use the ``label`` option. When given, it selects an internal label for the equation, by which it can be cross-referenced, and causes an equation number to be issued. See :rst:role:`eq` for an example. The numbering style depends on the output format.
ja: 通常、数式には番号が付きません。数式に番号をつけたい場合は、 ``label`` オプションを使用してください。これが指定されると、数式のラベルを選択できます。この数式のラベルを使ってクロスリファレンスを作成することができます。例は :rst:role:`eq` を参照してください。ナンバリングの形式は出力フォーマットに依存します。

source: There is also an option ``nowrap`` that prevents any wrapping of the given math in a math environment. When you give this option, you must make sure yourself that the math is properly set up. For example::
ja: ``nowrap`` オプションを使用することで、math環境で自動的にラッピングされるのを止めることができます。このオプションを指定した場合には、自分自身で適切な設定を行う必要があります。 サンプル::
pt_br: Também existe uma opção ``nowrap`` que previne qualquer quebra no ambiente math. Quando usar essa opção, certifique-se que math está configurada corretamente. Por exemplo::

source: Role for cross-referencing equations via their label. Example::
ja: 数式のラベルに対する、クロスリファレンスを行うためのロールです。例::

source: :mod:`sphinx.ext.imgmath` -- Render math as images
ja: :mod:`sphinx.ext.imgmath` -- 数式を画像にレンダリングします
pt_br: :mod:`sphinx.ext.imgmath` -- Renderizar math com imagens

source: This extension renders math via LaTeX and dvipng_ or dvisvgm_ into PNG or SVG images. This of course means that the computer where the docs are built must have both programs available.
ja: この拡張機能は LaTeX と dvipng_ または dvisvg_ を用い、数式を PNG または SVG 画像に変換します。当然ながら文書をビルドするコンピュータではこれらのプログラムが動作する必要があります。
pt_br: Essa extensão renderiza math via LaTeX e dvipng_ ou dvisvgm_ em imagens PNG ou SVG. Isso significa que no computador onde esses documentos serão construídos, devem ter esses programas disponíveis.

source: There are various config values you can set to influence how the images are built:
ja: この拡張用の設定値がいくつかあります。これらの設定値を変更することで、画像のビルドをカスタマイズしたりできます:
pt_br: Existem diversos valores config que podem ser usados para influenciar como imagens são construídas:

source: The output image format. The default is ``'png'``. It should be either ``'png'`` or ``'svg'``.
ja: 出力する画像のフォーマット。デフォルトは ``'png'`` です。 ``'png'`` または ``'svg'`` のいずれかの値をとります。
pt_br: O formato de saída da imagem. O padrão é ``'png'``. Pode ser ou ``'png'`` ou ``'svg'``.

source: The command name with which to invoke LaTeX. The default is ``'latex'``; you may need to set this to a full path if ``latex`` is not in the executable search path.
ja: LaTeXを呼び出す場合のコマンド名です。デフォルトでは ``'latex'`` となります。もしも ``latex`` コマンドが実行ファイルの検索パスにない場合には、フルパスを指定する必要があります。
pt_br: O nome do comando com o qual chamamos LaTeX. O padrão é ``'latex'``; pode ser necessário configurar o caminho completo, caso não esteja na variável PATH.

source: Since this setting is not portable from system to system, it is normally not useful to set it in ``conf.py``; rather, giving it on the :program:`sphinx-build` command line via the :option:`-D <sphinx-build -D>` option should be preferable, like this::
ja: この設定はシステム間で共通にはできないため、``conf.py`` の中で設定することは通常行いません。むしろ、次のように :program:`sphinx-build` コマンドの :option:`-D <sphinx-build -D>` オプションとして与えるほうが望ましいでしょう。 ::
pt_br: Como essa configuração não é portável de um sistema para outro, não é muito útil configurar no ``conf.py``; em vez disso, use o comando do :program:`sphinx-build` via :option:`-D <sphinx-build -D>` é mais eficaz, como isso::

source: This value should only contain the path to the latex executable, not further arguments; use :confval:`imgmath_latex_args` for that purpose.
ja: この値にはLaTeXの実行ファイルのパスだけを含むようにして下さい。LaTeXに追加で渡したい引数は、こちらに入れないで、 :confval:`imgmath_latex_args` を使用してください。
pt_br: Esse valor deve conter somente o PATH para o programa LaTeX executável, sem nenhum argumento; usar :confval:`imgmath_latex_args` para esse propósito.

source: The command name with which to invoke ``dvipng``. The default is ``'dvipng'``; you may need to set this to a full path if ``dvipng`` is not in the executable search path. This option is only used when ``imgmath_image_format`` is set to ``'png'``.
ja: ``dvipng`` を呼び出す時のコマンド名です。デフォルト値は ``'dvipng'`` です。もしも ``dvipng`` が実行ファイルの検索パス外にある場合には、絶対パスを指定してください。このオプションは``imgmath_image_format`` が ``'png'`` の場合にのみ有効です。
pt_br: O nome do comando com o qual chamamos ``dvipng``. O padrão é ``'dvipng'``; pode ser necessário definir o caminho integral se ``dvipng`` não estiver no caminho executável. Essa opção só é usada quando ``imgmath_image_format`` é definida para ``'png'``.

source: The command name with which to invoke ``dvisvgm``. The default is ``'dvisvgm'``; you may need to set this to a full path if ``dvisvgm`` is not in the executable search path. This option is only used when ``imgmath_image_format`` is ``'svg'``.
ja: ``dvisvgm`` を呼び出す時のコマンド名です。デフォルト値は ``'dvisvgm'`` です。もしも ``dvisvgm`` が実行ファイルの検索パス外にある場合には、絶対パスを指定してください。このオプションは``imgmath_image_format`` が ``'svg'`` の場合にのみ有効です。
pt_br: O nome do comando com o qual chamamos ``dvisvgm``. O padrão é ``'dvisvgm'``; pode ser necessário configurar o caminho integral se ``dvisvgm`` não estiver no caminho executável. Essa opção só é usada quando ``imgmath_image_format`` é ``'svg'``.

source: Additional arguments to give to latex, as a list. The default is an empty list.
ja: LaTeXに渡す追加の引数です。リストで渡します。デフォルト値は空のリストになります。
pt_br: Argumentos adicionais passados para latex, como uma lista. O padrão é uma lista vazia.

source: Additional LaTeX code to put into the preamble of the short LaTeX files that are used to translate the math snippets. This is empty by default. Use it e.g. to add more packages whose commands you want to use in the math.
ja: 数式のコード片を変換するのに使用する、短いLaTeXファイルの中の前置きとして入れる、追加のLaTeXコードです。デフォルトでは空です。このオプションは、例えば、数式の中で使いたいコマンドのためのパッケージを追加するのに使えます。
pt_br: Código adicional LaTeX para o pequeno preâmbulo dos arquivos LaTeX usados para traduzir snippets math. Está vazio por padrão. Use para adicionar mais comandos nos pacotes que deseja utilizar em math.

source: Additional arguments to give to dvipng, as a list. The default value is ``['-gamma', '1.5', '-D', '110', '-bg', 'Transparent']`` which makes the image a bit darker and larger then it is by default, and produces PNGs with a transparent background. This option is used only when ``imgmath_image_format`` is ``'png'``.
ja: dvipngに与える、追加の引数をリストで渡します。デフォルト値は ``['-gamma', '1.5', '-D', '110', '-bg', 'Transparent']`` で、画像をデフォルトよりも、多少暗く、サイズは少々大きく、背景を透過にしたPNGを生成します。このオプションは``imgmath_image_format`` が ``'png'`` の場合にのみ有効です。
pt_br: Argumentos adicionais para dvipng, como uma lista. O valor padrão é ``['-gamma', '1.5', '-D', '110', '-bg', 'Transparent']`` o que produz imagens mais escuras e largas que o padrão e produz PNG com fundo transparente. Essa opção é usada somente quando ``imgmath_image_format`` é ``'png'``.

source: Additional arguments to give to dvisvgm, as a list. The default value is ``['--no-fonts']``. This option is used only when ``imgmath_image_format`` is ``'svg'``.
ja: dvisvgmに与える、追加の引数をリストで渡します。デフォルト値は ``['--no-fonts']`` です。このオプションは``imgmath_image_format`` が ``'svg'`` の場合にのみ有効です。
pt_br: Argumentos adicionais para dvisvgm as a list. O valor padrão é ``['--no-fonts']``. Essa opção é usada somente quando ``imgmath_image_format`` é ``'svg'``.

source: ``dvipng`` has the ability to determine the "depth" of the rendered text: for example, when typesetting a fraction inline, the baseline of surrounding text should not be flush with the bottom of the image, rather the image should extend a bit below the baseline. This is what TeX calls "depth". When this is enabled, the images put into the HTML document will get a ``vertical-align`` style that correctly aligns the baselines.
ja: ``dvipng`` は、レンダリングされたテキストの"深さ"を決定できます。例えば、行の文章の中に分数を写植する場合、テキストのベースラインと、生成された画像の底辺の高さが同じであってはならず、画像はベースラインよりも少し低い位置になるべでしょう。これがTeXの世界でいう"深さ"です。もしもこのオプションが有効になっていると、ベースラインからの正しいオフセット量の ``垂直揃え`` のスタイルで画像が生成され、HTMLドキュメントに入れられます。
pt_br: ``dvipng`` tem a habilidade de determinar "depth" do texto renderizado: por exemplo quando produzindo uma fração dentro de uma linha básica cercada por texto não suplantada pela base da imagem, a imagem deve extender-se um pouco abaixo da linha inferior básica, a imagem será inserida em um documento HTML e terá um estilo ``vertical-align`` que adequadamente alinha linhas base.

source: Unfortunately, this only works when the `preview-latex package`_ is installed. Therefore, the default for this option is ``False``.
ja: 残念ながら、このオプションは、 `preview-latex package`_ がインストールされていなければ動作しません。そのため、デフォルトの値は ``False`` になっています。
pt_br: Esse trabalho só funciona quando o pacote `preview-latex package`_ está instalado. De outro modo essa opção é ``False``.

source: Currently this option is only used when ``imgmath_image_format`` is ``'png'``.
ja: 現在このオプションは``imgmath_image_format`` が ``'png'`` の場合にのみ有効です。
pt_br: Atualmente essa opção é usada somente quando ``imgmath_image_format`` é ``'png'``.

source: Default: ``True``. If false, do not add the LaTeX code as an "alt" attribute for math images.
ja: デフォルトは ``True`` 。Falseの時は、画像の"alt"属性に、LaTeXのコードを埋め込みません。
pt_br: Padrão ``True``. Se falso, não adicione código LaTeX com um atributo "alt" para imagens math.

source: The font size (in ``pt``) of the displayed math. The default value is ``12``. It must be a positive integer.
ja: 表示する数式のフォントサイズです(単位は ``pt``)。デフォルト値は ``12`` です。この値は正の整数値でなければなりません。
pt_br: O tamanho do fonte (em ``pt``) para math exibido. O padrão é ``12``. Deve ser um número positivo.

source: :mod:`sphinx.ext.mathjax` -- Render math via JavaScript
ja: :mod:`sphinx.ext.mathjax` -- JavaScriptを使った数式のレンダリング
pt_br: :mod:`sphinx.ext.mathjax` -- Renderizado via math JavaScript

source: This extension puts math as-is into the HTML files. The JavaScript package MathJax_ is then loaded and transforms the LaTeX markup to readable math live in the browser.
ja: この拡張機能は、HTMLの中に数式を埋め込みます。JavaScriptの MathJax_ パッケージは、ブラウザの中で、LaTeXのマークアップを読める数式に、動的に変換します。
pt_br: Essa extensão usa math as-is nos arquivos HTML. O pacote JavaScript MathJax_ é carregado e transforma marcações LaTeX em math lidas na hora no navegador.

source: Because MathJax (and the necessary fonts) is very large, it is not included in Sphinx.
ja: MathJax(と必要なフォント)はとても大きいため、これはSphinxには組み込まれていません。
pt_br: Como o MathJax (fontes necessários) é volumoso, ele não está incluído no Sphinx.

source: The path to the JavaScript file to include in the HTML files in order to load MathJax.
ja: HTMLにJSMathをロードして読み込ませるための、JavaScriptファイルへのパスを設定します。
pt_br: O caminho para arquivo JavaScript incluído no arquivo HTML que chama MathJax.

source: The default is the ``https://`` URL that loads the JS files from the `cdnjs`__ Content Delivery Network. See the `MathJax Getting Started page`__ for details. If you want MathJax to be available offline, you have to download it and set this value to a different path.
ja: デフォルトは``https://`` URLで、`cdnjs`__コンテントデリバリーネットワークから JSファイル群をロードします。詳しくは `MathJax Getting Started page`__を見てください。 MathJaxをオフラインで利用したい場合は、MathJaxをダウンロードし、この値を別のパスに設定しなければなりません。

source: The path can be absolute or relative; if it is relative, it is relative to the ``_static`` directory of the built docs.
ja: パスは、絶対パスでも相対パスでも指定ができます。相対パスの場合、ビルドした出力の ``_static`` ディレクトリへのパスになっています。
pt_br: O caminho pode ser absoluto ou relativo; se relativo, ele será em relação ao diretório ``_static`` onde foram construidos os documentos.

source: For example, if you put MathJax into the static path of the Sphinx docs, this value would be ``MathJax/MathJax.js``. If you host more than one Sphinx documentation set on one server, it is advisable to install MathJax in a shared location.
ja: 例えば、MathjaxをSphinxのstaticパスに置いた場合、この値は ``MathJax/MathJax.js`` となります。もし、一つ以上のSphinxドキュメントをサーバー上にホストしている場合、共通の場所にMathjaxをインストールしておくといいでしょう。
pt_br: Por exemplo, se colocar MathJax no caminho estático dos documentos Sphinx, seu valor pode ser ``MathJax/MathJax.js``. Caso seu host possua mais de um Sphinx definidos em um único servidor, é aconselhável usar um local compartilhado.

source: You can also give a full ``https://`` URL different from the CDN URL.
ja: また、CDN URLではなく別の ``https://`` 等で始まるURLを指定してもいいでしょう。

source: The options to script tag for mathjax. For example, you can set integrity option with following setting::
ja: mathjax における script タグへのオプションです。例えば、integrity オプションを次のように設定できます::

source: The default is empty (``{}``).
ja: デフォルトは空です (``{}``) 。

source: :mod:`sphinx.ext.jsmath` -- Render math via JavaScript
ja: :mod:`sphinx.ext.jsmath` -- JavaScriptを使用して数式をレンダリングします
pt_br: :mod:`sphinx.ext.jsmath` -- Renderiza math via JavaScript

source: This extension works just as the MathJax extension does, but uses the older package jsMath_. It provides this config value:
ja: この拡張機能はMathJax拡張と同じように動作しますが、古い jsMath_ パッケージを利用します。この拡張機能には、次のような設定があります。
pt_br: Essa extensão trabalho como a extensão MathJax, mas usa antigo pacote jsMath_. Permite valor de config:

source: The path to the JavaScript file to include in the HTML files in order to load JSMath. There is no default.
ja: HTMLにJSMathをロードして読み込ませるための、JavaScriptファイルへのパスを設定します。デフォルト値はありません。
pt_br: O caminho do arquivo JavaScript para incluir em arquivos HTML para carregar JSMath. Não há definição por padrão.

source: For example, if you put JSMath into the static path of the Sphinx docs, this value would be ``jsMath/easy/load.js``. If you host more than one Sphinx documentation set on one server, it is advisable to install jsMath in a shared location.
ja: もしもjsMathを、Sphinxのドキュメント内の静的ファイルのフォルダに置いたとしたら、この設定値は ``jsMath/easy/load.js`` になります。もしもSphinxのドキュメントをサーバ上に何セットも設置する場合には、共有の場所にjsMathをインストールするのが賢明でしょう。
pt_br: Por exemplo, para colocar JSMAth no caminho estático dos documentos Sphinx, esse valor de ser ``jsMath/easy/load.js``. Se em seu host há diversos conjuntos de Documentação Sphinx, é aconselhável instalar jsMath em local compartilhado.
