Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/extensions/duration.po
Languages: pt_br, zh_cn

source: :mod:`sphinx.ext.duration` -- Measure durations of Sphinx processing
pt_br: :mod:`sphinx.ext.duration` -- Mede durações de processamento do Sphinx
zh_cn: :mod:`sphinx.ext.duration` -- 测量Sphinx处理持续的时间

source: This extension measures durations of Sphinx processing when reading documents and is useful for inspecting what document is slowly built. Durations are printed to console at the end of the build and saved to a JSON file in the output directory by default.
pt_br: Esta extensão mede a duração do processamento do Sphinx durante a leitura de documentos e é útil para inspecionar quais documentos são construídos lentamente. As durações são exibidas no console ao final da construção e salvas em um arquivo JSON no diretório de saída por padrão.
zh_cn: 此扩展测量Sphinx处理持续的时间，对于检查构建缓慢的文档非常有用。在构建结束时在控制台输出统计结果，而且默认将结果保存到输出目录的一个json文件

source: Enable this extension by adding ``'sphinx.ext.duration'`` to the :confval:`extensions` list in your :file:`conf.py`:
pt_br: Habilite esta extensão adicionando ``'sphinx.ext.duration'`` à lista :confval:`extensions` no seu :file:`conf.py`:
zh_cn: 通过在 :file:`conf.py` 的 :confval:`extensions` 列表中添加 ``'sphinx.ext.duration'`` 来启用此扩展：

source: Configuration
pt_br: Configuração
zh_cn: 配置

source: Type
pt_br: Tipo
zh_cn: 类型

source: Default
pt_br: Padrão
zh_cn: 默认

source: Show the total reading duration in the build summary, e.g.:
pt_br: Mostra a duração total da leitura no resumo da construção, por exemplo:
zh_cn: 在构建摘要中显示总的读取持续时间，例如：

source: Show the slowest durations in the build summary. The durations are sorted in order from slowest to fastest. This prints up to :confval:`duration_n_slowest` durations, e.g.:
pt_br: Exibe as durações mais lentas no resumo de construção. As durações são classificadas em ordem crescente de lentidão. Isso exibe até :confval:`duration_n_slowest` durações, por exemplo:
zh_cn: 在构建摘要中显示最慢的持续时间。持续时间按从慢到快的顺序排序。这将打印最多 :confval:`duration_n_slowest` 个持续时间，例如：

source: Maximum number of slowest durations to show in the build summary when :confval:`duration_print_slowest` is enabled. By default, only the ``5`` slowest durations are shown. Set this to ``0`` to show all durations.
pt_br: Número máximo de durações mais lentas a serem exibidas no resumo da construção quando :confval:`duration_print_slowest` está ativado. Por padrão, apenas as ``5`` durações mais lentas são exibidas. Defina este valor como ``0`` para exibir todas as durações.
zh_cn: 启用 :confval:`duration_print_slowest` 时，在构建摘要中显示的最慢持续时间的最大数量。默认情况下，仅显示 ``5`` 个最慢的持续时间。将此值设置为 ``0`` 以显示所有持续时间。

source: Write all reading durations to a JSON file in the output directory The file contents are a map of the document names to reading durations, where document names are strings and durations are floats in seconds. Set this value to an empty string or ``None`` to disable writing the file, or set it to a relative path to customize it.
pt_br: Grava todas as durações de leitura em um arquivo JSON no diretório de saída. O conteúdo do arquivo é um mapeamento dos nomes dos documentos para as durações de leitura, onde os nomes dos documentos são strings e as durações são números de ponto flutuante em segundos. Defina este valor como uma string vazia ou ``None`` para desativar a gravação do arquivo, ou defina-o como um caminho relativo para personalizá-lo.
zh_cn: 将所有读取持续时间写入输出目录中的JSON文件。文件内容是文档名称到读取持续时间的映射，其中文档名称是字符串，持续时间是以秒为单位的浮点数。将此值设置为空字符串或 ``None`` 以禁用写入文件，或将其设置为相对路径以自定义它。

source: This may be useful for testing and setting a limit on reading times.
pt_br: Isso pode ser útil para testar e definir um limite de tempo de leitura.
zh_cn: 这对于测试和设置读取时间限制可能很有用。

source: Set a duration limit (in seconds) for reading a document. If any duration exceeds this value, a warning is emitted.
pt_br: Define um limite de duração (em segundos) para a leitura de um documento. Se a duração exceder esse valor, um aviso será exibido.
zh_cn: 为读取文档设置持续时间限制（以秒为单位）。如果任何持续时间超过此值，将发出警告。
