Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/extensions/graphviz.po
Languages: fr, pt_br

source: :mod:`sphinx.ext.graphviz` -- Add Graphviz graphs
fr: :mod:`sphinx.ext.graphviz` -- Ajouter des graphiques Graphviz
pt_br: :mod:`sphinx.ext.graphviz` -- Adiciona gráficos Graphviz

source: This extension allows you to embed `Graphviz <https://graphviz.org/>`_ graphs in your documents.
fr: Cette extension vous permet d'intégrer `Graphviz <https://graphviz.org/>`_ graphiques dans vos documents.
pt_br: Esta extensão permite incorporar gráficos `Graphviz <https://graphviz.org/>`_ em seus documentos.

source: It adds these directives:
fr: Il ajoute ces directives :
pt_br: Ele adiciona estas diretivas:

source: Directive to embed graphviz code. The input code for ``dot`` is given as the content. For example::
fr: Directive pour intégrer le code de graphviz. Le code d'entrée pour "point" est donné comme contenu. Par exemple: :
pt_br: Diretiva para incorporar o código graphviz. O código de entrada para ``dot`` é fornecido como o conteúdo. Por exemplo::

source: In HTML output, the code will be rendered to a PNG or SVG image (see :confval:`graphviz_output_format`). In LaTeX output, the code will be rendered to an embeddable PDF file.
fr: En sortie HTML, le code sera rendu en image PNG ou SVG (voir :confval:`graphviz_output_format`). En sortie LaTeX, le code sera rendu dans un fichier PDF intégrable.
pt_br: Na saída HTML, o código será renderizado para uma imagem PNG ou SVG (veja :confval:`graphviz_output_format`). Na saída LaTeX, o código será renderizado em um arquivo PDF que pode ser incorporado.

source: You can also embed external dot files, by giving the file name as an argument to :rst:dir:`graphviz` and no additional content::
fr: Vous pouvez également intégrer des fichiers de points externes, en donnant le nom du fichier en argument à :rst:dir:`graphviz` et sans contenu supplémentaire::
pt_br: Você também pode incorporar arquivos *dot* externos, dando o nome do arquivo como um argumento para :rst:dir:`graphviz` e sem conteúdo adicional::

source: As for all file references in Sphinx, if the filename is absolute, it is taken as relative to the source directory.
fr: Comme pour toutes les références de fichiers dans Sphinx, si le nom de fichier est absolu, il est considéré comme relatif au répertoire source.
pt_br: Quanto a todas as referências de arquivo no Sphinx, se o nome do arquivo for absoluto, ele será considerado relativo ao diretório fonte.

source: Added support for external files.
fr: Ajout de la prise en charge des fichiers externes.
pt_br: Adicionado suporte para arquivos externos.

source: options
pt_br: opções

source: The alternate text of the graph. By default, the graph code is used to the alternate text.
pt_br: O texto alternativo do gráfico. Por padrão, o código do gráfico é usado para o texto alternativo.

source: The horizontal alignment of the graph.
pt_br: O alinhamento horizontal do gráfico.

source: The caption of the graph.
pt_br: A legenda do gráfico.

source: The layout of the graph (e.g. ``dot``, ``neato`` and so on). A path to the graphviz commands are also allowed. By default, :confval:`graphviz_dot` is used.
pt_br: O layout do gráfico (por exemplo, ``dot``, ``neato`` e assim por diante). Um caminho para os comandos graphviz também é permitido. Por padrão, :confval:`graphviz_dot` é usado.

source: Renamed from ``graphviz_dot``
pt_br: Renomeado de ``graphviz_dot``

source: The label of the graph.
pt_br: O rótulo do gráfico.

source: The class name of the graph.
pt_br: O nome da classe do gráfico.

source: Directive for embedding a single undirected graph. The name is given as a directive argument, the contents of the graph are the directive content. This is a convenience directive to generate ``graph <name> { <content> }``.
fr: Directive pour l'intégration d'un seul graphique non dirigé. Le nom est donné en argument directive, le contenu du graphique est le contenu de la directive. Ceci est une directive de commodité pour générer ``graph <name> { <content> }``.
pt_br: Diretiva para incorporação de um único gráfico não direcionado. O nome é dado como um argumento de diretiva, o conteúdo do gráfico é o conteúdo da diretiva. Esta é uma diretiva de conveniência para gerar ``graph <nome> { <conteúdo> }``.

source: For example::
fr: Pas exemple::
pt_br: Por exemplo::

source: The graph name is passed unchanged to Graphviz. If it contains non-alphanumeric characters (e.g. a dash), you will have to double-quote it.
fr: Le nom du graphique est transmis inchangé à Graphviz ; s'il contient des caractères non alphanumériques (p. ex. un tiret), vous devez le citer deux fois.
pt_br: O nome do gráfico é passado inalterado para o Graphviz. Se ele contiver caracteres não-alfanuméricos (por exemplo, um traço), você terá que aspas duplas.

source: Same as :rst:dir:`graphviz`.
pt_br: Mesmo que :rst:dir:`graphviz`.

source: Directive for embedding a single directed graph. The name is given as a directive argument, the contents of the graph are the directive content. This is a convenience directive to generate ``digraph <name> { <content> }``.
fr: Directive pour l'intégration d'un seul graphique orienté. Le nom est donné en argument directive, le contenu du graphique est le contenu de la directive. Ceci est une directive de commodité pour générer ``digraph <name> { <content> }``.
pt_br: Diretiva para incorporação de um único gráfico direcionado. O nome é dado como um argumento de diretiva, o conteúdo do gráfico é o conteúdo da diretiva. Esta é uma diretiva de conveniência para gerar ``digraph <name> { <content> }``.

source: There are also these config values:
pt_br: Existem também estes valores de configuração:

source: The command name with which to invoke ``dot``. The default is ``'dot'``; you may need to set this to a full path if ``dot`` is not in the executable search path.
fr: Le nom de la commande avec laquelle invoquer ``dot``. La valeur par défaut est ```'dot'`` ; vous devrez peut-être définir un chemin complet si ``dot`` n'est pas dans le chemin de recherche exécutable.
pt_br: O nome do comando com o qual invocar ``dot``. O padrão é ``'dot'``; talvez seja necessário definir isso para um caminho completo se ``dot`` não estiver no caminho de pesquisa executável.

source: Since this setting is not portable from system to system, it is normally not useful to set it in ``conf.py``; rather, giving it on the :program:`sphinx-build` command line via the :option:`-D <sphinx-build -D>` option should be preferable, like this::
fr: Comme ce paramètre n'est pas portable d'un système à l'autre, il n'est normalement pas utile de le définir dans ``conf.py`` ; plutôt, le donner sur la ligne de commande \:program\:`sphinx-build` via l'option \:option\:`-D <sphinx-build -D>' devrait être préférable, comme ceci :
pt_br: Como essa configuração não é portável de um sistema para outro, não é muito útil configurar no ``conf.py``; em vez disso, use o comando do :program:`sphinx-build` via :option:`-D <sphinx-build -D>` é mais eficaz, como isso::

source: Additional command-line arguments to give to dot, as a list. The default is an empty list. This is the right place to set global graph, node or edge attributes via dot's ``-G``, ``-N`` and ``-E`` options.
fr: Arguments de ligne de commande supplémentaires à donner au point, sous forme de liste. La valeur par défaut est une liste vide. C'est le bon endroit pour définir des attributs globaux de graphique, de nœud ou de bord via les options dot's ``-G``, ``-N`` et ``-E``.
pt_br: Argumentos adicionais de linha de comando para fornecer ao dot, como uma lista. O padrão é uma lista vazia. Este é o lugar certo para definir atributos globais de gráfico, nó ou borda através das opções ``-G``, ``-N`` e ``-E`` do dot.

source: The output format for Graphviz when building HTML files. This must be either ``'png'`` or ``'svg'``; the default is ``'png'``. If ``'svg'`` is used, in order to make the URL links work properly, an appropriate ``target`` attribute must be set, such as ``"_top"`` and ``"_blank"``. For example, the link in the following graph should work in the svg output: ::
fr: Le format de sortie pour Graphviz lors de la création de fichiers HTML. Ce doit être soit ``'png'`` ou ``'svg'`` ; la valeur par défaut est ``'png'``. Si ``'svg'`` est utilisé, pour que les liens URL fonctionnent correctement, un attribut ``target`` approprié doit être défini, tel que ``"_top"`` et ``"_blank"``. Par exemple, le lien dans le graphique suivant devrait fonctionner dans la sortie svg : :: :
pt_br: O formato de saída do Graphviz ao criar arquivos HTML. Isso deve ser ``'png'`` ou ``'svg'``; o padrão é ``'png'``. Se ``'svg'`` for usada, para fazer com que os links de URL funcionem corretamente, um atributo ``target`` apropriado deve ser definido, como ``"_top"`` e ``"_blank"``. Por exemplo, o link no gráfico a seguir deve funcionar na saída SVG:

source: Previously, output always was PNG.
fr: Auparavant, la sortie était toujours en PNG.
pt_br: Anteriormente, a saída sempre era PNG.
