Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/extensions/imgconverter.po
Languages: pt_br

source: :mod:`sphinx.ext.imgconverter` -- A reference image converter using Imagemagick
pt_br: :mod:`sphinx.ext.imgconverter` -- Um conversor de imagem de referência usando o Imagemagick

source: This extension converts images in your document to appropriate format for builders. For example, it allows you to use SVG images with LaTeX builder. As a result, you don't mind what image format the builder supports.
pt_br: Esta extensão converte imagens em seu documento em formato apropriado para construtores. Por exemplo, permite usar imagens SVG com o construtor LaTeX. Como resultado, você não precisa ser preocupar com quais formatos de imagem o construtor oferece suporte.

source: By default the extension uses ImageMagick_ to perform conversions, and will not work if ImageMagick is not installed.
pt_br: Por padrão, a extensão usa ImageMagick_ para realizar conversões e não funcionará se o ImageMagick não estiver instalado.

source: ImageMagick rasterizes a SVG image on conversion. As a result, the image becomes not scalable. To avoid that, please use other image converters like `sphinxcontrib-svg2pdfconverter`__ (which uses Inkscape or ``rsvg-convert``).
pt_br: O ImageMagick rasteriza uma imagem SVG na conversão. Como resultado, a imagem não é escalável. Para evitar isso, por favor, use outros conversores de imagem como o `sphinxcontrib-svg2pdfconverter`__ (que usa o Inkscape ou ``rsvg-convert``).

source: Configuration
pt_br: Configuração

source: A path to a conversion command. By default, the imgconverter finds the command from search paths.
pt_br: Um caminho para um comando de conversão. Por padrão, o imgconverter usa o comando a partir da caminhos de pesquisa.

source: On Unix platforms, the command :command:`convert` is used by default.
pt_br: Em plataformas Unix, o comando :command:`convert` é usado por padrão.

source: On Windows, the command :command:`magick` is used by default.
pt_br: No Windows, o comando :command:`magick` é usado por padrão.

source: Use :command:`magick` command by default on windows
pt_br: Usa o comando :command:`magick` por padrão no Windows

source: Additional command-line arguments to give to :command:`convert`, as a list. The default is an empty list ``[]``.
pt_br: Argumentos adicionais da linha de comando em passar para :command:`convert`, como uma lista. O padrão é uma lista vazia ``[]``.

source: On Windows, it defaults to ``["convert"]``.
pt_br: No Windows, o padrão é ``["convert"]``.

source: Use ``["convert"]`` by default on Windows
pt_br: Usa ``["convert"]`` por padrão no Windows
