Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/extensions/linkcode.po
Languages: fr, ja

source: :mod:`sphinx.ext.linkcode` -- Add external links to source code
fr: :mod:`sphinx.ext.linkcode` -- Ajouter des liens externes au code source
ja: :mod:`sphinx.ext.linkcode` -- ソースコードへの外部リンクを追加

source: This extension looks at your object descriptions (``.. class::``, ``.. function::`` etc.) and adds external links to code hosted somewhere on the web. The intent is similar to the ``sphinx.ext.viewcode`` extension, but assumes the source code can be found somewhere on the Internet.
fr: Cette extension examine les descriptions de vos objets (``... classe::``, ``... fonction::`` etc.) et ajoute des liens externes au code hébergé quelque part sur le web. L'intention est similaire à celle de l'extension ``sphinx.ext.viewcode``, mais suppose que le code source peut être trouvé quelque part sur Internet.
ja: この拡張はオブジェクトの説明( ``.. class::`` や ``.. function::`` など)を見て、web上にホストされているコードへの外部リンクを追加します。この意図は ``sphinx.ext.viewcode`` 拡張と似ていますが、インターネット上のどこかにソースコードがあることを前提としています。

source: In your configuration, you need to specify a :confval:`linkcode_resolve` function that returns an URL based on the object.
fr: Dans votre configuration, vous devez spécifier une fonction :confval:`linkcode_resolve` qui retourne une URL basée sur l'objet.
ja: 設定ファイルでそのオブジェクトのURLベースを返す :confval:`linkcode_resolve` 関数を指定する必要があります。

source: Configuration
ja: 設定

source: Type
ja: タイプ

source: Default
ja: デフォルト

source: This is a function ``linkcode_resolve(domain, info)``, which should return the URL to source code corresponding to the object in given domain with given information.
fr: C'est une fonction ``linkcode_resolve(domain, info)``, qui devrait renvoyer l'URL vers le code source correspondant à l'objet dans un domaine donné avec des informations données.
ja: この ``linkcode_resolve(domain, info)`` 関数は、与えられた情報と与えられたドメインを使って、あるオブジェクトに対応するソースコードのURLを返す必要があります。

source: The function should return ``None`` if no link is to be added.
fr: La fonction doit retourner ``None``` si aucun lien n'est à ajouter.
ja: もし追加するリンクがない場合、 ``None`` を返す必要があります。

source: The argument ``domain`` specifies the language domain the object is in. ``info`` is a dictionary with the following keys guaranteed to be present (dependent on the domain):
fr: L'argument ``domain`` spécifie le domaine de langue dans lequel se trouve l'objet. ``info``` est un dictionnaire avec les clés suivantes garanties pour être présentes (selon le domaine) :
ja: ``domain`` 引数はオブジェクトが属する言語ドメインを指定します。 ``info`` 引数は以下に示す、前提となっているキーを含む辞書型です(どのようなキーが必要かは各言語ドメインに依存します)。

source: ``py``: ``module`` (name of the module), ``fullname`` (name of the object)
fr: ``py`` : ``module`` (nom du module), ``fullname`` (nom de l'objet)
ja: ``py``: ``module`` (モジュール名)、 ``fullname`` (オブジェクト名)

source: ``c``: ``names`` (list of names for the object)
fr: ``c`` : ``names`` (liste des noms pour l'objet)
ja: ``c``: ``names`` (そのオブジェクトに対する名前のリスト)

source: ``cpp``: ``names`` (list of names for the object)
fr: ``cpp`` : ``names`` (liste des noms pour l'objet)
ja: ``cpp``: ``names`` (そのオブジェクトに対する名前のリスト)

source: ``javascript``: ``object`` (name of the object), ``fullname`` (name of the item)
fr: ``javascript`` : ``object`` (nom de l'objet), ``fullname`` (nom de l'élément)
ja: ``javascript``: ``object`` (オブジェクトの名前), ``fullname`` (そのアイテム名)

source: Example:
fr: Exemple:
ja: 例:
