Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/advanced/intl.po
Languages: pt_br

source: Internationalization
pt_br: Internacionalização

source: Complementary to translations provided for Sphinx-generated messages such as navigation bars, Sphinx provides mechanisms facilitating the translation of *documents*. See the :ref:`intl-options` for details on configuration.
pt_br: Complementarmente às traduções fornecidas pelas mensagens geradas pelo Sphinx, tal como barras de navegação, o Sphinx provê mecanismos para facilitar a tradução de *documentos*. Veja as :ref:`intl-options` para detalhes na configuração.

source: Workflow visualization of translations in Sphinx. (The figure is created by `plantuml <https://plantuml.com>`_.)
pt_br: Visualização do fluxo de trabalho de traduções no Sphinx. (A figura foi criada por `plantuml <https://plantuml.com>`_.)

source: Sphinx internationalization details
pt_br: Detalhes da internacionalização do Sphinx

source: **gettext** [1]_ is an established standard for internationalization and localization. It naively maps messages in a program to a translated string. Sphinx uses these facilities to translate whole documents.
pt_br: **gettext** [1]_ é um padrão estabelecido para internacionalização e localização. Ele mapeia mensagens em um programa para uma string traduzida. Sphinx usa essas facilidades para todos os documentos.

source: Initially project maintainers have to collect all translatable strings (also referred to as *messages*) to make them known to translators. Sphinx extracts these through invocation of :command:`sphinx-build -M gettext`.
pt_br: Inicialmente os mantenedores do projeto coletam todas as strings que serão traduzidas (também referidas como *mensagens* ou *frases*) para torná-las conhecidas para os tradutores. Sphinx extrai isso através da chamada de :command:`sphinx-build -M gettext`.

source: Every single element in the doctree will end up in a single message which results in lists being equally split into different chunks while large paragraphs will remain as coarsely-grained as they were in the original document. This grants seamless document updates while still providing a little bit of context for translators in free-text passages. It is the maintainer's task to split up paragraphs which are too large as there is no sane automated way to do that.
pt_br: Cada elemento individual do doctree irá gerar uma mensagem individual, a qual resulta em listas que sendo igualmente quebradas em diferentes fragmentos, enquanto grandes parágrafos irão permanecer formatados como no documento original. Isso permite atualizações perfeitas dos documentos, enquanto são mantidos os contextos que os tradutores precisam para traduzir livremente os conteúdos. A tarefa do mantenedor é quebrar em parágrafos não muito longos para que isso seja racional, pois não há nenhuma automação para isso.

source: After Sphinx successfully ran the :class:`~sphinx.builders.gettext.MessageCatalogBuilder` you will find a collection of ``.pot`` files in your output directory. These are **catalog templates** and contain messages in your original language *only*.
pt_br: Após o Sphinx executar :class:`~sphinx.builders.gettext.MessageCatalogBuilder`, pode-se encontrar uma coleção de arquivos ``.pot`` em seu diretório de saída. Estes são **modelos de catálogos** e *só* contêm mensagens no seu idioma original.

source: They can be delivered to translators which will transform them to ``.po`` files --- so called **message catalogs** --- containing a mapping from the original messages to foreign-language strings.
pt_br: Esses arquivos são enviados para os tradutores que irão transformá-los em arquivos ``.po`` -- os chamados **catálogos de mensagens** -- contendo um mapeamento das mensagens originais para as strings na língua estrangeira.

source: *gettext* compiles them into a binary format known as **binary catalogs** through :program:`msgfmt` for efficiency reasons. If you make these files discoverable with :confval:`locale_dirs` for your :confval:`language`, Sphinx will pick them up automatically.
pt_br: O *gettext* os compila em um formato binário conhecido como **catálogos binários** usando :program:`msgfmt` por motivos de eficiência. Se você tornar esses arquivos detectáveis com o :confval:`locale_dirs` para o seu :confval:`language`, o Sphinx irá buscá-los automaticamente.

source: An example: you have a document :file:`usage.rst` in your Sphinx project. The *gettext* builder will put its messages into :file:`usage.pot`. Imagine you have Spanish translations [2]_ stored in :file:`usage.po` --- for your builds to be translated you need to follow these instructions:
pt_br: Um exemplo: você tem um documento :file:`usage.rst` no seu projeto Sphinx. O construtor *gettext* colocará suas mensagens em :file:`usage.pot`. Imagine que você tenha as traduções para espanhol [2]_ armazenadas em :file:`usage.po` --- para que suas construções sejam traduzidas, é necessário seguir estas instruções:

source: Compile your message catalog to a locale directory, say ``locale``, so it ends up in :file:`./locale/es/LC_MESSAGES/usage.mo` in your source directory (where ``es`` is the language code for Spanish.) ::
pt_br: Compile seu catálogo de mensagens para um diretório de localidade, digamos ``locale``, de forma que ele fique em :file:`./locale/es/LC_MESSAGES/usage.mo` em seu diretório fonte (sendo ``es`` o código de idioma para espanhol.) ::

source: Set :confval:`locale_dirs` to ``["locale/"]``.
pt_br: Defina :confval:`locale_dirs` para ``["locale/"]``.

source: Set :confval:`language` to ``es`` (also possible via :option:`-D <sphinx-build -D>`).
pt_br: Defina :confval:`language` para ``es`` (também possível via :option:`-D <sphinx-build -D>`).

source: Run your desired build.
pt_br: Faça a construção desejada.

source: In order to protect against mistakes, a warning is emitted if cross-references in the translated paragraph do not match those from the original. This can be turned off globally using the :confval:`suppress_warnings` configuration variable. Alternatively, to turn it off for one message only, end the message with ``#noqa`` like this::
pt_br: Para proteger contra erros, um aviso é emitido se as referências cruzadas no parágrafo traduzido não corresponderem às do original. Isso pode ser desativado globalmente usando a variável de configuração :confval:`suppress_warnings`. Alternativamente, para desativá-lo apenas para uma mensagem, termine a mensagem com ``#noqa`` assim::

source: (Write ``\#noqa`` in case you want to have "#noqa" literally in the text. This does not apply to code blocks, where ``#noqa`` is ignored because code blocks do not contain references anyway.)
pt_br: (Escreva ``\#noqa`` caso você queira ter "#noqa" literalmente no texto. Isso não se aplica a blocos de código, onde ``#noqa`` é ignorado porque os blocos de código não contêm referências de qualquer maneira. )

source: The ``#noqa`` mechanism.
pt_br: O mecanismo ``#noqa``.

source: Translating with sphinx-intl
pt_br: Traduzindo com sphinx-intl

source: Quick guide
pt_br: Guia rápido

source: `sphinx-intl`_ is a useful tool to work with Sphinx translation flow. This section describe an easy way to translate with *sphinx-intl*.
pt_br: `sphinx-intl`_ é uma ferramenta útil para trabalhar com o fluxo de tradução do Sphinx. Esta seção descreve uma maneira fácil de traduzir com *sphinx-intl*.

source: Install `sphinx-intl`_.
pt_br: Instale `sphinx-intl`_.

source: Add configurations to :file:`conf.py`.
pt_br: Adicione configurações ao :file:`conf.py`.

source: This case-study assumes that BUILDDIR is set to ``_build``, :confval:`locale_dirs` is set to ``locale/`` and :confval:`gettext_compact` is set to ``False`` (the Sphinx document is already configured as such).
pt_br: Este estudo de caso presume que BUILDDIR está definido para ``_build``, que :confval:`locale_dirs` está definido como ``locale/`` e :confval:`gettext_compact` está definido como ``False`` (o documento Sphinx já está configurado como tal).

source: Extract translatable messages into pot files.
pt_br: Extraia mensagens traduzíveis em arquivos pot.

source: The generated pot files will be placed in the ``_build/gettext`` directory.
pt_br: Os arquivos pot gerados serão colocados no diretório ``_build/gettext``.

source: Generate po files.
pt_br: Gere os arquivos po.

source: We'll use the pot files generated in the above step.
pt_br: Nós vamos usar os arquivos pot gerados na etapa acima.

source: Once completed, the generated po files will be placed in the below directories:
pt_br: Uma vez completados, os arquivos po gerados serão colocados nos diretórios abaixo:

source: Translate po files.
pt_br: Traduza os arquivos po.

source: As noted above, these are located in the ``./locale/<lang>/LC_MESSAGES`` directory. An example of one such file, from Sphinx, :file:`builders.po`, is given below.
pt_br: Como mencionado acima, eles estão localizados no diretório ``./locale/<lang>/LC_MESSAGES``. Um exemplo de um tal arquivo, do Sphinx, :file:`builders.po`, é fornecido abaixo.

source: Another case, msgid is multi-line text and contains reStructuredText syntax:
pt_br: Outro caso, msgid possui múltiplas linhas de texto e contém sintaxe reStructuredText:

source: Please be careful not to break reStructuredText notation. Most po-editors will help you with that.
pt_br: Preste muita atenção para não quebrar a notação reStructuredText. Editores de arquivo po ajudam muito nisso.

source: Build translated document.
pt_br: Construa o documento traduzido.

source: You need a :confval:`language` parameter in :file:`conf.py` or you may also specify the parameter on the command line.
pt_br: Você precisa de um parâmetro :confval:`language` em :file:`conf.py` ou também pode especificar o parâmetro na linha de comando.

source: For BSD/GNU make, run:
pt_br: Para BSD/GNU make, execute:

source: For Windows :command:`cmd.exe`, run:
pt_br: Para o Windows :command:`cmd.exe`, execute:

source: For PowerShell, run:
pt_br: Para o PowerShell, execute:

source: Congratulations! You got the translated documentation in the ``_build/html`` directory.
pt_br: Parabéns! O documento traduzido está no diretório ``_build/html``.

source: :program:`sphinx-build` that is invoked by make command will build po files into mo files.
pt_br: :program:`sphinx-build` que é invocado pelo comando make e irá construir arquivos po em arquivos mo.

source: If you are using 1.2.x or earlier, please invoke :command:`sphinx-intl build` command before :command:`make` command.
pt_br: Se você estiver usando 1.2.x ou anterior, invoque o comando :command:`sphinx-intl build` antes do comando :command:`make`.

source: Translating
pt_br: Traduzindo

source: Update your po files by new pot files
pt_br: Atualize seus arquivos po com os novos arquivos pot

source: If a document is updated, it is necessary to generate updated pot files and to apply differences to translated po files. In order to apply the updates from a pot file to the po file, use the :command:`sphinx-intl update` command.
pt_br: Se um documento for atualizado, é necessário gerar arquivos pot atualizados e aplicar as diferenças aos arquivos po traduzidos. Para aplicar as atualizações de um arquivo pot ao arquivo po, use o comando :command:`sphinx-intl update`.

source: Using Transifex service for team translation
pt_br: Usando o serviço Transifex para tradução em equipe

source: Transifex_ is one of several services that allow collaborative translation via a web interface. It has a nifty Go-based command line client that makes it easy to fetch and push translations.
pt_br: Transifex_ é um dos diversos serviços que permite tradução colaborativa via interface web. Possui um cliente bacana de linha de comando baseado em Go que permite baixar e enviar traduções.

source: Install the `Transifex CLI tool`_.
pt_br: Instale a `ferramenta de CLI do Transifex`_.

source: You need the :command:`tx` command line tool for uploading resources (pot files). The official installation process place the :file:`tx` binary file in the current directory along with a README and a LICENSE file, and adds the current directory to ``$PATH``.
pt_br: Você precisa da ferramenta de linha de comando :command:`tx` para enviar recursos (arquivos pot). O processo de instalação oficial coloca o arquivo binário :file:`tx` no diretório atual junto com um arquivo README e um arquivo LICENSE, e adiciona o diretório atual ao ``$PATH``.

source: `Transifex Client documentation`_
pt_br: `Documentação do Transifex Client`_

source: Create your Transifex_ account and create a new project and an organization for your document.
pt_br: Crie sua conta no Transifex_ e crie um novo projeto e uma organização para sua documentação.

source: Currently, Transifex does not allow for a translation project to have more than one version of the document, so you'd better include a version number in your project name.
pt_br: Atualmente, o Transifex não permite que um projeto de tradução tenha mais de uma versão do documento, então é melhor incluir o número da versão em seu nome de projeto.

source: For example:
pt_br: Por exemplo:

source: Organization ID
pt_br: ID da organização

source: Project ID
pt_br: ID do projeto

source: Project URL
pt_br: URL do projeto

source: Create an API token to be used in the command-line.
pt_br: Crie um token de API para ser usado na linha de comando.

source: Go to your `Transifex API token`_ page and generate a token. Copy the generated token now, as you will not be able to see it again later.
pt_br: Vá para sua página de `token de API do Transifex`_ e gere um token. Copie o token gerado agora, pois você não poderá vê-lo novamente mais tarde.

source: Set your Transifex API token in the user configuration file :file:`$HOME/.transifexrc`.
pt_br: Defina seu token da API Transifex no arquivo de configuração de usuário :file:`$HOME/.transifexrc`.

source: Alternatively, you can store your Transifex API token as the environment variable ``TX_TOKEN``, which is recognized and used by :command:`tx`.
pt_br: Alternativamente, você pode armazenar seu token da API do Transifex como a variável de ambiente ``TX_TOKEN``, que é reconhecida e usada pelo :command:`tx`.

source: Create the project's config file for :command:`tx` command.
pt_br: Crie o arquivo de configuração do projeto para o comando :command:`tx`.

source: This process will create ``.tx/config`` in the current directory.
pt_br: Este processo criará ``.tx/config`` no diretório atual.

source: Upload pot files to Transifex service.
pt_br: Faça o upload dos arquivos pot para o serviço Transifex.

source: Register pot files to ``.tx/config`` file using :command:`sphinx-intl update-txconfig-resources`, adjusting ``--pot-dir`` value to your project's pot files' directory:
pt_br: Registre os arquivos pot no arquivo ``.tx/config`` usando :command:`sphinx-intl update-txconfig-resources`, ajustando o valor ``--pot-dir`` para o diretório dos arquivos pot do seu projeto:

source: You can use the ``SPHINXINTL_TRANSIFEX_ORGANIZATION_NAME`` and ``SPHINXINTL_TRANSIFEX_PROJECT_NAME`` environment variables instead of the respective command line arguments.
pt_br: Você pode usar as variáveis ​​de ambiente ``SPHINXINTL_TRANSIFEX_ORGANIZATION_NAME`` e ``SPHINXINTL_TRANSIFEX_PROJECT_NAME`` em vez dos respectivos argumentos de linha de comando.

source: `sphinx-intl update-txconfig-resources documentation`_
pt_br: `Documentação de sphinx-intl update-txconfig-resources`_

source: and upload pot files:
pt_br: e faça upload dos arquivos pot:

source: Forward the translation on Transifex.
pt_br: Encaminhe a tradução no Transifex.

source: Pull translated po files and make translated HTML.
pt_br: Baixe os arquivos po traduzidos e gere o HTML traduzido.

source: Get translated catalogs and build mo files. For example, to build mo files for German (de):
pt_br: Obtenha catálogos traduzidos e gere os arquivos mo. Por exemplo, para gerar os arquivos mo para alemão (de):

source: Invoke :command:`make html` (for BSD/GNU make) passing the language code:
pt_br: Execute :command:`make html` (para BSD/GNU make) passando o código do idioma:

source: That's all!
pt_br: Isso é tudo, pessoal!

source: Translating locally and on Transifex
pt_br: Traduzindo localmente e no Transifex

source: If you want to push all language's po files, you can be done by using :command:`tx push -t` command. Watch out! This operation overwrites translations in Transifex.
pt_br: Se você quer enviar os arquivos po de todos os idiomas, é possível fazê-lo usando o comando :command:`tx push -t`. Cuidado! Esta operação substitui as traduções no Transifex.

source: In other words, if you have updated each in the service and local po files, it would take much time and effort to integrate them.
pt_br: Em outras palavras, caso tenha atualizado cada um deles via serviço Transifex e arquivos locais po, pode ser necessário muito esforço para integrá-los.

source: Using Weblate service for team translation
pt_br: Usando o serviço Weblate para tradução em equipe

source: Read more in `Weblate's documentation`_.
pt_br: Leia mais na `documentação do Weblate`_.

source: Contributing to Sphinx reference translation
pt_br: Contribuindo para tradução das referências do Sphinx

source: The recommended way for new contributors to translate Sphinx reference is to join the translation team on Transifex.
pt_br: A maneira que recomendamos para novos contribuidores para traduzir o Sphinx é juntar-se à equipe de tradução no Transifex.

source: There is a `sphinx translation page`_ for Sphinx (master) documentation.
pt_br: Existe uma `página de tradução do sphinx`_ para a documentação do Sphinx (master).

source: Login to Transifex_ service.
pt_br: Faça login no serviço Transifex_.

source: Go to `sphinx translation page`_.
pt_br: Acesse a `página de tradução do sphinx`_.

source: Click ``Request language`` and fill form.
pt_br: Clique em ``Request language`` e preencha o formulário.

source: Wait acceptance by Transifex sphinx translation maintainers.
pt_br: Aguarde o aceite pelos mantenedores de tradução do Sphinx no Transifex.

source: (After acceptance) Translate on Transifex.
pt_br: (Após ser aceito) Traduza no Transifex.

source: Detail is here: https://help.transifex.com/en/articles/6248698-getting-started-as-a-translator
pt_br: Detalhes aqui: https://help.transifex.com/en/articles/6248698-getting-started-as-a-translator

source: Translation progress and statistics
pt_br: Progresso e estatísticas de tradução

source: During the rendering process, Sphinx marks each translatable node with a ``translated`` attribute, indicating if a translation was found for the text in that node.
pt_br: Durante o processo de renderização, o Sphinx marca cada nó traduzível com um atributo ``translated``, indicando se uma tradução foi encontrada para o texto naquele nó.

source: The :confval:`translation_progress_classes` configuration value can be used to add a class to each element, depending on the value of the ``translated`` attribute.
pt_br: O valor de configuração :confval:`translation_progress_classes` pode ser usado para adicionar uma classe a cada elemento, dependendo do valor do atributo ``translated``.

source: The ``|translation progress|`` substitution can be used to display the percentage of nodes that have been translated on a per-document basis.
pt_br: A substituição ``|translation progress|`` pode ser usada para exibir a porcentagem de nós que foram traduzidos por documento.

source: Footnotes
pt_br: Notas de rodapé

source: See the `GNU gettext utilities <https://www.gnu.org/software/gettext/manual/gettext.html#Introduction>`_ for details on that software suite.
pt_br: Consulte `GNU gettext utilities <https://www.gnu.org/software/gettext/manual/gettext.html#Introduction>`_ para obter detalhes sobre esse pacote de software.

source: Because nobody expects the Spanish Inquisition!
pt_br: Porque ninguém espera encontrar a Inquisição Espanhola!
