Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/advanced/websupport/storagebackends.po
Languages: pt_br

source: Storage backends
pt_br: Backends de armazenamento

source: To create a custom storage backend you will need to subclass the :class:`StorageBackend` class. Then create an instance of the new class and pass that as the *storage* keyword argument when you create the :class:`~.WebSupport` object::
pt_br: Para criar um backend de armazenamento personalizado é necessário criar uma subclasse de :class:`StorageBackend`. Em seguida, crie uma instância da nova classe e passe o argumento nomeado *storage* ao criar o objeto :class:`~.WebSupport`::

source: For more information about creating a custom storage backend, please see the documentation of the :class:`StorageBackend` class below.
pt_br: Para maiores informações sobre como criar retaguarda personalizada de armazenamento, ver abaixo a documentação da classe :class:`StorageBackend`.

source: Defines an interface for storage backends.
pt_br: Define o interface para armazenamento de retaguarda.

source: StorageBackend class is moved to sphinxcontrib.websupport.storage from sphinx.websupport.storage.
pt_br: Classe Armazenamento de Retaguarda foi movida para sphinxcontrib.websupport.storage em sphinx.websupport.storage.

source: Methods
pt_br: Métodos

source: Called immediately before the build process begins. Use this to prepare the StorageBackend for the addition of nodes.
pt_br: Chamado imediatamente antes que o processo de build começa. Use para preparar Armazenamento de Retaguarda para adição de nodes.

source: Add a node to the StorageBackend.
pt_br: Adicionar um node em Armazenamento de Retaguarda.

source: Parameters
pt_br: Parâmetros

source: a unique id for the comment.
pt_br: Id único para o comentário.

source: the name of the document the node belongs to.
pt_br: nome do documento ao qual o node pertence.

source: the source files name.
pt_br: nome do arquivo fonte.

source: Called after a build has completed. Use this to finalize the addition of nodes if needed.
pt_br: Chamado após build completo. Usar para finalizar a adição de nodes se necessário.

source: Called when a comment is being added.
pt_br: Chamado quando o comentário for adicionado.

source: the text of the comment
pt_br: texto do comentário

source: whether the comment should be displayed
pt_br: quando o comentário deve ser exibido

source: the name of the user adding the comment
pt_br: o nome do usuário que adiciona o comentário

source: a date object with the time the comment was added
pt_br: data do objeto com o horário que o comentário foi adicionado

source: the text of the proposal the user made
pt_br: o texto proposto pelo usuário

source: the id of the node that the comment is being added to
pt_br: id do node que no qual o comentário foi adicionado

source: the id of the comment's parent comment.
pt_br: o id do comentário mediato.

source: whether the user adding the comment is a moderator
pt_br: quando o usuário comentando for um moderador

source: Delete a comment.
pt_br: Apagar comentário.

source: Raises :class:`~sphinxcontrib.websupport.errors.UserNotAuthorizedError` if moderator is False and `username` doesn't match the username on the comment.
pt_br: Ativa :class:`~sphinxcontrib.websupport.errors.UserNotAuthorizedError` se o moderador é False e `username` não combina com username do comentário.

source: The id of the comment being deleted.
pt_br: Id do comentário sendo apagado.

source: The username of the user requesting the deletion.
pt_br: Username do usuário requisitando a remoção.

source: Whether the user is a moderator.
pt_br: Quando o usuário é um moderador.

source: Called to retrieve all data for a node. This should return a dict with two keys, *source* and *comments* as described by :class:`~sphinxcontrib.websupport.WebSupport`'s :meth:`~sphinxcontrib.websupport.WebSupport.get_data` method.
pt_br: Chamado para recuperar todos dados de um node. Isso retorna um dicionário com duas chaves, *source* e *comments* como descrito na classe :class:`~sphinxcontrib.websupport.WebSupport`'s método :meth:`~sphinxcontrib.websupport.WebSupport.get_data`.

source: The id of the node to get data for.
pt_br: Id do node para quem os dados foram obtidos

source: The name of the user requesting the data.
pt_br: O nome do usuário requisitando dados.

source: Whether the requestor is a moderator.
pt_br: Quando o requerente é um moderador.

source: Process a vote that is being cast. `value` will be either -1, 0, or 1.
pt_br: Processar voto que está em execução. `value` pode ser -1, 0 ou 1.

source: The id of the comment being voted on.
pt_br: Id do comentário que está sendo votado.

source: The username of the user casting the vote.
pt_br: Username do usuário do voto em tela.

source: The value of the vote being cast.
pt_br: Valor do voto em tela.

source: If a user is allowed to change their username this method should be called so that there is not stagnate data in the storage system.
pt_br: Se o usuário é autorizado a modificar seu nome de usuário esse método deve ser chamado, para evitar dados estagnados no sistema de armazenamento.

source: The username being changed.
pt_br: Username sendo modificado.

source: What the username is being changed to.
pt_br: Qual username está sendo modificado.

source: Called when a moderator accepts a comment. After the method is called the comment should be displayed to all users.
pt_br: Ativado quando o moderador aceita um comentário. Após o método chamado o comentário é exibido para todos usuários.

source: The id of the comment being accepted.
pt_br: O id do comentário aceito.
