Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/man/sphinx-build.po
Languages: pt_br

source: Synopsis
pt_br: Sinopse

source: **sphinx-build** [*options*] <*sourcedir*> <*outputdir*> [*filenames* ...]
pt_br: **sphinx-build** [*opções*] <*sourcedir*> <*outputdir*> [*nomes de arquivos* ...]

source: Description
pt_br: Descrição

source: :program:`sphinx-build` generates documentation from the files in ``<sourcedir>`` and places it in the ``<outputdir>``.
pt_br: :program:`sphinx-build` gera documentação dos arquivos que estão em ``<sourcedir>`` e monta documento final em ``<outputdir>``.

source: :program:`sphinx-build` looks for ``<sourcedir>/conf.py`` for the configuration settings. :manpage:`sphinx-quickstart(1)` may be used to generate template files, including ``conf.py``.
pt_br: :program:`sphinx-build` busca no ``<sourcedir>/conf.py`` por um arquivo de configurações. :manpage:`sphinx-quickstart(1)` pode ser usado para gerar modelos de arquivos, inclusive o arquivo ``conf.py``.

source: :program:`sphinx-build` can create documentation in different formats. A format is selected by specifying the builder name on the command line; it defaults to HTML. Builders can also perform other tasks related to documentation processing. For a list of available builders, refer to :doc:`/usage/builders/index`.
pt_br: :program:`sphinx-build` pode criar documentação em diversos formatos. Um formato é selecionado especificando o nome do construtor na linha de comando; o padrão é HTML. Esses construtores também pode executar outras tarefas relacionadas ao processamento da documentação. Para uma lista de construtores disponíveis, consulte :doc:`/usage/builders/index`.

source: By default, everything that is outdated is built. Output only for selected files can be built by specifying individual filenames.
pt_br: Por padrão tudo que estiver desatualizado é reconstruído. Saída de apenas alguns arquivos pode ser construída através da especificação individual desses arquivos.

source: Options
pt_br: Opções

source: Select a builder, using the *make-mode*. See :doc:`/usage/builders/index` for a list of all of Sphinx's built-in builders. Extensions can add their own builders.
pt_br: Seleciona um construtor, usando o *make-mode*. Veja :doc:`/usage/builders/index` para uma lista de todos os construtores embutidos do Sphinx. As extensões podem adicionar seus próprios construtores.

source: Sphinx only recognizes the ``-M`` option if it is used first, along with the source and output directories, before any other options are passed. For example::
pt_br: O Sphinx só reconhece a opção ``-M`` se ela for usada primeiro, junto com os diretórios fonte e de saída, antes de qualquer outra opção ser passada. Por exemplo::

source: The *make-mode* provides the same build functionality as a default :ref:`Makefile or Make.bat <makefile_options>`, and provides the following additional build pipelines:
pt_br: O *make-mode* fornece a mesma funcionalidade de construção que um :ref:`Makefile ou Make.bat <makefile_options>` padrão e fornece os seguintes pipelines de construção adicionais:

source: Build LaTeX files and run them through :program:`pdflatex`, or as per :confval:`latex_engine` setting. If :confval:`language` is set to ``'ja'``, will use automatically the :program:`platex/dvipdfmx` latex to PDF pipeline.
pt_br: Constrói arquivos LaTeX e executa cada um deles através do :program:`pdflatex` ou através da configuração :confval:`latex_engine`. Se :confval:`language` é ``'ja'``, irá usar automaticamente pipeline latex :program:`platex/dvipdfmx` para PDF.

source: Build Texinfo files and run them through :program:`makeinfo`.
pt_br: Constrói arquivos Texinfo e executa cada um através de :program:`makeinfo`.

source: The default output directory locations when using *make-mode* differ from the defaults when using :option:`-b`.
pt_br: Os locais padrão do diretório de saída ao usar *make-mode* diferem dos padrões ao usar :option:`-b`.

source: doctrees are saved to ``<outputdir>/doctrees``
pt_br: doctrees são salvos em ``<outputdir>/doctrees``

source: output files are saved to ``<outputdir>/<builder name>``
pt_br: arquivos de saída são salvos em ``<outputdir>/<builder name>``

source: Selects a builder.
pt_br: Seleciona um construtor.

source: See :doc:`/usage/builders/index` for a list of all of Sphinx's built-in builders. Extensions can add their own builders.
pt_br: Veja :doc:`/usage/builders/index` para uma lista de todos os construtores embutidos do Sphinx. As extensões podem adicionar seus próprios construtores.

source: Add ``--builder`` long option.
pt_br: Adiciona a opção longa ``--builder``.

source: If given, always write all output files. The default is to only write output files for new and changed source files. (This may not apply to all builders.)
pt_br: Se passado, sempre sobrepõe a gravação de todos arquivos. O padrão é sobrepor somente arquivos de saída para novos e modificados. (isso não se aplica a todos construtores).

source: This option does not re-read source files. To read and re-process every file, use :option:`--fresh-env` instead.
pt_br: Esta opção não relê os arquivos fonte. Para ler e reprocessar cada arquivo, use :option:`--fresh-env`.

source: Add ``--write-all`` long option.
pt_br: Adiciona a opção longa ``--write-all``.

source: Don't use a saved :term:`environment` (the structure caching all cross-references), but rebuild it completely. The default is to only read and parse source files that are new or have changed since the last run.
pt_br: Não usa o :term:`ambiente` salvo (a estrutura faz cache das referências cruzadas), mas reconstruir completamente. O padrão é só ler e fazer parse dos arquivos fonte que forem novos ou foram atualizados desde a última execução.

source: Add ``--fresh-env`` long option.
pt_br: Adiciona a opção longa ``--fresh-env``.

source: Define the tag *tag*. This is relevant for :rst:dir:`only` directives that include their content only if certain tags are set. See :ref:`including content based on tags <tags>` for further detail.
pt_br: Define a tag *tag*. Isto é relevante para diretivas :rst:dir:`only` que incluem seu conteúdo apenas se certas tags estiverem definidas. Veja :ref:`incluindo conteúdo com base nas tags <tags>` para mais detalhes.

source: Add ``--tag`` long option.
pt_br: Adiciona a opção longa ``--tag``.

source: Since Sphinx has to read and parse all source files before it can write an output file, the parsed source files are cached as "doctree pickles". Normally, these files are put in a directory called :file:`.doctrees` under the build directory; with this option you can select a different cache directory (the doctrees can be shared between all builders).
pt_br: Sphinx leu e fez parse de todos fontes antes de gravar saída nos arquivos, esses arquivos fontes são mantidos em cache como "doctree pickles". Normalmente, esses arquivos são gravados em um diretório chamado :file:`.doctrees` sob o diretório onde está sendo feito o build; com essa opção pode ser selecionado um diretório cache diferente (doctrees podem ser compartilhados entre vários construtores).

source: Add ``--doctree-dir`` long option.
pt_br: Adiciona a opção longa ``--doctree-dir``.

source: Distribute the build over *N* processes in parallel, to make building on multiprocessor machines more effective. This feature only works on systems supporting "fork". Windows is not supported. Note that not all parts and not all builders of Sphinx can be parallelized. If ``auto`` argument is given, Sphinx uses the number of CPUs as *N*. Defaults to 1.
pt_br: Distribui a construção através de *N* processos em paralelo, para permitir o processo de construção em máquinas com múltiplos processadores ser mais efetivo. Este recurso só funciona em sistemas que têm suporte a "fork". o Windows não é suportado. Note que nem todas as partes nem todos os construtores do Sphinx podem ser executados em paralelo. Se o argumento ``auto`` é fornecido, então o Sphinx usa o número de CPUs como *N*. O padrão é 1.

source: This option should be considered *experimental*.
pt_br: Esta opção deve ser considerada como *experimental*.

source: Support ``auto`` argument.
pt_br: Suporte ao argumento ``auto``.

source: Add ``--jobs`` long option.
pt_br: Adiciona a opção longa ``--jobs``.

source: Don't look for the :file:`conf.py` in the source directory, but use the given configuration directory instead. Note that various other files and paths given by configuration values are expected to be relative to the configuration directory, so they will have to be present at this location too.
pt_br: Não procura pelo :file:`conf.py` no diretório fonte, mas use o diretório de configuração informado. Note que outros arquivos e caminhos obtidos pelos valores da configuração são esperados como relativos ao diretório de configuração, portanto também devem estar presentes nessa localização.

source: Add ``--config-dir`` long option.
pt_br: Adiciona a opção longa ``--config-dir``.

source: Don't look for a configuration file; only take options via the :option:`--define` option.
pt_br: Não usa um arquivo de configuração; obtém as opções por meio da opção :option:`--define`.

source: Add ``--isolated`` long option.
pt_br: Adiciona a opção longa ``--isolated``.

source: Override a configuration value set in the :file:`conf.py` file. The value must be a number, string, list or dictionary value.
pt_br: substitui um valor da configuração definido no arquivo :file:`conf.py`. O valor deve ser número, string, lista ou dicionário.

source: For lists, you can separate elements with a comma like this: ``-D html_theme_path=path1,path2``.
pt_br: Para listas, pode-se separar os elementos por vírgulas como esse: ``-D html_tema_caminho=caminho1,caminho2``.

source: For dictionary values, supply the setting name and key like this: ``-D latex_elements.docclass=scrartcl``.
pt_br: Para valores dicionário, forneça o nome opção e a chave como ``-D latex_elements.docclass=scrartcl``.

source: For boolean values, use ``0`` or ``1`` as the value.
pt_br: Para valores booleanos, use ``0`` ou ``1`` como valor.

source: The value can now be a dictionary value.
pt_br: O valor pode ser um valor de dicionário.

source: The value can now also be a list value.
pt_br: O valor pode ser um valor de lista.

source: Add ``--define`` long option.
pt_br: Adiciona a opção longa ``--define``.

source: Make the *name* assigned to *value* in the HTML templates.
pt_br: Torna o *name* assinalado para *value* nos modelos HTML.

source: Add ``--html-define`` long option.
pt_br: Adiciona a opção longa ``--html-define``.

source: Run in nitpicky mode. Currently, this generates warnings for all missing references. See the config value :confval:`nitpick_ignore` for a way to exclude some references as "known missing".
pt_br: Executa no modo nitpicky (em português, minucioso). Atualmente, isso gera avisos para todas as referências inexistentes. Veja o valor de configuração :confval:`nitpick_ignore` para uma forma de não exibir referências conhecidas como "sabidamente ausentes".

source: Add ``--nitpicky`` long option.
pt_br: Adiciona a opção longa ``--nitpicky``.

source: Do not emit colored output.
pt_br: Não emite saída colorida.

source: Add ``--no-color`` long option.
pt_br: Adiciona a opção longa ``--no-color``.

source: Emit colored output. Auto-detected by default.
pt_br: Emite saída colorida. Detectado automaticamente por padrão.

source: Increase verbosity (log-level). This option can be given up to three times to get more debug logging output. It implies :option:`-T`.
pt_br: Incrementa a verbosidade (log-level). Essa opção pode ser dada até três vezes mais para maior detalhe de log na saída. Isso implica :option:`-T`.

source: Add ``--verbose`` long option.
pt_br: Adiciona a opção longa ``--verbose``.

source: Do not output anything on standard output, only write warnings and errors to standard error.
pt_br: Não emite saída nenhuma na saída padrão, só grava avisos de erros na saída padrão de erros.

source: Add ``--quiet`` long option.
pt_br: Adiciona a opção longa ``--quiet``.

source: Do not output anything on standard output, also suppress warnings. Only errors are written to standard error.
pt_br: Não emite nenhuma saída na saída padrão, também suprime avisos. Só erros serão exibidos na saída padrão de erros.

source: Add ``--silent`` long option.
pt_br: Adiciona a opção longa ``--silent``.

source: Write warnings (and errors) to the given file, in addition to standard error.
pt_br: Grava avisos (e erros) para um determinado arquivo, em adição à saída de erro padrão.

source: ANSI control sequences are stripped when writing to *file*.
pt_br: As sequências de controle ANSI são removidas ao gravar em *file*.

source: Add ``--warning-file`` long option.
pt_br: Adiciona a opção longa ``--warning-file``.

source: Turn warnings into errors. This means that :program:`sphinx-build` exits with exit status 1 if any warnings are generated during the build.
pt_br: Transforma avisos em erros. Isso significa que :program:`sphinx-build` sai com status de saída 1 se quaisquer avisos forem gerados durante a construção.

source: Add ``--fail-on-warning`` long option.
pt_br: Adiciona a opção longa ``--fail-on-warning``.

source: :program:`sphinx-build` no longer exits on the first warning, but instead runs the entire build and exits with exit status 1 if any warnings were generated. This behaviour was previously enabled with :option:`--keep-going`.
pt_br: :program:`sphinx-build` não sai mais no primeiro aviso, mas em vez disso executa a construção inteira e sai com status de saída 1 se algum aviso foi gerado. Esse comportamento era habilitado anteriormente com :option:`--keep-going`.

source: From Sphinx 8.1, :option:`!--keep-going` is always enabled. Previously, it was only applicable whilst using :option:`--fail-on-warning`, which by default exited :program:`sphinx-build` on the first warning. Using :option:`!--keep-going` runs :program:`!sphinx-build` to completion and exits with exit status 1 if errors are encountered.
pt_br: A partir do Sphinx 8.1, :option:`!--keep-going` está sempre habilitado. Anteriormente, ele era aplicável somente ao usar :option:`--fail-on-warning`, que por padrão saía de :program:`sphinx-build` no primeiro aviso. Usar :option:`!--keep-going` executa :program:`!sphinx-build` até a conclusão e sai com status de saída 1 se erros forem encontrados.

source: :program:`sphinx-build` no longer exits on the first warning, meaning that in effect :option:`!--fail-on-warning` is always enabled. The option is retained for compatibility, but may be removed at some later date.
pt_br: :program:`sphinx-build` não mais é encerrado no primeiro aviso, o que significa que, na verdade, :option:`!--fail-on-warning` está sempre habilitado. A opção é mantida para compatibilidade, mas pode ser removida em alguma data posterior.

source: Display the full traceback when an unhandled exception occurs. Otherwise, only a summary is displayed and the traceback information is saved to a file for further analysis.
pt_br: Exibe rastreabilidade completa quando uma exceção não tratada ocorrer. Caso contrário, só um resumo será exibido e a informação do rastreamento será salva em arquivo para análise posterior.

source: Add ``--show-traceback`` long option.
pt_br: Adiciona a opção longa ``--show-traceback``.

source: (Useful for debugging only.) Run the Python debugger, :mod:`pdb`, if an unhandled exception occurs while building.
pt_br: (Útil só para depuração). Executar o depurador do Python, :mod:`pdb`, se uma exceção não tratada ocorrer durante a construção.

source: Add ``--pdb`` long option.
pt_br: Adiciona a opção longa ``--pdb``.

source: Raise an exception when a warning is emitted during the build. This can be useful in combination with :option:`--pdb` to debug warnings.
pt_br: Levanta uma exceção quando um aviso for emitido durante a construção. Isso pode ser útil em combinação com :option:`--pdb` para depurar avisos.

source: Display usage summary or Sphinx version.
pt_br: Exibe resumo de uso ou versão do Sphinx.

source: You can also give one or more filenames on the command line after the source and build directories. Sphinx will then try to build only these output files (and their dependencies).
pt_br: Também pode ser informado um ou mais nomes de arquivo na linha de comando após o diretório fonte e o de montagem. Sphinx irá tentar construir esses arquivos de saída (bem como suas dependências).

source: Environment Variables
pt_br: variáveis de ambiente

source: The :program:`sphinx-build` refers following environment variables:
pt_br: O :program:`sphinx-build` usa as seguintes variáveis de ambiente:

source: A path to make command. A command name is also allowed. :program:`sphinx-build` uses it to invoke sub-build process on make-mode.
pt_br: O caminho para o comando make. O nome do comando também é permitido. :program:`sphinx-build` usa isso para chamar processos dependentes para montador no modo make.

source: Makefile Options
pt_br: Opções de Makefile

source: The :file:`Makefile` and :file:`make.bat` files created by :program:`sphinx-quickstart` usually run :program:`sphinx-build` only with the :option:`-b` and :option:`-d` options. However, they support the following variables to customize behavior:
pt_br: Os arquivos :file:`Makefile` e :file:`make.bat` criados pelo :program:`sphinx-quickstart` normalmente executam :program:`sphinx-build` só com a opção :option:`-b` e :option:`-d`. Contudo oferecem suporte às seguintes variáveis para personalizar o comportamento:

source: This sets the ``'papersize'`` key of :confval:`latex_elements`: i.e. ``PAPER=a4`` sets it to ``'a4paper'`` and ``PAPER=letter`` to ``'letterpaper'``.
pt_br: Isso configura a chave ``'papersize'`` de :confval:`latex_elements`: isto é, ``PAPER=a4`` configura-a para ``'a4paper'`` e ``PAPER=letter`` para ``'letterpaper'``.

source: Usage of this environment variable got broken at Sphinx 1.5 as ``a4`` or ``letter`` ended up as option to LaTeX document in place of the needed ``a4paper``, resp. ``letterpaper``. Fixed at 1.7.7.
pt_br: Uso dessa variável de ambiente parece ter quebrado no Sphinx 1.5, pois ``a4`` ou ``letter`` acabou como uma opção para documento LaTeX no lugar do ``a4paper`` ou ``letterpaper`` necessários, respectivamente. Corrigido em 1.7.7.

source: The command to use instead of ``sphinx-build``.
pt_br: O comando para usar em vez de ``sphinx-build``.

source: The build directory to use instead of the one chosen in :program:`sphinx-quickstart`.
pt_br: O diretório onde será construído em vez de um escolhido pelo :program:`sphinx-quickstart`.

source: Additional options for :program:`sphinx-build`. These options can also be set via the shortcut variable **O** (capital 'o').
pt_br: Opções adicionais para :program:`sphinx-build`. Essas opções também podem ser definidas por meio da variável de atalho **O** ('o' maiúsculo).

source: When set (regardless of value), :program:`sphinx-build` will not use color in terminal output. ``NO_COLOR`` takes precedence over ``FORCE_COLOR``. See `no-color.org <https://no-color.org/>`__ for other libraries supporting this community standard.
pt_br: Quando definido (independentemente do valor), :program:`sphinx-build` não usará cores na saída do terminal. ``NO_COLOR`` tem precedência sobre ``FORCE_COLOR``. Veja `no-color.org <https://no-color.org/>`__ para outras bibliotecas que oferecem suporte a este padrão da comunidade.

source: When set (regardless of value), :program:`sphinx-build` will use color in terminal output. ``NO_COLOR`` takes precedence over ``FORCE_COLOR``.
pt_br: Quando definido (independentemente do valor), :program:`sphinx-build` usará cores na saída do terminal. ``NO_COLOR`` tem precedência sobre ``FORCE_COLOR``.

source: Deprecation Warnings
pt_br: Avisos de Obsoleto

source: If any deprecation warning like ``RemovedInSphinxXXXWarning`` are displayed when building a user's document, some Sphinx extension is using deprecated features. In that case, please report it to author of the extension.
pt_br: Se qualquer aviso como ``RemovedInSphinxXXXWarning`` for exibido quando for construir o documento, e algumas extensões Sphinx estiverem referenciando funcionalidades tornadas obsoletas. Nesse caso favor entrar em contato com o autor da extensão.

source: To disable the deprecation warnings, please set ``PYTHONWARNINGS=`` environment variable to your environment. For example:
pt_br: Para desabilitar avisos de obsoleto, favor ver variável de ambiente ``PYTHONWARNINGS=``. Por exemplo:

source: ``export PYTHONWARNINGS=`` and do ``make html`` (Linux/Mac)
pt_br: ``export PYTHONWARNINGS=`` e executar ``make html`` (Linux/Mac)

source: ``set PYTHONWARNINGS=`` and do ``make html`` (Windows)
pt_br: ``set PYTHONWARNINGS=`` e executar ``make html`` (Windows)

source: modify your Makefile/make.bat and set the environment variable
pt_br: modificar seu Makefile/make.bat e a variável de ambiente

source: See also
pt_br: Ver também
