Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/extdev/event_callbacks.po
Languages: pt_br

source: Event callbacks API
pt_br: API de retorno de chamada de eventos

source: Connecting callback functions to events is a simple way to extend Sphinx, by hooking into the build process at various points.
pt_br: Conectar funções de retorno de chamada a eventos é uma maneira simples de estender o Sphinx, conectando-se ao processo de construção em vários pontos.

source: Use :meth:`.Sphinx.connect` in an extension's ``setup`` function, or a ``setup`` function in your projects :file:`conf.py`, to connect functions to the events:
pt_br: Use :meth:`.Sphinx.connect` em uma função ``setup`` da extensão, ou uma função ``setup`` em seus projetos :file:`conf.py`, para conectar funções aos eventos:

source: Extensions can add their own events by using :meth:`.Sphinx.add_event`, and calling them them with :meth:`.Sphinx.emit` or :meth:`.Sphinx.emit_firstresult`.
pt_br: As extensões podem adicionar seus próprios eventos usando :meth:`.Sphinx.add_event` e chamando-os com :meth:`.Sphinx.emit` ou :meth:`.Sphinx.emit_firstresult`.

source: Core events overview
pt_br: Visão geral de eventos principais

source: Below is an overview of the core event that happens during a build.
pt_br: Abaixo está uma visão geral do evento principal que acontece durante uma construção.

source: Here is also a flow diagram of the events, within the context of the Sphinx build process:
pt_br: Aqui está também um diagrama de fluxo dos eventos, dentro do contexto do processo de construção do Sphinx:

source: Sphinx core events flow
pt_br: Fluxo de eventos principais do Sphinx

source: Core event details
pt_br: Detalhes de eventos principais

source: Here is a more detailed list of these events.
pt_br: Aqui está uma lista mais detalhada desses eventos.

source: Parameters
pt_br: Parâmetros

source: Emitted when the config object has been initialized.
pt_br: Emitido quando o objeto de configuração foi inicializado.

source: Emitted when the builder object has been created (available as ``app.builder``).
pt_br: Emitido quando o objeto construtor foi criado (disponível como ``app.builder``).

source: returns
pt_br: retorna

source: ``list[str]`` of additional docnames to re-read
pt_br: ``list[str]`` de docnames adicionais para ler novamente

source: Emitted when the environment determines which source files have changed and should be re-read. *added*, *changed* and *removed* are sets of docnames that the environment has determined. You can return a list of docnames to re-read in addition to these.
pt_br: Emitido quando o ambiente determina quais arquivos fonte foram alterados e devem ser relidos. *add*, *changed* e *removed* são conjuntos de docnames determinados pelo ambiente. Você pode retornar uma lista de docnames para reler além destes.

source: Emitted when all traces of a source file should be cleaned from the environment, that is, if the source file is removed or before it is freshly read. This is for extensions that keep their own caches in attributes of the environment.
pt_br: Emitido quando todos os rastros de um arquivo fonte devem ser limpos do ambiente, ou seja, se o arquivo fonte for removido ou antes de ser lido recentemente. Isto é para extensões que mantêm seus próprios caches em atributos do ambiente.

source: For example, there is a cache of all modules on the environment. When a source file has been changed, the cache's entries for the file are cleared, since the module declarations could have been removed from the file.
pt_br: Por exemplo, existe um cache de todos os módulos no ambiente. Quando um arquivo fonte é alterado, as entradas do cache do arquivo são limpas, pois as declarações do módulo podem ter sido removidas do arquivo.

source: Emitted after the environment has determined the list of all added and changed files and just before it reads them. It allows extension authors to reorder the list of docnames (*inplace*) before processing, or add more docnames that Sphinx did not consider changed (but never add any docnames that are not in :attr:`.found_docs`).
pt_br: Emitido após o ambiente ter determinado a lista de todos os arquivos adicionados e alterados e pouco antes de lê-los. Ele permite que os autores da extensão reordenem a lista de docnames (*inplace*) antes do processamento, ou adicionem mais docnames que o Sphinx não considerou alterados (mas nunca adicionem quaisquer docnames que não estejam em :attr:`.found_docs`).

source: You can also remove document names; do this with caution since it will make Sphinx treat changed files as unchanged.
pt_br: Você também pode remover nomes dos documentos; faça isso com cuidado, pois fará com que o Sphinx trate os arquivos alterados como inalterados.

source: ``list[str]`` with a single element, representing the content of the included file.
pt_br: ``list[str]`` com um único elemento, representando o conteúdo do arquivo incluído.

source: Emitted when a source file has been read.
pt_br: Emitido quando um arquivo fonte foi lido.

source: You can process the ``content`` and replace this item to implement source-level transformations.
pt_br: Você pode processar o ``content`` e substituir este item para implementar transformações no nível de fontes.

source: For example, if you want to use ``$`` signs to delimit inline math, like in LaTeX, you can use a regular expression to replace ``$...$`` by ``:math:`...```.
pt_br: Por exemplo, se você quiser usar sinais ``$`` para delimitar matemática em linha, como no LaTeX, você pode usar uma expressão regular para substituir ``$...$`` por ``:math:`... ```.

source: :class:`~pathlib.Path` representing the included file relative to the :term:`source directory`.
pt_br: :class:`~pathlib.Path` representando o arquivo incluído relativo ao :term:`diretório fonte`.

source: ``str`` of the document name that contains the :dudir:`include` directive.
pt_br: ``str`` do nome do documento que contém a diretiva :dudir:`include`.

source: Emitted when a file has been read with the :dudir:`include` directive.
pt_br: Emitido quando um arquivo foi lido com a diretiva :dudir:`include`.

source: You can process the ``content`` and replace this item to transform the included content, as with the :event:`source-read` event.
pt_br: Você pode processar o ``content`` e substituir este item para transformar o conteúdo incluído, como acontece com o evento :event:`source-read`.

source: The :dudir:`include` directive and the :event:`source-read` event.
pt_br: A diretiva :dudir:`include` e o evento :event:`source-read`.

source: Emitted when an object description directive has run. The *domain* and *objtype* arguments are strings indicating object description of the object. And *contentnode* is a content for the object. It can be modified in-place.
pt_br: Emitido quando uma diretiva de descrição de objeto é executada. Os argumentos *domain* e *objtype* são strings que indicam a descrição do objeto. E *contentnode* é um conteúdo para o objeto. Ele pode ser modificado no local.

source: Emitted when a doctree has been parsed and read by the environment, and is about to be pickled. The ``doctree`` can be modified in-place.
pt_br: Emitido quando uma doctree foi analisada e lida pelo ambiente e está prestes a ser serializada com pickle. O ``doctree`` pode ser modificado no local.

source: The :class:`.pending_xref` node to be resolved. Its ``reftype``, ``reftarget``, ``modname`` and ``classname`` attributes determine the type and target of the reference.
pt_br: O nó :class:`.pending_xref` a ser resolvido. Seus atributos ``reftype``, ``reftarget``, ``modname`` e ``classname`` determinam o tipo e o alvo da referência.

source: The node that carries the text and formatting inside the future reference and should be a child of the returned reference node.
pt_br: O nó que carrega o texto e a formatação dentro da referência futura e deve ser filho do nó de referência retornado.

source: A new node to be inserted in the document tree in place of the node, or ``None`` to let other handlers try.
pt_br: Um novo nó a ser inserido na árvore do documento no lugar do nó, ou ``None`` para permitir que outros manipuladores tentem.

source: Emitted when a cross-reference to an object cannot be resolved. If the event handler can resolve the reference, it should return a new docutils node to be inserted in the document tree in place of the node *node*. Usually this node is a :class:`~nodes.reference` node containing *contnode* as a child. If the handler can not resolve the cross-reference, it can either return ``None`` to let other handlers try, or raise :class:`~sphinx.errors.NoUri` to prevent other handlers in trying and suppress a warning about this cross-reference being unresolved.
pt_br: Emitido quando uma referência cruzada a um objeto não pode ser resolvida. Se o manipulador de eventos puder resolver a referência, ele deverá retornar um novo nó docutils a ser inserido na árvore de documentos no lugar do nó *node*. Normalmente este nó é um nó :class:`~nodes.reference` contendo *contnode* como filho. Se o manipulador não puder resolver a referência cruzada, ele pode retornar ``None`` para permitir que outros manipuladores tentem ou aumentar :class:`~sphinx.errors.NoUri` para evitar que outros manipuladores tentem e suprimir um aviso sobre esta referência cruzada não foi resolvida.

source: The :class:`.Domain` of the missing reference.
pt_br: O :class:`.Domain` da referência ausente.

source: The :class:`.pending_xref` node that could not be resolved.
pt_br: O nó :class:`.pending_xref` que não pôde ser resolvido.

source: ``True`` if a warning was emitted, else ``None``
pt_br: ``True`` se um aviso foi emitido, caso contrário ``None``

source: Emitted when a cross-reference to an object cannot be resolved even after :event:`missing-reference`. If the event handler can emit warnings for the missing reference, it should return ``True``. The configuration variables :confval:`nitpick_ignore` and :confval:`nitpick_ignore_regex` prevent the event from being emitted for the corresponding nodes.
pt_br: Emitido quando uma referência cruzada a um objeto não pode ser resolvida mesmo após :event:`missing-reference`. Se o manipulador de eventos puder emitir avisos para a referência ausente, ele deverá retornar ``True``. As variáveis ​​de configuração :confval:`nitpick_ignore` e :confval:`nitpick_ignore_regex` evitam que o evento seja emitido para os nós correspondentes.

source: Emitted when a doctree has been "resolved" by the environment, that is, all references have been resolved and TOCs have been inserted. The *doctree* can be modified in place.
pt_br: Emitido quando uma doctree foi "resolvida" pelo ambiente, ou seja, todas as referências foram resolvidas e os TOCs foram inseridos. A *doctree* pode ser modificada no local.

source: Here is the place to replace custom nodes that don't have visitor methods in the writers, so that they don't cause errors when the writers encounter them.
pt_br: Este é o lugar para substituir nós personalizados que não possuem métodos de visitante nos escritores, para que não causem erros quando os escritores os encontrarem.

source: This event is only emitted when parallel reading of documents is enabled. It is emitted once for every subprocess that has read some documents.
pt_br: Este evento só é emitido quando a leitura paralela de documentos está habilitada. É emitido uma vez para cada subprocesso que leu algum documento.

source: You must handle this event in an extension that stores data in the environment in a custom location. Otherwise the environment in the main process will not be aware of the information stored in the subprocess.
pt_br: Você deve manipular esse evento em uma extensão que armazene dados no ambiente em um local customizado. Caso contrário, o ambiente do processo principal não terá conhecimento das informações armazenadas no subprocesso.

source: *other* is the environment object from the subprocess, *env* is the environment from the main process. *docnames* is a set of document names that have been read in the subprocess.
pt_br: *other* é o objeto de ambiente do subprocesso, *env* é o ambiente do processo principal. *docnames* é um conjunto de nomes dos documentos que foram lidos no subprocesso.

source: iterable of ``str``
pt_br: iterável de ``str``

source: Emitted after reading all documents, when the environment and all doctrees are now up-to-date.
pt_br: Emitido após a leitura de todos os documentos, quando o ambiente e todas as doctrees estão atualizados.

source: You can return an iterable of docnames from the handler. These documents will then be considered updated, and will be (re-)written during the writing phase.
pt_br: Você pode retornar um iterável de docnames do manipulador. Estes documentos serão então considerados atualizados e serão (re)escritos durante a fase de redação.

source: The handlers' return value is now used.
pt_br: O valor de retorno dos manipuladores agora é usado.

source: Emitted when the environment determines which source files have changed and should be re-read. You can return an iterable of docnames to re-read.
pt_br: Emitido quando o ambiente determina quais arquivos fonte foram alterados e devem ser relidos. Você pode retornar um iterável de docnames para reler.

source: Emitted when Consistency checks phase. You can check consistency of metadata for whole of documents.
pt_br: Emitido durante a fase de verificação de consistência. Você pode verificar a consistência dos metadados de todos os documentos.

source: ``Exception`` or ``None``
pt_br: ``Exception`` ou ``None``

source: Emitted when a build has finished, before Sphinx exits, usually used for cleanup. This event is emitted even when the build process raised an exception, given as the *exception* argument. The exception is reraised in the application after the event handlers have run. If the build process raised no exception, *exception* will be ``None``. This allows to customize cleanup actions depending on the exception status.
pt_br: Emitido quando uma construção é concluída, antes da saída do Sphinx, geralmente usado para limpeza. Este evento é emitido mesmo quando o processo de construção levanta uma exceção, fornecida como argumento *exception*. A exceção é levantada novamente na aplicação após a execução dos manipuladores de eventos. Se o processo de construção não levantou nenhuma exceção, *exception* será ``None``. Isto permite personalizar ações de limpeza dependendo do status da exceção.

source: Builder specific events
pt_br: Eventos específicos do construtor

source: These events are emitted by specific builders.
pt_br: Esses eventos são emitidos por construtores específicos.

source: iterable of ``(pagename, context, templatename)`` where *pagename* and *templatename* are strings and *context* is a ``dict[str, Any]``.
pt_br: iterável de ``(pagename, context, templatename)`` onde *pagename* e *templatename* são strings e *context* é um ``dict[str, Any]``.

source: Emitted when the HTML builder is starting to write non-document pages.
pt_br: Emitido quando o construtor HTML está começando a escrever páginas que não são de documento.

source: You can add pages to write by returning an iterable from this event.
pt_br: Você pode adicionar páginas para escrever retornando um iterável deste evento.

source: :class:`docutils.nodes.document` or ``None``
pt_br: :class:`docutils.nodes.document` ou ``None``

source: ``str`` or ``None``
pt_br: ``str`` ou ``None``

source: Emitted when the HTML builder has created a context dictionary to render a template with -- this can be used to add custom elements to the context.
pt_br: Emitido quando o construtor HTML cria um dicionário de contexto para renderizar um modelo -- isso pode ser usado para adicionar elementos personalizadosao contexto.

source: The *pagename* argument is the canonical name of the page being rendered, that is, without ``.html`` suffix and using slashes as path separators. The *templatename* is the name of the template to render, this will be ``'page.html'`` for all pages from reST documents.
pt_br: O argumento *pagename* é o nome canônico da página que está sendo renderizada, ou seja, sem o sufixo ``.html`` e usando barras como separadores de caminho. O *templatename* é o nome do modelo a ser renderizado, será ``'page.html'`` para todas as páginas dos documentos reST.

source: The *context* argument is a dictionary of values that are given to the template engine to render the page and can be modified to include custom values.
pt_br: O argumento *context* é um dicionário de valores que são fornecidos ao mecanismo de modelo para renderizar a página e pode ser modificado para incluir valores personalizados.

source: The *doctree* argument will be a doctree when the page is created from a reST documents; it will be ``None`` when the page is created from an HTML template alone.
pt_br: O argumento *doctree* será uma doctree quando a página for criada a partir de documentos reST; será ``None`` quando a página for criada apenas a partir de um modelo HTML.

source: You can return a string from the handler, it will then replace ``'page.html'`` as the HTML template for this page.
pt_br: Você pode retornar uma string do manipulador, ele substituirá ``'page.html'`` como o modelo HTML para esta página.

source: You can install JS/CSS files for the specific page via :meth:`.Sphinx.add_js_file` and :meth:`.Sphinx.add_css_file` (since v3.5.0).
pt_br: Você pode instalar arquivos JS/CSS para a página específica via :meth:`.Sphinx.add_js_file` e :meth:`.Sphinx.add_css_file` (desde v3.5.0).

source: The return value can now specify a template name.
pt_br: O valor de retorno agora pode especificar um nome de modelo.

source: ``str`` of the collected URI
pt_br: ``str`` do URI coletado

source: Emitted when the linkcheck builder collects hyperlinks from document.
pt_br: Emitido quando o construtor linkcheck coleta hiperlinks do documento.

source: The event handlers can modify the URI by returning a string.
pt_br: Os manipuladores de eventos podem modificar o URI retornando uma string.
