Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/extdev/i18n.po
Languages: pt_br, zh_cn

source: i18n API
pt_br: API i18n
zh_cn: i18n接口

source: Look for message catalogs in `locale_dirs` and *ensure* that there is at least a NullTranslations catalog set in `translators`. If called multiple times or if several ``.mo`` files are found, their contents are merged together (thus making ``init`` reentrant).
pt_br: Procure catálogos de mensagens em `locale_dirs` e *certifique-se* de que haja pelo menos um catálogo NullTranslations definido em `translators`. Se chamado várias vezes ou se vários arquivos ``.mo`` forem encontrados, seus conteúdos são mesclados (tornando o ``init`` reentrante).
zh_cn: 在“locale_dirs”中查找邮件目录，并确保在“translators”中至少设置了一个空翻译目录。如果多次调用或找到多个`.mo``文件，它们的内容将合并在一起（从而使``init``可重入）。

source: Initialize locale for console.
pt_br: Inicialize o código do localidade para o console.
zh_cn: 初始化控制台的区域设置。

source: Get a translation function based on the *catalog* and *namespace*.
pt_br: Obtenha uma função de tradução baseada no *catálogo* e no *namespace*.
zh_cn: 获取基于*catalog*和*namespace*的翻译函数。

source: The extension can use this API to translate the messages on the extension::
pt_br: A extensão pode usar essa API para traduzir as mensagens na extensão::
zh_cn: 扩展可以使用此接口转换扩展上的消息：

source: With this code, sphinx searches a message catalog from ``${package_dir}/locales/${language}/LC_MESSAGES/myextension.mo``. The :confval:`language` is used for the searching.
pt_br: Com este código, o sphinx pesquisa um catálogo de mensagens em ``${package_dir}/locales/${language}/LC_MESSAGES/myextension.mo``. O :confval:`language` é usado para a pesquisa.
zh_cn: 使用这段代码，sphinx从`${package\udir}/locales/${language}/LC}MESSAGES中搜索消息目录/我的扩展.mo``. ：confval:`language`用于搜索。

source: Translation function for messages on documentation (menu, labels, themes and so on). This function follows :confval:`language` setting.
pt_br: Função de tradução para mensagens na documentação (menu, etiquetas, temas e assim por diante). Esta função segue a configuração :confval:`language`.
zh_cn: 文档信息（菜单、标签、主题等）的翻译功能。此函数遵循：confval:`language`设置。

source: Translation function for console messages This function follows locale setting (`LC_ALL`, `LC_MESSAGES` and so on).
pt_br: Função de tradução para mensagens do console. Essa função segue a configuração de localidade (`LC_ALL`, `LC_MESSAGES` e assim por diante).
zh_cn: 控制台消息的翻译函数此函数遵循区域设置（`LC`ALL`、`LC`messages`等）。

source: Extension internationalization (`i18n`) and localization (`l10n`) using i18n API
pt_br: Internacionalização de extensão (`i18n`) e localização (`l10n`) usando API i18n
zh_cn: 使用i18n接口的插件国际化（`i18n`）和本地化（`l10n`）

source: An extension may naturally come with message translations. This is briefly summarized in :func:`sphinx.locale.get_translation` help.
pt_br: Uma extensão pode vir naturalmente com traduções de mensagens. Isso é resumido brevemente na ajuda :func:`sphinx.locale.get_translation`.
zh_cn: 插件很自然地会伴随着消息翻译而来。简要总结如下：func:`sphinx.locale.get_翻译`帮助。

source: In practice, you have to:
pt_br: Na prática, você tem que:
zh_cn: 实际上，您必须：

source: Choose a name for your message catalog, which must be unique. Usually the name of your extension is used for the name of message catalog.
pt_br: Escolha um nome para o seu catálogo de mensagens, que deve ser exclusivo. Normalmente, o nome do seu ramal é usado para o nome do catálogo de mensagens.
zh_cn: 为邮件目录选择一个名称，该名称必须是唯一的。通常，插件名的名称用于消息目录的名称。

source: Mark in your extension sources all messages as translatable, via :func:`sphinx.locale.get_translation` function, usually renamed ``_()``, e.g.:
pt_br: Marque em suas fontes de extensão todas as mensagens como traduzíveis, através da função :func:`sphinx.locale.get_translation`, geralmente renomeada para ``_()``, por exemplo:
zh_cn: 通过：func:`sphinx.locale.get_翻译`函数，通常重命名为```uU（）``，例如：

source: Set up your extension to be aware of its dedicated translations:
pt_br: Configure sua extensão para estar ciente de suas traduções dedicadas:
zh_cn: 设置插件以了解其专用翻译：

source: Generate message catalog template ``*.pot`` file, usually in ``locale/`` source directory, for example via `Babel`_:
pt_br: Gere o arquivo modelo de catálogo de mensagens ``*.pot``, geralmente no diretório fonte ``locale/``, por exemplo via `Babel`_:
zh_cn: 生成消息目录模板“*.pot”文件，通常位于“locale/`”源目录中，例如通过“Babel”生成：

source: Create message catalogs (``*.po``) for each language which your extension will provide localization, for example via `Babel`_:
pt_br: Crie catálogos de mensagens (``*.po``) para cada idioma para o qual sua extensão fornecerá localização, por exemplo via `Babel`_:
zh_cn: 为您的插件将提供本地化的每种语言创建消息目录（`*.po```），例如通过“Babel”`：

source: Translate message catalogs for each language manually
pt_br: Traduzir catálogos de mensagens para cada idioma manualmente
zh_cn: 手动翻译每种语言的邮件目录

source: Compile message catalogs into ``*.mo`` files, for example via `Babel`_:
pt_br: Compile catálogos de mensagens em arquivos ``*.mo``, por exemplo via `Babel`_:
zh_cn: 将邮件目录编译为`*.mo``文件，例如通过“Babel”\：

source: Ensure that message catalog files are distributed when your package will be installed, by adding equivalent line in your extension ``MANIFEST.in``:
pt_br: Certifique-se de que os arquivos do catálogo de mensagens sejam distribuídos quando seu pacote for instalado, adicionando uma linha equivalente em sua extensão ``MANIFEST.in``:
zh_cn: 通过在扩展名中添加等效行，确保在安装包时分发了消息目录文件``MANIFEST.in``:

source: When the messages on your extension has been changed, you need to also update message catalog template and message catalogs, for example via `Babel`_:
pt_br: Quando as mensagens em sua extensão foram alteradas, você também precisa atualizar o modelo de catálogo de mensagens e os catálogos de mensagens, por exemplo, via `Babel`_:
zh_cn: 当您的扩展名上的消息发生更改时，您还需要更新消息目录模板和消息目录，例如通过“Babel”
