Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/extdev/index.po
Languages: pt_br

source: Since many projects will need special features in their documentation, Sphinx is designed to be extensible on several levels.
pt_br: Como muitos projetos necessitam de funcionalidades especiais em sua documentação, Sphix foi desenhado para ser extensível em diversos níveis.

source: Here are a few things you can do in an extension:
pt_br: Aqui estão algumas coisas que você pode fazer em uma extensão:

source: Add new :term:`builder`\s to support new output formats or actions on the parsed documents.
pt_br: Adiciona um novo :term:`construtor <builder>` para ter suporte aos novos formatos de saída ou ações nos documentos analisados.

source: Register custom reStructuredText roles and directives, extending the markup using the :doc:`markupapi`.
pt_br: Registra papéis e diretivas reStructuredText personalizadas, estendendo a marcação usando a :doc:`markupapi`.

source: Add custom code to so-called "hook points" at strategic places throughout the build process, allowing you to register a hook and run specialized code. For example, see the :ref:`events`.
pt_br: Adiciona código personalizado aos chamados "pontos de gancho" em locais estratégicos ao longo do processo de construção, permitindo que você registre um gancho e execute código especializado. Por exemplo, veja :ref:`events`.

source: An extension is simply a Python module with a ``setup()`` function. A user activates the extension by placing the extension's module name (or a sub-module) in their :confval:`extensions` configuration value.
pt_br: Uma extensão é simplesmente um módulo Python com uma função ``setup()``. Um usuário ativa a extensão colocando o nome do módulo da extensão (ou um submódulo) em seu valor de configuração :confval:`extensions`.

source: The configuration file itself can be treated as an extension if it contains a ``setup()`` function. All other extensions to load must be listed in the :confval:`extensions` configuration value.
pt_br: A configuração do próprio arquivo pode ser tratada como uma extensão se ela contiver uma função ``setup()``. Todas as outras extensões para serem carregadas devem estar listadas em :confval:`extensions`

source: Important objects
pt_br: Objetos importantes

source: There are several key objects whose API you will use while writing an extension. These are:
pt_br: Existem vários objetos-chave cuja API você usará ao escrever uma extensão. São eles:

source: **Application**
pt_br: **Applicação**

source: The application object (usually called ``app``) is an instance of :class:`.Sphinx`. It controls most high-level functionality, such as the setup of extensions, event dispatching and producing output (logging).
pt_br: O objeto de aplicação (geralmente chamado ``app``) é uma instância de :class:`.Sphinx`. Ele controla a maioria das funcionalidades de alto nível, como a configuração de extensões, o despacho de eventos e a produção de saída (logging).

source: If you have the environment object, the application is available as ``env.app``.
pt_br: Se você tiver o objeto de ambiente, o aplicativo estará disponível como ``env.app``.

source: **Environment**
pt_br: **Ambiente**

source: The build environment object (usually called ``env``) is an instance of :class:`.BuildEnvironment`. It is responsible for parsing the source documents, stores all metadata about the document collection and is serialized to disk after each build.
pt_br: O objeto do ambiente de construção (geralmente chamado ``env``) é uma instância de :class:`.BuildEnvironment`. Ele é responsável por analisar os documentos de origem, armazena todos os metadados sobre a coleção de documentos e é serializado em disco após cada construção.

source: Its API provides methods to do with access to metadata, resolving references, etc. It can also be used by extensions to cache information that should persist for incremental rebuilds.
pt_br: Sua API fornece métodos para acessar metadados, resolver referências, etc. Também pode ser usada por extensões para armazenar em cache informações que devem persistir para recriações incrementais.

source: If you have the application or builder object, the environment is available as ``app.env`` or ``builder.env``.
pt_br: Se você tiver o objeto do aplicativo ou construtor, o ambiente estará disponível como ``app.env`` ou ``builder.env``.

source: **Builder**
pt_br: **Construtor**

source: The builder object (usually called ``builder``) is an instance of a specific subclass of :class:`.Builder`. Each builder class knows how to convert the parsed documents into an output format, or otherwise process them (e.g. check external links).
pt_br: O objeto construtor (geralmente chamado ``builder``) é uma instância de uma subclasse específica de :class:`.Builder`. Cada classe de construtor sabe como converter os documentos analisados em um formato de saída ou processá-los (por exemplo, verificar links externos).

source: If you have the application object, the builder is available as ``app.builder``.
pt_br: Se você tiver o objeto do aplicativo, o construtor estará disponível como ``app.builder``.

source: The config object (usually called ``config``) provides the values of configuration values set in :file:`conf.py` as attributes. It is an instance of :class:`.Config`.
pt_br: O objeto de configuração (geralmente chamado ``config``) fornece os valores dos valores de configuração definidos em :file:`conf.py` como atributos. É uma instância de :class:`.Config`.

source: The config is available as ``app.config`` or ``env.config``.
pt_br: A configuração está disponível como ``app.config`` ou ``env.config``.

source: To see an example of use of these objects, refer to :doc:`../development/tutorials/index`.
pt_br: Para ver um exemplo de uso desses objetos, consulte :doc:`../development/tutorials/index`.

source: Build Phases
pt_br: Fases Construção

source: One thing that is vital in order to understand extension mechanisms is the way in which a Sphinx project is built: this works in several phases.
pt_br: Uma coisa que é vital para entender os mecanismos de extensão é a maneira como um projeto ``Sphinx`` é construído: isso funciona em várias fases.

source: **Phase 0: Initialization**
pt_br: **Phase 0: Inicialização**

source: In this phase, almost nothing of interest to us happens. The source directory is searched for source files, and extensions are initialized. Should a stored build environment exist, it is loaded, otherwise a new one is created.
pt_br: Nesta fase, quase nada de interessante para nós acontece. O diretório de origem é pesquisado por arquivos de origem e as extensões são inicializadas. Se existir um ambiente de construção armazenado, ele será carregado, caso contrário, um novo será criado.

source: **Phase 1: Reading**
pt_br: **Phase 1: Leitura**

source: In Phase 1, all source files (and on subsequent builds, those that are new or changed) are read and parsed. This is the phase where directives and roles are encountered by docutils, and the corresponding code is executed. The output of this phase is a *doctree* for each source file; that is a tree of docutils nodes. For document elements that aren't fully known until all existing files are read, temporary nodes are created.
pt_br: Na Fase 1, todos os arquivos de origem (e em construções subsequentes, aqueles que são novos ou alterados) são lidos e analisados. Esta é a fase em que diretivas e funções são encontradas pelos docutils e o código correspondente é executado. A saída desta fase é um *doctree* para cada arquivo fonte; isso é uma árvore de nós docutils. Para elementos de documento que não são totalmente conhecidos até que todos os arquivos existentes sejam lidos, nós temporários são criados.

source: During reading, the build environment is updated with all meta- and cross reference data of the read documents, such as labels, the names of headings, described Python objects and index entries. This will later be used to replace the temporary nodes.
pt_br: Durante a leitura, o ambiente de construção é atualizado com todos os dados de meta e referência cruzada dos documentos lidos, como labels, os nomes dos títulos, objetos descritos do Python e entradas de índice. Isso será usado posteriormente para substituir os nós temporários.

source: The parsed doctrees are stored on the disk, because it is not possible to hold all of them in memory.
pt_br: Os ``doctrees`` analisados são armazenados no disco, porque não é possível manter todos eles na memória.

source: **Phase 2: Consistency checks**
pt_br: **Phase 2: Verificações e consistências**

source: Some checking is done to ensure no surprises in the built documents.
pt_br: Alguma verificação é feita para garantir que não haja surpresas nos documentos construídos.

source: **Phase 3: Resolving**
pt_br: **Fase 3: Resolução**

source: Now that the metadata and cross-reference data of all existing documents is known, all temporary nodes are replaced by nodes that can be converted into output using components called transforms. For example, links are created for object references that exist, and simple literal nodes are created for those that don't.
pt_br: Agora que os metadados e os dados de referência cruzada de todos os documentos existentes são conhecidos, todos os nós temporários são substituídos por nós que podem ser convertidos em saída usando componentes chamados de transformações. Por exemplo, links são criados para referências de objetos existentes e nós literais simples são criados para aqueles que não existem.

source: **Phase 4: Writing**
pt_br: **Fase 4: Gravação**

source: This phase converts the resolved doctrees to the desired output format, such as HTML or LaTeX. This happens via a so-called docutils writer that visits the individual nodes of each doctree and produces some output in the process.
pt_br: Esta fase converte os ``doctrees`` resolvidos no formato de saída desejado, como HTML ou LaTeX. Isso acontece por meio de um escritor chamado ``docutils``, que visita os nós individuais de cada ``doctree`` e produz alguma saída no processo.

source: Some builders deviate from this general build plan, for example, the builder that checks external links does not need anything more than the parsed doctrees and therefore does not have phases 2--4.
pt_br: Alguns construtores se desviam desse plano de construção geral, por exemplo, o construtor que verifica links externos não precisa de nada além dos ``doctrees`` analisados e, portanto, não possui as fases 2-4.

source: To see an example of application, refer to :doc:`../development/tutorials/todo`.
pt_br: Para ver um exemplo de aplicação, consulte :doc:`../development/tutorials/todo`.

source: Extension metadata
pt_br: Extensões Metadados

source: The ``setup()`` function can return a dictionary. This is treated by Sphinx as metadata of the extension. Metadata keys currently recognized are:
pt_br: A função ``setup()`` pode retornar um dicionário. Isso é tratado pelo Sphinx como extensão de metadados. Chaves dos Metadados normalmente reconhecidas são:

source: ``'version'``: a string that identifies the extension version. It is used for extension version requirement checking (see :confval:`needs_extensions`) and informational purposes. If not given, ``"unknown version"`` is substituted.
pt_br: ``'version'``: uma palavra que identifica a versão da extensão. É utilizada para a verificação da versão mínima requerida (ver :confval:`needs_extensions`) e finalidades de informação. Se não informado será apresentado ``"versão desconhecida"``

source: ``'env_version'``: an integer that identifies the version of env data structure if the extension stores any data to environment. It is used to detect the data structure has been changed from last build. The extensions have to increment the version when data structure has changed. If not given, Sphinx considers the extension does not stores any data to environment.
pt_br: ``'env_version'``: um inteiro que identifica a versão da estrutura de dados ``env`` se a extensão armazena dados no ambiente. Ele é usado para detectar que a estrutura de dados foi alterada da última construção. As extensões precisam incrementar a versão quando a estrutura de dados for alterada. Se não for fornecido, o ``Sphinx`` considera que a extensão não armazena dados no ambiente.

source: ``'parallel_read_safe'``: a boolean that specifies if parallel reading of source files can be used when the extension is loaded. It defaults to ``False``, i.e. you have to explicitly specify your extension to be parallel-read-safe after checking that it is.
pt_br: ``'parallel_read_safe'``: valor booleano que especifica se leitura paralela dos arquivos fontes pode ser usada, quando a extensão for carregada. O valor padrão é ``False``, ex. deve ser explicitado que sua função pode usar processamento paralelo, após a devida comprovação através dos testes.

source: ``'parallel_write_safe'``: a boolean that specifies if parallel writing of output files can be used when the extension is loaded. Since extensions usually don't negatively influence the process, this defaults to ``True``.
pt_br: ``'parallel_write_safe'``: valor booleano que especifica que a gravação dos arquivos de saída pode ser usada quando sua extensão for carregada. Normalmente extensões não influenciam negativamente o processo, o valor padrão é ``True``.

source: APIs used for writing extensions
pt_br: APIs usadas para gravar extensões
