Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/extdev/parserapi.po
Languages: pt_br, zh_cn

source: Parser API
zh_cn: 解析器接口

source: `The docutils documentation describes`__ parsers as follows:
pt_br: `A documentação do docutils descreve`__ analisadores da seguinte forma:
zh_cn: `docutils文档对“解析器”的描述如下：

source: The Parser analyzes the input document and creates a node tree representation.
pt_br: O Analisador analisa o documento de entrada e cria uma representação de árvore de nós.
zh_cn: 解析器分析输入文档并创建节点树表示。

source: In Sphinx, the parser modules works as same as docutils. The parsers are registered to Sphinx by extensions using Application APIs; :meth:`.Sphinx.add_source_suffix()` and :meth:`.Sphinx.add_source_parser()`.
pt_br: No Sphinx, os módulos do analisador funcionam da mesma forma que os docutils. Os analisadores são registrados no Sphinx por extensões usando APIs de aplicativos; :meth:`.Sphinx.add_source_suffix()` e :meth:`.Sphinx.add_source_parser()`.
zh_cn: 在Sphinx中，解析器模块的工作原理与docutils相同。解析器通过使用应用接口的扩展注册到Sphinx；：meth:`。Sphinx.add_source_suffix()`and:meth:`。Sphinx.add_source_parser()`.

source: The *source suffix* is a mapping from file suffix to file type. For example, ``.rst`` file is mapped to ``'restructuredtext'`` type. Sphinx uses the file type to looking for parsers from registered list. On searching, Sphinx refers to the ``Parser.supported`` attribute and picks up a parser which contains the file type in the attribute.
pt_br: O *source suffix* é um mapeamento do sufixo do arquivo para o tipo de arquivo. Por exemplo, o arquivo ``.rst`` é mapeado para o tipo ``'restructuredtext'``. Sphinx usa o tipo de arquivo para procurar analisadores da lista registrada. Na busca, o Sphinx se refere ao atributo ``Parser.supported`` e pega um analisador que contém o tipo de arquivo no atributo.
zh_cn: *源后缀*是从文件后缀到文件类型的映射。例如，`.rst``文件映射到`'RestructedText``类型。Sphinx使用文件类型从已注册的列表中查找解析器。在搜索时，斯芬克斯指的是``解析器。支持``属性并获取包含属性中文件类型的解析器。

source: The users can override the source suffix mappings using :confval:`source_suffix` like following::
pt_br: Os usuários podem substituir os mapeamentos de sufixo de origem usando :confval:`source_suffix` como a seguir::
zh_cn: 用户可以使用：confval:`source_suffix`重写源后缀映射，如下所示：

source: You should indicate file types your parser supports. This will allow users to configure their settings appropriately.
pt_br: Você deve indicar os tipos de arquivo que seu analisador suporta. Isso permitirá que os usuários definam suas configurações adequadamente.
zh_cn: 您应该指出解析器支持的文件类型。这将允许用户适当地配置他们的设置。

source: A base class of source parsers. The additional parsers should inherit this class instead of ``docutils.parsers.Parser``. Compared with ``docutils.parsers.Parser``, this class improves accessibility to Sphinx APIs.
pt_br: Uma classe base de analisadores de origem. Os analisadores adicionais devem herdar esta classe ao invés de ``docutils.parsers.Parser``. Comparada com ``docutils.parsers.Parser``, esta classe melhora a acessibilidade às APIs Sphinx.
zh_cn: 源解析程序的基类。其他解析器应该继承这个类，而不是``docutils.parsers.Parser``. 与``docutils.parsers.Parser``，该类改进了Sphinx API的可访问性。

source: The subclasses can access following objects and functions:
zh_cn: 子类可以访问以下对象和函数：

source: The application object (:class:`sphinx.application.Sphinx`)
zh_cn: 应用程序对象（：class:`sphinx.application.sphinx`)

source: The config object (:class:`sphinx.config.Config`)
zh_cn: 配置对象（：class:`sphinx.config.config`)

source: The environment object (:class:`sphinx.environment.BuildEnvironment`)
zh_cn: 环境对象（：class:`sphinx.environment.BuildEnvironment`)

source: Emit a warning. (Same as :meth:`sphinx.application.Sphinx.warn()`)
zh_cn: 发出警告。（同：meth:`sphinx.application.Sphinx.warn()``）

source: Emit a informational message. (Same as :meth:`sphinx.application.Sphinx.info()`)
zh_cn: 发出信息性消息。（同：meth:`sphinx.application.sphinx.info（）`）

source: ``warn()`` and ``info()`` is deprecated. Use :mod:`sphinx.util.logging` instead.
zh_cn: ``warn（）``和`info（）``已弃用。使用：mod:`sphinx.util.logging`代替。

source: parser.app is deprecated.
zh_cn: parser.app已弃用。

source: The subclasses can access sphinx core runtime objects (app, config and env).
pt_br: As subclasses podem acessar objetos de runtime do núcleo sphinx (app, config e env).

source: set_application will be called from Sphinx to set app and other instance variables
pt_br: set_application será chamado do Sphinx para definir a aplicação e outras variáveis de instância

source: Parameters
pt_br: Parâmetros

source: Sphinx application object
pt_br: Objeto de aplicação Sphinx

source: The config object
pt_br: O objeto configuração

source: The environment object
pt_br: O objeto ambiente
