Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/extdev/projectapi.po
Languages: pt_br, zh_cn

source: Project API
pt_br: API de projeto
zh_cn: 项目接口

source: A project is the source code set of the Sphinx document(s).
pt_br: Um projeto é o conjunto de código-fonte do(s) documento(s) Sphinx.

source: Find all document files in the source directory and put them in :attr:`docnames`.
pt_br: Encontra todos os arquivos de documentos no diretório fonte e coloca-os em :attr:`docnames`.
zh_cn: 在源目录中查找所有文档文件，并将它们放入：attr:`docnames`。

source: Return the filename for the document name.
pt_br: Retorna o nome do arquivo para o nome do documento.
zh_cn: 返回文件名的文件名。

source: If *absolute* is True, return as an absolute path. Else, return as a relative path to the source directory.
pt_br: Se *absolute* for True, retorna como um caminho absoluto. Caso contrário, retorne como um caminho relativo para o diretório fonte.

source: Return the docname for the filename if the file is a document.
pt_br: Retorna o docname para o nome do arquivo se o arquivo for um documento.

source: *filename* should be absolute or relative to the source directory.
pt_br: *filename* deve ser absoluto ou relativo ao diretório fonte.
zh_cn: *文件名*应该是绝对的或相对于源目录的。

source: Take over a result of last build.
pt_br: Assume o resultado da última construção.
zh_cn: 接管上次生成的结果。

source: The name of documents belonging to this project.
pt_br: O nome dos documentos pertencentes a este projeto.

source: source_suffix. Same as :confval:`source_suffix`.
pt_br: source_suffix. Mesmo que :confval:`source_suffix`.
zh_cn: source_suffix。同：confval:`source_suffix`。

source: Source directory.
pt_br: Diretório fonte.
zh_cn: 源目录

source: A project is source code set of Sphinx document.
zh_cn: 项目是Sphinx文档的源代码集。

source: If *basedir* is True, return as an absolute path. Else, return as a relative path to the source directory.
zh_cn: 如果*basedir*为True，则返回为绝对路径。否则，作为源目录的相对路径返回。

source: Return the docname for the filename if the file is document.
zh_cn: 如果文件是document，则返回文件名的docname。

source: The name of documents belongs to this project.
zh_cn: 文件名称属于此项目。
