Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/extdev/builderapi.po
Languages: pt_br, zh_cn

source: Builder API
pt_br: API de construtor
zh_cn: 构建器API

source: This is the base class for all builders.
pt_br: Esta é a classe base para todos os construtores.
zh_cn: 这是所有构建器的基类。

source: It follows this basic workflow:
pt_br: Ela segue este fluxo de trabalho básico:
zh_cn: 它遵循以下基本工作流程：

source: Call graph for the standard Sphinx build workflow
pt_br: Grafo de chamadas para o fluxo de trabalho padrão de construção do Sphinx
zh_cn: 标准Sphinx生成工作流程的调用图

source: Overridable Attributes
pt_br: Atributos substituíveis
zh_cn: 可重写的属性

source: These class attributes should be set on builder sub-classes:
pt_br: Estes atributos de classe devem ser definidos em subclasses de construtor:
zh_cn: 这些类属性应设置在构建器（构建器）子类之上：

source: The builder's name. This is the value used to select builders on the command line.
pt_br: O nome do construtor. Este é o valor usado para selecionar construtores na linha de comando.
zh_cn: 构建器的名字。这是在命令行上选择构建器时使用的值。

source: The builder's output format, or '' if no document output is produced. This is commonly the file extension, e.g. "html", though any string value is accepted. The builder's format string can be used by various components such as :class:`.SphinxPostTransform` or extensions to determine their compatibility with the builder.
pt_br: O formato de saída do construtor, ou '' se nenhuma saída de documento for produzida. Esta é geralmente a extensão do arquivo, por exemplo, "html", embora qualquer valor de string seja aceito. A string de formato do construtor pode ser usada por vários componentes, como :class:`.SphinxPostTransform` ou extensões para determinar sua compatibilidade com o construtor.
zh_cn: 构建器的输出格式，如果没有生成文档输出则为空字符串。这通常是文件扩展名，例如“html”，但接受任何字符串值。构建器的格式字符串可以被各种组件（如 :class:`.SphinxPostTransform` 或扩展）用来确定它们与构建器的兼容性。

source: The message emitted upon successful build completion. This can be a printf-style template string with the following keys: ``outdir``, ``project``
pt_br: A mensagem emitida após a conclusão bem-sucedida da construção. Esta pode ser uma string de modelo no estilo printf com as seguintes chaves: ``outdir``, ``project``
zh_cn: 成功完成生成时发出的消息。这可以是一个printf样式的模板字符串，具有以下键：``outdir``，``project``

source: Whether it is safe to make parallel :meth:`~.Builder.write_doc` calls.
pt_br: Se é seguro fazer chamadas paralelas de :meth:`~.Builder.write_doc`.
zh_cn: 是否可以安全地进行并行 :meth:`~.Builder.write_doc` 调用。

source: The list of MIME types of image formats supported by the builder. Image files are searched in the order in which they appear here.
pt_br: A lista de tipos MIME de formatos de imagem suportados pelo construtor. Os arquivos de imagem são pesquisados ​​na ordem em que aparecem aqui.
zh_cn: 构建器支持的图像格式的MIME类型列表。图像文件按它们在此处出现的顺序进行搜索。

source: The builder can produce output documents that may fetch external images when opened.
pt_br: O construtor pode produzir documentos de saída que podem buscar imagens externas quando abertos.
zh_cn: 构建器可以生成在打开时可能获取外部图像的输出文档。

source: The file format produced by the builder allows images to be embedded using data-URIs.
pt_br: O formato de arquivo produzido pelo construtor permite que imagens sejam incorporadas usando URIs de dados.
zh_cn: 构建器生成的文件格式允许使用数据URI嵌入图像。

source: default translator class for the builder. This can be overridden by :py:meth:`~sphinx.application.Sphinx.set_translator`.
pt_br: Classe tradutora padrão para o construtor. Isso pode ser substituído por :py:meth:`~sphinx.application.Sphinx.set_translator`.
zh_cn: 构建器的默认转换器类。可以通过 :py:meth:`~sphinx.application.Sphinx.set_translator` 重写。

source: Core Methods
pt_br: Métodos principais
zh_cn: 核心方法

source: These methods define the core build workflow and must not be overridden:
pt_br: Estes métodos definem o fluxo principal de construção e devem ser substituídos:
zh_cn: 这些方法定义了核心构建工作流程，不能被重写：

source: Build all source files.
pt_br: Constrói todos os arquivos fonte.
zh_cn: 生成所有源文件。

source: Only rebuild as much as needed for changes in the *filenames*.
pt_br: Reconstrói apenas o necessário para alterações nos *filename*.
zh_cn: 仅根据需要重新生成 *filenames* 中的更改。

source: Only rebuild what was changed or added since last build.
pt_br: Reconstrói apenas o que foi alterado ou adicionado desde a última construção.
zh_cn: 仅重建自上次生成以来更改或添加的内容。

source: Main build method, usually called by a specific ``build_*`` method.
pt_br: Método de construção principal, geralmente chamado por um método ``build_*`` específico.
zh_cn: 主要的构建方法，通常由特定的 ``build_*`` 方法调用。

source: First updates the environment, and then calls :meth:`!write`.
pt_br: Primeiro atualiza o ambiente e depois chama :meth:`!write`.
zh_cn: 首先，更新环境，然后调用 :meth:`!write`。

source: (Re-)read all files new or changed since last update.
pt_br: (Re-)lê todos os arquivos novos ou alterados desde a última atualização.
zh_cn: (重新)读取自上次更新以来所有新的或更改的文件。

source: Store all environment docnames in the canonical format (ie using SEP as a separator in place of os.path.sep).
pt_br: Armazena todos os docnames do ambiente no formato canônico (ou seja, usando SEP como separador no lugar de os.path.sep).
zh_cn: 将所有环境文档名称存储在规范格式中（即使用 SEP 作为 os.path.sep 的分隔符）。

source: Parse a file and add/update inventory entries for the doctree.
pt_br: Analisa um arquivo e adiciona/atualiza entradas de inventário para a doctree.
zh_cn: 解析文件并为文档树添加/更新清单条目。

source: Write the doctree to a file, to be used as a cache by re-builds.
pt_br: Escreve a doctree em um arquivo, para ser usado como cache nas reconstruções.
zh_cn: 将文档树写入文件，以供重新生成时用作缓存。

source: Write builder specific output files.
pt_br: Escreve arquivos de saída específicos do construtor.
zh_cn: 编写特定于构建器的输出文件。

source: Abstract Methods
pt_br: Métodos abstratos
zh_cn: 抽象方法

source: These must be implemented in builder sub-classes:
pt_br: Estes devem ser implementados em subclasses de construtor:
zh_cn: 这些必须在构建器子类中实现：

source: Return an iterable of output files that are outdated, or a string describing what an update build will build.
pt_br: Retorna um iterável de arquivos de saída desatualizados ou uma string descrevendo o que uma construção de atualização construir.
zh_cn: 返回一个过时的输出文件的迭代器，或一个描述更新生成将生成什么的字符串。

source: If the builder does not output individual files corresponding to source files, return a string here. If it does, return an iterable of those files that need to be written.
pt_br: Se o construtor não gerar arquivos individuais correspondentes aos arquivos fonte, retorna uma string aqui. Em caso afirmativo, retorna um iterável dos arquivos que precisam ser escritos.
zh_cn: 如果构建器没有输出与源文件对应的单个文件，请在此处返回一个字符串。如果是，则返回需要写入的文件的迭代器。

source: Write the output file for the document
pt_br: Escreve o arquivo de saída para o documento
zh_cn: 为文档编写输出文件

source: the :term:`docname <document name>`.
pt_br: o :term:`docname <document name>`.
zh_cn: :term:`docname <document name>`。

source: defines the content to be written.
pt_br: define o conteúdo a ser escrito.
zh_cn: 定义要写入的内容。

source: The output filename must be determined within this method, typically by calling :meth:`~.Builder.get_target_uri` or :meth:`~.Builder.get_relative_uri`.
pt_br: O nome do arquivo de saída deve ser determinado dentro deste método, normalmente chamando :meth:`~.Builder.get_target_uri` ou :meth:`~.Builder.get_relative_uri`.
zh_cn: 必须在此方法中确定输出文件名，通常通过调用 :meth:`~.Builder.get_target_uri` 或 :meth:`~.Builder.get_relative_uri`。

source: Return the target URI for a document name.
pt_br: Retorna o URI alvo para um nome do documento.
zh_cn: 返回文档名的目标URI。

source: *typ* can be used to qualify the link characteristic for individual builders.
pt_br: *typ* pode ser usado para qualificar a característica do link para construtores individuais.
zh_cn: *typ* 可用于限定单个构建器的链接特性。

source: Overridable Methods
pt_br: Métodos substituíveis
zh_cn: 可重写的方法

source: These methods can be overridden in builder sub-classes:
pt_br: Esses métodos podem ser substituídos nas subclasses do construtor:
zh_cn: 这些方法可以在构建器子类中重写：

source: Load necessary templates and perform initialization. The default implementation does nothing.
pt_br: Carrega os modelos necessários e executa a inicialização. A implementação padrão não faz nada.
zh_cn: 加载必要的模板并执行初始化。默认实现什么也不做。

source: Write all documents in *docnames*.
pt_br: Escreve todos documentos em *docnames*.
zh_cn: 写入 *docnames* 中的所有文档。

source: This method can be overridden if a builder does not create output files for each document.
pt_br: Este método pode ser substituído se um construtor não cria arquivos de saída para cada documento.
zh_cn: 如果构建器不为每个文档创建输出文件，则可以重写此方法。

source: A place where you can add logic before :meth:`write_doc` is run
pt_br: Um lugar onde você pode adicionar lógica antes de :meth:`write_doc` ser executado
zh_cn: 在运行 :meth:`write_doc` 之前可以添加逻辑的地方

source: Where assets (images, static files, etc) are copied before writing
pt_br: Para onde os ativos (imagens, arquivos estáticos, etc) são copiados antes da escrita
zh_cn: 在编写之前复制资产（图像、静态文件等）的位置

source: Return a relative URI between two source filenames.
pt_br: Retorna um URI relativo entre dois nomes de arquivos fonte.
zh_cn: 返回两个源文件名之间的相对URI。

source: raises
pt_br: levanta
zh_cn: 引发

source: :exc:`!NoUri` if there's no way to return a sensible URI.
pt_br: :exc:`!NoUri` se não houver como retornar um URI sensato.
zh_cn: :exc:`!NoUri` 如果没有办法返回合理的URI。

source: Finish the building process.
pt_br: Conclui o processo de construção.
zh_cn: 完成构建过程。

source: The default implementation does nothing.
pt_br: A implementação padrão não faz nada.
zh_cn: 默认实现什么也不做。

source: Attributes
pt_br: Atributos

source: Attributes that are callable from the builder instance:
pt_br: Atributos que são chamáveis a partir da instância do construtor:
zh_cn: 可以从构建器实例调用的属性：

source: An :class:`.EventManager` object.
pt_br: Um objeto :class:`.EventManager`.
zh_cn: 一个 :class:`.EventManager` 类的对象。

source: Overridable Attributes (extensions)
pt_br: Atributos substituíveis (extensões)
zh_cn: 可重写的属性（扩展）

source: Builder sub-classes can set these attributes to support built-in extensions:
pt_br: As subclasses de Builder podem definir esses atributos para oferecer suporte a extensões embutidas:
zh_cn: 构建器子类可以设置这些属性以支持内置扩展：

source: By default, the :mod:`linkcode <sphinx.ext.linkcode>` extension will only inject references for an ``html`` builder. The ``supported_linkcode`` class attribute can be defined in a non-HTML builder to support managing references generated by linkcode. The expected value for this attribute is an expression which is compatible with :rst:dir:`only`.
pt_br: Por padrão, a extensão :mod:`linkcode <sphinx.ext.linkcode>` injetará apenas referências para um construtor ``html``. O atributo de classe ``supported_linkcode`` pode ser definido em um construtor não HTML para dar suporte ao gerenciamento de referências geradas pelo linkcode. O valor esperado para esse atributo é uma expressão compatível com :rst:dir:`only`.
zh_cn: 默认情况下，:mod:`linkcode <sphinx.ext.linkcode>` 扩展只会为 ``html`` 构建器注入引用。可以在非HTML构建器中定义 ``supported_linkcode`` 类属性，以支持管理linkcode生成的引用。该属性的预期值是与 :rst:dir:`only` 兼容的表达式。

source: For example, if a builder was named ``custom-builder``, the following can be used:
pt_br: Por exemplo, se um construtor foi nomeado ``custom-builder``, o seguinte pode ser usado:
zh_cn: 例如，如果构建器名为 ``custom-builder``，则可以使用以下内容：

source: Parameters
zh_cn: 参数
