Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/extdev/collectorapi.po
Languages: pt_br

source: Environment Collector API
pt_br: API do coletor de ambiente

source: An EnvironmentCollector is a specific data collector from each document.
pt_br: Um EnvironmentCollector é um coletor de dados específico de cada documento.

source: It gathers data and stores :py:class:`BuildEnvironment <sphinx.environment.BuildEnvironment>` as a database. Examples of specific data would be images, download files, section titles, metadatas, index entries and toctrees, etc.
pt_br: Ele reúne dados e armazena :py:class:`BuildEnvironment <sphinx.environment.BuildEnvironment>` como um banco de dados. Exemplos de dados específicos seriam imagens, arquivos de download, títulos de seções, metadados, entradas de índice e árvores de índice, etc.

source: This class essentially wraps a sub-set of :ref:`Sphinx event callbacks <events>`.
pt_br: Esta classe essencialmente envolve um subconjunto de :ref:`retorno de chamadas de eventos do Sphinx <events>`.

source: Remove specified data of a document.
pt_br: Remove dados especificados de um documento.

source: This method is called on the removal of the document.
pt_br: Este método é chamado de remoção do documento.

source: Return a list of docnames to re-read.
pt_br: Retorna uma lista de nomes de documentos para reler.

source: This method is called before reading the documents.
pt_br: Este método é chamado antes da leitura dos documentos.

source: This method is called after reading the whole of documents.
pt_br: Este método é chamado após a leitura de todos os documentos.

source: Merge in specified data regarding docnames from a different `BuildEnvironment` object which coming from a subprocess in parallel builds.
pt_br: Mescla dados especificados sobre nomes de documentos de um objeto `BuildEnvironment` diferente que vem de um subprocesso em construções paralelas.

source: Process a document and gather specific data from it.
pt_br: Processa um documento e coleta dados específicos dele.

source: This method is called after the document is read.
pt_br: Este método é chamado após a leitura do documento.
