Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/extdev/envapi.po
Languages: ja, pt_br, zh_cn

source: Build environment API
ja: ビルド環境API
pt_br: API de ambiente de construção
zh_cn: 生成环境接口

source: **Attributes**
ja: **属性**
pt_br: **Atributos**
zh_cn: **属性**

source: Reference to the :class:`.Sphinx` (application) object.
ja: :class:`.Sphinx` (application) オブジェクトへの参照です
pt_br: Refer. ao objeto (aplicação) :class:`.Sphinx`.
zh_cn: 对：class:`.Sphinx`（应用程序）对象的引用。

source: Reference to the :class:`.Config` object.
ja: :class:`.Config` オブジェクトへの参照です。
pt_br: Referência ao objeto :class:`.Config`.
zh_cn: 对：class:`.Config`对象的引用。

source: Target project. See :class:`.Project`.
ja: ターゲットプロジェクト。 :class:`.Project` を参照してください。
pt_br: Projeto alvo. Veja :class:`.Project`.
zh_cn: 目标项目。参见：类：`.Project`。

source: Source directory.
ja: ソースディレクトリ。
pt_br: Diretório Fonte.
zh_cn: 源目录

source: Directory for storing pickled doctrees.
ja: pickle化された doctree を格納するディレクトリ
pt_br: Diretório para armazenar doctrees serializados com pickle.
zh_cn: 用于存储doctree的目录。

source: An :class:`.EventManager` object.
ja: :class:`.EventManager` オブジェクト。
pt_br: Um objeto :class:`.EventManager`.
zh_cn: An:类：`.EventManager`对象。

source: A set of all existing docnames.
ja: 存在しているdocnameの集合
pt_br: Um conjunto de todos os docnames existentes.
zh_cn: 所有现有文件名的集合。

source: Dictionary mapping docnames to "metadata" (see :ref:`metadata`).
ja: docnameをメタデータにマッピングするための辞書です。(参考： :ref:`metadata`).
pt_br: Dicionário mapeando docnames para "metadados" (veja :ref:`metadata`).
zh_cn: 将docnames映射到“metadata”的字典（请参见：ref:`metadata`）。

source: Dictionary mapping docnames to the docutils node for their main title.
ja: docnameをdocutilのメインタイトルのノードにマッピングするための辞書です。
pt_br: Dicionário mapeando docname para o nó docutils para seu título principal.
zh_cn: 字典将docnames映射到docutils节点作为它们的主标题。

source: Returns the docname of the document currently being parsed.
ja: 現在のドキュメントに対応するdocnameを返します。
pt_br: Retorna o docname do documento que está sendo analisado no momento.
zh_cn: 返回当前正在分析的文档的文档名。

source: Returns the parser being used for to parse the current document.
pt_br: Retorna o analisador usado para analisar o documento atual.

source: **Utility methods**
ja: **ユーティリティ関数**
pt_br: **Métodos utilitários**
zh_cn: **实用方法**

source: Return the filename for the document name.
ja: ドキュメント名に関連するファイル名を返します。
pt_br: Retorna o nome do arquivo para o nome do documento.
zh_cn: 返回文件名的文件名。

source: If *base* is True, return absolute path under self.srcdir. If *base* is False, return relative path to self.srcdir.
ja: \ *base*\ がTrueの場合には、self.srcdir以下の絶対パスを返します。 \ *base*\ がFalseの場合には、self.srcdirからの相対パスを返します。
pt_br: Se *base* for True, retorna o caminho absoluto em self.srcdir. Se *base* for False, retorna o caminho relativo para self.srcdir.
zh_cn: 如果*base*为真，则返回绝对路径self.srcdir. 如果*base*为False，则将相对路径返回到self..srcdir.

source: Return paths to a file referenced from a document, relative to documentation root and absolute.
ja: ドキュメントに対応するファイルパスを、ドキュメントルートからの相対パスと絶対パスで返します。
pt_br: Retorna caminhos para um arquivo referenciado em um documento, relativo à raiz e absoluto da documentação.
zh_cn: 返回从文档引用的文件的路径（相对于文档根目录和绝对路径）。

source: In the input "filename", absolute filenames are taken as relative to the source dir, while relative filenames are relative to the dir of the containing document.
ja: "filename"が絶対パスであれば、ソースディレクトリからの相対パスとみなされます。*filename*が相対パスであれば、ドキュメントからの相対パスとみなされます。
pt_br: Na entrada "filename", os nomes de arquivos absolutos são considerados relativos ao diretório fonte, enquanto os nomes de arquivos relativos são relativos ao diretório do documento que o contém.
zh_cn: 在输入的“文件名”中，绝对文件名被视为相对于源目录，而相对文件名是相对于包含文档的显示文件列表。

source: Add *filename* as a dependency of the current document.
ja: 現在のドキュメントとの依存関係を示すための *filename* を追加します。
pt_br: Adiciona *filename* como uma dependência do documento atual.
zh_cn: 添加*文件名*作为当前文档的依赖项。

source: This means that the document will be rebuilt if this file changes.
ja: これにより、依存ファイルに変更が生じた際には現在のドキュメントもリビルドされます。
pt_br: Isso significa que o documento será reconstruído se este arquivo for alterado.
zh_cn: 这意味着如果此文件发生更改，将重新生成文档。

source: *filename* should be absolute or relative to the source directory.
ja: \ *filename*\ は絶対パスもしくは、ソースディレクトリからの相対パスで指定する必要があります。
pt_br: *filename* deve ser absoluto ou relativo ao diretório fonte.
zh_cn: *文件名*应该是绝对的或相对于源目录的。

source: Return a serial number, e.g. for index entry targets.
ja: インデックスなどで用いるための、シリアルナンバーを返します。
pt_br: Retorna um número de série, por ex. para alvos de entrada de índice.
zh_cn: 返回序列号，例如索引项目标的序列号。

source: The number is guaranteed to be unique in the current document.
ja: このシリアル番号は、現在の文書のなかで一意であることが保証されます。
pt_br: É garantido que o número seja exclusivo no documento atual.
zh_cn: 该编号保证在当前文档中是唯一的。

source: Add the current document to the list of documents that will automatically be re-read at the next build.
ja: 現在のドキュメントを、次回ビルドの際に自動再読み込みするドキュメント一覧に追加します。
pt_br: Adiciona o documento atual à lista de documentos que serão relidos automaticamente na próxima construção.
zh_cn: 将当前文档添加到将在下一次生成时自动重新读取的文档列表中。
