Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/extdev/index.po
Languages: pt_br, zh_cn

source: Sphinx API
pt_br: API do Sphinx
zh_cn: Sphinx API接口

source: Since many projects will need special features in their documentation, Sphinx is designed to be extensible on several levels.
pt_br: Como muitos projetos necessitam de funcionalidades especiais em sua documentação, Sphix foi desenhado para ser extensível em diversos níveis.
zh_cn: 因为许多项目在其文档中需要特殊的特性，所以Sphinx被设计为在多个层次上具有可扩展性。

source: Here are a few things you can do in an extension:
pt_br: Aqui estão algumas coisas que você pode fazer em uma extensão:
zh_cn: 在扩展中，您可以完成的事情：

source: Add new :term:`builder`\s to support new output formats or actions on the parsed documents.
pt_br: Adiciona um novo :term:`construtor <builder>` para ter suporte aos novos formatos de saída ou ações nos documentos analisados.
zh_cn: 添加新的 :term:`builder` （构建器），以支持新的输出格式或输出行为。

source: Register custom reStructuredText roles and directives, extending the markup using the :doc:`markupapi`.
pt_br: Registra papéis e diretivas reStructuredText personalizadas, estendendo a marcação usando a :doc:`markupapi`.
zh_cn: 使用 :doc:`markupapi` 注册自定义的reStructuredText角色和指令。

source: Add custom code to so-called "hook points" at strategic places throughout the build process, allowing you to register a hook and run specialized code. For example, see the :ref:`events`.
pt_br: Adiciona código personalizado aos chamados "pontos de gancho" em locais estratégicos ao longo do processo de construção, permitindo que você registre um gancho e execute código especializado. Por exemplo, veja :ref:`events`.
zh_cn: 将自定义代码添加到构建过程的关键位置处（所谓的"钩子点"）中，使得您可以注册钩子并运行特殊代码。例如，请参阅 :ref:`events`。

source: An extension is simply a Python module with a ``setup()`` function. A user activates the extension by placing the extension's module name (or a sub-module) in their :confval:`extensions` configuration value.
pt_br: Uma extensão é simplesmente um módulo Python com uma função ``setup()``. Um usuário ativa a extensão colocando o nome do módulo (ou submódulo) da extensão em seu valor de configuração :confval:`extensions`.
zh_cn: 扩展是带有 ``setup()`` 函数的Python模块。用户通过在 :confval:`extensions` 配置值中添加扩展模块名（或子模块）来激活扩展。

source: When :program:`sphinx-build` is executed, Sphinx will attempt to import each module that is listed, and execute ``yourmodule.setup(app)``. This function is used to prepare the extension (e.g., by executing Python code), linking resources that Sphinx uses in the build process (like CSS or HTML files), and notifying Sphinx of everything the extension offers (such as directive or role definitions). The ``app`` argument is an instance of :class:`.Sphinx` and gives you control over most aspects of the Sphinx build.
pt_br: Quando :program:`sphinx-build` é executado, o Sphinx tentará importar cada módulo listado e executar ``seumódulo.setup(app)``. Esta função é usada para preparar a extensão (por exemplo, executando código Python), vinculando recursos que o Sphinx usa no processo de construção (como arquivos CSS ou HTML) e notificando o Sphinx sobre tudo o que a extensão oferece (como definições de papéis ou diretivas). O argumento ``app`` é uma instância de :class:`.Sphinx` e dá a você controle sobre a maioria dos aspectos da construção do Sphinx.
zh_cn: 当执行 :program:`sphinx-build` 时，sphinx将尝试导入列出的每个模块，然后执行 ``yourmodule.setup(app)``。此函数用于扩展的初始化（例如，通过执行Python代码），链接Sphinx在构建过程中使用的资源（如CSS或HTML文件），并将扩展提供的所有内容通知Sphinx（例如指令或角色定义）。 ``app`` 参数是 :class:`.Sphinx` 的一个实例，它使您可以控制Sphinx构建的大多数方面。

source: The configuration file itself can be treated as an extension if it contains a ``setup()`` function. All other extensions to load must be listed in the :confval:`extensions` configuration value.
pt_br: A configuração do próprio arquivo pode ser tratada como uma extensão se ela contiver uma função ``setup()``. Todas as outras extensões para serem carregadas devem estar listadas no valor de configuração :confval:`extensions`.
zh_cn: 如果配置文件包含 ``setup()`` 函数，则该配置文件本身也被当做一个扩展。需要加载的所有其它扩展必须列在 :confval:`extensions` 配置值中。

source: The rest of this page describes some high-level aspects of developing extensions and various parts of Sphinx's behavior that you can control. For some examples of how extensions can be built and used to control different parts of Sphinx, see the :ref:`extension-tutorials-index`.
pt_br: O restante desta página descreve alguns aspectos de alto nível do desenvolvimento de extensões e várias partes do comportamento do Sphinx que você pode controlar. Para alguns exemplos de como extensões podem ser construídas e usadas para controlar diferentes partes do Sphinx, veja o :ref:`extension-tutorials-index`.
zh_cn: 本页的其余部分描述了开发扩展的一些高级方面，以及您可以控制的Sphinx行为的各个部分。有关如何创建和使用扩展来控制Sphinx的不同部分的一些示例，请参阅 :ref:`extension-tutorials-index`。

source: Important objects
pt_br: Objetos importantes
zh_cn: 重要的对象

source: There are several key objects whose API you will use while writing an extension. These are:
pt_br: Existem vários objetos-chave cuja API você usará ao escrever uma extensão. São eles:
zh_cn: 有几个关键对象，它们的API接口将在编写扩展时使用：

source: **Application**
pt_br: **Aplicação**
zh_cn: **应用**

source: The application object (usually called ``app``) is an instance of :class:`.Sphinx`. It controls most high-level functionality, such as loading config, initialising the environment, and the setup of extensions.
pt_br: O objeto aplicação (geralmente chamado ``app``) é uma instância de :class:`.Sphinx`. Ele controla a maioria das funcionalidades de alto nível, como a configuração de configuração, inicialização do ambiente e a configuração de extensões.
zh_cn: application对象（通常称为 ``app``）是 :class:`.Sphinx` 类的实例。它控制大多数高级功能，例如加载配置、初始化环境和设定扩展。

source: **Environment**
pt_br: **Ambiente**
zh_cn: **构建环境**

source: The build environment object (usually called ``env``) is an instance of :class:`.BuildEnvironment`. It is responsible for parsing the source documents, stores all metadata about the document collection and is serialized to disk after each build.
pt_br: O objeto ambiente de construção (geralmente chamado ``env``) é uma instância de :class:`.BuildEnvironment`. Ele é responsável por analisar os documentos fonte, armazena todos os metadados sobre a coleção de documentos e é serializado em disco após cada construção.
zh_cn: build environment对象（通常称为 ``env``）是 :class:`.BuildEnvironment` 类的实例。它负责解析源文档，存储文档集合的所有元数据，并在每次构建后序列化到磁盘。

source: Its API provides methods to do with access to metadata, resolving references, etc. It can also be used by extensions to cache information that should persist for incremental rebuilds.
pt_br: Sua API fornece métodos para acessar metadados, resolver referências, etc. Também pode ser usada por extensões para armazenar em cache informações que devem persistir para reconstruções incrementais.
zh_cn: 它的接口提供了访问元数据、解析引用等的方法。插件也可以使用它来缓存应该为增量重建保留的信息。

source: If you have the application or builder object, the environment is available as ``app.env`` or ``builder.env``. In :class:`.SphinxDirective`, :class:`.SphinxRole`, or :class:`.SphinxTransform` subclasses, the environment is available as ``self.env``.
pt_br: Se você tiver o objeto de aplicação ou construtor, o ambiente estará disponível como ``app.env`` ou ``builder.env``. Nas subclasses de :class:`.SphinxDirective`, :class:`.SphinxRole` ou :class:`.SphinxTransform`, o ambiente estará disponível como ``self.env``.
zh_cn: 如果您有application或builder对象，则环境可用作 ``app.env`` 或 ``builder.env``。在 :class:`.SphinxDirective`、:class:`.SphinxRole` 或 :class:`.SphinxTransform` 子类中，环境用 ``self.env`` 描述。

source: **Builder**
pt_br: **Construtor**
zh_cn: **构建器**

source: The builder object (usually called ``builder``) is an instance of a specific subclass of :class:`.Builder`. Each builder class knows how to convert the parsed documents into an output format, or otherwise process them (e.g. check external links).
pt_br: O objeto construtor (geralmente chamado ``builder``) é uma instância de uma subclasse específica de :class:`.Builder`. Cada classe de construtor sabe como converter os documentos analisados em um formato de saída ou processá-los (por exemplo, verificar links externos).
zh_cn: builder对象（通常称为 ``builder``）是一个特定子类 :class:`.Builder` 的实例。每个builder类都知道如何将已解析的文档转换为输出格式，或者以其他方式处理它们（例如，检查外部链接）。

source: If you have the application object, the builder is available as ``app.builder``.
pt_br: Se você tiver o objeto aplicação, o construtor estará disponível como ``app.builder``.
zh_cn: 如果您有application对象，则构建器用 ``app.builder`` 描述。

source: **Config**
zh_cn: **配置**

source: The config object (usually called ``config``) provides the values of configuration values set in :file:`conf.py` as attributes. It is an instance of :class:`.Config`.
pt_br: O objeto configuração (geralmente chamado ``config``) fornece os valores dos valores de configuração definidos em :file:`conf.py` como atributos. É uma instância de :class:`.Config`.
zh_cn: config对象（通常称为 ``config``）提供在 :file:`conf.py` 中作为属性设置的配置值。它是一个 :class:`.Config` 类的实例。

source: The config is available as ``env.config``, ``builder.config``, or ``app.config``. In :class:`.SphinxDirective`, :class:`.SphinxRole`, or :class:`.SphinxTransform` subclasses, the environment is available as ``self.config``.
pt_br: A configuração está disponível como ``env.config``, ``builder.config`` ou ``app.config``. Nas subclasses de :class:`.SphinxDirective`, :class:`.SphinxRole` ou :class:`.SphinxTransform`, o ambiente está disponível como ``self.config``.
zh_cn: config用 ``env.config``、``builder.config`` 或 ``app.config`` 描述。在 :class:`.SphinxDirective`、:class:`.SphinxRole` 或 :class:`.SphinxTransform` 子类中，环境用 ``self.config`` 描述。

source: **Events**
pt_br: **Eventos**
zh_cn: **事件**

source: The event manager object (usually called ``events``) manages and dispatches Sphinx's events system. It is an instance of :class:`.EventManager`.
pt_br: O objeto gerenciador de eventos (geralmente chamado de ``events``) gerencia e despacha o sistema de eventos do Sphinx. É uma instância de :class:`.EventManager`.
zh_cn: event manager对象（通常称为 ``events``）管理和分发Sphinx的事件系统。它是 :class:`.EventManager` 类的实例。

source: The event manager is available as ``env.events``, ``builder.events``, or ``app.events``.
pt_br: O gerenciador de eventos está disponível como ``env.events``, ``builder.events`` ou ``app.events``.
zh_cn: event manager用 ``env.events``、``builder.events`` 或 ``app.events`` 描述。

source: To see an example of use of these objects, refer to :ref:`the tutorials <extension-tutorials-index>`.
pt_br: Para ver um exemplo de uso destes objetos, consulte :ref:`os tutoriais <extension-tutorials-index>`.
zh_cn: 要查看这些对象的使用示例，请参阅 :ref:`the tutorials <extension-tutorials-index>`。

source: Build phases
pt_br: Fases da construção
zh_cn: 构建的各个阶段

source: One thing that is vital in order to understand extension mechanisms is the way in which a Sphinx project is built: this works in several phases.
pt_br: Uma coisa que é vital para entender os mecanismos de extensão é a maneira como um projeto Sphinx é construído: isso funciona em várias fases.
zh_cn: 为了理解扩展机制，一件至关重要的事情是Sphinx项目的构建方式：它分几个阶段工作。

source: **Phase 0: Initialization**
pt_br: **Fase 0: Inicialização**
zh_cn: **阶段0：初始化**

source: In this phase, almost nothing of interest to us happens. The source directory is searched for source files, and extensions are initialized. Should a stored build environment exist, it is loaded, otherwise a new one is created.
pt_br: Nesta fase, quase nada de interessante para nós acontece. O diretório fonte é pesquisado por arquivos fonte e as extensões são inicializadas. Se existir um ambiente de construção armazenado, ele será carregado, caso contrário, um novo será criado.
zh_cn: 在这个阶段，几乎没有任何值得我们关注的事情发生。在源目录中搜索源文件，并初始化各扩展。如果存在一个已经被保存了的构建环境，则加载该环境，否则将创建一个新环境。

source: **Phase 1: Reading**
pt_br: **Fase 1: Leitura**
zh_cn: **阶段1：读取**

source: In Phase 1, all source files (and on subsequent builds, those that are new or changed) are read and parsed. This is the phase where directives and roles are encountered by docutils, and the corresponding code is executed. The output of this phase is a *doctree* for each source file; that is a tree of docutils nodes. For document elements that aren't fully known until all existing files are read, temporary nodes are created.
pt_br: Na Fase 1, todos os arquivos fonte (e em construções subsequentes, aqueles que são novos ou alterados) são lidos e analisados. Esta é a fase em que diretivas e papéis são encontradas pelos docutils e o código correspondente é executado. A saída desta fase é um *doctree* para cada arquivo fonte; isso é uma árvore de nós docutils. Para elementos de documento que não são totalmente conhecidos até que todos os arquivos existentes sejam lidos, nós temporários são criados.
zh_cn: 在阶段1中，所有源文件（以及后续构建中的新的或更改的）都将被读取和解析。这是docutils遇到指令和角色并执行相应代码的阶段。这个阶段的输出是每个源文件的 *doctree*；这是docutils节点的树。对于在读取所有现有文件之前不完全知道的文档元素，将创建临时节点。

source: There are nodes provided by docutils, which are documented `in the docutils documentation <https://docutils.sourceforge.io/docs/ref/doctree.html>`__. Additional nodes are provided by Sphinx and :ref:`documented here <nodes>`.
pt_br: Existem nós fornecidos por docutils, que são documentados `na documentação do docutils <https://docutils.sourceforge.io/docs/ref/doctree.html>`__. Nós adicionais são fornecidos pelo Sphinx e :ref:`documentados aqui <nodes>`.
zh_cn: docutils提供的节点在 `docutils文档 <https://docutils.sourceforge.io/docs/ref/doctree.html>`__ 中有记录。Sphinx提供了其他节点，:ref:`描述在这里 <nodes>`。

source: During reading, the build environment is updated with all meta- and cross reference data of the read documents, such as labels, the names of headings, described Python objects and index entries. This will later be used to replace the temporary nodes.
pt_br: Durante a leitura, o ambiente de construção é atualizado com todos os dados de meta e referência cruzada dos documentos lidos, como rótulos, os nomes dos títulos, objetos descritos do Python e entradas de índice. Isso será usado posteriormente para substituir os nós temporários.
zh_cn: 在读取过程中，将用已读取文档的元数据和交叉引用数据（比如标签、标题名称、所描述的Python对象和索引项）对 build environment 进行更新。这将稍后用于替换临时节点。

source: The parsed doctrees are stored on the disk, because it is not possible to hold all of them in memory.
pt_br: Os doctrees analisados são armazenados no disco porque não é possível manter todos eles na memória.
zh_cn: 解析后的doctree存储在磁盘上，因为不可能将它们全部保存在内存中。

source: **Phase 2: Consistency checks**
pt_br: **Fase 2: Verificações de consistência**
zh_cn: **阶段2: 一致性检查**

source: Some checking is done to ensure no surprises in the built documents.
pt_br: Alguma verificação é feita para garantir que não haja surpresas nos documentos construídos.
zh_cn: 进行一些检查以确保生成的文档中没有意外情况。

source: **Phase 3: Resolving**
pt_br: **Fase 3: Resolução**
zh_cn: **阶段3：解析**

source: Now that the metadata and cross-reference data of all existing documents is known, all temporary nodes are replaced by nodes that can be converted into output using components called transforms. For example, links are created for object references that exist, and simple literal nodes are created for those that don't.
pt_br: Agora que os metadados e os dados de referência cruzada de todos os documentos existentes são conhecidos, todos os nós temporários são substituídos por nós que podem ser convertidos em saída usando componentes chamados de transformações. Por exemplo, links são criados para referências de objetos existentes e nós literais simples são criados para aqueles que não existem.
zh_cn: 现在，所有现有文档的元数据和交叉引用数据都是已知的，所有临时节点都将被节点替换，这些节点可以使用称为transforms的组件转换为输出。例如，为存在的对象引用创建链接，为不存在的对象引用创建简单文本节点。

source: **Phase 4: Writing**
pt_br: **Fase 4: Gravação**
zh_cn: **阶段4：写作**

source: This phase converts the resolved doctrees to the desired output format, such as HTML or LaTeX. This happens via a so-called docutils writer that visits the individual nodes of each doctree and produces some output in the process.
pt_br: Esta fase converte os doctrees resolvidos no formato de saída desejado, como HTML ou LaTeX. Isso acontece por meio de um escritor chamado docutils, que visita os nós individuais de cada doctree e produz alguma saída no processo.
zh_cn: 此阶段将解析的doctree转换为所需的输出格式，例如HTML或LaTeX。这是通过一个所谓的docutils编写器来实现的，它访问每个doctree的各个节点，并在这个过程中生成一些输出。

source: Some builders deviate from this general build plan, for example, the builder that checks external links does not need anything more than the parsed doctrees and therefore does not have phases 2--4.
pt_br: Alguns construtores se desviam desse plano de construção geral, por exemplo, o construtor que verifica links externos não precisa de nada além dos doctrees analisados e, portanto, não possui as fases 2 a 4.
zh_cn: 一些构建器偏离了这个一般的构建计划，例如，检查外部链接的构建器只需要解析的doctree，因此不需要第2-4阶段。

source: To see an example of application, refer to :ref:`tutorial-extend-build`.
pt_br: Para ver um exemplo de aplicação, consulte :ref:`tutorial-extend-build`.
zh_cn: 要查看应用示例，请参阅 :ref:`tutorial-extend-build`。

source: Extension metadata
pt_br: Metadados das extensões
zh_cn: 扩展的元数据

source: The ``setup()`` function should return a dictionary. This is treated by Sphinx as metadata of the extension. Metadata keys currently recognized are:
pt_br: A função ``setup()`` deve retornar um dicionário. Isso é tratado pelo Sphinx como extensão de metadados. Chaves dos metadados normalmente reconhecidas são:
zh_cn: ``setup()`` 函数应返回一个字典。Sphinx将其视为扩展的元数据。当前识别的元数据键有：

source: A string that identifies the extension version. It is used for extension version requirement checking (see :confval:`needs_extensions`) and informational purposes. If no version string is returned, ``'unknown version'`` is used by default.
pt_br: Uma palavra que identifica a versão da extensão. É utilizada para a verificação da versão mínima requerida (veja :confval:`needs_extensions`) e finalidades de informação. Se nenhuma string de versão for retornada, ``'unknown version'`` é usado por padrão.
zh_cn: 一个标识扩展版本的字符串。它用于扩展版本需求检查（参见 :confval:`needs_extensions`）和信息目的。如果没有返回版本字符串，则默认使用 ``'unknown version'``。

source: A non-zero positive integer integer that records the version of data stored in the environment by the extension.
pt_br: Um inteiro positivo diferente de zero que registra a versão dos dados armazenados no ambiente pela extensão.
zh_cn: 一个非零正整数，记录扩展在环境中存储的数据的版本。

source: If ``'env_version'`` is not set, the extension **must not** store any data or state directly on the environment object (``env``).
pt_br: Se ``'env_version'`` não estiver definido, a extensão **não deve** armazenar nenhum dado ou estado diretamente no objeto de ambiente (``env``).
zh_cn: 如果未设置 ``'env_version'``，则扩展 **不能** 直接在环境对象（``env``）上存储任何数据或状态。

source: This key must be defined if the extension uses the ``env`` object to store data. The version number must be incremented whenever the type, structure, or meaning of the stored data change, to ensure Sphinx does not try and load invalid data from a cached environment.
pt_br: Esta chave deve ser definida se a extensão usar o objeto ``env`` para armazenar dados. O número da versão deve ser incrementado sempre que o tipo, estrutura ou significado dos dados armazenados mudarem, para garantir que o Sphinx não tente carregar dados inválidos de um ambiente em cache.
zh_cn: 如果扩展使用 ``env`` 对象来存储数据，则必须定义此键。每当存储数据的类型、结构或含义发生变化时，版本号必须递增，以确保Sphinx不会尝试从缓存的环境中加载无效数据。

source: A boolean that specifies if parallel reading of source files can be used when the extension is loaded. It defaults to ``False``, meaning that you have to explicitly specify your extension to be safe for parallel reading after checking that it is.
pt_br: Um valor booleano que especifica se leitura paralela dos arquivo fonte pode ser usada, quando a extensão for carregada. O valor padrão é ``False``, o que significa que deve ser explicitado que sua extensão é segura para leitura em paralelo, após a devida comprovação através dos testes.
zh_cn: 一个布尔值，指定在加载扩展时是否可以使用源文件的并行读取。它默认为 ``False``，这意味着您必须在检查扩展是否安全进行并行读取后，明确指定您的扩展是安全的。

source: When *parallel-read-safe* is ``True``, the extension must satisfy the following conditions:
pt_br: Quando *parallel-read-safe* é ``True``, a extensão deve satisfazer as seguintes condições:
zh_cn: 当 *parallel-read-safe* 为 ``True`` 时，扩展必须满足以下条件：

source: The core logic of the extension is parallelly executable during the reading phase.
pt_br: A lógica central da extensão é executável paralelamente durante a fase de leitura.
zh_cn: 扩展的核心逻辑在读取阶段是可并行执行的。

source: It has event handlers for :event:`env-merge-info` and :event:`env-purge-doc` events if it stores data to the build environment object (``env``) during the reading phase.
pt_br: Possui manipuladores de eventos para eventos :event:`env-merge-info` e :event:`env-purge-doc` se armazenar dados no objeto ambiente de construção (``env``) durante a fase de leitura.
zh_cn: 如果在读取阶段将数据存储到build environment对象（``env``）中，则它具有 :event:`env-merge-info` 和 :event:`env-purge-doc` 事件的事件处理程序。

source: A boolean that specifies if parallel writing of output files can be used when the extension is loaded. Since extensions usually don't negatively influence the process, this defaults to ``True``.
pt_br: Um valor booleano que especifica que a gravação dos arquivos de saída pode ser usada quando sua extensão for carregada. Normalmente extensões não influenciam negativamente o processo, o valor padrão é ``True``.
zh_cn: 一个布尔值，指定在加载扩展时是否可以使用输出文件的并行写入。由于扩展通常不会对该过程产生负面影响，因此它默认为 ``True``。

source: When *parallel-write-safe* is ``True``, the extension must satisfy the following conditions:
pt_br: Quando *parallel-write-safe* é ``True``, a extensão deve satisfazer as seguintes condições:
zh_cn: 当 *parallel-write-safe* 为 ``True`` 时，扩展必须满足以下条件：

source: The core logic of the extension is parallelly executable during the writing phase.
pt_br: A lógica central da extensão é executável paralelamente durante a fase de gravação.
zh_cn: 扩展的核心逻辑在写入阶段是可并行执行的。

source: APIs used for writing extensions
pt_br: APIs usadas para escrever extensões
zh_cn: 用于编写扩展的API接口

source: These sections provide a more complete description of the tools at your disposal when developing Sphinx extensions. Some are core to Sphinx (such as the :doc:`appapi`) while others trigger specific behavior (such as the :doc:`i18n`)
pt_br: Estas seções fornecem uma descrição mais completa das ferramentas à sua disposição ao desenvolver extensões Sphinx. Alguns são essenciais para o Sphinx (como o :doc:`appapi`) enquanto outros desencadeiam comportamentos específicos (como o :doc:`i18n`)
zh_cn: 这些部分提供了在开发Sphinx扩展时可以使用的工具的更完整的描述。一些是Sphinx的核心（例如 :doc:`appapi`），而其他一些则触发特定的行为（例如 :doc:`i18n`）
