Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/extdev/markupapi.po
Languages: pt_br, zh_cn

source: Docutils markup API
pt_br: API de marcações do Docutils
zh_cn: Docutils标记 API

source: This section describes the API for adding reStructuredText markup elements (roles and directives).
pt_br: Esta seção descreve a API para adicionar elementos de marcação reStructuredText (papéis e diretivas).
zh_cn: 本节介绍用于添加reStructuredText标记元素（角色和指令）的 API。

source: Roles
pt_br: Papéis
zh_cn: 角色

source: Roles follow the interface described below. They have to be registered by an extension using :meth:`.Sphinx.add_role` or :meth:`.Sphinx.add_role_to_domain`.
pt_br: Os papéis seguem a interface descrita abaixo. Eles devem ser registrados por uma extensão usando :meth:`.Sphinx.add_role` ou :meth:`.Sphinx.add_role_to_domain`.
zh_cn: 角色遵循下面描述的接口。它们必须通过使用 :meth:`.Sphinx.add_role` 或 :meth:`.Sphinx.add_role_to_domain` 的扩展来注册。

source: The *options* and *content* parameters are only used for custom roles created via the :dudir:`role` directive. The return value is a tuple of two lists, the first containing the text nodes and elements from the role, and the second containing any system messages generated. For more information, see the `custom role overview`_ from Docutils.
pt_br: Os parâmetros *options* e *content* são usados ​​apenas para papéis personalizados criados através da diretiva :dudir:`role`. O valor de retorno é uma tupla de duas listas, a primeira contendo os nós de texto e os elementos do papel, e a segunda contendo quaisquer mensagens do sistema geradas. Para obter mais informações, consulte a `visão geral de papel personalizado`_ do Docutils.
zh_cn: *options* 和 *content* 参数仅用于通过 :dudir:`role` 指令创建的自定义角色。返回值是一个包含两个列表的元组，第一个包含来自角色的文本节点和元素，第二个包含生成的任何系统消息。有关更多信息，请参阅 Docutils 的 `custom role overview`_。

source: Creating custom roles
pt_br: Criando papéis personalizados
zh_cn: 创建自定义角色

source: Sphinx provides two base classes for creating custom roles, :class:`~sphinx.util.docutils.SphinxRole` and :class:`~sphinx.util.docutils.ReferenceRole`.
pt_br: O Sphinx fornece duas classes base para a criação de papéis personalizados, :class:`~sphinx.util.docutils.SphinxRole` e :class:`~sphinx.util.docutils.ReferenceRole`.
zh_cn: Sphinx 提供了两个用于创建自定义角色的基类，:class:`~sphinx.util.docutils.SphinxRole` 和 :class:`~sphinx.util.docutils.ReferenceRole`。

source: These provide a class-based interface for creating roles, where the main logic must be implemented in your ``run()`` method. The classes provide a number of useful methods and attributes, such as ``self.text``, ``self.config``, and ``self.env``. The ``ReferenceRole`` class implements Sphinx's ``title <target>`` logic, exposing ``self.target`` and ``self.title`` attributes. This is useful for creating cross-reference roles.
pt_br: Eles fornecem uma interface baseada em classes para criação de papéis, onde a lógica principal deve ser implementada em seu método ``run()``. As classes fornecem vários métodos e atributos úteis, como ``self.text``, ``self.config`` e ``self.env``. A classe ``ReferenceRole`` implementa a lógica ``título <alvo>`` do Sphinx, expondo os atributos ``self.alvo`` e ``self.título``. Isto é útil para criar papéis de referência cruzada.
zh_cn: 这些为创建角色提供了基于类的接口，其中主要逻辑必须在您的 ``run()`` 方法中实现。这些类提供了许多有用的方法和属性，例如 ``self.text``、``self.config`` 和 ``self.env``。``ReferenceRole`` 类实现了 Sphinx 的 ``title <target>`` 逻辑，公开了 ``self.target`` 和 ``self.title`` 属性。这对于创建交叉引用角色非常有用。

source: Directives
pt_br: Diretivas
zh_cn: 指令

source: Directives are handled by classes derived from ``docutils.parsers.rst.Directive``. They have to be registered by an extension using :meth:`.Sphinx.add_directive` or :meth:`.Sphinx.add_directive_to_domain`.
pt_br: As diretivas são tratadas por classes derivadas de ``docutils.parsers.rst.Directive``. Eles devem ser registrados por uma extensão usando :meth:`.Sphinx.add_directive` ou :meth:`.Sphinx.add_directive_to_domain`.
zh_cn: 指令由派生自 ``docutils.parsers.rst.Directieve``。它们必须通过使用 :meth:`.Sphinx.add_directive` 或者 :meth:`.Sphinx.add_directive_to_domain`

source: The markup syntax of the new directive is determined by the follow five class attributes:
pt_br: A sintaxe de marcação da nova diretiva é determinada pelos cinco atributos de classe a seguir:
zh_cn: 新指令的标记语法由以下五个类属性确定：

source: Number of required directive arguments.
pt_br: Número de argumentos de diretiva necessários.
zh_cn: 必需的指令参数数。

source: Number of optional arguments after the required arguments.
pt_br: Número de argumentos opcionais após os argumentos obrigatórios.
zh_cn: 必需参数后的可选参数数目。

source: May the final argument contain whitespace?
pt_br: O argumento final pode conter espaços em branco?
zh_cn: 最后一个参数可以包含空格吗？

source: Mapping of option names to validator functions.
pt_br: Mapeamento de nomes de opções para funções validadoras.
zh_cn: 选项名到验证器函数的映射。

source: Option validator functions take a single parameter, the option argument (or ``None`` if not given), and should validate it or convert it to the proper form. They raise :exc:`ValueError` or :exc:`TypeError` to indicate failure.
pt_br: As funções validadoras de opções recebem um único parâmetro, o argumento da opção (ou ``None`` se não for fornecido), e devem validá-lo ou convertê-lo para o formato apropriado. Eles levantam :exc:`ValueError` ou :exc:`TypeError` para indicar falha.
zh_cn: 选项验证器函数接受一个参数，即Option参数（如果未给定，则为“None”），并应验证它或将其转换为正确的形式。它们发出 :exc:`ValueError` 或 :exc:`TypeError` 来表示失败。

source: There are several predefined and possibly useful validators in the :mod:`docutils.parsers.rst.directives` module.
pt_br: Existem vários validadores predefinidos e possivelmente úteis no módulo :mod:`docutils.parsers.rst.directives`.
zh_cn: :mod:`docutils.parsers.rst.directives` 模块里有一些预先定义的验证器。

source: May the directive have content?
pt_br: A diretiva pode ter conteúdo?
zh_cn: 指令是否有内容？

source: New directives must implement the :meth:`run` method:
pt_br: Novas diretivas devem implementar o método :meth:`run`:
zh_cn: 新指令必须实现 :meth:`run` 方法：

source: This method must process the directive arguments, options and content, and return a list of Docutils/Sphinx nodes that will be inserted into the document tree at the point where the directive was encountered.
pt_br: Este método deve processar os argumentos, opções e conteúdo da diretiva e retornar uma lista de nós Docutils/Sphinx que serão inseridos na árvore do documento no ponto onde a diretiva foi encontrada.
zh_cn: 此方法必须处理指令参数、选项和内容，并返回Docutils/Sphinx节点列表，这些节点将在遇到指令的位置插入到文档树中。

source: Instance attributes that are always set on the directive are:
pt_br: Os atributos de instância que são sempre definidos na diretiva são:
zh_cn: 始终在指令上设置的实例属性包括：

source: The directive name (useful when registering the same directive class under multiple names).
pt_br: O nome da diretiva (útil ao registrar a mesma classe de diretiva com vários nomes).
zh_cn: 指令名（在多个名称下注册同一个指令类时很有用）。

source: The arguments given to the directive, as a list.
pt_br: Os argumentos apresentados à diretiva, em forma de lista.
zh_cn: 以列表形式提供给指令的参数。

source: The options given to the directive, as a dictionary mapping option names to validated/converted values.
pt_br: As opções dadas à diretiva, como uma opção de mapeamento de dicionário, nomeiam para valores validados/convertidos.
zh_cn: 给指令的选项，作为将选项名称映射到已验证/转换的值的字典。

source: The directive content, if given, as a :class:`!ViewList`.
pt_br: O conteúdo da diretiva, se fornecido, como :class:`!ViewList`.
zh_cn: 指令内容（如果给出），作为 :class:`!ViewList`。

source: The absolute line number on which the directive appeared. This is not always a useful value; use :attr:`srcline` instead.
pt_br: O número absoluto da linha em que a diretiva apareceu. Este nem sempre é um valor útil; use :attr:`srcline` em vez disso.
zh_cn: 出现指令的绝对行号。这并不总是有用的值；请改用 :attr:`srcline`。

source: Internal offset of the directive content. Used when calling ``nested_parse`` (see below).
pt_br: Deslocamento interno do conteúdo da diretiva. Usado ao chamar ``nested_parse`` (veja abaixo).
zh_cn: 指令内容的内部偏移量。调用“nested_parse”时使用（请参见下文）。

source: The string containing the entire directive.
pt_br: A string que contém toda a diretiva.
zh_cn: 包含整个指令的字符串。

source: The state and state machine which controls the parsing. Used for ``nested_parse``.
pt_br: O estado e a máquina de estado que controla a análise. Usado para ``nested_parse``.
zh_cn: 控制解析的状态和状态机。用于“嵌套”分析。

source: `Creating directives`_ HOWTO of the Docutils documentation
pt_br: HOWTO `Creating directives`_ da documentação do Docutils
zh_cn: `Creating directives`_ Docutils文档的“HOWTO”

source: Parsing directive content as reStructuredText
pt_br: Analisando o conteúdo da diretiva como reStructuredText
zh_cn: 将指令内容解析为 reStructuredText

source: Many directives will contain more markup that must be parsed. To do this, use one of the following APIs from the :meth:`~Directive.run` method:
pt_br: Muitas diretivas conterão mais marcações que devem ser analisadas. Para fazer isso, use uma das seguintes APIs do método :meth:`~Directive.run`:
zh_cn: 许多指令将包含必须解析的更多标记。为此，请在 :meth:`~Directive.run` 方法中使用以下 API 之一：

source: The first method parses all the directive's content as markup, whilst the second only parses the given *text* string. Both methods return the parsed Docutils nodes in a list.
pt_br: O primeiro método analisa todo o conteúdo da diretiva como marcação, enquanto o segundo analisa apenas a string *text* fornecida. Ambos os métodos retornam os nós Docutils analisados ​​em uma lista.
zh_cn: 第一个方法将指令的所有内容解析为标记，而第二个方法仅解析给定的 *text* 字符串。这两种方法都以列表形式返回解析后的 Docutils 节点。

source: The methods are used as follows:
pt_br: Os métodos são usados como demonstrado a seguir.
zh_cn: 这些方法的使用方式如下：

source: The above utility methods were added in Sphinx 7.4. Prior to Sphinx 7.4, the following methods should be used to parse content:
pt_br: Os métodos utilitários acima foram adicionados no Sphinx 7.4. Antes do Sphinx 7.4, os seguintes métodos deviam ser usados ​​para analisar o conteúdo:
zh_cn: 上述实用方法是在 Sphinx 7.4 中添加的。在 Sphinx 7.4 之前，应使用以下方法来解析内容：

source: :func:`sphinx.util.nodes.nested_parse_with_titles` -- this allows titles in the parsed content.
pt_br: :func:`sphinx.util.nodes.nested_parse_with_titles` essa isso permite títulos no conteúdo analisado.
zh_cn: :func:`sphinx.util.nodes.nested_parse_with_titles` -- 这允许解析内容中包含标题。

source: To parse inline markup, use :py:meth:`~sphinx.util.docutils.SphinxDirective.parse_inline()`. This must only be used for text which is a single line or paragraph, and does not contain any structural elements (headings, transitions, directives, etc).
pt_br: Para analisar a marcação em linha, use :py:meth:`~sphinx.util.docutils.SphinxDirective.parse_inline()`. Deve ser utilizado apenas para textos que sejam de uma única linha ou parágrafo e não contenham quaisquer elementos estruturais (títulos, transições, diretivas, etc.).
zh_cn: 要解析内联标记，请使用 :py:meth:`~sphinx.util.docutils.SphinxDirective.parse_inline()`。这只能用于单行或段落的文本，并且不包含任何结构元素（标题、过渡、指令等）。

source: ``sphinx.util.docutils.switch_source_input()`` allows changing the source (input) file during parsing content in a directive. It is useful to parse mixed content, such as in ``sphinx.ext.autodoc``, where it is used to parse docstrings.
pt_br: ``sphinx.util.docutils.switch_source_input()`` permite alterar o arquivo fonte (entrada) durante a análise do conteúdo de uma diretiva. É útil analisar conteúdo misto, como em ``sphinx.ext.autodoc``, onde é usado para analisar docstrings.
zh_cn: ``sphinx.util.docutils.switch_source_input()`` 允许在指令中解析内容时更改源（输入）文件。它对于解析混合内容非常有用，例如在 ``sphinx.ext.autodoc`` 中，它用于解析文档字符串。

source: Until Sphinx 1.6, ``sphinx.ext.autodoc.AutodocReporter`` was used for this purpose. It is replaced by ``switch_source_input()``.
pt_br: Até o Sphinx 1.6, ``sphinx.ext.autodoc.AutodocReporter`` era usado para este propósito. Ele foi substituído por ``switch_source_input()``.
zh_cn: 直到 Sphinx 1.6，``sphinx.ext.autodoc.AutodocReporter`` 才用于此目的。它被 ``switch_source_input()`` 所取代。

source: ViewLists and StringLists
pt_br: ViewLists e StringLists
zh_cn: ViewLists 和 StringLists

source: Docutils represents document source lines in a ``StringList`` class, which inherits from ``ViewList``, both in the ``docutils.statemachine`` module. This is a list with extended functionality, including that slicing creates views of the original list and that the list contains information about source line numbers.
pt_br: Docutils representa as linhas fonte do documento em uma classe ``StringList``, que herda de ``ViewList``, ambas no módulo ``docutils.statemachine``. Esta é uma lista com funcionalidade estendida, incluindo que o fatiamento cria visualizações da lista original e que a lista contém informações sobre os números das linhas do código-fonte.
zh_cn: Docutils 在 ``docutils.statemachine`` 模块中使用 ``StringList`` 类表示文档源行，该类继承自 ``ViewList``。这是一个具有扩展功能的列表，包括切片创建原始列表的视图，并且该列表包含有关源行号的信息。

source: The :attr:`Directive.content` attribute is a ``StringList``. If you generate content to be parsed as reStructuredText, you have to create a ``StringList`` for the Docutils APIs. The utility functions provided by Sphinx handle this automatically. Important for content generation are the following points:
pt_br: O atributo :attr:`Directive.content` é um ``StringList``. Se você gerar conteúdo para ser analisado como reStructuredText, você terá que criar um ``StringList`` para as APIs do Docutils. As funções utilitárias fornecidas pelo Sphinx tratam disso automaticamente. Importantes para a geração de conteúdo são os seguintes pontos:
zh_cn: :attr:`Directive.content` 属性是一个 ``StringList``。如果您生成的内容要作为 reStructuredText 进行解析，则必须为 Docutils API 创建一个 ``StringList``。Sphinx 提供的实用程序函数会自动处理此问题。内容生成的重要点如下：

source: The ``ViewList`` constructor takes a list of strings (lines) and a source (document) name.
pt_br: O construtor de ``ViewList`` recebe uma lista de strings (linhas) e um nome de origem (documento).
zh_cn: ``ViewList`` 构造函数接受字符串列表（行）和源（文档）名称。

source: The ``ViewList.append()`` method takes a line and a source name as well.
pt_br: O método ``ViewList.append()`` leva uma linha e um nome de origem também.
zh_cn: ``ViewList.append()`` 方法也接受一行和一个源名称。
