Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/extdev/utils.po
Languages: pt_br

source: Utilities
pt_br: Utilitários

source: Sphinx provides utility classes and functions to develop extensions.
pt_br: Sphinx fornece classes e funções utilitárias para desenvolver extensões.

source: Base classes for components
pt_br: Classes base para componentes

source: These base classes are useful to allow your extensions to obtain Sphinx components (e.g. :class:`.Config`, :class:`.BuildEnvironment` and so on) easily.
pt_br: Essas classes base são úteis para permitir que suas extensões obtenham componentes Sphinx (por exemplo, :class:`.Config`, :class:`.BuildEnvironment` e assim por diante) facilmente.

source: The subclasses of them might not work with bare docutils because they are strongly coupled with Sphinx.
pt_br: As subclasses deles podem não funcionar com docutils simples porque estão fortemente acopladas ao Sphinx.

source: A base class of Transforms.
pt_br: Uma classe base de Transforms.

source: Compared with ``docutils.transforms.Transform``, this class improves accessibility to Sphinx APIs.
pt_br: Comparada com ``docutils.transforms.Transform``, esta classe melhora a acessibilidade às APIs do Sphinx.

source: Reference to the :class:`.Sphinx` object.
pt_br: Referência ao objeto :class:`.Sphinx`.

source: Reference to the :class:`.Config` object.
pt_br: Referência ao objeto :class:`.Config`.

source: Reference to the :class:`.BuildEnvironment` object.
pt_br: Referência ao objeto :class:`.BuildEnvironment`.

source: A base class of post-transforms.
pt_br: Uma classe base de pós-transformações.

source: Post transforms are invoked to modify the document to restructure it for outputting. They resolve references, convert images, do special transformation for each output formats and so on. This class helps to implement these post transforms.
pt_br: As pós-transformações são invocadas para modificar o documento e reestruturá-lo para saída. Eles resolvem referências, convertem imagens, fazem transformações especiais para cada formato de saída e assim por diante. Esta classe ajuda a implementar essas pós-transformações.

source: Override to apply the transform to the document tree.
pt_br: Substitui para aplicar a transformação à árvore do documentos.

source: Check this transform working for current builder.
pt_br: Verifica se esta transformação funcionando para o construtor atual.

source: Main method of post transforms.
pt_br: Método principal de pós-transformações.

source: Subclasses should override this method instead of ``apply()``.
pt_br: As subclasses devem sobrescrever este método em vez de ``apply()``.

source: A base class for Sphinx directives.
pt_br: Uma classe base para diretivas Sphinx.

source: This class provides helper methods for Sphinx directives.
pt_br: Esta classe fornece métodos auxiliares para diretivas Sphinx.

source: The subclasses of this class might not work with docutils. This class is strongly coupled with Sphinx.
pt_br: As subclasses desta classe podem não funcionar com docutils. Esta classe está fortemente acoplada ao Sphinx.

source: Get current location info for logging.
pt_br: Obtém informações de localização atuais para registro.

source: Get source and line number.
pt_br: Obtenha o arquivo fonte e o número da linha.

source: Parse the directive's content into nodes.
pt_br: Analisa o conteúdo da diretiva em nós.

source: Are titles (sections) allowed in the directive's content? Note that this option bypasses Docutils' usual checks on doctree structure, and misuse of this option can lead to an incoherent doctree. In Docutils, section nodes should only be children of ``Structural`` nodes, which includes ``document``, ``section``, and ``sidebar`` nodes.
pt_br: Os títulos (seções) são permitidos no conteúdo da diretiva? Observe que esta opção ignora as verificações usuais do Docutils na estrutura do doctree, e o uso indevido desta opção pode levar a um doctree incoerente. No Docutils, os nós de seção devem ser apenas filhos dos nós ``Structural``, que incluem os nós ``document``, ``section`` e ``sidebar``.

source: Parse *text* as inline elements.
pt_br: Analisa *text* como elementos em linha.

source: The text to parse, which should be a single line or paragraph. This cannot contain any structural elements (headings, transitions, directives, etc).
pt_br: O texto a ser analisado, que deve ser uma única linha ou parágrafo. Não pode conter quaisquer elementos estruturais (títulos, transições, diretivas, etc.).

source: The line number where the interpreted text begins.
pt_br: O número da linha onde o texto interpretado começa.

source: A list of nodes (text and inline elements) and a list of system_messages.
pt_br: Uma lista de nós (elementos de texto e embutidos) e uma lista de system_messages.

source: Parse *text* into nodes.
pt_br: Analisa *text* em nós.

source: Text, in string form. ``StringList`` is also accepted.
pt_br: Texto, na forma de string. ``StringList`` também é aceito.

source: Are titles (sections) allowed in *text*? Note that this option bypasses Docutils' usual checks on doctree structure, and misuse of this option can lead to an incoherent doctree. In Docutils, section nodes should only be children of ``Structural`` nodes, which includes ``document``, ``section``, and ``sidebar`` nodes.
pt_br: Os títulos (seções) são permitidos *text*? Observe que esta opção ignora as verificações usuais do Docutils na estrutura do doctree, e o uso indevido desta opção pode levar a um doctree incoerente. No Docutils, os nós de seção devem ser apenas filhos dos nós ``Structural``, que incluem os nós ``document``, ``section`` e ``sidebar``.

source: The offset of the content.
pt_br: A posição do conteúdo.

source: Set source and line number to the node.
pt_br: Define o arquivo fonte e o número da linha para o nó.

source: A base class for Sphinx roles.
pt_br: Uma classe base para papéis do Sphinx.

source: This class provides helper methods for Sphinx roles.
pt_br: Esta classe fornece métodos auxiliares para papéis do Sphinx.

source: A list of strings, the directive content for customisation (from the "role" directive).
pt_br: Uma lista de strings, o conteúdo da diretiva para personalização (da diretiva "papel").

source: The ``docutils.parsers.rst.states.Inliner`` object.
pt_br: O objeto ``docutils.parsers.rst.states.Inliner``.

source: The role name actually used in the document.
pt_br: O nome do papel realmente usado no documento.

source: A dictionary of directive options for customisation (from the "role" directive).
pt_br: Um dicionário de opções de diretivas para personalização (da diretiva "papel").

source: A string containing the entire interpreted text input.
pt_br: Uma string contendo toda a entrada de texto interpretada.

source: The interpreted text content.
pt_br: O conteúdo do texto interpretado

source: A base class for reference roles.
pt_br: Uma classe base para papéis de referência.

source: The reference roles can accept ``link title <target>`` style as a text for the role. The parsed result; link title and target will be stored to ``self.title`` and ``self.target``.
pt_br: Os papéis de referência podem aceitar o estilo ``título do link <alvo>`` como texto para o papel. O resultado analisado; o alvo e o título do link serão armazenados em ``self.título`` e ``self.alvo``.

source: A boolean indicates the reference is disabled.
pt_br: Um booleano indica que a referência está desabilitada.

source: A boolean indicates the role has explicit title or not.
pt_br: Um booleano indica que o papel tem título explícito ou não.

source: The link target for the interpreted text.
pt_br: O alvo do link para o texto interpretado.

source: The link title for the interpreted text.
pt_br: O título do link para o texto interpretado.

source: A base class for image converters.
pt_br: Uma classe base para conversores de imagem.

source: An image converter is kind of Docutils transform module. It is used to convert image files which are not supported by a builder to the appropriate format for that builder.
pt_br: Um conversor de imagem é uma espécie de módulo de transformação Docutils. Ele é usado para converter arquivos de imagem que não são suportados por um construtor para o formato apropriado para esse construtor.

source: For example, :py:class:`LaTeX builder <.LaTeXBuilder>` supports PDF, PNG and JPEG as image formats. However it does not support SVG images. For such case, using image converters allows to embed these unsupported images into the document. One of the image converters; :ref:`sphinx.ext.imgconverter <sphinx.ext.imgconverter>` can convert a SVG image to PNG format using Imagemagick internally.
pt_br: Por exemplo, :py:class:`construtor LaTeX <.LaTeXBuilder>` oferece suporte a PDF, PNG e JPEG como formatos de imagem. No entanto, não oferece suporte a imagens SVG. Nesse caso, o uso de conversores de imagens permite incorporar essas imagens não suportadas no documento. Um dos conversores de imagem; :ref:`sphinx.ext.imgconverter <sphinx.ext.imgconverter>` pode converter uma imagem SVG para o formato PNG usando o Imagemagick internamente.

source: There are three steps to make your custom image converter:
pt_br: Existem três etapas para criar seu conversor de imagem personalizado:

source: Make a subclass of ``ImageConverter`` class
pt_br: Faz uma subclasse da classe ``ImageConverter``

source: Override ``conversion_rules``, ``is_available()`` and ``convert()``
pt_br: Substitui ``conversion_rules``, ``is_available()`` e ``convert()``

source: Register your image converter to Sphinx using :py:meth:`.Sphinx.add_post_transform`
pt_br: Registra seu conversor de imagem no Sphinx usando :py:meth:`.Sphinx.add_post_transform`

source: Convert an image file to the expected format.
pt_br: Converte um arquivo de imagem para o formato esperado.

source: *_from* is a path of the source image file, and *_to* is a path of the destination file.
pt_br: *_from* é o caminho do arquivo de imagem fonte e *_to* é o caminho do arquivo alvo.

source: Return the image converter is available or not.
pt_br: Retorna o conversor de imagem está disponível ou não.

source: The converter is available or not. Will be filled at the first call of the build. The result is shared in the same process.
pt_br: O conversor está disponível ou não. Será preenchido na primeira chamada da construção. O resultado é compartilhado no mesmo processo.

source: Todo
pt_br: Por fazer

source: This should be refactored not to store the state without class variable.
pt_br: Isso deve ser refatorado para não armazenar o estado sem variável de classe.

source: A conversion rules the image converter supports. It is represented as a list of pair of source image format (mimetype) and destination one::
pt_br: Uma regra de conversão suportada pelo conversor de imagem. É representado como uma lista de pares de formato de imagem fonte (mimetype) e alvo um::

source: Numerical priority of this transform, 0 through 999 (override).
pt_br: Prioridade numérica desta transformação, de 0 a 999 (substituição).

source: Utility components
pt_br: Componentes de utilitários

source: Event manager for Sphinx.
pt_br: Gerenciador de eventos para o Sphinx.

source: Register a custom Sphinx event.
pt_br: Registra um evento personalizado do Sphinx.

source: Connect a handler to specific event.
pt_br: Conecta um manipulador para um evento específico.

source: Disconnect a handler.
pt_br: Desconecta um manipulador.

source: Emit a Sphinx event.
pt_br: Emite um evento Sphinx.

source: Emit a Sphinx event and returns first result.
pt_br: Emite um evento Sphinx e retorna o primeiro resultado.

source: This returns the result of the first handler that doesn't return ``None``.
pt_br: Isso retorna o resultado do primeiro manipulador que não retorna ``None``.

source: Utility functions
pt_br: Funções unitárias

source: The state machine state. Must be a subclass of ``RSTState``.
pt_br: O estado da máquina de estado. Deve ser uma subclasse de ``RSTState``.

source: The text's source, used when creating a new ``StringList``.
pt_br: A fonte do texto, usada ao criar uma nova ``StringList``.

source: If this is False (the default), then *content* is parsed as if it were an independent document, meaning that title decorations (e.g. underlines) do not need to match the surrounding document. This is useful when the parsed content comes from a completely different context, such as docstrings. If this is True, then title underlines must match those in the surrounding document, otherwise the behaviour is undefined.
pt_br: Se for False (o padrão), então *content* será analisado como se fosse um documento independente, o que significa que as decorações do título (por exemplo, sublinhados) não precisam corresponder ao documento ao redor. Isso é útil quando o conteúdo analisado vem de um contexto completamente diferente, como docstrings. Se isto for True, então os sublinhados do título deverão corresponder aos do documento adjacente, caso contrário o comportamento será indefinido.

source: Utility types
pt_br: Tipos de utilitários

source: The metadata returned by an extension's ``setup()`` function.
pt_br: Os metadados retornados pela função ``setup()`` de uma extensão.

source: See :ref:`ext-metadata`.
pt_br: Veja :ref:`ext-metadata`.

source: An integer that identifies the version of env data added by the extension.
pt_br: Um número inteiro que identifica a versão dos dados ambientais adicionados pela extensão.

source: Indicate whether parallel reading of source files is supported by the extension.
pt_br: Indica se a leitura paralela de arquivos fonte é suportada pela extensão.

source: Indicate whether parallel writing of output files is supported by the extension (default: ``True``).
pt_br: Indica se a escrita paralela de arquivos de saída é suportada pela extensão (padrão: ``True``).

source: The extension version (default: ``'unknown version'``).
pt_br: A versão da extensão (padrão: ``'unknown version'``).
