Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: Options for LaTeX output
pt_br: Opções para saída LaTeX

source: These options influence LaTeX output.
pt_br: Essas opções influenciam a saída do LaTeX.

source: The LaTeX engine to build the docs. The setting can have the following values:
pt_br: O mecanismo LaTeX para construir documentos. A configuração pode ter os valores:

source: ``'pdflatex'`` -- PDFLaTeX (default)
pt_br: ``'pdflatex'`` -- PDFLaTeX (padrão)

source: ``'uplatex'`` -- upLaTeX (default if :confval:`language` is ``'ja'``)
pt_br: ``'uplatex'`` -- upLaTeX (padrão se :confval:`language` for ``'ja'``)

source: ``'pdflatex'``\ 's support for Unicode characters is limited.
pt_br: Suporte do ``'pdflatex'`` para caracteres Unicode é limitado.

source: 2.0 adds to ``'pdflatex'`` support in Latin language document of occasional Cyrillic or Greek letters or words. This is not automatic, see the discussion of the :confval:`latex_elements` ``'fontenc'`` key.
pt_br: 2.0 adiciona suporte a ``'pdflatex'`` em documentos de língua latina de letras ou palavras cirílicas ou gregas ocasionais. Isto não é automático, veja a discussão sobre a chave ``'fontenc'`` de :confval:`latex_elements`.

source: If your project uses Unicode characters, setting the engine to ``'xelatex'`` or ``'lualatex'`` and making sure to use an OpenType font with wide-enough glyph coverage is often easier than trying to make ``'pdflatex'`` work with the extra Unicode characters. Since Sphinx 2.0 the default is the GNU FreeFont which covers well Latin, Cyrillic and Greek.
pt_br: Se o seu projeto usa caracteres Unicode, definir o mecanismo para ``'xelatex'`` ou ``'lualatex'`` e certificar-se de usar uma fonte OpenType com ampla cobertura de glifos é frequentemente mais fácil do que tentar fazer ``'pdflatex'`` funcionar com os caracteres Unicode extras. Desde o Sphinx 2.0, o padrão é o GNU FreeFont que cobre bem o latim, cirílico e grego.

source: Use ``xelatex`` (and LaTeX package ``xeCJK``) by default for Chinese documents.
pt_br: Usa ``xelatex`` (e o pacote LaTeX ``xeCJK``) por padrão para documentos chineses.

source: Use ``xelatex`` by default for Greek documents.
pt_br: Usa ``xelatex`` por padrão para documentos gregos.

source: Add ``uplatex`` support.
pt_br: Adiciona suporte a ``uplatex``.

source: ``uplatex`` becomes the default setting of Japanese documents.
pt_br: ``uplatex`` se torna a configuração padrão de documentos japoneses.

source: Contrarily to :ref:`MathJaX math rendering in HTML output <math-support>`, LaTeX requires some extra configuration to support Unicode literals in :rst:dir:`math`: the only comprehensive solution (as far as we know) is to use ``'xelatex'`` or ``'lualatex'`` *and* to add ``r'\usepackage{unicode-math}'`` (e.g. via the :confval:`latex_elements` ``'preamble'`` key). You may prefer ``r'\usepackage[math-style=literal]{unicode-math}'`` to keep a Unicode literal such as ``α`` (U+03B1) for example as is in output, rather than being rendered as :math:`\alpha`.
pt_br: Ao contrário da :ref:`renderização matemática de MathJaX na saída HTML <math-support>`, o LaTeX requer alguma configuração extra para oferecer suporte a literais Unicode em :rst:dir:`math`: a única solução abrangente (até onde sabemos) é usar ``'xelatex'`` ou ``'lualatex'`` *e* para adicionar ``r'\usepackage{unicode-math}'`` (por exemplo, através da chave ``'preamble'`` de :confval:`latex_elements`) Você pode preferir ``r'\usepackage[math-style=literal]{unicode-math}'`` para manter um Unicode literal como ``α`` (U+03B1) por exemplo como está na saída, em vez de sendo renderizado como :math:`\alpha`.

source: This value determines how to group the document tree into LaTeX source files. It must be a list of tuples ``(startdocname, targetname, title, author, theme, toctree_only)``, where the items are:
pt_br: Este valor determina como agrupar a árvore de documentos em arquivos fonte LaTeX. Deve ser uma lista de tuplas ``(startdocname, targetname, title, author, theme, toctree_only)``, onde os itens são:

source: String that specifies the :term:`document name` of the LaTeX file's master document. All documents referenced by the *startdoc* document in TOC trees will be included in the LaTeX file. (If you want to use the default root document for your LaTeX build, provide your :confval:`root_doc` here.)
pt_br: String que especifica o :term:`nome do documento <document name>` do documento mestre do arquivo LaTeX. Todos os documentos referenciados pelo documento *startdoc* nas árvores TOC serão incluídos no arquivo LaTeX. (Se você deseja usar o documento raiz padrão para sua construção LaTeX, forneça seu :confval:`root_doc` aqui.)

source: File name of the LaTeX file in the output directory.
pt_br: Nome de arquivo do arquivo LaTeX no diretório de saída.

source: LaTeX document title. Can be empty to use the title of the *startdoc* document. This is inserted as LaTeX markup, so special characters like a backslash or ampersand must be represented by the proper LaTeX commands if they are to be inserted literally.
pt_br: Título do documento LaTeX. Pode estar vazio para usar o título do documento *startdoc*. Isso é inserido como marcação LaTeX, portanto, caracteres especiais como uma barra invertida ou "e" comercial devem ser representados pelos comandos LaTeX apropriados se forem inseridos literalmente.

source: Author for the LaTeX document. The same LaTeX markup caveat as for *title* applies. Use ``\\and`` to separate multiple authors, as in: ``'John \\and Sarah'`` (backslashes must be Python-escaped to reach LaTeX).
pt_br: Autor do documento LaTeX. A mesma advertência de marcação LaTeX que para *title* se aplica. Use ``\\and`` para separar vários autores, como em: ``'John \\and Sarah'`` (as barras invertidas devem ter escape do Python para chegar ao LaTeX).

source: LaTeX theme. See :confval:`latex_theme`.
pt_br: Tema LaTeX. Veja :confval:`latex_theme`.

source: Must be ``True`` or ``False``. If true, the *startdoc* document itself is not included in the output, only the documents referenced by it via TOC trees. With this option, you can put extra stuff in the master document that shows up in the HTML, but not the LaTeX output.
pt_br: Deve ser ``True`` ou ``False``. Se verdadeiro, o próprio documento *startdoc* não é incluído na saída, apenas os documentos referenciados por ele por meio de árvores TOC. Com esta opção, você pode colocar coisas extras no documento mestre que aparecem no HTML, mas não na saída LaTeX.

source: In the past including your own document class required you to prepend the document class name with the string "sphinx". This is not necessary anymore.
pt_br: Anteriormente incluindo classe do seu próprio documento podia ser prefixado a nome da classe com a string "sphinx". Não é mais necessário.

source: The 6th item ``toctree_only``. Tuples with 5 items are still accepted.
pt_br: O sexto item de ``toctree_only``. Pares com 5 itens são aceitos.

source: If given, this must be the name of an image file (relative to the configuration directory) that is the logo of the docs. It is placed at the top of the title page. Default: ``None``.
pt_br: Se informado deve ser o nome de um arquivo de imagem (relativo ao diretório de configuração) que será o logo dos docs. Será colocado no topo do título da página. Padrão ``None``.

source: This value determines the topmost sectioning unit. It should be chosen from ``'part'``, ``'chapter'`` or ``'section'``. The default is ``None``; the topmost sectioning unit is switched by documentclass: ``section`` is used if documentclass will be ``howto``, otherwise ``chapter`` will be used.
pt_br: Este valor determina a unidade de corte superior. Deve ser escolhido entre ``'part'``, ``'chapter'`` ou ``'section'``. O padrão é ``None``; a unidade de seção mais alta é trocada por documentclass: ``section`` é usado se documentclass for ``howto``, caso contrário, ``chapter`` será usado.

source: Note that if LaTeX uses ``\part`` command, then the numbering of sectioning units one level deep gets off-sync with HTML numbering, because LaTeX numbers continuously ``\chapter`` (or ``\section`` for ``howto``.)
pt_br: Observe que se o LaTeX usa o comando ``\part``, então a numeração das unidades de seção em um nível de profundidade fica fora de sincronia com a numeração HTML, porque os números LaTeX continuamente ``\chapter`` (ou ``\section`` para ``howto``.)

source: A list of document names to append as an appendix to all manuals.
pt_br: Lista de nomes de documentos que serão anexados para todos manuais.

source: This value can be a bool or a list of index names that should be generated, like for :confval:`html_domain_indices`.
pt_br: Esse valor pode ser booleano ou lista de nomes de índices que devem ser gerados, para :confval:`html_domain_indices`.

source: If true, add page references after internal references. This is very useful for printed copies of the manual. Default is ``False``.
pt_br: Se verdadeiro, adiciona página após referências internas. Isso é útil para cópias impressas do manual. Padrão é ``False``.

source: Control whether to display URL addresses. This is very useful for printed copies of the manual. The setting can have the following values:
pt_br: Controle exibição endereços URL. É util para imprimir copias do manual. A configuração deve ter os seguintes valores:

source: ``'no'`` -- do not display URLs (default)
pt_br: ``'no'`` -- não exibir URLs (padrão)

source: ``'inline'`` -- display URLs inline in parentheses
pt_br: ``'inline'`` -- exibir URLs inline em parenteses

source: This value is now a string; previously it was a boolean value, and a true value selected the ``'inline'`` display. For backwards compatibility, ``True`` is still accepted.
pt_br: O valor é uma string; anteriormente era um valor boleano e valor verdadeiro selecionado exibir ``'inline'``. Por compatibilidade anterior, ``True`` ainda é aceito.

source: The default is ``False``: it means that Sphinx's own macros are used for merged cells from grid tables. They allow general contents (literal blocks, lists, blockquotes, ...) but may have problems if the :rst:dir:`tabularcolumns` directive was used to inject LaTeX mark-up of the type ``>{..}``, ``<{..}``, ``@{..}`` as column specification.
pt_br: O padrão é ``False``: significa que as próprias macros do Sphinx são usadas para células mescladas de tabelas de grade. Eles permitem conteúdos gerais (blocos literais, listas, blocos de citação, ...) mas podem ter problemas se a diretiva :rst:dir:`tabularcolumns` foi usada para injetar marcação LaTeX do tipo ``>{..}``, ``<{..}``, ``@{..}`` como especificação de coluna.

source: Setting to ``True`` means to use LaTeX's standard ``\multicolumn``; this is incompatible with literal blocks in the horizontally merged cell, and also with multiple paragraphs in such cell if the table is rendered using ``tabulary``.
pt_br: Definir como ``True`` significa usar o padrão do LaTeX ``\multicolumn``; isso é incompatível com blocos literais na célula mesclada horizontalmente e também com vários parágrafos em tal célula se a tabela for renderizada usando ``tabulary``.

source: If ``True``, the PDF build from the LaTeX files created by Sphinx will use :program:`xindy` (doc__) rather than :program:`makeindex` for preparing the index of general terms (from :rst:dir:`index` usage). This means that words with UTF-8 characters will get ordered correctly for the :confval:`language`.
pt_br: Se for ``True``, o PDF construído a partir dos arquivos LaTeX criados pelo Sphinx usará :program:`xindy` (documentação__) em vez de :program:`makeindex` para preparar o índice de termos gerais (do uso de :rst:dir:`index`). Isso significa que palavras com caracteres UTF-8 serão ordenadas corretamente para :confval:`language`.

source: This option is ignored if :confval:`latex_engine` is ``'platex'`` (Japanese documents; :program:`mendex` replaces :program:`makeindex` then).
pt_br: Esta opção é ignorada se :confval:`latex_engine` for ``'platex'`` (documentos japoneses; :program:`mendex` substitui :program:`makeindex`).

source: The default is ``True`` for ``'xelatex'`` or ``'lualatex'`` as :program:`makeindex`, if any indexed term starts with a non-ascii character, creates ``.ind`` files containing invalid bytes for UTF-8 encoding. With ``'lualatex'`` this then breaks the PDF build.
pt_br: O padrão é ``True`` para ``'xelatex'`` ou ``'lualatex'`` como :program:`makeindex`, se qualquer termo indexado começar com um caractere não ascii, cria arquivos ``.ind`` contendo bytes inválidos para codificação UTF-8. Com ``'lualatex'`` isso então quebra a construção do PDF.

source: The default is ``False`` for ``'pdflatex'`` but ``True`` is recommended for non-English documents as soon as some indexed terms use non-ascii characters from the language script.
pt_br: O padrão é ``False`` para ``'pdflatex'`` mas ``True`` é recomendado para documentos que não estejam em inglês assim que alguns termos indexados usem caracteres não ascii do script de idioma.

source: Sphinx adds to :program:`xindy` base distribution some dedicated support for using ``'pdflatex'`` engine with Cyrillic scripts. And whether with ``'pdflatex'`` or Unicode engines, Cyrillic documents handle correctly the indexing of Latin names, even with diacritics.
pt_br: Sphinx adiciona à distribuição de base :program:`xindy` algum suporte dedicado para usar o mecanismo ``'pdflatex'`` com scripts cirílicos. E seja com motores ``'pdflatex'`` ou Unicode, os documentos cirílicos lidam corretamente com a indexação de nomes latinos, mesmo com sinais diacríticos.

source: Its :ref:`documentation <latex_elements_confval>` has moved to :doc:`/latex`.
pt_br: Sua :ref:`documentação <latex_elements_confval>` foi movida para :doc:`/latex`.

source: A dictionary mapping ``'howto'`` and ``'manual'`` to names of real document classes that will be used as the base for the two Sphinx classes. Default is to use ``'article'`` for ``'howto'`` and ``'report'`` for ``'manual'``.
pt_br: Dicionário mapeando ``'howto'`` e ``'manual'`` para nomes reais de documentos e classes que serão usadas como classes Sphinx. Padrão é usar ``'article'`` para ``'howto'`` e ``'report'`` para ``'manual'``.

source: In Japanese docs (:confval:`language` is ``'ja'``), by default ``'jreport'`` is used for ``'howto'`` and ``'jsbook'`` for ``'manual'``.
pt_br: Em documentos japoneses (:confval:`language` é ``'ja'``), por padrão ``'jreport'`` é usado para ``'howto'`` e ``'jsbook'`` para ``'manual'``.

source: A list of file names, relative to the configuration directory, to copy to the build directory when building LaTeX output. This is useful to copy files that Sphinx doesn't copy automatically, e.g. if they are referenced in custom LaTeX added in ``latex_elements``. Image files that are referenced in source files (e.g. via ``.. image::``) are copied automatically.
pt_br: Lista de nome de arquivos, relativos ao diretório de configuração, para serem copiados para o diretório de construção quando gerando saída LaTeX. Isso é útil para copiar arquivos Sphinx que não são copiados automaticamente, ex: quando são referenciados por LaTeX configurável adicionados em ``latex_elements``. Arquivos de Imagem que são referenciados na fonte (ex: via ``.. image::``) são copiados automaticamente.

source: You have to make sure yourself that the filenames don't collide with those of any automatically copied files.
pt_br: Confirmar que o nome de arquivo não conflita com nenhum arquivo que é copiado automaticamente.

source: This overrides the files which is provided from Sphinx such as ``sphinx.sty``.
pt_br: Isso sobrescreve os arquivos fornecidos pelo Sphinx, como ``sphinx.sty``.

source: The "theme" that the LaTeX output should use. It is a collection of settings for LaTeX output (ex. document class, top level sectioning unit and so on).
pt_br: O "tema" que a saída LaTeX deve usar. É uma coleção de configurações para a saída LaTeX (por exemplo, classe de documento, unidade de corte de nível superior e assim por diante).

source: As a built-in LaTeX themes, ``manual`` and ``howto`` are bundled.
pt_br: Como um tema LaTeX embutido, ``manual`` e ``howto`` são empacotados.

source: A LaTeX theme for writing a manual. It imports the ``report`` document class (Japanese documents use ``jsbook``).
pt_br: Um tema LaTeX para escrever um manual. Ele importa a classe de documento ``report`` (documentos japoneses usam ``jsbook``).

source: A LaTeX theme for writing an article. It imports the ``article`` document class (Japanese documents use ``jreport`` rather). :confval:`latex_appendices` is available only for this theme.
pt_br: Um tema LaTeX para escrever um artigo. Ele importa a classe de documento ``article`` (documentos japoneses usam ``jreport``). :confval:`latex_appendices` está disponível apenas para este tema.

source: It defaults to ``'manual'``.
pt_br: Seu padrão é ``'manual'``.

source: A dictionary of options that influence the look and feel of the selected theme.
pt_br: Um dicionário de opções que influenciam a aparência do tema selecionado.

source: A list of paths that contain custom LaTeX themes as subdirectories. Relative paths are taken as relative to the configuration directory.
pt_br: Uma lista de caminhos que contêm temas LaTeX personalizados como subdiretórios. Os caminhos relativos são considerados relativos ao diretório de configuração.

source: Options for text output
pt_br: Opções para saída texto

source: These options influence text output.
pt_br: Essas opções influenciam a saída texto.

source: Determines which end-of-line character(s) are used in text output.
pt_br: Determina caracter usado como final de linha na saída texto.

source: ``'unix'``: use Unix-style line endings (``\n``)
pt_br: ``'unix'``: Usa estilo para finalizar linhas (``\n``)

source: ``'windows'``: use Windows-style line endings (``\r\n``)
pt_br: ``'windows'``: Usa o estilo Windows para finalizar linhas (``\r\n``)

source: ``'native'``: use the line ending style of the platform the documentation is built on
pt_br: ``'native'``: Usa o estilo de fim de linha da plataforma onde está sendo construída a documentação.

source: Default: ``'unix'``.
pt_br: Padrão: ``'unix'``.

source: A string of 7 characters that should be used for underlining sections. The first character is used for first-level headings, the second for second-level headings and so on.
pt_br: String de 7 caracteres que deve ser usada para seções contidas. O primeiro caracter é usado para cabeçalhos do primeiro nível, segundo caracter para segundo nível e assim sucessivamente.

source: The default is ``'*=-~"+`'``.
pt_br: Padrão é ``'*=-~"+`'``.

source: A boolean that decides whether section numbers are included in text output. Default is ``True``.
pt_br: Booleano que decide quando os números de seção são incluídos na saída do texto. Padrão é ``True``.

source: Suffix for section numbers in text output. Default: ``". "``. Set to ``" "`` to suppress the final dot on section numbers.
pt_br: Sufixo para números de seção na saída de texto. Padrão: ``"."``. Defina como ``""`` para suprimir o ponto final nos números de seção.

source: Options for manual page output
pt_br: Opções para saída página manual

source: These options influence manual page output.
pt_br: Essas opções influenciam a saída página manual.

source: This value determines how to group the document tree into manual pages. It must be a list of tuples ``(startdocname, name, description, authors, section)``, where the items are:
pt_br: Esse valor determina como o grupo de páginas aparecem no manual. Deve ser uma lista de pares ``(startdocname, name, description, authors, section)``, onde os itens são:

source: String that specifies the :term:`document name` of the manual page's master document. All documents referenced by the *startdoc* document in TOC trees will be included in the manual file. (If you want to use the default root document for your manual pages build, use your :confval:`root_doc` here.)
pt_br: String que especifica o :term:`nome do documento <document name>` do documento mestre da página de manual. Todos os documentos referenciados pelo documento *startdoc* nas árvores TOC serão incluídos no arquivo de manual. (Se você deseja usar o documento raiz padrão para sua construção de páginas de manual, use seu :confval:`root_doc` aqui.)

source: Name of the manual page. This should be a short string without spaces or special characters. It is used to determine the file name as well as the name of the manual page (in the NAME section).
pt_br: Nome da página de manual. Deve ser uma string curta sem espaços ou caracteres especiais. É usado para determinar o nome do arquivo, bem como o nome da página do manual (na seção NAME).

source: Description of the manual page. This is used in the NAME section. Can be an empty string if you do not want to automatically generate the NAME section.
pt_br: Descrição da página de manual. Isso é usado na seção NAME. Pode ser uma string vazia se você não quiser gerar automaticamente a seção NAME.

source: A list of strings with authors, or a single string. Can be an empty string or list if you do not want to automatically generate an AUTHORS section in the manual page.
pt_br: Uma lista de strings com autores ou uma única string. Pode ser uma string ou lista vazia se você não quiser gerar automaticamente uma seção AUTHORS na página de manual.

source: The manual page section. Used for the output file name as well as in the manual page header.
pt_br: A seção da página de manual. Usado para o nome do arquivo de saída, bem como no cabeçalho da página de manual.

source: If true, add URL addresses after links. Default is ``False``.
pt_br: Se Verdadeiro, adiciona endereços URL após links. Padrão ``False``.

source: If true, make a section directory on build man page. Default is True.
pt_br: Se verdadeiro, cria um diretório de seção na página de manual de construção. O padrão é True.

source: The default is changed to ``False`` from ``True``.
pt_br: O padrão foi alterado para ``False`` de ``True``.

source: The default is changed to ``True`` from ``False`` again.
pt_br: O padrão foi alterado para ``True`` para ``False`` novamente.

source: Options for Texinfo output
pt_br: Opções para saida TexInfo

source: These options influence Texinfo output.
pt_br: Essas opções influenciam a saida Texinfo.

source: This value determines how to group the document tree into Texinfo source files. It must be a list of tuples ``(startdocname, targetname, title, author, dir_entry, description, category, toctree_only)``, where the items are:
pt_br: Esse valor determina como a raiz do grupo de documento em arquivos fontes Texinfo. Devem ser uma lista de pares ``(startdocname, targetname, title, author, dir_entry, description, category, toctree_only)`` onde itens são:

source: String that specifies the :term:`document name` of the the Texinfo file's master document. All documents referenced by the *startdoc* document in TOC trees will be included in the Texinfo file. (If you want to use the default master document for your Texinfo build, provide your :confval:`root_doc` here.)
pt_br: String que especifica o :term:`nome do documento <document name>` do documento mestre do arquivo Texinfo. Todos os documentos referenciados pelo documento *startdoc* nas árvores TOC serão incluídos no arquivo Texinfo. (Se você deseja usar o documento mestre padrão para sua construção Texinfo, forneça seu :confval:`root_doc` aqui.)

source: File name (no extension) of the Texinfo file in the output directory.
pt_br: Nome de arquivo (sem extensão) do arquivo Texinfo no diretório de saída.
