Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: Texinfo document title. Can be empty to use the title of the *startdoc* document. Inserted as Texinfo markup, so special characters like ``@`` and ``{}`` will need to be escaped to be inserted literally.
pt_br: Título do documento Texinfo. Pode estar vazio para usar o título do documento *startdoc*. Inserido como marcação Texinfo, portanto, caracteres especiais como ``@`` e ``{}`` precisarão ser escapados para serem inseridos literalmente.

source: Author for the Texinfo document. Inserted as Texinfo markup. Use ``@*`` to separate multiple authors, as in: ``'John@*Sarah'``.
pt_br: Autor do documento Texinfo. Inserido como marcação Texinfo. Use ``@*`` para separar vários autores, como em: ``'John@*Sarah'``.

source: The name that will appear in the top-level ``DIR`` menu file.
pt_br: O nome que vai aparecer no arquivo de menu de topo de nível ``DIR``.

source: Descriptive text to appear in the top-level ``DIR`` menu file.
pt_br: Um texto descritivo que vai aparecer no arquivo de menu de topo de nível ``DIR``.

source: Specifies the section which this entry will appear in the top-level ``DIR`` menu file.
pt_br: Especifica a seção na qual esta entrada vai aparecer no arquivo de menu de topo de nível ``DIR``.

source: Must be ``True`` or ``False``. If true, the *startdoc* document itself is not included in the output, only the documents referenced by it via TOC trees. With this option, you can put extra stuff in the master document that shows up in the HTML, but not the Texinfo output.
pt_br: Deve ser ``True`` ou ``False``. Se verdadeiro, o próprio documento *startdoc* não é incluído na saída, apenas os documentos referenciados por ele por meio de árvores TOC. Com esta opção, você pode colocar coisas extras no documento mestre que aparecem no HTML, mas não na saída do Texinfo.

source: Control how to display URL addresses.
pt_br: Controlear como exibir endereços URL.

source: ``'footnote'`` -- display URLs in footnotes (default)
pt_br: ``'footnote'`` -- exibir URLs nas notas de rodapé (padrão).

source: If true, do not generate a ``@detailmenu`` in the "Top" node's menu containing entries for each sub-node in the document. Default is ``False``.
pt_br: Se verdadeiro, não gerar ``@detailmenu`` no "Topo" do menu contendo entradas para cada sub-menu do documento. O padrão é ``False``.

source: A dictionary that contains Texinfo snippets that override those Sphinx usually puts into the generated ``.texi`` files.
pt_br: Um dicionário que contém TexInfo que sobrepõe aqueles que o Sphinx usualmente coloca nos arquivos gerados ``.texi``.

source: Keys that you may want to override include:
pt_br: Chaves que podem ser sobrepostas são:

source: Number of spaces to indent the first line of each paragraph, default ``2``. Specify ``0`` for no indentation.
pt_br: Número de espaços para indentar a primeira linha de cada parágrafo, padrão ``2``. Especificar ``0`` para não haver indentação.

source: Number of spaces to indent the lines for examples or literal blocks, default ``4``. Specify ``0`` for no indentation.
pt_br: Número de espaços para indentar as linhas de exemplo ou blocos de literais, padrão ``4``. Especificar ``0`` para não haver indentação.

source: Texinfo markup inserted near the beginning of the file.
pt_br: Marcação TexInfo inserida próxima do início do arquivo.

source: Texinfo markup inserted within the ``@copying`` block and displayed after the title. The default value consists of a simple title page identifying the project.
pt_br: Marcações inseridas com o bloco

source: Keys that are set by other options and therefore should not be overridden are:
pt_br: Chaves que configuram outras opções e podem ser sobrepostas são:

source: If false, do not generate inline references in a document. That makes an info file more readable with stand-alone reader (``info``). Default is ``True``.
pt_br: Se false, não gera referências embutidas em um documento. Isso torna um arquivo de informação mais legível com o leitor autônomo (``info``). O padrão é ``True``.

source: Options for QtHelp output
pt_br: Opções para saída QtHelp

source: These options influence qthelp output. As this builder derives from the HTML builder, the HTML options also apply where appropriate.
pt_br: Essas opções influenciam a saída do qthelp. Como esse construtor deriva do construtor HTML, as opções HTML também se aplicam quando apropriado.

source: The basename for the qthelp file. It defaults to the :confval:`project` name.
pt_br: O nome base do arquivo qthelp. O padrão é o nome :confval:`project`.

source: The namespace for the qthelp file. It defaults to ``org.sphinx.<project_name>.<project_version>``.
pt_br: O namespace para o arquivo qthelp. O padrão é ``org.sphinx.<project_name>.<project_version>``.

source: The HTML theme for the qthelp output. This defaults to ``'nonav'``.
pt_br: Tema HTML para saída qthelp. Padrão ``'nonav'``.

source: Options for the linkcheck builder
pt_br: Opções para construtor linkcheck

source: A list of regular expressions that match URIs that should not be checked when doing a ``linkcheck`` build. Example::
pt_br: A lista de expressões regulares que combinam com as URIs que não precisam ser verificadas com o construtor `linkcheck``. Exemplo::

source: A dictionary that maps a pattern of the source URI to a pattern of the canonical URI. The linkcheck builder treats the redirected link as "working" when:
pt_br: Um dicionário que mapeia um padrão do URI de origem para um padrão do URI canônico. O construtor linkcheck trata o link redirecionado como "funcionando" quando:

source: the link in the document matches the source URI pattern, and
pt_br: o link no documento corresponde ao padrão de URI de origem e

source: the redirect location matches the canonical URI pattern.
pt_br: o local de redirecionamento corresponde ao padrão de URI canônico.

source: Example:
pt_br: Exemplo:

source: If set, linkcheck builder will emit a warning when disallowed redirection found. It's useful to detect unexpected redirects under :option:`the warn-is-error mode <sphinx-build -W>`.
pt_br: Se definido, o construtor linkcheck emitirá um aviso quando o redirecionamento não permitido for encontrado. É útil para detectar redirecionamentos inesperados em :option:`o modo warn-is-error <sphinx-build -W>`.

source: A dictionary that maps baseurls to HTTP request headers.
pt_br: Um dicionário que mapeia baseurls para cabeçalhos de solicitação HTTP.

source: The key is a URL base string like ``"https://www.sphinx-doc.org/"``. To specify headers for other hosts, ``"*"`` can be used. It matches all hosts only when the URL does not match other settings.
pt_br: A chave é uma string base de URL como ``"https://www.sphinx-doc.org/"``. Para especificar cabeçalhos para outros hosts, ``"*"`` pode ser usado. Ele corresponde a todos os hosts somente quando o URL não corresponde a outras configurações.

source: The value is a dictionary that maps header name to its value.
pt_br: O valor é um dicionário que mapeia nome de cabeçalho para seu valor.

source: The number of times the linkcheck builder will attempt to check a URL before declaring it broken. Defaults to 1 attempt.
pt_br: O número de vezes que o construtor linkcheck irá tentar verificar a URL antes de assumir que está quebrada. Padrão 1 tentativa.

source: The number of worker threads to use when checking links. Default is 5 threads.
pt_br: O número de threads concomitantes para usar quando verificando links. Padrão 5 threads.

source: If true, check the validity of ``#anchor``\ s in links. Since this requires downloading the whole document, it's considerably slower when enabled. Default is ``True``.
pt_br: Se verdadeiro, o validador do link ``#anchor``\. Isso requer download do documento por inteiro e é consideravelmente mais lento quando habilitado. Padrão é ``Verdadeiro``.

source: A list of regular expressions that match anchors Sphinx should skip when checking the validity of anchors in links. This allows skipping anchors that a website's JavaScript adds to control dynamic pages or when triggering an internal REST request. Default is ``["^!"]``.
pt_br: Uma lista de expressões regulares que correspondem às âncoras Sphinx deve pular ao verificar a validade das âncoras nos links. Isso permite pular âncoras que o JavaScript de um site adiciona para controlar páginas dinâmicas ou ao acionar uma solicitação REST interna. O padrão é ``["^!"]``.

source: If you want to ignore anchors of a specific page or of pages that match a specific pattern (but still check occurrences of the same page(s) that don't have anchors), use :confval:`linkcheck_ignore` instead, for example as follows::
pt_br: Se você quiser ignorar as âncoras de uma página específica ou de páginas que correspondem a um padrão específico (mas ainda verificar ocorrências das mesmas páginas que não têm âncoras), use :confval:`linkcheck_ignore` em vez disso, por exemplo como segue::

source: Pass authentication information when doing a ``linkcheck`` build.
pt_br: Passa informações de autenticação ao fazer uma construção ``linkcheck``.

source: A list of ``(regex_pattern, auth_info)`` tuples where the items are:
pt_br: Uma lista de tuplas ``(regex_pattern, auth_info)`` nas quais os itens são:

source: A regular expression that matches a URI.
pt_br: Uma expressão regular que corresponde a uma URI.

source: Authentication information to use for that URI. The value can be anything that is understood by the ``requests`` library (see :ref:`requests Authentication <requests:authentication>` for details).
pt_br: Informações de autenticação a serem usadas para esse URI. O valor pode ser qualquer coisa que seja compreendida pela biblioteca ``requests`` (veja :ref:`Authentication do requests<requests:authentication>` para detalhes).

source: The ``linkcheck`` builder will use the first matching ``auth_info`` value it can find in the :confval:`linkcheck_auth` list, so values earlier in the list have higher priority.
pt_br: O construtor ``linkcheck`` usará o primeiro valor ``auth_info`` correspondente que puder encontrar na lista :confval:`linkcheck_auth`, então os valores anteriores na lista têm maior prioridade.

source: The ``linkcheck`` builder may issue a large number of requests to the same site over a short period of time. This setting controls the builder behavior when servers indicate that requests are rate-limited.
pt_br: O construtor ``linkcheck`` pode emitir um grande número de solicitações para o mesmo site em um curto período de tempo. Esta configuração controla o comportamento do construtor quando os servidores indicam que os pedidos são limitados por taxa.

source: If a server indicates when to retry (using the `Retry-After`_ header), ``linkcheck`` always follows the server indication.
pt_br: Se um servidor indica quando tentar novamente (usando o cabeçalho `Retry-After`_), ``linkcheck`` sempre segue a indicação do servidor.

source: A list of regular expressions that match documents in which Sphinx should not check the validity of links. This can be used for permitting link decay in legacy or historical sections of the documentation.
pt_br: Uma lista de expressões regulares que correspondem a documentos nos quais o Sphinx não deve verificar a validade dos links. Isso pode ser usado para permitir o enfraquecimento do link em seções herdadas ou históricas da documentação.

source: Options for the XML builder
pt_br: Opções para construtor XML

source: If true, pretty-print the XML. Default is ``True``.
pt_br: Se verdadeiro, impressão formatada de XML. Padrão é ``Verdadeiro``.

source: Footnotes
pt_br: Notas de Rodapé

source: A note on available globbing syntax: you can use the standard shell constructs ``*``, ``?``, ``[...]`` and ``[!...]`` with the feature that these all don't match slashes. A double star ``**`` can be used to match any sequence of characters *including* slashes.
pt_br: Anotação sobre sintaxe global disponível: podem ser usadas construções ``*``, ``?``, ``[...]`` e ``[!...]`` com funcionalidade que não combinem com barras. Asterisco duplo ``**`` pode ser usada para combinar com qualquer sequência de caracteres *incluindo* barras.

source: Options for the C domain
pt_br: Opções para o domínio C

source: A list of strings that the parser additionally should accept as attributes. This can for example be used when attributes have been ``#define`` d for portability.
pt_br: Lista de termos que podem ser aceitos como atributos. Isso pode por exemplo ser usado como atributos ``#define`` são usados para portabilidade.

source: A list of strings that the parser additionally should accept as attributes with one argument. That is, if ``my_align_as`` is in the list, then ``my_align_as(X)`` is parsed as an attribute for all strings ``X`` that have balanced braces (``()``, ``[]``, and ``{}``). This can for example be used when attributes have been ``#define`` d for portability.
pt_br: Uma lista de strings que o analisador também deve aceitar como atributos com um argumento. Ou seja, se ``my_align_as`` estiver na lista, então ``my_align_as(X)`` é analisado como um atributo para todas as strings ``X`` que têm parênteses, colchetes e chaves balanceados (ou seja, ``()``, ``[]`` e ``{}``). Isso pode, por exemplo, ser usado quando os atributos foram definidos, com ``#define``, para portabilidade.

source: A list of identifiers to be recognized as keywords by the C parser. It defaults to ``['alignas', 'alignof', 'bool', 'complex', 'imaginary', 'noreturn', 'static_assert', 'thread_local']``.
pt_br: Uma lista de identificadores a serem reconhecidos como palavras-chave pelo analisador C. O padrão é ``['alignas', 'alignof', 'bool', 'complex', 'imaginary', 'noreturn', 'static_assert', 'thread_local']``.

source: Options for the C++ domain
pt_br: Opções para domínio C++

source: A list of prefixes that will be ignored when sorting C++ objects in the global index. For example ``['awesome_lib::']``.
pt_br: Uma lista de prefixos que serão ignorados ao classificar objetos C++ no índice global. Por exemplo ``['awesome_lib::']``.

source: Options for the Python domain
pt_br: Opções para o domínio Python

source: Examples
pt_br: Exemplos

source: If true, suppress the module name of the python reference if it can be resolved. The default is ``False``.
pt_br: Se verdadeiro, suprime o nome do módulo da referência python se puder ser resolvido. O padrão é ``False``.

source: This configuration is still in experimental
pt_br: Esta configuração ainda está em fase experimental

source: Example of configuration file
pt_br: Exemplo de arquivo configuração
