Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: _`dic_enc option` is the encoding for the MeCab algorithm.
pt_br: _`dic_enc option` é a codificação do algoritmo MeCab.

source: _`dict option` is the dictionary to use for the MeCab algorithm.
pt_br: _`dict option` é o dicionário para usar algoritmo MeCab.

source: _`lib option` is the library name for finding the MeCab library via ctypes if the Python binding is not installed.
pt_br: _`lib option` é o nome da biblioteca para encontrar biblioteca MeCab via ctypes se o build do Python não estiver instalado.

source: Options for ``'janome'``:
pt_br: Opções para ``'janome'``:

source: _`user_dic option` is the user dictionary file path for Janome.
pt_br: _`user_dic option` é caminho para arquivo dicionário do Janome.

source: _`user_dic_enc option` is the encoding for the user dictionary file specified by ``user_dic`` option. Default is 'utf8'.
pt_br: _`user_dic_enc option` é o código de página para arquivo dicionário especificado opção ``user_dic``. Padrão 'utf8'.

source: html_search_options for Japanese is re-organized and any custom splitter can be used by `type`_ settings.
pt_br: opções para html_search_options idioma Japonês é reorganizado e configurações serão usados por `type`_ settings.

source: The Chinese support has these options:
pt_br: Chinês suporta essas opções

source: ``dict`` -- the ``jieba`` dictionary path if want to use custom dictionary.
pt_br: ``dict`` -- dicionário ``jieba`` caminho se deseja usar dicionário personalizado.

source: The name of a JavaScript file (relative to the configuration directory) that implements a search results scorer. If empty, the default will be used.
pt_br: O nome do arquivo JavaScript (relativo ao diretório de configuração) que implementa rank resultados pesquisa. Se vazio, o padrão é usado.

source: It is disabled for images having ``no-scaled-link`` class
pt_br: Isso está desabilitado para imagens com a classe ``no-scaled-link``

source: The name of math_renderer extension for HTML output. The default is ``'mathjax'``.
pt_br: O nome da extensão math_renderer para saída HTML. O padrão é ``'mathjax'``.

source: Output is processed with HTML5 writer. Default is ``False``.
pt_br: A saída é processada com o escritor HTML5. O padrão é ``False``.

source: Output is processed with HTML4 writer. Default is ``False``.
pt_br: A saída é processada com o escritor HTML4. O padrão é ``False``.

source: Options for Single HTML output
pt_br: Opções para a saída Single HTML

source: Options for HTML help output
pt_br: Opções para ajuda saída HTML

source: Output file base name for HTML help builder. Default is ``'pydoc'``.
pt_br: Saída arquivo base chamada construtor ajuda HTML . Padrão é ``'pydoc'``.

source: This is the file name suffix for generated HTML help files. The default is ``".html"``.
pt_br: Este é o sufixo do nome do arquivo para arquivos de ajuda HTML gerados. O padrão é ``".html"``.

source: Suffix for generated links to HTML files. The default is ``".html"``.
pt_br: Sufixo para links gerados para arquivos HTML. O padrão é ``".html"``.

source: Options for Apple Help output
pt_br: Opções para saída Ajuda Apple

source: These options influence the Apple Help output. This builder derives from the HTML builder, so the HTML options also apply where appropriate.
pt_br: Essas opções influenciam saída Ajuda Apple. Esse construtor deriva do construtor HTML, portanto opções também se aplicam onde apropriadas.

source: Apple Help output will only work on Mac OS X 10.6 and higher, as it requires the :program:`hiutil` and :program:`codesign` command line tools, neither of which are Open Source.
pt_br: Saída Ajuda Apple só funciona no Mac OS X 10.6 e posterior, como requer :program:`hiutil` e :program:`codesign` na linha de comando, ambos não são Open Source.

source: You can disable the use of these tools using :confval:`applehelp_disable_external_tools`, but the result will not be a valid help book until the indexer is run over the ``.lproj`` folders within the bundle.
pt_br: Pode desabilitar essa funcionalidade usando :confval:`applehelp_disable_external_tools`, mas o resultado só será válido quando o indexador for executado nas pastas ``.lproj``.

source: The basename for the Apple Help Book. Defaults to the :confval:`project` name.
pt_br: Nome base para Apple Help Book. Padrão para nome projeto :confval:`project`.

source: The bundle ID for the help book bundle.
pt_br: O ID do Conjunto para livro de ajuda itens.

source: You *must* set this value in order to generate Apple Help.
pt_br: Esse valor *deve* ser configurado para gerar Ajuda Apple.

source: The development region. Defaults to ``'en-us'``, which is Apple’s recommended setting.
pt_br: O região padrão desenv. Padrão para ``'en-us'``, que é a recomentdação Apple.

source: The bundle version (as a string). Defaults to ``'1'``.
pt_br: Versão do Conjunto (como string). Padrão para ``'1'``.

source: The help bundle icon file, or ``None`` for no icon. According to Apple's documentation, this should be a 16-by-16 pixel version of the application's icon with a transparent background, saved as a PNG file.
pt_br: O arquivo de ícone do pacote de ajuda ou ``None`` para nenhum ícone. De acordo com a documentação da Apple, esta deve ser uma versão de 16x16 pixels do ícone do aplicativo com um fundo transparente, salvo como um arquivo PNG.

source: The product tag for use with :confval:`applehelp_kb_url`. Defaults to :samp:`'{<project>}-{<release>}'`.
pt_br: Etiqueta produto usado :confval:`applehelp_kb_url`. Padrão para :samp:`'{<project>}-{<release>}'`.

source: The URL for your knowledgebase server, e.g. ``https://example.com/kbsearch.py?p='product'&q='query'&l='lang'``. Help Viewer will replace the values ``'product'``, ``'query'`` and ``'lang'`` at runtime with the contents of :confval:`applehelp_kb_product`, the text entered by the user in the search box and the user's system language respectively.
pt_br: O URL de seu servidor de base de conhecimento, por exemplo, ``https://example.com/kbsearch.py?p='product'&q='query'&l='lang'``. O Visualizador de Ajuda irá substituir os valores ``'product'``, ``'query'`` e ``'lang'`` em tempo de execução pelo conteúdo de :confval:`applehelp_kb_product`, o texto inserido pelo usuário no caixa de pesquisa e o idioma do sistema do usuário, respectivamente.

source: Defaults to ``None`` for no remote search.
pt_br: Padrão para ``None`` para pesquisa remota.

source: The URL for remote content. You can place a copy of your Help Book's ``Resources`` folder at this location and Help Viewer will attempt to use it to fetch updated content.
pt_br: O URL para conteúdo remoto. Você pode colocar uma cópia da pasta ``Resources`` de seu Livro de Ajuda neste local e o Visualizador de Ajuda tentará usá-la para buscar conteúdo atualizado.

source: e.g. if you set it to ``https://example.com/help/Foo/`` and Help Viewer wants a copy of ``index.html`` for an English speaking customer, it will look at ``https://example.com/help/Foo/en.lproj/index.html``.
pt_br: ex.. se configurar ``https://example.com/help/Foo/`` e Visualizador Help utiliza uma cópia de ``index.html`` para idioma Inglês, irá parecer com ``https://example.com/help/Foo/en.lproj/index.html``.

source: Defaults to ``None`` for no remote content.
pt_br: Padrão ``None`` para nenhum conteúdo remoto.

source: If ``True``, tell the help indexer to index anchors in the generated HTML. This can be useful for jumping to a particular topic using the ``AHLookupAnchor`` function or the ``openHelpAnchor:inBook:`` method in your code. It also allows you to use ``help:anchor`` URLs; see the Apple documentation for more information on this topic.
pt_br: Se ``True``, informa ao indexador help para ancorar índices gerados em HTML. Pode ser útil na hora de navegar para um tópico em particular usando função ``AHLookupAnchor`` ``openHelpAnchor:inBook:`` em seu código. Também possibilita uso de URLs ``help:anchor``; ver documentação Apple para maiores informações sobre esse tópico.

source: Controls the minimum term length for the help indexer. Defaults to ``None``, which means the default will be used.
pt_br: Controla o tamanho mínimo para indexador help. Padrão para ``None``, o que significa que o padrão será usado.

source: Either a language specification (to use the built-in stopwords), or the path to a stopwords plist, or ``None`` if you do not want to use stopwords. The default stopwords plist can be found at ``/usr/share/hiutil/Stopwords.plist`` and contains, at time of writing, stopwords for the following languages:
pt_br: Especificação do idioma (usado para palavras-chave), ou o caminho para plist de palavras-chave ou ``None`` caso não desejar palavras-chave. A plist padrão de palavras-chave pode ser encontrada em ``/usr/share/hiutil/Stopwords.plist`` e contém, em tempo de geração, stopwords para os idiomas:

source: Language
pt_br: Idioma

source: Code
pt_br: Código

source: English
pt_br: Inglês

source: German
pt_br: Alemão

source: Spanish
pt_br: Espanhol

source: French
pt_br: Francês

source: Swedish
pt_br: Sueco

source: Hungarian
pt_br: Húngaro

source: Specifies the locale to generate help for. This is used to determine the name of the ``.lproj`` folder inside the Help Book’s ``Resources``, and is passed to the help indexer.
pt_br: Especifíca para qual locale será gerado o Help. Isso é usado para determinar o nome da pasta ``.lproj`` dento do Help ``Resources``, e é passado ao indexador de ajuda.

source: Specifies the help book title. Defaults to :samp:`'{<project>} Help'`.
pt_br: Especifica o título do livro de jelp. Padrão para :samp:`'{<project>} Help'`.

source: Specifies the identity to use for code signing, or ``None`` if code signing is not to be performed.
pt_br: Especifica a identidade do código de assinatura do usuário ou ``None`` se a assinatura não deve ser efetuada.

source: Defaults to the value of the environment variable ``CODE_SIGN_IDENTITY``, which is set by Xcode for script build phases, or ``None`` if that variable is not set.
pt_br: Padrão para o valor da variável de ambiente ``CODE_SIGN_IDENTITY``, na qual Xcode constrói as fases, ou ``None`` se a variável não deve ser configurada.

source: A *list* of additional arguments to pass to :program:`codesign` when signing the help book.
pt_br: Uma *lista* argumentos adicionais para passar ao :program:`codesign` quando assinando o livro de help.

source: Defaults to a list based on the value of the environment variable ``OTHER_CODE_SIGN_FLAGS``, which is set by Xcode for script build phases, or the empty list if that variable is not set.
pt_br: Padrão para lista baseada nos valores das variáveis do ambiente ``OTHER_CODE_SIGN_FLAGS``, as quais pode ser usadas na construção pelo Xcode ou lista vazia se a variável não for configurada.

source: The path to the :program:`hiutil` program. Defaults to ``'/usr/bin/hiutil'``.
pt_br: O caminho para o programa :program:`hiutil`. Padrão para ``'/usr/bin/hiutil'``.

source: The path to the :program:`codesign` program. Defaults to ``'/usr/bin/codesign'``.
pt_br: O caminho para o programa :program:`codesign`. Padrão ``'/usr/bin/codesign'``.

source: If ``True``, the builder will not run the indexer or the code signing tool, no matter what other settings are specified.
pt_br: Se ``True``, o construtor não irá executar o indexador ou a ferramente de assinatura, não importa o que outras configurações especificam.

source: This is mainly useful for testing, or where you want to run the Sphinx build on a non-Mac OS X platform and then complete the final steps on OS X for some reason.
pt_br: Essa é a parte mais útil para teste, onde pode ser solicitado para o Sphinx ser construído em uma plataforma não MAC OS X e então completar apenas os passos finais no OS X.

source: Options for epub output
pt_br: Opções para saída epub

source: These options influence the epub output. As this builder derives from the HTML builder, the HTML options also apply where appropriate. The actual values for some of the options is not really important, they just have to be entered into the `Dublin Core metadata <https://dublincore.org/>`_.
pt_br: Essas opções influenciam a saída do epub. Como esse construtor deriva do construtor HTML, as opções HTML também se aplicam quando apropriado. Os valores reais para algumas das opções não são realmente importantes, eles apenas têm que ser inseridos nos `metadados Dublin Core <https://dublincore.org/>`_.

source: The basename for the epub file. It defaults to the :confval:`project` name.
pt_br: Nome do arquivo epub. O padrão é o nome :confval:`project`.

source: The HTML theme for the epub output. Since the default themes are not optimized for small screen space, using the same theme for HTML and epub output is usually not wise. This defaults to ``'epub'``, a theme designed to save visual space.
pt_br: O tema HTML para saída epub. Desde que temas padrões não são otimizados para dispositivos telas menores, usando os mesmos temas HTML a saída epub não será adequada. Valor padrão para tema ``'epub'``, é um tema para economizar espaço.

source: The title of the document. It defaults to the :confval:`html_title` option but can be set independently for epub creation. It defaults to the :confval:`project` option.
pt_br: O título do documento. O padrão é a opção :confval:`html_title`, mas pode ser definido independentemente para a criação do epub. O padrão é a opção :confval:`project`.

source: It defaults to the ``project`` option.
pt_br: Usa como padrão a opção ``project``.

source: The description of the document. The default value is ``'unknown'``.
pt_br: A descrição do documento. O padrão é ``'unknown'``.

source: Renamed from ``epub3_description``
pt_br: Renomeado a partir de ``epub3_description``

source: The author of the document. This is put in the Dublin Core metadata. It defaults to the :confval:`author` option.
pt_br: O autor do documento. Isso é gravado em metadados Dublin Core. Padrão opção :confval:`author`.

source: The name of a person, organization, etc. that played a secondary role in the creation of the content of an EPUB Publication. The default value is ``'unknown'``.
pt_br: O nome da pessoa, organização, etc. que desempenha papel secundário na criação de conteúdo na publicação EPUB. O padrão é ``'desconhecido'``.

source: Renamed from ``epub3_contributor``
pt_br: Renomeado a partir de ``epub3_contributor``

source: The language of the document. This is put in the Dublin Core metadata. The default is the :confval:`language` option or ``'en'`` if unset.
pt_br: O idioma do documento. Isso será gravado nos metadados Dublin Core. O padrão é opção :confval:`language` ou ``'en'`` se não for configurado.

source: The publisher of the document. This is put in the Dublin Core metadata. You may use any sensible string, e.g. the project homepage. The defaults to the :confval:`author` option.
pt_br: O editor do documento. Isso é colocado nos metadados Dublin Core. Você pode usar qualquer string sensível, por exemplo, a página inicial do projeto. O padrão é a opção :confval:`author`.

source: The copyright of the document. It defaults to the :confval:`copyright` option but can be set independently for epub creation.
pt_br: Copyright do documento. Padrão para valor da opção :confval:`copyright` mas pode ser independentemente configurada para criação epub.

source: An identifier for the document. This is put in the Dublin Core metadata. For published documents this is the ISBN number, but you can also use an alternative scheme, e.g. the project homepage. The default value is ``'unknown'``.
pt_br: Identificador para o documento. Isso é gravado nos metadados Dublin Core. Para publicação documentos é o número ISBN, mas pode ser usado um schema alternativo, ex.. nome página do projeto. O padrão é ``'unknown'``.

source: The publication scheme for the :confval:`epub_identifier`. This is put in the Dublin Core metadata. For published books the scheme is ``'ISBN'``. If you use the project homepage, ``'URL'`` seems reasonable. The default value is ``'unknown'``.
pt_br: Esquema para :confval:`epub_identifier`. Gravado nos metadados do Dublin Core. Para editores o esquema é ``'ISBN'``. Se usar página web, ``'URL'`` pode atender. O valor padrão é ``'unknown'``.

source: A unique identifier for the document. This is put in the Dublin Core metadata. You may use a `XML's Name format <https://www.w3.org/TR/REC-xml/#NT-NameStartChar>`_ string. You can't use hyphen, period, numbers as a first character. The default value is ``'unknown'``.
pt_br: Um identificador exclusivo para o documento. Isso é colocado nos metadados Dublin Core. Você pode usar uma string de `formato de Name do XML <https://www.w3.org/TR/REC-xml/#NT-NameStartChar>`_. Você não pode usar hífen, ponto, números como um primeiro caractere. O valor padrão é ``'unknown'``.

source: The cover page information. This is a tuple containing the filenames of the cover image and the html template. The rendered html cover page is inserted as the first item in the spine in :file:`content.opf`. If the template filename is empty, no html cover page is created. No cover at all is created if the tuple is empty. Examples::
pt_br: Informação página abertura. Esse par contendo nome de arquivo da imagem do modelo html. A renderização da página será inserida como primeiro item do :file:`content.opf`. Se o nome do modelo estiver vazio, nenhuma página abertura será criada. Nada será criado se o par estiver vazio. Exemplos::

source: The default value is ``()``.
pt_br: O valor padrão é ``()``.

source: A list of CSS files. The entry must be a *filename* string or a tuple containing the *filename* string and the *attributes* dictionary. For more information, see :confval:`html_css_files`.
pt_br: Uma lista de arquivos CSS. A entrada deve ser uma string *filename* ou uma tupla contendo a string *filename* e o dicionário de *attributes*. Para mais informações, veja :confval:`html_css_files`.

source: Additional files that should be inserted before the text generated by Sphinx. It is a list of tuples containing the file name and the title. If the title is empty, no entry is added to :file:`toc.ncx`. Example::
pt_br: Arquivo adicional deve ser inserido antes do texto gerado pelo Sphinx. Lista de pares contendo nome de arquivo e título. Se título está vazio, nenhuma entrada é adicionada para o arquivo :file:`toc.ncx`. Exemplo::

source: The default value is ``[]``.
pt_br: O valor padrão é ``[]``.

source: Additional files that should be inserted after the text generated by Sphinx. It is a list of tuples containing the file name and the title. This option can be used to add an appendix. If the title is empty, no entry is added to :file:`toc.ncx`. The default value is ``[]``.
pt_br: Arquivos adicionais que devem ser inseridos após o texto gerado pelo Sphinx. Lista de pares contendo nome do arquivo e título. Essa opção é usada para adicionar sufixo. Se o título está vazio, nenhuma entrada é adicionada para o arquivo :file:`toc.ncx`. O padrão é ``[]``.

source: A list of files that are generated/copied in the build directory but should not be included in the epub file. The default value is ``[]``.
pt_br: Lista de arquivos que são gerados/copiados no diretório de construção mas não devem ser incluídos no arquivo epub. O padrão é ``[]``.

source: The depth of the table of contents in the file :file:`toc.ncx`. It should be an integer greater than zero. The default value is 3. Note: A deeply nested table of contents may be difficult to navigate.
pt_br: A profundidade da tabela de conteúdos do arquivo :file:`toc.ncs`. Deve ser um inteiro maior que zero. O padrão é 3. Nota: Estruturas mais abrangentes de tabela de conteúdos pode ser difícil para navegar.

source: This flag determines if a toc entry is inserted again at the beginning of its nested toc listing. This allows easier navigation to the top of a chapter, but can be confusing because it mixes entries of different depth in one list. The default value is ``True``.
pt_br: Esse indicador determina se a entrada toc será inserida novamente no início da toc subordinada. Isso permite navegação mais fácil no topo do capítulo, mas pode ser confuso por misturar diversos níveis de hierárquia na lista. O padrão do valor é ``True``.

source: This setting control the scope of the epub table of contents. The setting can have the following values:
pt_br: Controla o escopo da tabela de conteúdos para epub. A configuração pode ter os seguintes valores:

source: ``'default'`` -- include all toc entries that are not hidden (default)
pt_br: ``'default'`` -- inclui todas entradas toc não omitidas (padrão)

source: ``'includehidden'`` -- include all toc entries
pt_br: ``'includehidden'`` -- inclui todas entras toc

source: This flag determines if sphinx should try to fix image formats that are not supported by some epub readers. At the moment palette images with a small color table are upgraded. You need Pillow, the Python Image Library, installed to use this option. The default value is ``False`` because the automatic conversion may lose information.
pt_br: Este sinalizador determina se o sphinx deve tentar corrigir formatos de imagem que não são suportados por alguns leitores epub. No momento, as imagens da paleta com uma pequena tabela de cores são atualizadas. Você precisa de Pillow, a Python Image Library, instalada para usar esta opção. O valor padrão é ``False`` porque a conversão automática pode perder informações.

source: This option specifies the maximum width of images. If it is set to a value greater than zero, images with a width larger than the given value are scaled accordingly. If it is zero, no scaling is performed. The default value is ``0``. You need the Python Image Library (Pillow) installed to use this option.
pt_br: Essa opção especifíca largura máxima para imagens. Se valor for maior que zero, images com largura maior que o valor informado serão convertidas. Se valor for zero, nenhuma conversão será executada. valor padrão é ``0``. Python Image Library (Pillow) deve estar disponível para usar essa opção.

source: Control whether to display URL addresses. This is very useful for readers that have no other means to display the linked URL. The settings can have the following values:
pt_br: Controle exibição endereços URL. Útil para leitores que não possuem outras maneiras de exibir URL ligadas. A configuração pode ter os seguintes valores:

source: ``'inline'`` -- display URLs inline in parentheses (default)
pt_br: ``'inline'`` -- exibir URLs dentro de parênteses (padrão)

source: ``'footnote'`` -- display URLs in footnotes
pt_br: ``'footnote'`` -- exibir urls nas notas de rodapé.

source: ``'no'`` -- do not display URLs
pt_br: ``'no'`` -- não exibir URLs

source: The display of inline URLs can be customized by adding CSS rules for the class ``link-target``.
pt_br: Para exibir URLs vinculadas utilizar adição de regras CSS para classe ``link-target``.

source: If true, add an index to the epub document. It defaults to the :confval:`html_use_index` option but can be set independently for epub creation.
pt_br: Se verdadeiro, adiciona índice documento epub. Padrão para usar :confval:`html_use_index` opção pode ser configurada independentemente para criação epub.

source: It specifies writing direction. It can accept ``'horizontal'`` (default) and ``'vertical'``
pt_br: Especifica a direção da escrita. Pode ser ``'horizontal'`` (padrão) ou ``'vertical'``

source: page progression
pt_br: progressão página

source: left to right
pt_br: esquerda para direita

source: right to left
pt_br: direita para esquerda

source: iBook's Scroll Theme support
pt_br: Suporte Rolagem do Tema iBook's

source: scroll-axis is vertical.
pt_br: scroll-axis é vertical.

source: scroll-axis is horizontal.
pt_br: scroll-axis é horizontal.
