Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: It replaces deprecated :confval:`html_use_smartypants`. It applies by default to all builders except ``man`` and ``text`` (see :confval:`smartquotes_excludes`.)
pt_br: Substitui o obsoleto :confval:`html_use_smartypants`. Aplica-se por padrão para todos os construtores exceto ``man`` e ``text`` (ver :confval:`smartquotes_excludes`.)

source: A `docutils.conf`__ file located in the configuration directory (or a global :file:`~/.docutils` file) is obeyed unconditionally if it *deactivates* smart quotes via the corresponding `Docutils option`__. But if it *activates* them, then :confval:`smartquotes` does prevail.
pt_br: Arquivo `docutils.conf`__ localizado no diretório de configuração (ou arquivo global :file:`~/.docutils` ) é respeitado incondicionalmente se ele *desativa* aspas diferentes através da opção correspondente `Docutils option`__. Mas se for *ativada* então :confval:`smartquotes` , não prevalece.

source: This string customizes the Smart Quotes transform. See the file :file:`smartquotes.py` at the `Docutils repository`__ for details. The default ``'qDe'`` educates normal **q**\ uote characters ``"``, ``'``, em- and en-**D**\ ashes ``---``, ``--``, and **e**\ llipses ``...``.
pt_br: Esta string personaliza a transformação Smart Quotes (aspas inteligentes). Veja o arquivo :file:`smartquotes.py` no `repositório Docutils`__ para detalhes. O padrão ``'qDe'`` educa os caracteres normais de aspas (**q**\ uote) ``"``, ``'``, travessão e meia-risca (em- e en-**D**\ ashes) ``---``, ``--``, e reticências (**e**\ llipses) ``...``.

source: This is a ``dict`` whose default is::
pt_br: Um ``dict`` cujo padrão é::

source: Each entry gives a sufficient condition to ignore the :confval:`smartquotes` setting and deactivate the Smart Quotes transform. Accepted keys are as above ``'builders'`` or ``'languages'``. The values are lists.
pt_br: Cada entrada fornece uma condição suficiente para ignorar a configuração :confval:`smartquotes` e desativar a transformação Smart Quotes. As chaves aceitas são como acima ``'builders'`` ou ``'languages'``. Os valores são listas.

source: Currently, in case of invocation of :program:`make` with multiple targets, the first target name is the only one which is tested against the ``'builders'`` entry and it decides for all. Also, a ``make text`` following ``make html`` needs to be issued in the form ``make text O="-E"`` to force re-parsing of source files, as the cached ones are already transformed. On the other hand the issue does not arise with direct usage of :program:`sphinx-build` as it caches (in its default usage) the parsed source files in per builder locations.
pt_br: Atualmente, em caso de chamada do :program:`make` com múltiplos alvos, o primeiro nome será o único validado nas opções ``'builders'`` e decidirá por todos. Também um ``make text`` seguido por ``make html`` aninhado será emitido no formato ``make text O="-E"`` para forçar a transmissão dos arquivos fonte, como cache que já foi transformado. De outra maneira o requerimento não se realizará no uso do :program:`sphinx-build` como cache (que é o uso padrão) dos arquivos fontes submetidos para cada construtor.

source: An alternative way to effectively deactivate (or customize) the smart quotes for a given builder, for example ``latex``, is to use ``make`` this way:
pt_br: Uma maneira alternativa de efetivamente desativar (ou personalizar) as aspas inteligentes para um determinado construtor, por exemplo, ``latex``, é usar o ``make`` desta maneira:

source: A User-Agent of Sphinx. It is used for a header on HTTP access (ex. linkcheck, intersphinx and so on). Default is ``"Sphinx/X.Y.Z requests/X.Y.Z python/X.Y.Z"``.
pt_br: Um User-Agent de Sphinx. É usado para um cabeçalho no acesso HTTP (ex.: linkcheck, intersphinx e assim por diante). O padrão é ``"Sphinx/X.Y.Z requests/X.Y.Z python/X.Y.Z"``.

source: If true, Sphinx verifies server certifications. Default is ``True``.
pt_br: Se verdadeiro, Sphinx verifica certificação do servidor. Padrão ``True``.

source: A path to a certification file of CA or a path to directory which contains the certificates. This also allows a dictionary mapping hostname to the path to certificate file. The certificates are used to verify server certifications.
pt_br: Caminho para certificação do arquivo do CA ou caminho para o diretório que contem os certificados. Isso permite o dicionário mapear nome do host para o caminho do certificado. O certificado é usado para verificar a certificação do servidor.

source: Sphinx uses requests_ as a HTTP library internally. Therefore, Sphinx refers a certification file on the directory pointed ``REQUESTS_CA_BUNDLE`` environment variable if ``tls_cacerts`` not set.
pt_br: Sphinx usa requests_ como uma biblioteca HTTP internamente. Portanto, Sphinx consulta um arquivo de certificação no diretório apontado pela variável de ambiente ``REQUESTS_CA_BUNDLE`` se ``tls_cacerts`` não estiver definida.

source: These values determine how to format the current date, used as the replacement for ``|today|``.
pt_br: esses valores determinam como o formato da data atual, usado em detrimento de ``|today|``.

source: If you set :confval:`today` to a non-empty value, it is used.
pt_br: Se configurar :confval:`today` para um valor não vazio, ele será usado.

source: Otherwise, the current time is formatted using :func:`time.strftime` and the format given in :confval:`today_fmt`.
pt_br: Caso contrário, horário corrente será usado no formato :func:`time.strftime` e o formato :confval:`today_fmt`.

source: The default is now :confval:`today` and a :confval:`today_fmt` of ``'%b %d, %Y'`` (or, if translation is enabled with :confval:`language`, an equivalent format for the selected locale).
pt_br: O padrão é agora :confval:`today` e um :confval:`today_fmt` de ``'%b %d, %Y'`` (ou se tradução estiver habilitada com :confval:`language`, um formato será selecionado na localidade equivalente).

source: The default language to highlight source code in. The default is ``'default'``. It is similar to ``'python3'``; it is mostly a superset of ``'python'`` but it fallbacks to ``'none'`` without warning if failed. ``'python3'`` and other languages will emit warning if failed.
pt_br: A linguagem padrão para realçar o código-fonte. O padrão é ``'default'``. É semelhante ao ``'python3'``; é basicamente um superconjunto de ``'python'``, mas ele cai para ``'none'`` sem aviso de falha. ``'python3'`` e outras linguagens emitem aviso se falharem.

source: The value should be a valid Pygments lexer name, see :ref:`code-examples` for more details.
pt_br: O valor deve ser um nome de lexador válido do Pygments, veja :ref:`code-examples` para mais detalhes.

source: The default is now ``'default'``. If you prefer Python 2 only highlighting, you can set it back to ``'python'``.
pt_br: O padrão agora é ``'default'``. Se você preferir o realce apenas de Python 2, você pode configurá-lo de volta para ``'python'``.

source: A dictionary that maps language names to options for the lexer modules of Pygments. These are lexer-specific; for the options understood by each, see the `Pygments documentation <https://pygments.org/docs/lexers>`_.
pt_br: Um dicionário que mapeia nomes de idiomas para opções para os módulos analisadores léxicos de Pygments. Estes são específicos do analisador léxico; para as opções compreendidas por cada um, consulte a `documentação do Pygments <https://pygments.org/docs/lexers>`_.

source: Example::
pt_br: Exemplo::

source: A single dictionary of options are also allowed. Then it is recognized as options to the lexer specified by :confval:`highlight_language`::
pt_br: Um único dicionário de opções também é permitido. Em seguida, é reconhecido como opções para o analisador léxico especificado por :confval:`highlight_language`::

source: Allow to configure highlight options for multiple languages
pt_br: Permite configurar opções de realce para várias linguagens

source: The style name to use for Pygments highlighting of source code. If not set, either the theme's default style or ``'sphinx'`` is selected for HTML output.
pt_br: O nome do estilo usado para enfatizar código fonte com Pygments. Se não configurado usa estilo do tema ou `'sphinx'`` é selecionado na saída HTML.

source: If the value is a fully-qualified name of a custom Pygments style class, this is then used as custom style.
pt_br: Se o valor é completamente qualificado como um nome configurado de estilo de classe Pygments, então será usado como estilo personalizado.

source: A boolean that decides whether parentheses are appended to function and method role text (e.g. the content of ``:func:`input```) to signify that the name is callable. Default is ``True``.
pt_br: Booleano que decide onde parenteses são anexados a funções ou regra do texto (ex: conteúdo de ``:func:`input```) para significar que o nome é chamado. Padrão para ``True``.

source: A boolean that decides whether module names are prepended to all :term:`object` names (for object types where a "module" of some kind is defined), e.g. for :rst:dir:`py:function` directives. Default is ``True``.
pt_br: Booleano que decide sobre nomes dos módulos serão prefixados a todos nomes :term:`object` (para tipos de objetos onde "modulo" é definido), e.g. para :rst:dir:`py:function`. Padrão é ``True``.

source: A boolean that decides whether :rst:dir:`codeauthor` and :rst:dir:`sectionauthor` directives produce any output in the built files.
pt_br: Booleano que decide diretivas para diretório :rst:dir:`codeauthor` e :rst:dir:`sectionauthor` quanto a geração nos arquivos.

source: A list of prefixes that are ignored for sorting the Python module index (e.g., if this is set to ``['foo.']``, then ``foo.bar`` is shown under ``B``, not ``F``). This can be handy if you document a project that consists of a single package. Works only for the HTML builder currently. Default is ``[]``.
pt_br: Lista de prefixos que serão ignorados para classificação índice módulos Python (ex: se configurado ``['foo.']``, então ``foo.bar`` é exibido sob o ``B``, não no ``F``). Isso pode ser útil quando seu projeto tem um único pacote. Atualmente funcionada só para o construtor HTML. Padrão é ``[]``.

source: Trim spaces before footnote references that are necessary for the reST parser to recognize the footnote, but do not look too nice in the output.
pt_br: Espaços antes das referências de rodapé são necessários para o parser reST para reconhecer notas de rodapé, mas não tem aparência boa na saída.

source: If true, doctest flags (comments looking like ``# doctest: FLAG, ...``) at the ends of lines and ``<BLANKLINE>`` markers are removed for all code blocks showing interactive Python sessions (i.e. doctests). Default is ``True``. See the extension :mod:`~sphinx.ext.doctest` for more possibilities of including doctests.
pt_br: Se verdadeiro, doctest marca (comentários como ``# doctest: FLAG, ...``) ao final das linhas e marcas ``<BLANKLINE>`` são removidas para todos blocos de código exibidos em sessões interativas Python (ex.. doctests). Padrão "True". Ver a extensão :mod:`~sphinx.ext.doctest` para mais possibilidades na inclusão de doctests.

source: Now also removes ``<BLANKLINE>``.
pt_br: Agora també remove ``<BLANKLINE>``.

source: Default is ``False``. When backslash stripping is enabled then every occurrence of ``\\`` in a domain directive will be changed to ``\``, even within string literals. This was the behaviour before version 3.0, and setting this variable to ``True`` will reinstate that behaviour.
pt_br: O padrão é ``False``. Quando a remoção da barra invertida está habilitada, então cada ocorrência de ``\\`` em uma diretiva de domínio será alterada para ``\``, mesmo dentro de literais de string. Este era o comportamento antes da versão 3.0, e definir esta variável como ``True`` irá restabelecer esse comportamento.

source: Options for internationalization
pt_br: Opções para internacionalização

source: These options influence Sphinx's *Native Language Support*. See the documentation on :ref:`intl` for details.
pt_br: Essa opção influencia Sphinx *Suporte Nativo a Idiomas*. Ver documentação :ref:`intl`, para maiores detalhes.

source: Support figure substitution
pt_br: Suporte substituição figura

source: Currently supported languages by Sphinx are:
pt_br: Idiomas atualmente suportados são:

source: ``ar`` -- Arabic
pt_br: ``ar`` -- Árabe

source: ``bg`` -- Bulgarian
pt_br: ``bg`` -- Búlgaro

source: ``ca`` -- Catalan
pt_br: ``ca`` -- Catalão

source: ``cak`` -- Kaqchikel
pt_br: ``cak`` -- Caqchiquel

source: ``cy`` -- Welsh
pt_br: ``cy`` -- Galês

source: ``da`` -- Danish
pt_br: ``da`` -- Dinamarquês

source: ``de`` -- German
pt_br: ``de`` -- Alemão

source: ``el`` -- Greek
pt_br: ``el`` -- Grego

source: ``es`` -- Spanish
pt_br: ``es`` -- Espanhol

source: ``et`` -- Estonian
pt_br: ``et`` -- Estoniano

source: ``eu`` -- Basque
pt_br: ``eu`` -- Basco

source: ``fa`` -- Iranian
pt_br: ``fa`` -- Iraniano

source: ``fi`` -- Finnish
pt_br: ``fi`` -- Finlandês

source: ``fr`` -- French
pt_br: ``fr`` -- Francês

source: ``he`` -- Hebrew
pt_br: ``he`` -- Hebreu

source: ``hi_IN`` -- Hindi (India)
pt_br: ``hi_IN`` -- Hindi (Índia)

source: ``hr`` -- Croatian
pt_br: ``hr`` -- Croata

source: ``hu`` -- Hungarian
pt_br: ``hu`` -- Húngaro

source: ``id`` -- Indonesian
pt_br: ``id`` -- Indonésio

source: ``it`` -- Italian
pt_br: ``it`` -- Italiano

source: ``ja`` -- Japanese
pt_br: ``ja`` -- Japonês

source: ``ko`` -- Korean
pt_br: ``ko`` -- Koreano

source: ``lt`` -- Lithuanian
pt_br: ``lt`` -- Lituano

source: ``lv`` -- Latvian
pt_br: ``lv`` -- Letão

source: ``mk`` -- Macedonian
pt_br: ``mk`` -- Macedônio

source: ``nb_NO`` -- Norwegian Bokmal
pt_br: ``nb_NO`` -- Norueguês Bokmal

source: ``ne`` -- Nepali
pt_br: ``ne`` -- Nepalês

source: ``nl`` -- Dutch
pt_br: ``nl`` -- Holandês

source: ``pl`` -- Polish
pt_br: ``pl`` -- Polonês

source: ``pt`` -- Portuguese
pt_br: ``pt`` -- Português

source: ``pt_BR`` -- Brazilian Portuguese
pt_br: ``pt_BR`` -- Português do Brasil

source: ``pt_PT`` -- European Portuguese
pt_br: ``pt_PT`` -- Português Portugal

source: ``ro`` -- Romanian
pt_br: ``ro`` -- Romeno

source: ``ru`` -- Russian
pt_br: ``ru`` -- Russo

source: ``sk`` -- Slovak
pt_br: ``sk`` -- Eslovêno

source: ``sl`` -- Slovenian
pt_br: ``sl`` -- Eslovênia

source: ``sq`` -- Albanian
pt_br: ``sq`` -- Albanês

source: ``sr`` -- Serbian
pt_br: ``sr`` -- Sérvio

source: ``sr@latin`` -- Serbian (Latin)
pt_br: ``sr@latin`` -- Sérvio (Latim)

source: ``sr_RS`` -- Serbian (Cyrillic)
pt_br: ``sr_RS`` -- Sérvio (Cirílico)

source: ``sv`` -- Swedish
pt_br: ``sv`` -- Sueco

source: ``ta`` -- Tamil
pt_br: ``ta`` -- Tâmil

source: ``tr`` -- Turkish
pt_br: ``tr`` -- Turco

source: ``uk_UA`` -- Ukrainian
pt_br: ``uk_UA`` -- Ucraniano

source: ``vi`` -- Vietnamese
pt_br: ``vi`` -- Vietnamita

source: ``zh_CN`` -- Simplified Chinese
pt_br: ``zh_CN`` -- Chinês Simplificado

source: ``zh_TW`` -- Traditional Chinese
pt_br: ``zh_TW`` -- Chinês Traditional

source: Directories in which to search for additional message catalogs (see :confval:`language`), relative to the source directory. The directories on this path are searched by the standard :mod:`gettext` module.
pt_br: Diretórios nos quais a pesquisa adicional do catálogo de mensagem (ver :confval:`language`), relativos ao diretório fonte. Os diretórios desse caminho de busca será usado pelo módulo padrão :mod:`gettext`.

source: Internal messages are fetched from a text domain of ``sphinx``; so if you add the directory :file:`./locale` to this setting, the message catalogs (compiled from ``.po`` format using :program:`msgfmt`) must be in :file:`./locale/{language}/LC_MESSAGES/sphinx.mo`. The text domain of individual documents depends on :confval:`gettext_compact`.
pt_br: Mensagens Internas do Sphinx são recuperadas de um domínio ``sphinx``; se adicionar o arquivo :file:`./locale` nessa configuração, o catálogo de mensagem (compilado no formato ``.po`` usando o programa :program:`msgfmt`) deve estar em :file:`./locale/{language}/LC_MESSAGES/sphinx.mo`. O domínio individual dos documentos depende de :confval:`gettext_compact`.

source: The default is ``['locales']``.
pt_br: O padrão é ``['locales']``.

source: The :option:`-v option for sphinx-build command <sphinx-build -v>` is useful to check the locale_dirs config works as expected. It emits debug messages if message catalog directory not found.
pt_br: A opção :option:`-v para o comando sphinx-build <sphinx-build -v>` é útil para verificar se a configuração locale_dirs funciona conforme o esperado. Ele emite mensagens de depuração se o diretório do catálogo de mensagens não for encontrado.

source: Use ``locales`` directory as a default value
pt_br: Usar diretório ``locales`` como valor padrão.

source: If true, "fuzzy" messages in the message catalogs are used for translation. The default is ``False``.
pt_br: Se verdadeiro, as mensagens "difusas" nos catálogos de mensagens são usadas para tradução. O padrão é ``False``.

source: If true, a document's text domain is its docname if it is a top-level project file and its very base directory otherwise.
pt_br: Se verdadeiro, um domínio de documento texto do docname e se for o nível topo arquivo de projeto ou seu diretório base.

source: If set to string, all document's text domain is this string, making all documents use single text domain.
pt_br: Se definido como string, todo o domínio de texto do documento é esta string, fazendo com que todos os documentos usem um único domínio de texto.

source: By default, the document ``markup/code.rst`` ends up in the ``markup`` text domain. With this option set to ``False``, it is ``markup/code``.
pt_br: Por padrão, o documento ``markup/code.rst`` termina no domínio texto ``markup``. Com esta opção ativada para ``False`` será ``markup/code``.

source: The string value is now accepted.
pt_br: O valor string agora é aceito.

source: If true, Sphinx generates uuid information for version tracking in message catalogs. It is used for:
pt_br: Se verdadeiro, Sphinx gerá informação uuid para rastrear versão os catálogos de mensagnes. Usado para:

source: Add uid line for each msgids in .pot files.
pt_br: Adicionar linha uid para cada msgid nos arquivos .pot.

source: Calculate similarity between new msgids and previously saved old msgids. This calculation takes a long time.
pt_br: Calcular similaridade entre novas msgids e previas salvas em antigas msgids. Esse cálculo leva algum tempo.

source: If you want to accelerate the calculation, you can use ``python-levenshtein`` 3rd-party package written in C by using :command:`pip install python-levenshtein`.
pt_br: Se deseja acelerar o cálculo, pode usar ``python-levenshtein`` pacote de 3. escrito em C usando o comando :command:`pip install python-levenshtein`.

source: The default is ``False``.
pt_br: O padrão é ``False``.

source: If true, Sphinx generates location information for messages in message catalogs.
pt_br: Se verdadeiro, Sphinx gera informação para tradução de mensagens em catalogos de mensagens.

source: The default is ``True``.
pt_br: O padrão é ``True``.

source: If true, Sphinx builds mo file for each translation catalog files.
pt_br: Se verdadeiro, Sphinx constrói arquivo mo (binario) para cada catálogo de mensagem.

source: To specify names to enable gettext extracting and translation applying for i18n additionally. You can specify below names:
pt_br: Para especificar nome para habilitar gettext extraindo e traduzindo aplicando i18n adicionalmente. Pode ser especificado os nomes:

source: index
pt_br: índice

source: literal blocks (``::`` annotation and ``code-block`` directive)
pt_br: blocos literais (anotação ``::`` e diretiva ``code-block``)

source: doctest block
pt_br: bloco doctest

source: raw content
pt_br: conteúdo bruto

source: image
pt_br: imagem

source: image/figure uri
pt_br: uri de imagem/figura

source: For example: ``gettext_additional_targets = ['literal-block', 'image']``.
pt_br: Por exemplo: ``gettext_additional_targets = ['literal-block', 'image']``.

source: The default is ``[]``.
pt_br: Padrão é ``[]``.

source: The alt text for image is translated by default.
pt_br: O texto alternativo da imagem é traduzido por padrão.

source: The filename format for language-specific figures. The default value is ``{root}.{language}{ext}``. It will be expanded to ``dirname/filename.en.png`` from ``.. image:: dirname/filename.png``. The available format tokens are:
pt_br: O nome do arquivo de imagem no idioma específico. O padrão é ``{root}.{idioma}{ext}``. Será expandido para ``diretório/arquivo.en.png`` derivado de ``.. image:: diretório/nomearquivo.png``. Os códigos disponíveis são:

source: ``{root}`` - the filename, including any path component, without the file extension, e.g. ``dirname/filename``
pt_br: ``{root}`` - O nome do arquivo, incluindo componentes de caminho, porem sem a extensão do arquivo, ex. ``diretório/arquivo``

source: ``{path}`` - the directory path component of the filename, with a trailing slash if non-empty, e.g. ``dirname/``
pt_br: ``{path}`` - o caminho do diretório do nome do arquivo, com barra final se não for vazio, ex. ``diretório/``

source: ``{docpath}`` - the directory path component for the current document, with a trailing slash if non-empty.
pt_br: ``{docpath}`` - o componente do caminho do diretório para o documento atual, com uma barra se não estiver vazio.

source: ``{basename}`` - the filename without the directory path or file extension components, e.g. ``filename``
pt_br: ``{basename}`` - nome do arquivo sem o caminho do diretório e sem a extensão do arquivo, ex. ``arquivo``

source: ``{ext}`` - the file extension, e.g. ``.png``
pt_br: ``{ext}`` - a extensão do arquivo, ex. ``.png``

source: ``{language}`` - the translation language, e.g. ``en``
pt_br: ``{language}`` - idioma da tradução, ex. ``en``

source: For example, setting this to ``{path}{language}/{basename}{ext}`` will expand to ``dirname/en/filename.png`` instead.
pt_br: Por exemplo, configurado isso para ``{path}{language}/{basename}{ext}`` irão ser expandidas para ``dirname/en/filename.png``.

source: Added ``{path}`` and ``{basename}`` tokens.
pt_br: Adic. ``{path}`` e ``{basename}`` termos.

source: Added ``{docpath}`` token.
pt_br: Adicionado o token ``{docpath}``.

source: Defaults to ``False``.
pt_br: O padrão é ``False``.

source: Options for Math
pt_br: Opções para Math

source: These options influence Math notations.
pt_br: Estas opções influenciam notações Math.

source: Set this option to ``True`` if you want all displayed math to be numbered. The default is ``False``.
pt_br: Defina essa opção para ``True`` se deseja exibir numeração. O padrão é ``False``.

source: A string used for formatting the labels of references to equations. The ``{number}`` place-holder stands for the equation number.
pt_br: Uma string usada para formatar os rótulos das referências às equações. O marcador de posição ``{number}`` representa o número da equação.

source: Example: ``'Eq.{number}'`` gets rendered as, for example, ``Eq.10``.
pt_br: Exemplo: ``'Eq.{number}'`` é renderizado como, por exemplo, ``Eq.10``.

source: If ``True``, displayed math equations are numbered across pages when :confval:`numfig` is enabled. The :confval:`numfig_secnum_depth` setting is respected. The :rst:role:`eq`, not :rst:role:`numref`, role must be used to reference equation numbers. Default is ``True``.
pt_br: Se ``Verdadeiro``, equações matemáticas serão exibidas como numeradas através das páginas quando :confval:`numfig` estiver habilitada. A configuração :confval:`numfig_secnum_depth` será respeitada. Será usada :rst:role:`eq`, não será usada :rst:role:`numref`, role deve ser usada para referenciar número de equações. Padrão é ``Verdadeiro``.
