Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: Options for HTML output
pt_br: Opções para saída HTML

source: These options influence HTML as well as HTML Help output, and other builders that use Sphinx's HTMLWriter class.
pt_br: Essas opções influenciam HTML bem como Saída HTML Help e outros construtores que usam classe Sphinx HTMLWriter.

source: The "theme" that the HTML output should use. See the :doc:`section about theming </usage/theming>`. The default is ``'alabaster'``.
pt_br: O "tema" que a saída HTML deve usar. Veja a :doc:`seção sobre temas </usage/theming>`. O padrão é ``'alabaster'``.

source: A dictionary of options that influence the look and feel of the selected theme. These are theme-specific. For the options understood by the builtin themes, see :ref:`this section <builtin-themes>`.
pt_br: Dicionário de opções que influenciam aparência e comportamento do tema selecionado. São específicos para tema. Para opções inteligíveis dos temas veja :ref:`this section <builtin-themes>`.

source: A list of paths that contain custom themes, either as subdirectories or as zip files. Relative paths are taken as relative to the configuration directory.
pt_br: Lista de caminhs que contém temas configurados, pode ser subdiretórios ou arquivos zip. Relativo ao caminho do diretório de configuração.

source: The style sheet to use for HTML pages. A file of that name must exist either in Sphinx's :file:`static/` path, or in one of the custom paths given in :confval:`html_static_path`. Default is the stylesheet given by the selected theme. If you only want to add or override a few things compared to the theme's stylesheet, use CSS ``@import`` to import the theme's stylesheet.
pt_br: Folha de estilo para páginas HTML. Arquivo com esse nome deve existir no caminho :file:`static/`, ou nos caminhos configuráveis :confval:`html_static_path`. Padrão é folha de estilo para o tema escolhido. Se desejar adicionar ou sobrepôr apenas alguns parâmetros usar CSS ``@import`` para importar folha de estilos.

source: The "title" for HTML documentation generated with Sphinx's own templates. This is appended to the ``<title>`` tag of individual pages, and used in the navigation bar as the "topmost" element. It defaults to :samp:`'{<project>} v{<revision>} documentation'`.
pt_br: O "título" para documentação HTML gerada pelos modelos Sphinx. Anexado na tag ``<title>`` das páginas individuais e usada na barra de navegação do elemento "superior". Padrão para :samp:`'documentação {<project>} v{<revision>} '`.

source: A shorter "title" for the HTML docs. This is used for links in the header and in the HTML Help docs. If not given, it defaults to the value of :confval:`html_title`.
pt_br: Um "título" mais curto para os documentos HTML. Isso é usado para links no cabeçalho e nos documentos de Ajuda em HTML. Se não for fornecido, o padrão é o valor de :confval:`html_title`.

source: The base URL which points to the root of the HTML documentation. It is used to indicate the location of document using `The Canonical Link Relation`_. Default: ``''``.
pt_br: O URL base que aponta para a raiz da documentação HTML. É usado para indicar o local do documento usando `The Canonical Link Relation`_. Padrão: ``''``.

source: The style of line numbers for code-blocks.
pt_br: O estilo de números de linha para blocos de código.

source: ``'table'`` -- display line numbers using ``<table>`` tag
pt_br: ``'table'`` -- exibe números de linha usando a tag ``<table>``

source: ``'inline'`` -- display line numbers using ``<span>`` tag (default)
pt_br: ``'inline'`` -- exibe números de linha usando a tag ``<span>`` (padrão)

source: It defaults to ``'inline'``.
pt_br: Tem como padrão ``'inline'``.

source: A dictionary of values to pass into the template engine's context for all pages. Single values can also be put in this dictionary using the :option:`-A <sphinx-build -A>` command-line option of ``sphinx-build``.
pt_br: Dicionário de valores para passar ao mecanismo contexto para todas páginas. Valores simples podem ser usados nesse dicionário através da opção :option:`-A <sphinx-build -A>` da linha de comando do ``sphinx-build``.

source: If given, this must be the name of an image file (path relative to the :term:`configuration directory`) that is the logo of the docs, or URL that points an image file for the logo. It is placed at the top of the sidebar; its width should therefore not exceed 200 pixels. Default: ``None``.
pt_br: Se fornecido, deve ser o nome de um arquivo de imagem (caminho relativo ao :term:`diretório de configuração <configuration directory>`) que é o logotipo dos documentos, ou URL que aponta um arquivo de imagem para o logotipo. Ele é colocado na parte superior da barra lateral; sua largura, portanto, não deve exceder 200 pixels. Padrão: ``None``.

source: The image file will be copied to the ``_static`` directory of the output HTML, but only if the file does not already exist there.
pt_br: O arquivo de imagem será copiado para diretório ``_static`` da saída HTML, mas somente se o arquivo não existir nesse local.

source: Also accepts the URL for the logo file.
pt_br: Também aceita a URL do arquivo de logotipo.

source: If given, this must be the name of an image file (path relative to the :term:`configuration directory`) that is the favicon of the docs, or URL that points an image file for the favicon. Modern browsers use this as the icon for tabs, windows and bookmarks. It should be a Windows-style icon file (``.ico``), which is 16x16 or 32x32 pixels large. Default: ``None``.
pt_br: Se fornecido, deve ser o nome de um arquivo de imagem (caminho relativo ao :term:`diretório de configuração <configuration directory>`) que é o favicon dos documentos, ou URL que aponta um arquivo de imagem para o favicon. Os navegadores modernos usam isso como ícone para abas, janelas e favoritos. Deve ser um arquivo de ícone no estilo do Windows (``.ico``), que tem 16x16 ou 32x32 pixels de tamanho. Padrão: ``None``.

source: Also accepts the URL for the favicon.
pt_br: Também aceita a URL do favicon.

source: A list of CSS files. The entry must be a *filename* string or a tuple containing the *filename* string and the *attributes* dictionary. The *filename* must be relative to the :confval:`html_static_path`, or a full URI with scheme like ``https://example.org/style.css``. The *attributes* is used for attributes of ``<link>`` tag. It defaults to an empty list.
pt_br: Uma lista de arquivos CSS. A entrada deve ser uma string *nome de arquivo* ou uma tupla contendo a string *nome de arquivo* e o dicionário de *atributos*. O *nome de arquivo* deve ser relativo ao :confval:`html_static_path`, ou um URI completo com esquema como ``https://example.org/style.css``. Os *atributos* são usados para atributos da tag ``<link>``. O padrão é uma lista vazia.

source: Support priority attribute
pt_br: Suporte ao atributo de prioridade

source: A list of JavaScript *filename*. The entry must be a *filename* string or a tuple containing the *filename* string and the *attributes* dictionary. The *filename* must be relative to the :confval:`html_static_path`, or a full URI with scheme like ``https://example.org/script.js``. The *attributes* is used for attributes of ``<script>`` tag. It defaults to an empty list.
pt_br: Uma lista de *filename* JavaScript. A entrada deve ser uma string *filename* ou uma tupla contendo a string *filename* e o dicionário *attributes*. O *filename* deve ser relativo ao :confval:`html_static_path` ou uma URI completa com esquema como ``https://example.org/script.js``. Os *attributes* são usados para atributos da tag ``1``. O padrão é uma lista vazia.

source: A list of paths that contain custom static files (such as style sheets or script files). Relative paths are taken as relative to the configuration directory. They are copied to the output's :file:`_static` directory after the theme's static files, so a file named :file:`default.css` will overwrite the theme's :file:`default.css`.
pt_br: Lista de caminhos que contém arquivos estáticos (como folhas de estilo ou arquivos script). Relativos ao diretório de config. São copiados para o arquivo saída :file:`_static` diretório após arquivos estáticos de tema, portante um arquivo chamado :file:`default.css` será sobreposto pelo arquivo tema :file:`default.css`.

source: As these files are not meant to be built, they are automatically excluded from source files.
pt_br: Como esses arquivos não são destinados para serem construídos, eles são automaticamente excluídos dos arquivos fontes.

source: For security reasons, dotfiles under ``html_static_path`` will not be copied. If you would like to copy them intentionally, please add each filepath to this setting::
pt_br: Por razões de segurança, dotfiles em ``html_static_path`` não serão copiados. Se desejar copiá-los intencionalmente, adicione cada caminho de arquivo a esta configuração::

source: Another way to do that, you can also use :confval:`html_extra_path`. It allows to copy dotfiles under the directories.
pt_br: Outra forma de fazer isso, você também pode usar :confval:`html_extra_path`. Permite copiar dotfiles nos diretórios.

source: The paths in :confval:`html_static_path` can now contain subdirectories.
pt_br: O caminho em :confval:`html_static_path` agora pode conter subdiretórios.

source: The entries in :confval:`html_static_path` can now be single files.
pt_br: As entradas em :confval:`html_static_path` pode ser arquivos simples.

source: The files under :confval:`html_static_path` are excluded from source files.
pt_br: Os arquivos em :confval:`html_static_path` são excluídos dos arquivos fonte.

source: A list of paths that contain extra files not directly related to the documentation, such as :file:`robots.txt` or :file:`.htaccess`. Relative paths are taken as relative to the configuration directory. They are copied to the output directory. They will overwrite any existing file of the same name.
pt_br: A lista de caminhos que contem arquivos extras, não diretamente relacionados com a documentação,como :file:`robots.txt` ou :file:`.htaccess`. Caminhos Relativos são obtidos no diretório de configuração. Serão copiados para o diretório de saida. Irão sobrepor arquivo já existente com o mesmo nome.

source: The dotfiles in the extra directory will be copied to the output directory. And it refers :confval:`exclude_patterns` on copying extra files and directories, and ignores if path matches to patterns.
pt_br: Os dotfiles no diretório extra serão copiados para o diretório de saída. E se refere am :confval:`exclude_patterns` sobre a cópia de arquivos e diretórios extras, e ignora se o caminho corresponde aos padrões.

source: If true, quotes and dashes are converted to typographically correct entities. Default: ``True``.
pt_br: Se verdadeiro, aspas e traços são convertidos para entidades tipograficamente corretas. Padrão ``True``.

source: To disable smart quotes, use rather :confval:`smartquotes`.
pt_br: Para desabilitar aspas smart, usar :confval:`smartquotes`.

source: Custom sidebar templates, must be a dictionary that maps document names to template names.
pt_br: Modelo configurável de barra lateral, deve ser um dicionário que mapeia nomes de documentos a nomes de modelos.

source: The keys can contain glob-style patterns [1]_, in which case all matching documents will get the specified sidebars. (A warning is emitted when a more than one glob-style pattern matches for any document.)
pt_br: As chaves podem conter padrões estilo global [1]_, nos casos onde os documentos que atenderem o critério, terão barras laterais especificadas. (Alerta é emitido quando mais de um padrão de estilo global combinar com um documento.)

source: The values can be either lists or single strings.
pt_br: Os valores pode ser listas ou simples strings.

source: If a value is a list, it specifies the complete list of sidebar templates to include. If all or some of the default sidebars are to be included, they must be put into this list as well.
pt_br: O valor é uma lista, que especifica uma lista completa de modelos de barra lateral para inclusão. Se todas ou algumas barras laterais são incluídas, elas devem estar nessa lista também.

source: The default sidebars (for documents that don't match any pattern) are defined by theme itself. Builtin themes are using these templates by default: ``['localtoc.html', 'relations.html', 'sourcelink.html', 'searchbox.html']``.
pt_br: As barras laterais padrão (para documentos que não correspondem a nenhum padrão) são definidas pelo próprio tema. Os temas usam embutidos esses modelos por padrão: ``['localtoc.html', 'relations.html', 'sourcelink.html', 'searchbox.html']``.

source: If a value is a single string, it specifies a custom sidebar to be added between the ``'sourcelink.html'`` and ``'searchbox.html'`` entries. This is for compatibility with Sphinx versions before 1.0.
pt_br: Se um valor é uma string simples, ele especifica uma barra lateral configurável a ser adicionada entre as entradas ``'sourcelink.html'`` e ``'searchbox.html'``. Isso é para compatibilidade com versões Sphinx anteriores a 1.0.

source: a single string value for ``html_sidebars`` will be removed in 2.0
pt_br: um termo simples para ``html_sidebars`` será removido em 2.0

source: Builtin sidebar templates that can be rendered are:
pt_br: Modelos de barra lateral implícita são renderizados:

source: **localtoc.html** -- a fine-grained table of contents of the current document
pt_br: **localtoc.html** -- tabela detalhada de conteúdos do documento atual

source: **globaltoc.html** -- a coarse-grained table of contents for the whole documentation set, collapsed
pt_br: **globaltoc.html** -- tabela esparça de conteúdo de todo o conjunto documento, modo encolhido

source: **relations.html** -- two links to the previous and next documents
pt_br: **relations.html** -- links que apontam para o anterior e próximo documentos

source: **sourcelink.html** -- a link to the source of the current document, if enabled in :confval:`html_show_sourcelink`
pt_br: **sourcelink.html** -- link que aponta para o documento atual, se habilitado exibe :confval:`html_show_sourcelink`

source: **searchbox.html** -- the "quick search" box
pt_br: **searchbox.html** -- caixa "pesquisa rápida"

source: This will render the custom template ``windowssidebar.html`` and the quick search box within the sidebar of the given document, and render the default sidebars for all other pages (except that the local TOC is replaced by the global TOC).
pt_br: Renderiza modelo configurável `windowssidebar.html`` e caixa de pesquisa dentro da barra lateral de um dado documento e renderiza barras laterais para outras páginas (exceto a tabela local de conteúdo TOC que será substituída pela TOC global).

source: The ability to use globbing keys and to specify multiple sidebars.
pt_br: Habilidde em usar chaves globias e especificar múltiplas barras laterais.

source: Note that this value only has no effect if the chosen theme does not possess a sidebar, like the builtin **scrolls** and **haiku** themes.
pt_br: Notar que esse valor só não tem efeito se o tema escolhido não possuir barra lateral, como os temas **scrolls** e **haiku**.

source: Additional templates that should be rendered to HTML pages, must be a dictionary that maps document names to template names.
pt_br: Modelos adicionais são renderizados para páginas HTML, devem ter um dicionário que mapeia nomes de documentos para nomes de modelos.

source: This will render the template ``customdownload.html`` as the page ``download.html``.
pt_br: Isso irá renderizar o modelo ``customdownload.html`` como página ``download.html``.

source: If true, generate domain-specific indices in addition to the general index. For e.g. the Python domain, this is the global module index. Default is ``True``.
pt_br: Se verdadeiro, gera índices específicos do domínio em adição ao índice geral. Por ex. domínio Python, é um módulo índice global. Padrão é ``Verdadeiro``.

source: This value can be a bool or a list of index names that should be generated. To find out the index name for a specific index, look at the HTML file name. For example, the Python module index has the name ``'py-modindex'``.
pt_br: Esse valor pode ser booleano ou lista de nomes de índices que devem ser gerados. Para encontrar o nome do índice para um índice específico, veja nome do arquivo HTML. Por exemplo: índice módulo Python tem nome ``'py-modindex'``.

source: If true, add an index to the HTML documents. Default is ``True``.
pt_br: Se Verdadeiro, adiciona um índice ao documento HTML. Padrão ``Verdadeiro``.

source: If true, the index is generated twice: once as a single page with all the entries, and once as one page per starting letter. Default is ``False``.
pt_br: Se verdadeiro, o índice é gerado novamente: quando uma simples página com todas entradas e quando uma página por letra inicial. Padrão é ``Falso``.

source: If true, the reST sources are included in the HTML build as :file:`_sources/{name}`. The default is ``True``.
pt_br: Se verdadeiro, fontes reSt são incluídos no construtor HTML como :file:`_sources/{name}`. O padrão é ``True``.

source: If true (and :confval:`html_copy_source` is true as well), links to the reST sources will be added to the sidebar. The default is ``True``.
pt_br: Se verdadeiro (e :confval:`html_copy_source` for verdadeiro também), links para fontes reST irão aparecer na barra lateral. O padrão é ``True``.

source: Suffix to be appended to source links (see :confval:`html_show_sourcelink`), unless they have this suffix already. Default is ``'.txt'``.
pt_br: Sufixo a ser anexado aos links de origem (veja :confval:`html_show_sourcelink`), a menos que eles já tenham este sufixo. O padrão é ``'.txt'``.

source: If nonempty, an `OpenSearch <https://github.com/dewitt/opensearch>`_ description file will be output, and all pages will contain a ``<link>`` tag referring to it. Since OpenSearch doesn't support relative URLs for its search page location, the value of this option must be the base URL from which these documents are served (without trailing slash), e.g. ``"https://docs.python.org"``. The default is ``''``.
pt_br: Se não estiver vazio, um arquivo de descrição `OpenSearch <https://github.com/dewitt/opensearch>`_ será gerado e todas as páginas conterão uma tag ``<link>`` referente a ele. Como o OpenSearch não oferece suporte a URLs relativos para o local da página de pesquisa, o valor dessa opção deve ser o URL base do qual esses documentos são veiculados (sem barra final), por exemplo, ``"https://docs.python.org"``. O padrão é ``''``.

source: Suffix for generated links to HTML files. The default is whatever :confval:`html_file_suffix` is set to; it can be set differently (e.g. to support different web server setups).
pt_br: Sufixo para links gerados para arquivos HTML. O padrão é o sufixo definido em :confval:`html_file_suffix`; pode ser modificado para suportar diferentes configurações de servidores web).

source: If true, "(C) Copyright ..." is shown in the HTML footer. Default is ``True``.
pt_br: Se verdadeiro, "(C) Copyright ..." é exibido no rodapé HTML. Padrão é ``True``.

source: If true, the text around the keyword is shown as summary of each search result. Default is ``True``.
pt_br: Se true, o texto ao redor da palavra-chave é mostrado como resumo de cada resultado da pesquisa. O padrão é ``True``.

source: If true, "Created using Sphinx" is shown in the HTML footer. Default is ``True``.
pt_br: Se verdadeiro, exibe "Criado usando Sphinx" no rodapé HTML. Padrão é ``True``.

source: Encoding of HTML output files. Default is ``'utf-8'``. Note that this encoding name must both be a valid Python encoding name and a valid HTML ``charset`` value.
pt_br: Codificação arquivos de saída HTML. Padrão é ``'utf-8'``. Nota que esse nome da codificação deve ser válido no Python e no ``conjunto de caracteres``.

source: If true, a list all whose items consist of a single paragraph and/or a sub-list all whose items etc... (recursive definition) will not use the ``<p>`` element for any of its items. This is standard docutils behavior. Default: ``True``.
pt_br: Se verdadeiro, uma lista com todos os itens que consistem em um único parágrafo e/ou uma sublista com todos os itens etc... (definição recursiva) não usará o elemento ``<p>`` para nenhum de seus itens. Este é o comportamento padrão dos docutils. Predefinição: ``True``.

source: Suffix for section numbers. Default: ``". "``. Set to ``" "`` to suppress the final dot on section numbers.
pt_br: Sufixo para número de seções. Padrão: Default: ``". "``. para suprimir o ponto final no número das seções.

source: Language to be used for generating the HTML full-text search index. This defaults to the global language selected with :confval:`language`. If there is no support for this language, ``"en"`` is used which selects the English language.
pt_br: Idioma usado para geração do índice HTML da pesquisa texto. Padrão ao idiomal global selecionaod com :confval:`language`. Se não houver suporte ao idioma, ``"en"`` será usado para selecionar idioma Inglês.

source: Support is present for these languages:
pt_br: Atualmente suporta esses idiomas:

source: ``en`` -- English
pt_br: ``en`` -- Inglês

source: ``no`` -- Norwegian
pt_br: ``no`` -- Norueguês

source: ``zh`` -- Chinese
pt_br: ``zh`` -- Chinês

source: Accelerating build speed
pt_br: Acelerando velocidade de montagem

source: Each language (except Japanese) provides its own stemming algorithm. Sphinx uses a Python implementation by default. You can use a C implementation to accelerate building the index file.
pt_br: Cada idioma (exceto Japonês) provê seu próprio algoritmo uso. Sphinx usa uma implementação Python por padrão. Pode ser escolhida a implementação C para acelerar a construção do arquivo índice.

source: `PyStemmer <https://pypi.org/project/PyStemmer/>`_ (all languages)
pt_br: `PyStemmer <https://pypi.org/project/PyStemmer/>`_ (todos os idiomas)

source: With support for ``en`` and ``ja``.
pt_br: Com suporte para ``en`` e ``ja``.

source: Added additional languages.
pt_br: Adicionado outros idiomas.

source: A dictionary with options for the search language support, empty by default. The meaning of these options depends on the language selected.
pt_br: Um dicionário com opções de suporte a pesquisa em outros idiomas, vazio por padrão. O significado depende do idioma selecionado.

source: The English support has no options.
pt_br: Em inglês não há opções.

source: The Japanese support has these options:
pt_br: Japonês suporte essas opções:

source: type
pt_br: tipo

source: You can choose from these modules:
pt_br: Pode escolher entre esses módulos:

source: TinySegmenter algorithm. This is default splitter.
pt_br: Algoritmo TinySegmenter. Esse é o divisor padrão.

source: MeCab binding. To use this splitter, 'mecab' python binding or dynamic link library ('libmecab.so' for linux, 'libmecab.dll' for windows) is required.
pt_br: MeCab funcionalidade. Usar isso para dividir, 'mecab' ou biblioteca link dinâmico ('libmecab.so' para linux, 'libmecab.dll' para windows) é necessário.

source: Janome binding. To use this splitter, `Janome <https://pypi.org/project/Janome/>`_ is required.
pt_br: Associações para Janome. Para usar este divisor, `Janome <https://pypi.org/project/Janome/>`_ é exigido.

source: ``'mecab'``, ``'janome'`` and ``'default'`` is deprecated. To keep compatibility, ``'mecab'``, ``'janome'`` and ``'default'`` are also acceptable.
pt_br: ``'mecab'``, ``'janome'`` e ``'default'`` foram descontinuados. Para manter a compatibilidade, ``'mecab'``, ``'janome'`` e ``'default'`` também são aceitos.

source: Other option values depend on splitter value which you choose.
pt_br: Valores das outras opções dependem de fragmentar o valor escolhido.

source: Options for ``'mecab'``:
pt_br: Opções para ``'mecab'``:
