Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: Configuration
pt_br: Configuração

source: The :term:`configuration directory` must contain a file named :file:`conf.py`. This file (containing Python code) is called the "build configuration file" and contains (almost) all configuration needed to customize Sphinx input and output behavior.
pt_br: O :term:`diretório de configuração <configuration directory>` deve conter um arquivo chamado :file:`conf.py`. Esse arquivo (contendo código Python) é chamado "arquivo de configuração da construção" e (geralmente) contém toda configuração necessária para personalizar o comportamento das entradas e saídas do Sphinx.

source: An optional file `docutils.conf`_ can be added to the configuration directory to adjust `Docutils`_ configuration if not otherwise overridden or set by Sphinx.
pt_br: Um arquivo opcional `docutils.conf`_ pode ser adicionado ao diretório de configuração para ajustar a configuração do `Docutils`_ se não for substituído ou definido pelo Sphinx.

source: The configuration file is executed as Python code at build time (using :func:`importlib.import_module`, and with the current directory set to its containing directory), and therefore can execute arbitrarily complex code. Sphinx then reads simple names from the file's namespace as its configuration.
pt_br: O arquivo de configuração é executado com código Python em tempo de construção (usando :func:`importlib.import_module`, e com o diretório corrente sendo definico como diretório base) e suporta a execução arbitrária de códigos complexos. Sphinx então faz a leitura de simples nomes de arquivos do namespace como sua configuração.

source: Important points to note:
pt_br: Pontos importantes a notar:

source: If not otherwise documented, values must be strings, and their default is the empty string.
pt_br: Se não documentado de outra maneira, valores devem ser strings e seus conteúdos padrão são strings vazias.

source: The term "fully-qualified name" refers to a string that names an importable Python object inside a module; for example, the FQN ``"sphinx.builders.Builder"`` means the ``Builder`` class in the ``sphinx.builders`` module.
pt_br: O termo "nome totalmente qualificado" refere-se a uma string que nomeia um objeto Python importável dentro de um módulo; por exemplo:, o ``"sphinx.builders.Builder"`` quer dizer a classe ``Builder`` no módulo ``sphinx.builders``.

source: Remember that document names use ``/`` as the path separator and don't contain the file name extension.
pt_br: Lembrar que o nome do documento usa ``/`` como separador do caminho e não contém o nome da extensão do arquivo.

source: Since :file:`conf.py` is read as a Python file, the usual rules apply for encodings and Unicode support.
pt_br: Já que :file:`conf.py` é lido como um arquivo Python, as regras usuais se aplicam para codificação e suporte Unicode.

source: The contents of the config namespace are pickled (so that Sphinx can find out when configuration changes), so it may not contain unpickleable values -- delete them from the namespace with ``del`` if appropriate. Modules are removed automatically, so you don't need to ``del`` your imports after use.
pt_br: O conteúdo do namespace config é obtido (é assim que Sphinx pode encontrar modificações externas da configuração), portando não pode conter valores impossíveis de interpretação -- remova esses no namespace com o comando ``del`` conforme apropriado. Módulos são removidos automaticamente, portanto não precisa usar ``del`` após uso em seus comandos import.

source: There is a special object named ``tags`` available in the config file. It can be used to query and change the tags (see :ref:`tags`). Use ``tags.has('tag')`` to query, ``tags.add('tag')`` and ``tags.remove('tag')`` to change. Only tags set via the ``-t`` command-line option or via ``tags.add('tag')`` can be queried using ``tags.has('tag')``. Note that the current builder tag is not available in ``conf.py``, as it is created *after* the builder is initialized.
pt_br: Existe um objeto especial chamado ``tags`` disponível no arquivo config. Pode ser usado para consultar e modificar tags (ver :ref:`tags`). Usar ``tags.has('tag')`` para consultar e ``tags.add('tag')`` e ``tags.remove('tag')`` para atualizar. Note que o construtor corrent não está disponível em ``conf.py``, quando foi criado *após* o construtor ser inicializado.

source: Project information
pt_br: Informação do Projeto

source: The documented project's name.
pt_br: Documentar nome do Projeto.

source: The author name(s) of the document. The default value is ``'unknown'``.
pt_br: O nome do autor(es) do documento. O padrão é ``'unknown'``.

source: A copyright statement in the style ``'2008, Author Name'``.
pt_br: Informação de direito autoral no estilo ``'2008, Author Name'``.

source: An alias of :confval:`copyright`.
pt_br: Um apelido para :confval:`copyright`.

source: The major project version, used as the replacement for ``|version|``. For example, for the Python documentation, this may be something like ``2.6``.
pt_br: Versão abrangente, usada em lugar de ``|version|``. Por exemplo na documentação Python, pode ser algo como ``2.6``.

source: The full project version, used as the replacement for ``|release|`` and e.g. in the HTML templates. For example, for the Python documentation, this may be something like ``2.6.0rc1``.
pt_br: Versão completa projeto, usada em substituição para ``|release|`` e em modelos HTML. Por exemplo, para documentação Python, pode conter algo como ``2.6.0rc1``.

source: If you don't need the separation provided between :confval:`version` and :confval:`release`, just set them both to the same value.
pt_br: Se não necessitar separação entre :confval:`version` e :confval:`release`, apenas configure ambos para mesmo valor.

source: General configuration
pt_br: Configuração Geral

source: A list of strings that are module names of :doc:`extensions <extensions/index>`. These can be extensions coming with Sphinx (named ``sphinx.ext.*``) or custom ones.
pt_br: Uma lista de strings que são nomes de módulos de :doc:`extensões <extensions/index>`. Essas podem ser extensões nativas do Sphinx (chamadas ``sphinx.ext.*``) e outras configuradas.

source: Note that you can extend :data:`sys.path` within the conf file if your extensions live in another directory -- but make sure you use absolute paths. If your extension path is relative to the :term:`configuration directory`, use :func:`os.path.abspath` like so::
pt_br: Notar que :data:`sys.path` pode ser extendidodentro do arquivo conf se suas extensões estão em outro diretório -- mas confirme o caminho real. Se o caminho de sua extensão é relativo ao :term:`diretório de configuração`, usar :func:`os.path.abspath` como::

source: That way, you can load an extension called ``extname`` from the subdirectory ``sphinxext``.
pt_br: Dessa maneira, pode ser carregada a extensão chamada ``extname`` do subdiretório ``sphinxext``.

source: The configuration file itself can be an extension; for that, you only need to provide a :func:`setup` function in it.
pt_br: O próprio arquivo de configuração pode ser uma extensão; para isso é necessário usar a função :func:`setup` no arquivo.

source: The file extensions of source files. Sphinx considers the files with this suffix as sources. The value can be a dictionary mapping file extensions to file types. For example::
pt_br: A extensão de arquivos fonte. Sphinx considera os arquivos com estes sufixos como fonte. O valor pode ser um dicionário mapeando extensões de arquivos para tipos de arquivos. Por exemplo::

source: By default, Sphinx only supports ``'restructuredtext'`` file type. You can add a new file type using source parser extensions. Please read a document of the extension to know which file type the extension supports.
pt_br: Por padrão, Sphinx somente tem suporte a tipos de arquivo ``'restructuredtext'``. Pode adicionar um novo tipo de fonte nas extensões permitidas. Leia a documentação da extensão para conhecer o tipo de arquivo que a extensão tem suporte.

source: The value may also be a list of file extensions: then Sphinx will consider that they all map to the ``'restructuredtext'`` file type.
pt_br: O valor também pode ser uma lista de extensões de arquivo: então o Sphinx irá considerar que todos eles mapeiam para o tipo de arquivo ``'restructuredtext'``.

source: Default is ``{'.rst': 'restructuredtext'}``.
pt_br: O padrão é ``{'.rst': 'restructuredtext'}``.

source: file extensions have to start with a dot (e.g. ``.rst``).
pt_br: extensões de arquivo devem começar com um ponto (por exemplo, ``.rst``).

source: Can now be a list of extensions.
pt_br: Pode agora ser uma lista de extensões.

source: Support file type mapping
pt_br: Suporte a tipo de arquivo

source: The encoding of all reST source files. The recommended encoding, and the default value, is ``'utf-8-sig'``.
pt_br: A codificação de todos arquivos fonte reST. O código recomendado e valor padrão é ``'utf-8-sig'``.

source: Previously, Sphinx accepted only UTF-8 encoded sources.
pt_br: Anteriormente, Sphinx aceitava somente fontes UTF-8.

source: If given, a dictionary of parser classes for different source suffices. The keys are the suffix, the values can be either a class or a string giving a fully-qualified name of a parser class. The parser class can be either ``docutils.parsers.Parser`` or :class:`sphinx.parsers.Parser`. Files with a suffix that is not in the dictionary will be parsed with the default reStructuredText parser.
pt_br: Se informado o dicionário de classes passadas para diferentes sufixos de fontes. As chaves são sufixos, os valores podem ser uma classe ou uma string informando o nome completamente qualificado da classe informada. A classe passada pode ser ``docutils.parsers.Parser`` ou :class:`sphinx.parsers.Parser`. Arquivos com sufixos que não estão no dicionário serão tratados como reStructuredText padrão.

source: For example::
pt_br: Por exemplo::

source: Refer to :doc:`/usage/markdown` for more information on using Markdown with Sphinx.
pt_br: Consulte :doc:`/usage/markdown` para mais informações sobre o uso do Markdown com o Sphinx.

source: Now Sphinx provides an API :meth:`.Sphinx.add_source_parser` to register a source parser. Please use it instead.
pt_br: Agora o Sphinx fornece um método API :meth:`.Sphinx.add_source_parser` para registrar analisador de fonte. Use esse método.

source: Same as :confval:`root_doc`.
pt_br: O mesmo que :confval:`root_doc`.

source: Renamed ``master_doc`` to ``root_doc``.
pt_br: Renomeado ``master_doc`` para ``root_doc``.

source: The document name of the "root" document, that is, the document that contains the root :rst:dir:`toctree` directive. Default is ``'index'``.
pt_br: O nome de documento do documento "root", isto é, o documento que contém a diretiva raiz :rst:dir:`toctree`. O padrão é ``'index'``.

source: The default is changed to ``'index'`` from ``'contents'``.
pt_br: O padrão foi alterado para ``'index'`` de ``'contents'``.

source: Renamed ``root_doc`` from ``master_doc``.
pt_br: Renomeado ``root_doc`` de ``master_doc``.

source: Example patterns:
pt_br: Padrões de exemplo:

source: ``'library/xml'`` -- ignores the ``library/xml`` directory
pt_br: ``'library/xml'`` -- ignora o diretório de ``library/xml``

source: ``'library/xml*'`` -- ignores all files and directories starting with ``library/xml``
pt_br: ``'library/xml*'`` -- ignora todos os arquivos e diretórios iniciando com ``library/xml``

source: ``'**/.svn'`` -- ignores all ``.svn`` directories
pt_br: ``'**/.svn'`` -- ignora todos diretórios ``.svn``

source: :confval:`exclude_patterns` is also consulted when looking for static files in :confval:`html_static_path` and :confval:`html_extra_path`.
pt_br: :confval:`exclude_patterns` também é consultado quando buscando por arquivos estáticos no :confval:`html_static_path` e :confval:`html_extra_path`.

source: A list of paths that contain extra templates (or templates that overwrite builtin/theme-specific templates). Relative paths are taken as relative to the configuration directory.
pt_br: A lista de caminhos que contêm modelos extras (ou modelos que sobrepõe temas internos ou específicos do tema). Caminhos relativos são tratados como relativos ao diretório da configuração.

source: As these files are not meant to be built, they are automatically added to :confval:`exclude_patterns`.
pt_br: Como esses arquivos não devem ser construídos, são automaticamente adicionados em :confval:`exclude_patterns`.

source: A string with the fully-qualified name of a callable (or simply a class) that returns an instance of :class:`~sphinx.application.TemplateBridge`. This instance is then used to render HTML documents, and possibly the output of other builders (currently the changes builder). (Note that the template bridge must be made theme-aware if HTML themes are to be used.)
pt_br: String com nome totalmente qualificado de chamável (ou simplesmente uma classe) que retorna uma instância de :class:`~sphinx.application.TemplateBridge`. Essa instância é então usada para renderizar a criação de documentos HTML ou de outros construtores (construtor corrente). (Note que a ligação do modelo do tema deve comportar HTML se temas são usados.)

source: A string of reStructuredText that will be included at the end of every source file that is read. This is a possible place to add substitutions that should be available in every file (another being :confval:`rst_prolog`). An example::
pt_br: Uma string de reStructuredText que pode ser incluída ao final de todo fonte que for lido. Isso é possível adicionar uma substituição que estará disponível em todo arquivo (outro como :confval:`rst_prolog`). Exemplo::

source: A string of reStructuredText that will be included at the beginning of every source file that is read. This is a possible place to add substitutions that should be available in every file (another being :confval:`rst_epilog`). An example::
pt_br: Uma string de reStructuredText que será incluída no início de cada arquivo fonte que é lido. Este é um local possível para adicionar substituições que devem estar disponíveis em todos os arquivos (outro sendo :confval:`rst_epilog`). Um exemplo::

source: The name of a reST role (builtin or Sphinx extension) to use as the default role, that is, for text marked up ```like this```. This can be set to ``'py:obj'`` to make ```filter``` a cross-reference to the Python function "filter". The default is ``None``, which doesn't reassign the default role.
pt_br: O nome de uma regra reST (nativa ou extensão Sphinx) para usar role padrão, isso é, o texto marcado ```como esse```. Pode ser configurado para ``'py:obj'`` para referência cruzada do ```filtro```. O padrão é ``None`` que não reassinala a role padrão.

source: If true, keep warnings as "system message" paragraphs in the built documents. Regardless of this setting, warnings are always written to the standard error stream when ``sphinx-build`` is run.
pt_br: Se true, mantém avisos como parágrafos de "mensagens de sistema" nos documentos construídos. A menos que isso seja definido, avisos são sempre exibidos na saída padrão quando ``sphinx-build`` for executado.

source: The default is ``False``, the pre-0.5 behavior was to always keep them.
pt_br: O padrão é ``False``, o comportamento pré-0.5 foi sempre mantê-los.

source: A list of warning types to suppress arbitrary warning messages.
pt_br: Uma lista arbitrária, dos tipos de mensagens de aviso que devem ser suprimidas.

source: You can choose from these types. You can also give only the first component to exclude all warnings attached to it.
pt_br: Você pode escolher entre esses tipos. Você também pode fornecer apenas o primeiro componente para excluir todos os avisos anexados a ele.

source: Added ``misc.highlighting_failure``
pt_br: Adic. ``misc.highlighting_failure``

source: Added ``epub.unknown_project_files``
pt_br: Adic. ``epub.unknown_project_files``

source: Added ``ref.footnote``
pt_br: Adic. ``ref.footnote``

source: Added ``epub.duplicated_toc_entry``
pt_br: Adicionada ``epub.duplicated_toc_entry``

source: Added ``toc.excluded`` and ``toc.not_readable``
pt_br: Adicionado ``toc.excluded`` e ``toc.not_readable``

source: Added ``i18n.inconsistent_references``
pt_br: Adicionado ``i18n.inconsistent_references``

source: If set to a ``major.minor`` version string like ``'1.1'``, Sphinx will compare it with its version and refuse to build if it is too old. Default is no requirement.
pt_br: Se configurado como uma string de versão ``major.minor`` como ``'1.1'``, Sphinx irá comparar isso com a sua versão e recusará construir se sua versão for muito antiga. O padrão é nenhum requerimento.

source: also accepts micro version string
pt_br: também aceita string micro versão

source: This value can be a dictionary specifying version requirements for extensions in :confval:`extensions`, e.g. ``needs_extensions = {'sphinxcontrib.something': '1.5'}``. The version strings should be in the form ``major.minor``. Requirements do not have to be specified for all extensions, only for those you want to check.
pt_br: O valor pode ser dicionário especificando os requerimentos das extensões :confval:`extensions`; ex: ``needs_extensions = {'sphinxcontrib.something': '1.5'}``. A string da versão deve ser no formato ``major.minor``. Requerimentos não precisam ser expecificado para todas extensões, apenas para as que devem ser verificadas.

source: This requires that the extension specifies its version to Sphinx (see :ref:`dev-extensions` for how to do that).
pt_br: Isso requer extensões que especificam sua versão para o Sphinx (ver :ref:`dev-extensions` para como usar isso).

source: A URL to cross-reference :rst:role:`manpage` roles. If this is defined to ``https://manpages.debian.org/{path}``, the :literal:`:manpage:`man(1)`` role will link to <https://manpages.debian.org/man(1)>. The patterns available are:
pt_br: Um URL para fazer referência cruzada aos papéis :rst:role:`manpage`. Se estiver definido para ``https://manpages.debian.org/{path}``, o papel :literal:`:manpage:`man(1)`` será vinculado a <https://manpages.debian.org/man(1)>. Os padrões disponíveis são:

source: ``page`` - the manual page (``man``)
pt_br: ``page`` - página manual (``man``)

source: ``section`` - the manual section (``1``)
pt_br: ``section`` - a seção do manual (``1``)

source: ``path`` - the original manual page and section specified (``man(1)``)
pt_br: ``path`` - a página original e a seção especificada do manual (``man(1)``)

source: This also supports manpages specified as ``man.1``.
pt_br: Também suporta páginas especificadas como ``man.1``.

source: This currently affects only HTML writers but could be expanded in the future.
pt_br: Atualmente afeta somente geração HTML mas pode ser expandido no futuro.

source: If true, Sphinx will warn about *all* references where the target cannot be found. Default is ``False``. You can activate this mode temporarily using the :option:`-n <sphinx-build -n>` command-line switch.
pt_br: Se true (verdadeiro), Sphinx irá avisar sobre *todas* referências onde o alvo não foi encontrado. Padrão é ``False``. Pode ser ativado temporáriamente usando na linha de comando com :option:`-n <sphinx-build -n>`.

source: An extended version of :confval:`nitpick_ignore`, which instead interprets the ``type`` and ``target`` strings as regular expressions. Note, that the regular expression must match the whole string (as if the ``^`` and ``$`` markers were inserted).
pt_br: Uma versão estendida do :confval:`nitpick_ignore`, que interpreta as strings ``type`` e ``target`` como expressões regulares. Note que a expressão regular deve corresponder a toda a string (como se os marcadores ``^`` e ``$`` tivessem sido inseridos.)

source: For example, ``(r'py:.*', r'foo.*bar\.B.*')`` will ignore nitpicky warnings for all python entities that start with ``'foo'`` and have ``'bar.B'`` in them, such as ``('py:const', 'foo_package.bar.BAZ_VALUE')`` or ``('py:class', 'food.bar.Barman')``.
pt_br: Por exemplo, ``(r'py:.*', r'foo.*bar\.B.*')`` irá ignorar avisos chatos para todas as entidades python que comecem com``'foo'`` e tenham ``'bar.B'`` neles, tal como ``('py:const', 'foo_package.bar.BAZ_VALUE')`` ou ``('py:class', 'food.bar.Barman')``.

source: If true, figures, tables and code-blocks are automatically numbered if they have a caption. The :rst:role:`numref` role is enabled. Obeyed so far only by HTML and LaTeX builders. Default is ``False``.
pt_br: Se verdadeiro, figuras, tabelas e bloco de códigos são automaticamente numerados, caso tenham legenda. Se a regra :rst:role:`numref` estivar habilitada. Abrange atualmente HTML e LaTeX. Padrão ``False``.

source: The LaTeX builder always assigns numbers whether this option is enabled or not.
pt_br: O construtor LaTeX sempre assinala números onde essa opção é habilitada ou não

source: A dictionary mapping ``'figure'``, ``'table'``, ``'code-block'`` and ``'section'`` to strings that are used for format of figure numbers. As a special character, ``%s`` will be replaced to figure number.
pt_br: Um dicionário mapeando ``'figure'``, ``'table'``, ``'code-block'`` e ``'section'`` para strings que são usadas para o formato de números de figura. Como um caractere especial, ``%s`` será substituído com o número da figura.

source: Default is to use ``'Fig. %s'`` for ``'figure'``, ``'Table %s'`` for ``'table'``, ``'Listing %s'`` for ``'code-block'`` and ``'Section %s'`` for ``'section'``.
pt_br: O padrão é usar ``'Fig. %s'`` para ``'figure'``, ``'Table %s'`` para ``'table'``, ``'Listing %s'`` para ``'code-block'`` e ``'Section %s'`` para ``'section'``.

source: if set to ``0``, figures, tables and code-blocks are continuously numbered starting at ``1``.
pt_br: se configurado para ``0``, figuras, tabelas e bloco de código são continuamente numerados iniciando em ``1``.

source: if ``1`` (default) numbers will be ``x.1``, ``x.2``, ... with ``x`` the section number (top level sectioning; no ``x.`` if no section). This naturally applies only if section numbering has been activated via the ``:numbered:`` option of the :rst:dir:`toctree` directive.
pt_br: se ``1`` (padrão) números serão ``x.1``, ``x.2``, ... com ``x`` o número da seção (nível superior de seção); em ``x.`` se não houver secão). Isso naturalmente se aplica, somente se numeração foi ativada através da opção ``:numbered:`` da diretiva :rst:dir:`toctree` .

source: ``2`` means that numbers will be ``x.y.1``, ``x.y.2``, ... if located in a sub-section (but still ``x.1``, ``x.2``, ... if located directly under a section and ``1``, ``2``, ... if not in any top level section.)
pt_br: ``2`` significa que números serão ``x.y.1``, ``x.y.2``, ... se existirem em uma sub-seção (mas aparedcem ``x.1``, ``x.2``, ... se existirem sob uma seção e ``1``, ``2``, ... se não existirem em nenhuma seção nível superior.)

source: The LaTeX builder obeys this setting (if :confval:`numfig` is set to ``True``).
pt_br: O construtor LaTeX obedece essa configuração (se :confval:`numfig` é ``True``).

source: If true, the `Docutils Smart Quotes transform`__, originally based on `SmartyPants`__ (limited to English) and currently applying to many languages, will be used to convert quotes and dashes to typographically correct entities. Default: ``True``.
pt_br: Se verdadeiro, a `Docutils Smart Quotes transform`__, originalmente baseada em `SmartyPants`__ (limitada ao Inglês) e atualmente aplica-se para diversos idiomas, será usada para converter aspas e traços para entidades tipograficamente corretas. Padrão: ``True``.
