Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/quickstart.po
Languages: fr, pt_br, zh_cn

source: Getting Started
fr: Démarrer avec Sphinx
pt_br: Iniciando
zh_cn: 入门

source: Sphinx is a *documentation generator* or a tool that translates a set of plain text source files into various output formats, automatically producing cross-references, indices, etc. That is, if you have a directory containing a bunch of :doc:`/usage/restructuredtext/index` or :doc:`/usage/markdown` documents, Sphinx can generate a series of HTML files, a PDF file (via LaTeX), man pages and much more.
fr: Sphinx est un *générateur de documentation* entendu comme un outil transformant un ensemble de fichiers texte source en différents formats de sortie , en produisant automatiquement les références croisées, index, etc. Ainsi, si vous disposez d'un répertoire contenant un groupe de documents :doc:`/usage/restructuredtext/index` ou :doc:`/usage/markdown`, Sphinx peut générer une série de fichiers HTML, un fichier PDF (via LaTeX), des pages de manuel et plus encore.
pt_br: Sphinx é um *gerador de documentação* ou uma ferramenta que traduz um conjunto de arquivos fonte de texto simples em vários formatos de saída, produzindo automaticamente referências cruzadas, índices, etc. Ou seja, se você tiver um diretório contendo um monte de :doc:`/usage/reestruturedtext/index` ou :doc:`/usage/markdown`, o Sphinx pode gerar uma série de arquivos HTML, um arquivo PDF (via LaTeX), páginas de manual e muito mais.
zh_cn: Sphinx 是一个 *文档生成器* ，您也可以把它看成一种工具，它可以将一组纯文本源文件转换成各种输出格式，并且自动生成交叉引用、索引等。也就是说，如果您的目录包含一堆 :doc:`/usage/restructuredtext/index` 或 :doc:`/usage/markdown` 文档，那么 Sphinx 就能生成一系列HTML文件，PDF文件（通过LaTeX），手册页等。

source: Sphinx focuses on documentation, in particular handwritten documentation, however, Sphinx can also be used to generate blogs, homepages and even books. Much of Sphinx's power comes from the richness of its default plain-text markup format, :doc:`reStructuredText </usage/restructuredtext/index>`, along with its :doc:`significant extensibility capabilities </development/index>`.
fr: Sphinx se focalise sur la documentation, en particulier la documentation manuscrite, cependant, Sphinx peut aussi être utilisé pour générer des blogs, des sites Internet et même des livres. Une grande partie de la puissance de Sphinx lui vient de la richesse de son format de balisage en texte brut par défaut :doc:`reStructuredText </usage/restructuredtext/index>`, accompagné de ses :doc:`capacités d'extension significatives </development/index>`.
zh_cn: Sphinx 专注于文档，尤其是 handwritten documentation ，然而，Sphinx 也可以用来生成博客、主页甚至书籍。Sphinx 的大部分功能来自于 :doc:`reStructuredText </usage/restructuredtext/index>` ，它是一种纯文本标记格式，有着丰富的功能和 :doc:`显著的扩展能力 </development/index>` 。

source: The goal of this document is to give you a quick taste of what Sphinx is and how you might use it. When you're done here, you can check out the :doc:`installation guide </usage/installation>` followed by the intro to the default markup format used by Sphinx, :doc:`reStucturedText </usage/restructuredtext/index>`.
pt_br: O objetivo deste documento é dar a você uma ideia rápida do que é o Sphinx e como você pode usá-lo. Quando terminar aqui, você pode verificar o :doc:`guia de instalação </usage/installation>` seguido pela introdução do formato de marcação padrão usado pelo Sphinx, :doc:`reStucturedText </usage/restructuredtext/index>`.
zh_cn: 本文档的目的是让您快速了解什么是 sphinx 以及如何使用 sphinx。完成后，您可以查看 :doc:`安装指南 </usage/installation>` ，后面是关于 Sphinx 使用的默认标记格式的介绍 :doc:`reStucturedText </usage/restructuredtext/index>` 。

source: For a great "introduction" to writing docs in general -- the whys and hows, see also `Write the docs`__, written by Eric Holscher.
fr: Pour une excellente "introduction" à l'écriture de documentation en général -- les pourquoi et comment, voir également `Write the docs`__, écrit par Eric Holscher.
pt_br: Para obter uma excelente "introdução" à escrita de documentos em geral -- os porquês e comos, consulte também `Write the docs`__, escrito por Eric Holscher.
zh_cn: 如果你想了解如何撰写文档，请参考 Eric Holscher 写的 `撰写文档`__ 。

source: Setting up the documentation sources
fr: Configurer les sources
pt_br: Configurando fontes de documentação
zh_cn: 初始化文档源目录

source: The root directory of a Sphinx collection of plain-text document sources is called the :term:`source directory`. This directory also contains the Sphinx configuration file :file:`conf.py`, where you can configure all aspects of how Sphinx reads your sources and builds your documentation. [#]_
fr: Le répertoire racine d’une collection Sphinx de sources de documents en texte brut est appelé :term:`répertoire source`. Ce répertoire contient également le fichier de configuration :file:`conf.py` de Sphinx, dans lequel vous pouvez paramétrer tous les aspects de la façon dont Sphinx lit vos sources et construit votre documentation. [#]_
pt_br: O diretório raiz de uma coleção Sphinx de fontes de documentos de texto simples é chamado de :term:`diretório fonte`. Este diretório também contém o arquivo de configuração :file:`conf.py` do Sphinx, onde você pode configurar todos os aspectos de como o Sphinx lê suas fontes e constrói sua documentação. [#]_
zh_cn: Sphinx 文档有一个根目录，里面存放着很多纯文本格式的源文件，这个根目录称为 :term:`源目录` 。该目录还包含 Sphinx 配置文件 :file:`conf.py` ，您可以在其中指定 Sphinx 如何读取源代码和生成文档。[#]_

source: Sphinx comes with a script called :program:`sphinx-quickstart` that sets up a source directory and creates a default :file:`conf.py` with the most useful configuration values from a few questions it asks you. To use this, run:
fr: Sphinx fournit un script appelé :program:`sphinx-quickstart` créant un répertoire source et un fichier :file:`conf.py` par défaut avec les paramètres essentiels configurés à partir de quelques questions qu'il vous pose. Pour l'utiliser, exécutez :
pt_br: O ``Sphinx`` vem com um script chamado :program:`sphinx-quickstart` que configura um diretório de origem e cria um :file:`conf.py` padrão com os valores de configuração mais úteis de algumas perguntas que ele faz. Para usar isso, execute:
zh_cn: Sphinx 附带一个名为 :program:`sphinx-quickstart` 的脚本，这个脚本会设置一个源目录并创建一个默认的 :file:`conf.py` 配置文件，在创建时，它还会问你一些问题，并从中得到配置值填入配置文件中。要使用此脚本，请运行：

source: Defining document structure
fr: Définir la structure
pt_br: Definindo estrutura do documento
zh_cn: 定义文档结构

source: Let's assume you've run :program:`sphinx-quickstart`. It created a source directory with :file:`conf.py` and a master document, :file:`index.rst`. The main function of the :term:`master document` is to serve as a welcome page, and to contain the root of the "table of contents tree" (or *toctree*). This is one of the main things that Sphinx adds to reStructuredText, a way to connect multiple files to a single hierarchy of documents.
pt_br: Vamos assumir que foi executado :program:`sphinx-quickstart`. Isso criou um diretório fonte com :file:`conf.py` e um documento mestre :file:`index.rst`. A função principal do :term:`documento mestre` é servir de página de boas-vindas, bem como conter a documentação raiz da estrutura "sumário" ou (*toctree*). Isso é um dos princípios que Sphinx usa para adicionar reStructuredText para conectar múltiplos arquivos em uma hierarquia simples de documentos.
zh_cn: 让我们假设你运行 :program:`sphinx-quickstart` 。它创建了一个带有配置文件 :file:`conf.py` 和一个主文件 :file:`index.rst` 的源目录。 :term:`主文件` 的主要功能是作为欢迎页面，并包含”目录树”（或*toctree*）的根。这种将多个文件连接到单个文档层次结构的方法，是 Sphinx 为 reStructuredText 添加的主要功能之一。

source: reStructuredText directives
fr: Directives reStructuredText
pt_br: Diretivas reStructuredText
zh_cn: reStructuredText 指令

source: ``toctree`` is a reStructuredText :dfn:`directive`, a very versatile piece of markup. Directives can have arguments, options and content.
fr: ``toctree`` est une :dfn:`directive` reStructuredText, un type de balise très polyvalent. Les directives peuvent recevoir des arguments, avoir des options et un contenu.
pt_br: ``toctree`` é uma diretiva reStructuredText :dfn:`directive`, peça muito versátil de marcação. Diretivas podem conter argumentos, opções e conteúdos.
zh_cn: “toctree” 是一个 reStructuredText :dfn:`指令` ，即具有特殊功能的标记。指令可以有参数、选项和内容。

source: *Arguments* are given directly after the double colon following the directive's name. Each directive decides whether it can have arguments, and how many.
fr: Les *arguments* sont passés directement après les doubles deux points suivant le nom de la directive. Chaque directive définit si elle peut recevoir des arguments, et combien.
pt_br: *Argumentos* são fornecidos diretamente após duplo dois pontos seguidos do nome da diretiva. Cada diretiva decide se existem e quantos são os argumentos.
zh_cn: *参数* 可以直接跟在指令的的两个英文冒号后面。不同指令有不同数量的参数，亦或没有。

source: *Options* are given after the arguments, in form of a "field list". The ``maxdepth`` is such an option for the ``toctree`` directive.
fr: Les *options* sont définies après les arguments, sous la forme d'une "liste de champs". ``maxdepth`` est un exemple d'une telle option pour la directive ``toctree``.
pt_br: *Opções* são fornecidas após os argumentos, na forma de "lista de campos". Como em ``maxdepth`` que é uma opção da diretiva ``toctree``.
zh_cn: *选项* 以“字段列表”的形式跟在参数后面。“maxdepth”（意为“（目录层级的）最大深度”）就是 “toctree”指令的一个选项。

source: *Content* follows the options or arguments after a blank line. Each directive decides whether to allow content, and what to do with it.
fr: Le *contenu* suit les options ou les arguments, séparé d'une ligne blanche. Chaque directive définit si elle accepte du contenu, et qu'en faire.
pt_br: *Conteúdo* segue opções ou argumentos após uma linha em branco. Cada diretiva decide como permite conteúdo e como tratá-lo.
zh_cn: *内容* 跟在选项或参数后面，它和选项/参数之间要空一行。每个指令决定是否允许内容，以及如何处理内容。

source: A common gotcha with directives is that **the first line of the content must be indented to the same level as the options are**.
fr: Un piège courant avec les directives est que **la première ligne du contenu doit être indentée au même niveau que le sont les options**.
pt_br: Um pegadinha comum com diretivas é que **a primeira linha do conteúdo precisa estar alinhada (com espaços) ao mesmo nível das opções**.
zh_cn: 指令的一个常见问题是 **内容的第一行必须缩进到与选项相同的级别** 。

source: The ``toctree`` directive initially is empty, and looks like so:
fr: La directive ``toctree`` est initialement vide et se présente comme ceci :
pt_br: A diretiva ``toctree`` inicialmente está vazia e se parece com isso:
zh_cn: “toctree”指令最初是空的，看起来像这样：

source: You add documents listing them in the *content* of the directive:
fr: Les documents y sont ajoutés en les listant dans le *contenu* de la directive :
pt_br: Você adiciona documentos listando-os no *content* da diretiva:
zh_cn: 您可以在指令的*内容*处列出要添加的文档：

source: This is exactly how the ``toctree`` for this documentation looks. The documents to include are given as :term:`document name`\ s, which in short means that you leave off the file name extension and use forward slashes (``/``) as directory separators.
fr: Voici exactement comment se présente la ``toctree`` de la présente documentation. Les documents à inclure sont listés par leurs :term:`nom de document`, c'est à dire sans l'extension du nom de fichier et en utilisant des slash ("/") comme séparateurs de répertoires.
pt_br: É exatamente assim que a ``toctree`` desta documentação parece. Os documentos a incluir são fornecidos como :term:`document name`\s, o que, em suma, significa que você deixa a extensão do nome do arquivo e usa barras (``/``) como separadores de diretório.
zh_cn: 这正是本文档的“toctree”的外观。要包含的文件以 :term:`文件名` 的形式给出，简单来说就是你不使用文件扩展名并使用正斜杠(/)作为目录分隔符。

source: |more| Read more about :ref:`the toctree directive <toctree-directive>`.
pt_br: |more| Ler mais sobre :ref:`diretiva toctree <toctree-directive>`.
zh_cn: |more| 阅读更多关于 :ref:`toctree 指令 <toctree-directive>` 的内容。

source: more info
pt_br: mais informações
zh_cn: 更多信息

source: You can now create the files you listed in the ``toctree`` and add content, and their section titles will be inserted (up to the ``maxdepth`` level) at the place where the ``toctree`` directive is placed. Also, Sphinx now knows about the order and hierarchy of your documents. (They may contain ``toctree`` directives themselves, which means you can create deeply nested hierarchies if necessary.)
fr: Vous pouvez maintenant créer les fichiers listés dans la ``toctree`` et y ajouter du contenu, les titres de leurs sections seront insérés (jusqu'au niveau ``maxdepth``) à l'endroit où la directive ``toctree`` est placée. En outre, Sphinx connait dès lors l'ordre et la hiérarchie de vos documents. (Ceux-ci peuvent eux-mêmes contenir des directives ``toctree``, ce qui signifie que vous pouvez si nécessaire créer des hiérarchies profondément imbriquées.)
pt_br: Agora você pode criar os arquivos que você listou no ``toctree`` e adicionar conteúdo, e seus títulos de seção serão inseridos (até o nível ``maxdepth``) no local onde a diretiva ``toctree`` é colocada. Além disso, o ``Sphinx`` agora sabe sobre a ordem e a hierarquia dos seus documentos. (Eles podem conter as diretivas ``toctree``, o que significa que você pode criar hierarquias profundamente aninhadas, se necessário.)
zh_cn: 现在你可以创建刚刚列在 ``toctree`` 里的文件，并添加内容了，它们的标题会（按照 ``maxdepth`` 设置的深度）自动插入到文档中的 ``toctree`` 指令的位置。而且 Sphinx 也知道你文档的顺序和层级结构。（文档自身也可以包含 ``toctree`` 指令，这样在需要的时候，就可以创建更深的嵌套层级了）

source: Adding content
fr: Ajouter du contenu
pt_br: Adicionando conteúdo
zh_cn: 添加内容

source: In Sphinx source files, you can use most features of standard :term:`reStructuredText`. There are also several features added by Sphinx. For example, you can add cross-file references in a portable way (which works for all output types) using the :rst:role:`ref` role.
fr: La plupart des fonctionnalités standard de :term:`reStructuredText` peuvent être utilisées dans les fichiers source Sphinx. D'autres sont également ajoutées par Sphinx. Par exemple, des références croisées peuvent être créées de façon portable (fonctionnant quelque soit le type de sortie) en utilisant le rôle :rst:role:`ref`.
pt_br: Nos arquivos de origem do ``Sphinx``, você pode usar a maioria dos recursos do padrão :term:`reStructuredText`. Há também vários recursos adicionados pelo ``Sphinx``. Por exemplo, você pode adicionar referências de arquivo cruzado de maneira portátil (que funciona para todos os tipos de saída) usando a função :rst:role:`ref`.
zh_cn: 在 Sphinx 源文件中，您可以使用标准 :term:`reStructuredText` 的大部分功能。不过也有一些功能是 Sphinx 独有的。比如，你可以使用 :rst:role:`ref` 角色来方便地添加跨文件的引用（对于所有输出格式都可用）。

source: For an example, if you are viewing the HTML version, you can look at the source for this document -- use the "Show Source" link in the sidebar.
fr: Pour un exemple, si vous lisez la version HTML de ce document, vous pouvez regarder la source de celui-ci -- utilisez le lien "Affichez la source" dans la barre latérale.
pt_br: Por exemplo, se você estiver visualizando a versão HTML, poderá olhar o código-fonte deste documento -- use o link "Exibir Fonte" na barra lateral.
zh_cn: 例如，如果您正在查看HTML版本，则可以查看此文档的源代码——使用侧栏中的“显示源代码”链接。

source: Todo
fr: À faire
pt_br: Por fazer
zh_cn: 待处理

source: Update the below link when we add new guides on these.
fr: Mettre à jour le lien ci-dessous lorsque de nouveaux guides seront ajoutés sur ceux-ci.
pt_br: Atualize o link abaixo quando adicionarmos novos guias sobre eles.
zh_cn: 在我们添加新指南时更新以下链接。

source: |more| See :doc:`/usage/restructuredtext/index` for a more in-depth introduction to reStructuredText, including markup added by Sphinx.
pt_br: |more| Veja :doc:`/usage/restructuredtext/index` para uma introdução mais aprofundada ao reStructuredText, incluindo marcação adicionada pelo ``Sphinx``.
zh_cn: |more| 有关 reStructuredText 的更深入介绍，请参阅 :doc:`/usage/restructuredtext/index` ，这里面包括 Sphinx 添加的标记。

source: Running the build
fr: Générer la documentation
pt_br: Executando a montagem
zh_cn: 运行生成程序

source: Now that you have added some files and content, let's make a first build of the docs. A build is started with the :program:`sphinx-build` program:
fr: Maintenant que vous avez ajouté des fichiers et du contenu, générons une première version de la documentation. La génération est lancée en utilisant le programme :program:`sphinx-build` :
pt_br: Agora que você adicionou alguns arquivos e conteúdo, vamos fazer uma primeira compilação dos documentos. Uma compilação é iniciada com o programa :program:`sphinx-build`:
zh_cn: 现在您已经添加了一些文件和内容，现在让我们构建文档吧。使用 :program:`sphinx-build` 程序启动构建：

source: where *sourcedir* is the :term:`source directory`, and *builddir* is the directory in which you want to place the built documentation. The :option:`-b <sphinx-build -b>` option selects a builder; in this example Sphinx will build HTML files.
pt_br: onde *diretório-fonte* é o :term:`source directory` e *diretório-montagem* é o diretório no qual será criada a documentação gerada. a opção :option:`-b <geração-sphinx -b>` seleciona o construtor, nesse exemplo serão gerados arquivos HTML.
zh_cn: 其中 *sourcedir* 是 :term:`源目录` ， *builddir* 是用来放置生成的文档的目录。选项 :option:`-b <sphinx-build -b>` 可以选择一个生成器，这个例子中我们生成 HTML 文件。

source: |more| Refer to the :doc:`sphinx-build man page </man/sphinx-build>` for all options that :program:`sphinx-build` supports.
pt_br: |more| Consulte o :doc:`sphinx-build man page </man/sphinx-build>` para todas as opções que o :program:`sphinx-build` suporta.
zh_cn: |more| 请参阅 :doc:`sphinx-build 手册 </man/sphinx-build>` 获取 :program:`sphinx-build` 支持的所有选项。

source: However, :program:`sphinx-quickstart` script creates a :file:`Makefile` and a :file:`make.bat` which make life even easier for you. These can be executed by running :command:`make` with the name of the builder. For example.
fr: Toutefois, le script :program:`sphinx-quickstart` crée des fichiers :file:`Makefile` et :file:`make.bat` vous rendant la vie encore plus facile. Ceux-ci peuvent être lancés en exécutant la commande :command:`make` avec le nom du générateur. Par example :
pt_br: No entanto, o script :program:`sphinx-quickstart` cria um :file:`Makefile` e um :file:`make.bat` que tornam a vida ainda mais fácil para você. Estes podem ser executados executando :command:`make` com o nome do construtor. Por exemplo.
zh_cn: 但是， :program:`sphinx-quickstart` 脚本创建了一个 :file:`Makefile` 和一个 :file:`make.bat` ，它给你提供了更多便利。 它们可以通过 :command:`make` 命令执行，后面带有生成器的名称。例如：

source: This will build HTML docs in the build directory you chose. Execute :command:`make` without an argument to see which targets are available.
fr: Ceci générera la documentation HTML dans le répertoire de destination choisi. Exécutez la commande :command:`make` sans argument pour obtenir la liste des cibles disponibles.
pt_br: Isto irá construir documentos HTML no diretório de compilação que você escolheu. Execute :command:`make` sem um argumento para ver quais alvos estão disponíveis.
zh_cn: 这将在您选择的生成目录中生成 HTML 文档。 执行不带参数的 :command:`make` 命令，以查看可用的生成目标。

source: How do I generate PDF documents?
fr: Comment générer des documents PDF ?
pt_br: Como gerar documentos PDF?
zh_cn: 如何生成 PDF 文档？

source: ``make latexpdf`` runs the :mod:`LaTeX builder <sphinx.builders.latex.LaTeXBuilder>` and readily invokes the pdfTeX toolchain for you.
fr: ``make latexpdf`` exécute le :mod:`générateur LaTeX <sphinx.builders.latex.LaTeXBuilder>` et facilite l'utilisation de la chaîne de compilation pdfTeX
pt_br: ``make latexpdf`` executa o construtor :mod:`LaTeX <sphinx.builders.latex.LaTeXBuilder>` e já chama a cadeia de ferramentas pdfTeX. Para executar.
zh_cn: 执行“make latexpdf”即可调用 :mod:`LaTeX builder <sphinx.builders.latex.LaTeXBuilder>` 并且自动帮你调用 pdfTeX 工具链。

source: Move this whole section into a guide on rST or directives
fr: Déplacer l'ensemble de cette section dans un guide sur rST ou les directives.
pt_br: Mova toda esta seção em um guia sobre reST ou diretivas
zh_cn: 将整个部分移到rST指南或指令中

source: Documenting objects
fr: Documenter des objets
pt_br: Documentando objetos
zh_cn: 给对象写文档

source: One of Sphinx's main objectives is easy documentation of :dfn:`objects` (in a very general sense) in any :dfn:`domain`. A domain is a collection of object types that belong together, complete with markup to create and reference descriptions of these objects.
fr: Un des principaux objectifs de Sphinx est de faciliter la documentation d':dfn:`objects` (au sens très large) dans n'importe quel :dfn:`domaine`. Un domaine est une collection d'objets allant de pair, et un balisage permettant la création et le référencement de ces objets.
pt_br: Um dos principais objetivos do Sphinx é a fácil documentação de :dfn:`objetos` (em senso geral) de qualquer :dfn:`domain`. Um domínio é uma coleção de tipos de objetos comuns entre si, com marcação completa para criar descrição referencial desses objetos.
zh_cn: Sphinx 的一个主要的用途是可以对任何 :dfn:`域` 中的（广义的） :dfn:`对象` 写文档。一个域是指一类相似的对象，它们之间可以相互引用。

source: The most prominent domain is the Python domain. For example, to document Python's built-in function ``enumerate()``, you would add this to one of your source files.
fr: Le domaine majeur est le domaine Python. Par exemple, pour documenter la fonction intégrée ``enumerate()``, vous ajouteriez les lignes ci-dessous à vos fichiers source:
pt_br: O domínio mais proeminente é o domínio Python. Por exemplo, para documentar a função interna do Python ``enumerate()``, você adicionaria isso a um dos seus arquivos de origem.
zh_cn: 最常使用的域就是 Python 域了。例如，要给 Python 的内置函数 ``enumerate()`` 写文档，你可以在你的某个源文件里添加以下内容。

source: This is rendered like this:
fr: Ce qui serait rendu de la façon suivante :
pt_br: Isso é renderizado como:
zh_cn: 它渲染后会显示成这样：

source: The argument of the directive is the :dfn:`signature` of the object you describe, the content is the documentation for it. Multiple signatures can be given, each in its own line.
fr: L'argument de la directive est la :dfn:`signature` de l'objet décrit, le contenu est la documentation de celui-ci. Des signatures multiples peuvent être passées, chacune sur sa propre ligne.
pt_br: O argumento da diretiva é :dfn:`signature` do objeto a ser descrito, o conteúdo de sua documentação. Múltiplas assinaturas podem ser dadas, cada uma em sua própria linha.
zh_cn: 指令的参数就是你要描述的对象的签名 ( :dfn:`signature` ) ，而内容就是针对它的文档。可以给出多个对象签名，分开写就可以，一行写一个。

source: The Python domain also happens to be the default domain, so you don't need to prefix the markup with the domain name.
fr: Le domaine Python se trouvant également être le domaine par défaut, le préfixe du nom du domaine peut être omis :
pt_br: O domínio Python também é o domínio padrão, portanto, você não precisa prefixar a marcação com o nome do domínio.
zh_cn: 恰好 Python 域是默认的域，所以不需要再另外写前缀。

source: does the same job if you keep the default setting for the default domain.
fr: produit le même rendu que précédemment si le paramètre de domaine par défaut reste inchangé.
pt_br: isso faz a mesma coisa para o domínio que for o escolhido como padrão.
zh_cn: 效果就是一样的（如果你没有改动默认域的设置）。

source: There are several more directives for documenting other types of Python objects, for example :rst:dir:`py:class` or :rst:dir:`py:method`. There is also a cross-referencing :dfn:`role` for each of these object types. This markup will create a link to the documentation of ``enumerate()``.
fr: Il existe plusieurs autres directives pour documenter les autres types d'objets Python, par example :rst:dir:`py:class` ou :rst:dir:`py:method`. Il existe également un rôle de référencement croisé pour chacun de ces types d'objet. Ce balisage créera un lien vers la documentation de ``enumerate()```.
pt_br: Existem várias outras diretivas para documentar outros tipos de objetos Python, por exemplo :rst:dir:`py:class` ou :rst:dir:`py:method`. Há também uma referência cruzada :dfn:`role` para cada um desses tipos de objeto. Esta marcação criará um link para a documentação do ``enumerate()``.
zh_cn: 还有一些指令用于给其他类型的 Python 对象写文档，例如 :rst:dir:`py:class` 或 :rst:dir:`py:method` 。对于每种对象类型，都有一个用于交叉引用 :dfn:`角色` 。这个标记将创建一个指向“enumerate()”文档的链接。
