Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/quickstart.po
Languages: fr, pt_br, zh_cn

source: And here is the proof: A link to :func:`enumerate`.
fr: En voici la preuve: un lien vers :func:`enumerate`.
pt_br: E aqui a prova: um link para :func:`enumerate`.
zh_cn: 效果就是这样：一个指向 :func:`enumerate` 的链接。

source: Again, the ``py:`` can be left out if the Python domain is the default one. It doesn't matter which file contains the actual documentation for ``enumerate()``; Sphinx will find it and create a link to it.
fr: À nouveau, le préfixe ``py:`` peut être omis si le domaine Python est resté celui par défaut. Peu importe quel fichier contient effectivement la documentation de ``enumerate()``; Sphinx la trouvera et créera un lien vers celle-ci.
pt_br: Relembrando que, ``py:`` pode ser omitido no domínio Python que é o padrão. Não importa em qual arquivo está a documentação para ``enumerate()``; Sphinx irá encontrar e criar um link para isso.
zh_cn: 再强调一次，如果 Python 域是默认域的话，就可以省略不写 ``py:``。不管 ``enumerate()`` 的文档在哪个文件中，Sphinx 都会自动找到它，并且创建指向它的链接。

source: Each domain will have special rules for how the signatures can look like, and make the formatted output look pretty, or add specific features like links to parameter types, e.g. in the C/C++ domains.
fr: Chaque domaine a ses règles de syntaxe pour les signatures, embellit le formatage des sorties, ou ajoute des fonctionnalités supplémentaires comme des liens vers des types de paramètres, par exemple dans le domaine C/C++.
pt_br: Cada domínio tem regras especiais para como a assinatura deve parecer e torna a saída formatada com um visual agradável, além disso pode adicionar funcionalidades específicas como links para tipos de parâmetros em domínios C/C++.
zh_cn: 每个不同的域都有它对签名的要求，以使得生成的文档好看，也有各自的特定功能，比如 C/C++ 域中可以链接到参数类型。

source: |more| See :doc:`/usage/restructuredtext/domains` for all the available domains and their directives/roles.
pt_br: |more| Veja :doc:`/usage/restructuredtext/domains` para todos os domínios disponíveis e suas diretivas/funções.
zh_cn: |more| 请参阅 :doc:`/usage/restructuredtext/domains` ，了解所有可用域及其指令/角色。

source: Basic configuration
fr: Configuration de base
pt_br: Configuração Básica
zh_cn: 基本配置

source: Earlier we mentioned that the :file:`conf.py` file controls how Sphinx processes your documents. In that file, which is executed as a Python source file, you assign configuration values. For advanced users: since it is executed by Sphinx, you can do non-trivial tasks in it, like extending :data:`sys.path` or importing a module to find out the version you are documenting.
fr: Plus tôt, nous avons mentionné que le fichier :file:`conf.py` contrôlait la façon dont Sphinx traitait vos documents. Dans ce fichier, exécuté comme un fichier source Python, vous affectez des valeurs de configuration. Pour les utilisateurs avancés, puisque le fichier est exécuté par Sphinx, il est possible d'y réaliser des tâches complexes, comme étendre :data:`sys.path` ou importer un module pour en identifier la version documentée.
pt_br: Já foi mencionado que o arquivo :file:`conf.py` controla como o Sphinx processa seus documentos. Nesse arquivo que é interpretado como um arquivo fonte Python, podem ser assinalados valores. Para usuários avançados: uma vez que é executado pelo Sphinx, podem ser feitas tarefas não triviais como ampliar :data:`sys.path` ou importar um módulo para encontrar a versão da documentação.
zh_cn: 之前我们提到，在文件 :file:`conf.py` 中，可以控制 Sphinx 如何处理你的文档。它是一个 Python 源文件，你可以给相应的变量赋值。对于高级用户来说，因为它是可以执行的程序，你可以做一些更高级的任务，比如扩展 :data:`sys.path` 或者导入代码模块并检查源程序的版本。

source: The config values that you probably want to change are already put into the :file:`conf.py` by :program:`sphinx-quickstart` and initially commented out (with standard Python syntax: a ``#`` comments the rest of the line). To change the default value, remove the hash sign and modify the value. To customize a config value that is not automatically added by :program:`sphinx-quickstart`, just add an additional assignment.
fr: Les valeurs de configuration que vous seriez susceptible de vouloir changer sont pré-insérées dans le fichier :file:`conf.py` par :program:`sphinx-quickstart` et initialement mises en commentaire (avec la syntaxe Python standard: un ``#`` mets en commentaire le reste de la ligne). Pour changer une valeur par défaut, supprimez le signe dièze et modifiez la valeur. Pour personnaliser un paramètre de configuration qui n'est pas ajouté automatiquement par :program:`sphinx-quickstart`, ajouté simplement une nouvelle affectation.
pt_br: Os valores do config que provavelmente serão modificados já estão postos no arquivo :file:`conf.py` pelo programa :program:`sphinx-quickstart` e inicialmente marcados como comentário (em Python a sintaxe ``#`` indica comentário para o resto da linha). Para modificar um valor padrão, remove o jogo da velha e modifique o valor desejado. Para configurar um valor do config que não está declarado, apenas adicione uma linha com a opção e assinalamento desejados.
zh_cn: 你想要配置的参数很可能已经包含在由 :program:`sphinx-quickstart` 生成的 :file:`conf.py` 中，并且默认被注释掉了（就是标准的 Python 语法，行首加 ``#`` 就把这一行后面的内容注释掉了）。要改变默认值的话，就把前面的井号键删掉然后再修改默认值。要是想添加自己的配置，就是不由 :program:`sphinx-quickstart` 自动生成的配置的话，只需要自己添加别的赋值语句就行。

source: Keep in mind that the file uses Python syntax for strings, numbers, lists and so on. The file is saved in UTF-8 by default, as indicated by the encoding declaration in the first line.
fr: Gardez en tête que le fichier utilise la syntaxe Python pour les chaines, nombres, listes, etc. Le fichier est enregistré en UTF-8 par défaut, tel qu'indiqué par la déclaration d'encodage à la première ligne.
pt_br: Lembre-se de que o arquivo usa a sintaxe do Python para strings, números, listas e assim por diante. O arquivo é salvo em UTF-8 por padrão, conforme indicado pela declaração de codificação na primeira linha.
zh_cn: 要记得，这个文件要使用 Python 语法写字符串、数字、列表等。此文件默认使用 UTF-8 编码，而且写在文件的第一行了。

source: |more| See :doc:`/usage/configuration` for documentation of all available config values.
pt_br: |more| Veja :doc:`/usage/configuration` para documentação de todos os valores de configuração disponíveis.
zh_cn: |more| 如果想了解所有的配置数据，请参考 :doc:`/usage/configuration`。

source: Move this entire doc to a different section
fr: Déplacer l'ensemble de cette documentation vers une autre section.
pt_br: Mova este documento inteiro para uma seção diferente
zh_cn: 将整个文档移动到其他部分

source: Autodoc
zh_cn: 使用 autodoc 自动生成文档

source: When documenting Python code, it is common to put a lot of documentation in the source files, in documentation strings. Sphinx supports the inclusion of docstrings from your modules with an :dfn:`extension` (an extension is a Python module that provides additional features for Sphinx projects) called *autodoc*.
fr: Pour la documentation de code Python, il est commun de placer beaucoup de celle-ci dans les fichiers source même, dans des chaines de documentation. Sphinx supporte l'inclusion des docstrings dans vos modules grâce à une :dfn:`extension` (une extension est un module Python fournissant des fonctionnalités supplémentaires pour les projets Sphinx) appelée *autodoc*.
pt_br: Ao documentar o código Python, é comum colocar muita documentação nos arquivos de origem, nas strings de documentação. O ``Sphinx`` suporta a inclusão de ``docstrings`` de seus módulos com um :dfn:`extension` (uma extensão é um módulo Python que fornece recursos adicionais para projetos ``Sphinx``) chamado *autodoc*.
zh_cn: 给 Python 代码写文档的一种常见做法是，在 Python 源文件里以文档字符串的形式在代码中插入文档。使用 *autodoc* :dfn:`扩展程序` （扩展程序是给 Sphinx 项目提供更多的功能的 Python 模块），Sphinx 就可以把你模块中的文档字符串插入进来。

source: In order to use *autodoc*, you need to activate it in :file:`conf.py` by putting the string ``'sphinx.ext.autodoc'`` into the list assigned to the :confval:`extensions` config value::
pt_br: Para usar o *autodoc*, você precisa ativá-lo em :file:`conf.py` colocando a string ``'sphinx.ext.autodoc'`` na lista atribuída ao valor da configuração :confval:`extensions`::
zh_cn: 要使用 *autodoc* ，先要在 :file:`conf.py` 文件中启动它。在配置参数 :confval:`extensions` 的列表中，添加一个字符串 ``'sphinx.ext.autodoc'`` 即可::

source: Then, you have a few additional directives at your disposal. For example, to document the function ``io.open()``, reading its signature and docstring from the source file, you'd write this::
pt_br: Então, você tem algumas diretivas adicionais à sua disposição. Por exemplo, para documentar a função ``io.open()``, lendo sua assinatura e docstring do arquivo fonte, você escreveria isto::
zh_cn: 然后，您可以使用其他一些指令。比如，要导入函数 ``io.open()`` 的文档，包括其在源代码文件当中的函数签名、文档字符串等，您要这样写::

source: You can also document whole classes or even modules automatically, using member options for the auto directives, like ::
pt_br: Também podem ser documentadas automaticamente, todas classes ou mesmo módulos, usando opções para diretivas automáticas como::
zh_cn: 你也可以自动导入整个类甚至整个模块的文档，使用 member 选项，如下所示 ::

source: *autodoc* needs to import your modules in order to extract the docstrings. Therefore, you must add the appropriate path to :py:data:`sys.path` in your :file:`conf.py`.
pt_br: *autodoc* precisa importar seus módulos para extrair as ``docstrings``. Portanto, você deve adicionar o path apropriado para :py:data:`sys.path` no seu :file:`conf.py`.
zh_cn: *autodoc* 需要您导入模块后才能提取文档字符串，因此要先到配置文件 :file:`conf.py` 中使用 :py:data:`sys.path` 添加相应的路径。

source: :mod:`~sphinx.ext.autodoc` **imports** the modules to be documented. If any modules have side effects on import, these will be executed by ``autodoc`` when ``sphinx-build`` is run.
pt_br: :mod:`~sphinx.ext.autodoc` **importa** módulos para documentar. Se algum módulo tiver efeitos na importação, serão executados por ``autodoc`` quando ``sphinx-build`` for executado.
zh_cn: :mod:`~sphinx.ext.autodoc` 会 **引入** 所有需要自动生成文档的模块。如果某些模块在导入时有一些额外的操作，在运行 ``sphinx-build`` 时，也会被 ``autodoc`` 执行。

source: If you document scripts (as opposed to library modules), make sure their main routine is protected by a ``if __name__ == '__main__'`` condition.
pt_br: Se os scripts do seu documento, (diferentemente de módulos de biblioteca), certificar-se que suas rotinas main estejam protegidas por um ``if __name__ == '__main__'`` condição.
zh_cn: 如果你要引入脚本（而不是库模块），确保主程序 main 有这个条件保护着： ``if __name__ == '__main__'`` 。

source: |more| See :mod:`sphinx.ext.autodoc` for the complete description of the features of autodoc.
pt_br: |more| Ver :mod:`sphinx.ext.autodoc` para descrição completa das funcionalidades do autodoc.
zh_cn: |more| 关于 autodoc 的完整功能请查阅： :mod:`sphinx.ext.autodoc` 。

source: Move this doc to another section
pt_br: Mover este documento para outra seção
zh_cn: 将此文档移到另一部分

source: Intersphinx
zh_cn: 跨 Sphinx 引用

source: Many Sphinx documents including the `Python documentation`_ are published on the Internet. When you want to make links to such documents from your documentation, you can do it with :mod:`sphinx.ext.intersphinx`.
fr: Beaucoup de documents Sphinx, y compris la `documentation Python`_ sont publiés sur Internet. Lorsque vous souhaitez créer des liens vers de tels documents depuis votre documentation, vous pouvez le faire avec :mod:`sphinx.ext.intersphinx`.
pt_br: Muitos documentos do ``Sphinx``, incluindo o `Python documentation`_, são publicados na Internet. Quando você quiser criar links para esses documentos a partir de sua documentação, você pode fazê-lo com :mod:`sphinx.ext.intersphinx`.
zh_cn: 包括 `Python 文档`_ 在内的许多 Sphinx 文档都在互联网上发布。如果要从文档中链接到此类文档，可以使用 :mod:`sphinx.ext.intersphinx` 。

source: In order to use intersphinx, you need to activate it in :file:`conf.py` by putting the string ``'sphinx.ext.intersphinx'`` into the :confval:`extensions` list and set up the :confval:`intersphinx_mapping` config value.
fr: Afin d'utiliser intersphinx, il vous faut d'abord l'activer dans :file:`conf.py` en ajoutant la chaîne ``'sphinx.ext.intersphinx'`` à la liste :confval:`extensions` et configurer la valeur du paramètre :confval:`intersphinx_mapping`.
pt_br: Para usar intersphinx, será necessário ativar no :file:`conf.py` adicionando a string ``'sphinx.ext.intersphinx'`` na lista :confval:`extensions` e configurar o valor :confval:`intersphinx_mapping`
zh_cn: 要使用 intersphinx，需要在 :file:`conf.py` 文件中配置 :confval:`extensions` 变量，把字符串 ``'sphinx.ext.intersphinx'`` 附加到列表，还要设置参数 :confval:`intersphinx_mapping`。

source: For example, to link to ``io.open()`` in the Python library manual, you need to setup your :confval:`intersphinx_mapping` like::
fr: Par exemple, pour créer un lien vers ``io.open()`` dans le manuel de la bibliothèque Python, vous devez configurer :confval:`intersphinx_mapping` de la façon suivante :
pt_br: Por exemplo, para link para ``io.open()`` no manual para biblioteca Python, é necessário usar :confval:`intersphinx_mapping`::
zh_cn: 比如，要链接到 Python 库官方文档的 ``io.open()`` ，要对 :confval:`intersphinx_mapping` 进行如下配置 ::

source: And now, you can write a cross-reference like ``:py:func:`io.open```. Any cross-reference that has no matching target in the current documentation set, will be looked up in the documentation sets configured in :confval:`intersphinx_mapping` (this needs access to the URL in order to download the list of valid targets). Intersphinx also works for some other :term:`domain`\'s roles including ``:ref:``, however it doesn't work for ``:doc:`` as that is non-domain role.
fr: Dès lors, vous pouvez écrire une référence croisée ``:py:func:`io.open```. Toute référence croisée qui n'a pas de cible correspondante dans le jeu de documentation courant sera recherchée dans les documentations configurées dans :confval:`intersphinx_mapping` (ce qui nécessite un accès à l'URL configurée pour télécharger la liste des cibles valides). Intersphinx fonctionne également avec d'autres rôles de :term:`domaine` y compris ``:ref:``, cependant il ne fonctionne pas pour ``:doc:`` car ce n'est pas un rôle de domaine.
pt_br: E agora, você pode escrever uma referência cruzada como ``:py:func:`io.open```. Qualquer referência cruzada que não tenha um destino correspondente no conjunto de documentações atual será pesquisada nos conjuntos de documentação configurados em :confval:`intersphinx_mapping` (isso requer acesso ao URL para fazer o download da lista de destinos válidos). O ``Intersphinx`` também funciona para outras funções do :term:`domain`, incluindo ``:ref:``, no entanto, ele não funciona para ``:doc:``, já que isso não é uma função de domínio.
zh_cn: 现在你就可以使用像 ``:py:func:`io.open``` 这样的交叉引用了。对于在当前文档中匹配不到的交叉引用，就会到配置的 :confval:`intersphinx_mapping` 跨 Sphinx 文档列表中查找（这需要能够访问到相应的 URL 以便下载可用文档对象的列表）。跨 Sphinx 引用也可以用于其他 :ref:`域` 相关的文本角色，比如 ``:ref:`` ；但不包括 ``:doc:`` 等不支持域的文本角色。

source: |more| See :mod:`sphinx.ext.intersphinx` for the complete description of the features of intersphinx.
pt_br: |more| Ver :mod:`sphinx.ext.intersphinx` para descrição completa das funcionalidades do intersphinx.
zh_cn: |more| 完整的跨 Sphinx 引用的功能介绍，参考 :mod:`sphinx.ext.intersphinx` 。

source: More topics to be covered
fr: Pour aller plus loin
pt_br: Mais tópicos para cobrir
zh_cn: 其他常用功能举例

source: :doc:`Other extensions </usage/extensions/index>`:
fr: :doc:`Autres extensions </usage/extensions/index>`
zh_cn: :doc:`其他扩展程序 </usage/extensions/index>`：

source: Static files
fr: Fichiers statiques
pt_br: Arquivos estáticos
zh_cn: 静态文件

source: :doc:`Selecting a theme </usage/theming>`
fr: :doc:`Choisir un thème </usage/theming>`
zh_cn: :doc:`选择主题 </usage/theming>`

source: :ref:`Templating <templating>`
fr: :ref:`Modèles de sortie <templating>`
pt_br: :ref:`Modelos <templating>`
zh_cn: :ref:`使用模板 <templating>`

source: Using extensions
fr: Utiliser des extensions
pt_br: Usando extensões
zh_cn: 使用扩展

source: :ref:`Writing extensions <dev-extensions>`
fr: :ref:`Écrire des extensions <dev-extensions>`
pt_br: :ref:`Escrevendo extensões <dev-extensions>`
zh_cn: :ref:`编写扩展 <dev-extensions>`

source: Footnotes
fr: Notes de bas de page
pt_br: Notas de Rodapé
zh_cn: 脚注

source: This is the usual layout. However, :file:`conf.py` can also live in another directory, the :term:`configuration directory`. Refer to the :doc:`sphinx-build man page </man/sphinx-build>` for more information.
fr: Ceci est l'agencement habituel. Cependant, :file:`conf.py` peut aussi se trouver dans un autre répertoire, le :term:`répertoire de configuration`. Référez-vous à la :doc:`page de manuel de sphinx-build</man/sphinx-build>` pour plus d'informations.
pt_br: Este é o layout usual. No entanto, :file:`conf.py` também pode viver em outro diretório, o :term:`configuration directory`. Consulte o :doc:`sphinx-build man page </man/sphinx-build>` para obter mais informações.
zh_cn: 这是通常的设置。然而， :file:`conf.py` 也可以在其他的目录中，即 :term:`配置目录` 。更多信息请参考 :doc:`sphinx-build 手册</man/sphinx-build>` 。

source: Sphinx focuses on documentation, in particular handwritten documentation, however, Sphinx can also be used to generate blogs, homepages and even books. Much of Sphinx's power comes from the richness of its default plain-text markup format, :doc:`reStructuredText </usage/restructuredtext/index>`, along with it's :doc:`significant extensibility capabilities </development/index>`.
pt_br: O Sphinx se concentra na documentação, em particular na documentação manuscrita; no entanto, o Sphinx também pode ser usado para gerar blogs, páginas iniciais e até livros. Muito do poder do Sphinx vem da riqueza de seu formato de marcação de texto simples padrão, :doc:`reStructuredText </usage/restructuredtext/index>`, junto com seus :doc:`recursos de extensibilidade significativos </development/index>`.

source: Return an iterator that yields tuples of an index and an item of the *sequence*. (And so on.)
fr: Renvoie un itérateur qui produit des n-uplets avec un indice et un élément de la *séquence*. (Et ainsi de suite.)
pt_br: Retorna um iterator que possue tuples de um índice e um item de *sequência*. (E assim sucessivamente.)

source: Let's assume you've run :program:`sphinx-quickstart`. It created a source directory with :file:`conf.py` and a root document, :file:`index.rst`. The main function of the :term:`root document` is to serve as a welcome page, and to contain the root of the "table of contents tree" (or *toctree*). This is one of the main things that Sphinx adds to reStructuredText, a way to connect multiple files to a single hierarchy of documents.
fr: Présumons que vous avez exécuté :program:`sphinx-quickstart`. Celui-ci a créé un répertoire source contenant le fichier :file:`conf.py` et un document racine :file:`index.rst`. La fonction principale du :term:`root document` est de servir de page de bienvenue, et de contenir la racine de "l'arbre de la table des matières" (ou *toctree*). C'est l'une des principales fonctions que Sphinx ajoute à reStructuredText, une manière de relier plusieurs fichiers dans une hiérarchie unique de documents.
