Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/theming.po
Languages: pt_br

source: HTML Theming
pt_br: Temas HTML

source: Sphinx provides a number of builders for HTML and HTML-based formats.
pt_br: O Sphinx fornece vários construtores em HTML e formatos baseados em HTML.

source: Builders
pt_br: Construtores

source: Todo
pt_br: Por fazer

source: Populate when the 'builders' document is split up.
pt_br: Preencher quando o documento 'builders' for dividido.

source: Themes
pt_br: Temas

source: This section provides information about using pre-existing HTML themes. If you wish to create your own theme, refer to :ref:`extension-html-theme`.
pt_br: Esta seção fornece informações sobre o uso de temas HTML preexistentes. Se você deseja criar seu próprio tema, consulte :ref:`extension-html-theme`.

source: Sphinx supports changing the appearance of its HTML output via *themes*. A theme is a collection of HTML templates, stylesheet(s) and other static files. Additionally, it has a configuration file which specifies from which theme to inherit, which highlighting style to use, and what options exist for customizing the theme's look and feel.
pt_br: O Sphinx tem suporte à alteração da aparência de sua saída HTML através do *temas*. Um tema é uma coleção de modelos HTML, folhas de estilo e outros arquivos estáticos. Além disso, ele possui um arquivo de configuração que especifica de qual tema herdar, qual estilo de realce usar e quais opções existem para personalizar a aparência do tema.

source: Themes are meant to be project-unaware, so they can be used for different projects without change.
pt_br: Temas são independentes de projetos e podem ser usados em diversos projetos em modificação.

source: Using a theme
pt_br: Usando um tema

source: Using a :ref:`theme provided with Sphinx <builtin-themes>` is easy. Since these do not need to be installed, you only need to set the :confval:`html_theme` config value. For example, to enable the ``classic`` theme, add the following to :file:`conf.py`::
pt_br: Usando um :ref:`theme provided with Sphinx <builtin-themes>` é fácil. Como estes não precisam ser instalados, você só precisa definir o valor de configuração :confval:`html_theme`. Por exemplo, para ativar o tema ``classic``, adicione o seguinte ao :file:`conf.py`::

source: You can also set theme-specific options using the :confval:`html_theme_options` config value. These options are generally used to change the look and feel of the theme. For example, to place the sidebar on the right side and a black background for the relation bar (the bar with the navigation links at the page's top and bottom), add the following :file:`conf.py`::
pt_br: Você também pode definir opções específicas do tema usando o valor de configuração :confval:`html_theme_options`. Essas opções geralmente são usadas para alterar a aparência do tema. Por exemplo, para colocar a barra lateral no lado direito e um plano de fundo preto para a barra de relações (a barra com os links de navegação na parte superior e inferior da página), adicione o seguinte :file:`conf.py`::

source: If the theme does not come with Sphinx, it can be in two static forms or as a Python package. For the static forms, either a directory (containing :file:`theme.toml` and other needed files), or a zip file with the same contents is supported. The directory or zipfile must be put where Sphinx can find it; for this there is the config value :confval:`html_theme_path`. This can be a list of directories, relative to the directory containing :file:`conf.py`, that can contain theme directories or zip files. For example, if you have a theme in the file :file:`blue.zip`, you can put it right in the directory containing :file:`conf.py` and use this configuration::
pt_br: Se o tema não vem com o Sphinx, ele pode estar em dois formatos estáticos ou como um pacote Python. Para os formatos estáticos, um diretório (contendo :file:`theme.toml` e outros arquivos necessários), ou um arquivo zip com o mesmo conteúdo, é suportado. O diretório ou zipfile deve ser colocado onde o Sphinx possa encontrá-lo; para isto, existe o valor de configuração :confval:`html_theme_path`. Este pode ser uma lista de diretórios, relativa ao diretório que contém :file:`conf.py`, que pode conter diretórios de temas ou arquivos zip. Por exemplo, se você tem um tema no arquivo :file:`blue.zip`, você pode colocá-lo no diretório que contém :file:`conf.py` e usar esta configuração::

source: The third form is a Python package. If a theme you want to use is distributed as a Python package, you can use it after installing
pt_br: A terceira forma é um pacote Python. Se um tema que você deseja usar for distribuído como um pacote Python, você poderá usá-lo após a instalação

source: Once installed, this can be used in the same manner as a directory or zipfile-based theme::
pt_br: Uma vez instalado, isso pode ser usado da mesma maneira que um tema baseado em diretório ou zipfile::

source: For more information on the design of themes, including information about writing your own themes, refer to :ref:`extension-html-theme`.
pt_br: Para obter mais informações sobre o design de temas, incluindo informações sobre como escrever seus próprios temas, consulte :ref:`extension-html-theme`.

source: Builtin themes
pt_br: Temas embutidos

source: **Theme overview**
pt_br: **Visão geral dos temas**

source: Sphinx comes with a selection of themes to choose from.
pt_br: O Sphinx vem com uma seleção de temas para escolher.

source: Note that from these themes only the Alabaster and Scrolls themes are mobile-optimated, the other themes resort to horizontal scrolling if the screen is too narrow.
pt_br: Observe que desses temas apenas os temas Alabaster e Scrolls são otimizados para dispositivos móveis, os demais temas recorrem à rolagem horizontal se a tela for muito estreita.

source: These themes are:
pt_br: Esses temas são:

source: **basic**
pt_br: **basico**

source: This is a basically unstyled layout used as the base for the other themes, and usable as the base for custom themes as well. The HTML contains all important elements like sidebar and relation bar. There are these options (which are inherited by the other themes):
pt_br: Este é um layout basicamente não estilizado usado como base para os outros temas e utilizável como base para temas personalizados também. O HTML contém todos os elementos importantes, como barra lateral e barra de relação. Existem estas opções (que são herdadas pelos outros temas):

source: **nosidebar** (true or false): Don't include the sidebar. Defaults to ``False``.
pt_br: **nosidebar** (true ou false): não inclua a barra lateral. O padrão é ``False``.

source: **sidebarwidth** (int or str): Width of the sidebar in pixels. This can be an int, which is interpreted as pixels or a valid CSS dimension string such as '70em' or '50%'. Defaults to 230 pixels.
pt_br: **sidebarwidth** (int ou str): Largura da barra lateral em pixels. Isso pode ser um int, que é interpretado como pixels ou uma string de dimensão CSS válida, como '70em' ou '50%'. O padrão é de 230 pixels.

source: **body_min_width** (int or str): Minimal width of the document body. This can be an int, which is interpreted as pixels or a valid CSS dimension string such as '70em' or '50%'. Use 0 if you don't want a width limit. Defaults may depend on the theme (often 450px).
pt_br: **body_min_width** (int ou str): Largura mínima do corpo do documento. Isso pode ser um int, que é interpretado como pixels ou uma string de dimensão CSS válida, como '70em' ou '50%'. Use 0 se você não quiser um limite de largura. Os padrões podem depender do tema (geralmente 450px).

source: **body_max_width** (int or str): Maximal width of the document body. This can be an int, which is interpreted as pixels or a valid CSS dimension string such as '70em' or '50%'. Use 'none' if you don't want a width limit. Defaults may depend on the theme (often 800px).
pt_br: **body_max_width** (int ou str): Largura máxima do corpo do documento. Isso pode ser um int, que é interpretado como pixels ou uma string de dimensão CSS válida, como '70em' ou '50%'. Use 'none' se você não quiser um limite de largura. Os padrões podem depender do tema (geralmente 800px).

source: **navigation_with_keys** (true or false): Allow navigating with the following keyboard shortcuts:
pt_br: **navigation_with_keys** (true or false): Permite navegar com os seguintes atalhos de teclado:

source: :kbd:`Left arrow`: previous page
pt_br: :kbd:`Left arrow`: página anterior

source: :kbd:`Right arrow`: next page
pt_br: :kbd:`Right arrow`: página seguinte

source: Defaults to ``False``.
pt_br: O padrão é ``False``.

source: **enable_search_shortcuts** (true or false): Allow jumping to the search box with :kbd:`/` and allow removal of search highlighting with :kbd:`Esc`.
pt_br: **enable_search_shortcuts** (true or false): Permite pular para a caixa de pesquisa com :kbd:`/` e permite a remoção do realce de pesquisa com :kbd:`Esc`.

source: Defaults to ``True``.
pt_br: O padrão é ``True``.

source: **globaltoc_collapse** (true or false): Only expand subsections of the current document in ``globaltoc.html`` (see :confval:`html_sidebars`). Defaults to ``True``.
pt_br: **globaltoc_collapse** (true ou false): Expande apenas subseções do documento atual em ``globaltoc.html`` (veja :confval:`html_sidebars`). O padrão é ``True``.

source: **globaltoc_includehidden** (true or false): Show even those subsections in ``globaltoc.html`` (see :confval:`html_sidebars`) which have been included with the ``:hidden:`` flag of the :rst:dir:`toctree` directive. Defaults to ``False``.
pt_br: **globaltoc_includehidden** (true or false): Mostra até mesmo aquelas subseções em ``globaltoc.html`` (veja :confval:`html_sidebars`) que foram incluídas com o sinalizador ``:hidden:`` da diretiva :rst:dir:`toctree`. O padrão é ``False``.

source: **globaltoc_maxdepth** (int): The maximum depth of the toctree in ``globaltoc.html`` (see :confval:`html_sidebars`). Set it to -1 to allow unlimited depth. Defaults to the max depth selected in the toctree directive.
pt_br: **globaltoc_maxdepth** (int): A profundidade máxima da toctree em ``globaltoc.html`` (veja :confval:`html_sidebars`). Defina-o como -1 para permitir profundidade ilimitada. O padrão é a profundidade máxima selecionada na diretiva toctree.

source: `Alabaster theme`_ is a modified "Kr" Sphinx theme from @kennethreitz (especially as used in his Requests project), which was itself originally based on @mitsuhiko's theme used for Flask & related projects. Refer to its `installation page`_ for information on how to configure :confval:`html_sidebars` for its use.
pt_br: `O tema Alabaster`_ é um tema "Kr" modificado de @kennethreitz (especialmente usado em seu projeto Requests) para o Sphinx, que originalmente era baseado no tema de @mitsuhiko usado para o Flask e projetos relacionados. Consulte sua `páginas de instalação`_ para obter informações sobre como configurar :confval:`html_sidebars` para seu uso.

source: This is the classic theme, which looks like `the Python 2 documentation <https://docs.python.org/2/>`_. It can be customized via these options:
pt_br: Este é o tema clássico, que se parece com `a documentação do Python 2 <https://docs.python.org/2/>`_. Pode ser personalizado através destas opções:

source: **rightsidebar** (true or false): Put the sidebar on the right side. Defaults to ``False``.
pt_br: **rightsidebar** (``True`` ou ``False``): coloque a barra lateral no lado direito. O padrão é ``False``.

source: **stickysidebar** (true or false): Make the sidebar "fixed" so that it doesn't scroll out of view for long body content. This may not work well with all browsers. Defaults to ``False``.
pt_br: **stickysidebar** (``True`` ou ``False``): Torna a barra lateral *fixa* para que não saia do campo de visão para o conteúdo do corpo longo. Isso pode não funcionar bem com todos os navegadores. O padrão é ``False``.

source: **collapsiblesidebar** (true or false): Add an *experimental* JavaScript snippet that makes the sidebar collapsible via a button on its side. Defaults to ``False``.
pt_br: **collapsiblesidebar** (``True`` ou ``False``): Adicione um snippet JavaScript *experimental* que torna a barra lateral recolhível por meio de um botão ao lado. O padrão é ``False``.

source: **externalrefs** (true or false): Display external links differently from internal links. Defaults to ``False``.
pt_br: **externalrefs** (``True`` ou ``False``): exibe links externos de maneira diferente dos links internos. O padrão é ``False``.

source: There are also various color and font options that can change the color scheme without having to write a custom stylesheet:
pt_br: Há também várias opções de cor e fonte que podem alterar o esquema de cores sem precisar escrever uma folha de estilo personalizada:

source: **footerbgcolor** (CSS color): Background color for the footer line.
pt_br: **footerbgcolor** (cor CSS): cor de fundo para a linha de rodapé.

source: **footertextcolor** (CSS color): Text color for the footer line.
pt_br: **footertextcolor** (cor CSS): cor do texto para a linha de rodapé.

source: **sidebarbgcolor** (CSS color): Background color for the sidebar.
pt_br: **sidebarbgcolor** (cor CSS): cor de fundo para a barra lateral.

source: **sidebarbtncolor** (CSS color): Background color for the sidebar collapse button (used when *collapsiblesidebar* is ``True``).
pt_br: **sidebarbtncolor** (cor CSS): Cor de fundo para o botão de recolhimento da barra lateral (usado quando *collapsiblesidebar* é ``True``).

source: **sidebartextcolor** (CSS color): Text color for the sidebar.
pt_br: **sidebartextcolor** (cor CSS): cor do texto para a barra lateral.

source: **sidebarlinkcolor** (CSS color): Link color for the sidebar.
pt_br: **sidebarlinkcolor** (cor CSS): cor do link para a barra lateral.

source: **relbarbgcolor** (CSS color): Background color for the relation bar.
pt_br: **relbarbgcolor** (cor CSS): cor de fundo para a barra de relação.

source: **relbartextcolor** (CSS color): Text color for the relation bar.
pt_br: **relbartextcolor** (cor CSS): cor do texto para a barra de relação.

source: **relbarlinkcolor** (CSS color): Link color for the relation bar.
pt_br: **relbarlinkcolor** (cor CSS): cor do link para a barra de relação.

source: **bgcolor** (CSS color): Body background color.
pt_br: **bgcolor** (cor CSS): Cor de fundo do corpo.

source: **textcolor** (CSS color): Body text color.
pt_br: **textcolor** (cor CSS): cor do texto do corpo.

source: **linkcolor** (CSS color): Body link color.
pt_br: **linkcolor** (cor CSS): Cor do link do corpo.

source: **visitedlinkcolor** (CSS color): Body color for visited links.
pt_br: **visitedlinkcolor** (cor CSS): cor do corpo para links visitados.

source: **headbgcolor** (CSS color): Background color for headings.
pt_br: **headbgcolor** (cor CSS): cor de fundo para títulos.

source: **headtextcolor** (CSS color): Text color for headings.
pt_br: **headtextcolor** (cor CSS): cor do texto para títulos.

source: **headlinkcolor** (CSS color): Link color for headings.
pt_br: **headlinkcolor** (cor CSS): cor do link para títulos.

source: **codebgcolor** (CSS color): Background color for code blocks.
pt_br: **codebgcolor** (cor CSS): cor de fundo para blocos de código.

source: **codetextcolor** (CSS color): Default text color for code blocks, if not set differently by the highlighting style.
pt_br: **codetextcolor** (cor CSS): Cor de texto padrão para blocos de código, se não for definido de maneira diferente pelo estilo de destaque.

source: **bodyfont** (CSS font-family): Font for normal text.
pt_br: **bodyfont** (CSS font-family): fonte para texto normal.

source: **headfont** (CSS font-family): Font for headings.
pt_br: **headfont** (CSS font-family): fonte para títulos.

source: The theme originally used by this documentation. It features a sidebar on the right side. There are currently no options beyond *nosidebar* and *sidebarwidth*.
pt_br: O tema originalmente usado por esta documentação. Possui uma barra lateral no lado direito. Atualmente não há opções além de *nosidebar* e *sidebarwidth*.

source: The Sphinx documentation now uses `an adjusted version of the sphinxdoc theme <https://github.com/sphinx-doc/sphinx/tree/master/doc/_themes/sphinx13>`_.
pt_br: A documentação do ``Sphinx`` agora usa `an adjusted version of the sphinxdoc theme <https://github.com/sphinx-doc/sphinx/tree/master/doc/_themes/sphinx13>`_.

source: A more lightweight theme, based on `the Jinja documentation <https://jinja.palletsprojects.com/>`_. The following color options are available:
pt_br: Um tema mais leve, baseado na `documentação do Jinja <https://jinja.palletsprojects.com/>`_. As seguintes opções de cores estão disponíveis:

source: A theme created by Andi Albrecht. The following options are supported:
pt_br: Um tema criado por Andi Albrecht. As seguintes opções são suportadas:

source: **bodyfont** (CSS font family): Font for normal text.
pt_br: **bodyfont** (família de fontes CSS): fonte para texto normal.

source: **headerfont** (CSS font family): Font for headings.
pt_br: **headerfont** (família de fontes CSS): fonte para títulos.

source: **pagewidth** (CSS length): Width of the page content, default 70em.
pt_br: **pagewidth** (comprimento CSS): Largura do conteúdo da página, padrão 70em.

source: **documentwidth** (CSS length): Width of the document (without sidebar), default 50em.
pt_br: **documentwidth** (comprimento CSS): Largura do documento (sem barra lateral), padrão 50em.

source: **sidebarwidth** (CSS length): Width of the sidebar, default 20em.
pt_br: **sidebarwidth** (comprimento CSS): Largura da barra lateral, padrão 20em.

source: **rightsidebar** (true or false): Put the sidebar on the right side. Defaults to ``True``.
pt_br: **rightsidebar** ( ou ``False``): coloque a barra lateral no lado direito. O padrão é ``True``.

source: **bgcolor** (CSS color): Background color.
pt_br: **bgcolor** (cor CSS): cor de fundo.

source: **headerbg** (CSS value for "background"): background for the header area, default a grayish gradient.
pt_br: **headerbg** (valor CSS para "background"): background para a área do cabeçalho, padrão um gradiente acinzentado.

source: **footerbg** (CSS value for "background"): background for the footer area, default a light gray gradient.
pt_br: **footerbg** (valor de CSS para "fundo"): plano de fundo para a área de rodapé, padrão um gradiente cinza claro.

source: **headercolor1**, **headercolor2** (CSS color): colors for <h1> and <h2> headings.
pt_br: **headercolor1**, **headercolor2** (cor CSS): cores para os cabeçalhos <h1> e <h2>.

source: **headerlinkcolor** (CSS color): Color for the backreference link in headings.
pt_br: **headerlinkcolor** (cor CSS): cor para o link de referência anterior nos títulos.

source: **textalign** (CSS *text-align* value): Text alignment for the body, default is ``justify``.
pt_br: **textalign** (valor CSS *text-align*): Alinhamento de texto para o corpo, o padrão é ``justify``.

source: A greenish theme. There are currently no options beyond *nosidebar* and *sidebarwidth*.
pt_br: Um tema esverdeado. Atualmente não há opções além de *nosidebar* e *sidebarwidth*.

source: A theme from the Pyramid web framework project, designed by Blaise Laflamme. There are currently no options beyond *nosidebar* and *sidebarwidth*.
pt_br: Um tema do projeto de framework web ``Pyramid``, projetado por Blaise Laflamme. Atualmente não há opções além de *nosidebar* e *sidebarwidth*.

source: A theme without sidebar inspired by the `Haiku OS user guide <https://www.haiku-os.org/docs/userguide/en/contents.html>`_. The following options are supported:
pt_br: Um tema sem barra lateral inspirada no `Haiku OS user guide <https://www.haiku-os.org/docs/userguide/en/contents.html>`_. As seguintes opções são suportadas:

source: **full_logo** (true or false, default ``False``): If this is true, the header will only show the :confval:`html_logo`. Use this for large logos. If this is false, the logo (if present) will be shown floating right, and the documentation title will be put in the header.
pt_br: **full_logo** (``True`` ou ``False``, padrão ``False``): Se isso for ``True``, o cabeçalho mostrará apenas o :confval:`html_logo`. Use isso para logotipos grandes. Se isso for falso, o logotipo (se presente) será exibido flutuando para a direita e o título da documentação será colocado no cabeçalho.

source: **textcolor**, **headingcolor**, **linkcolor**, **visitedlinkcolor**, **hoverlinkcolor** (CSS colors): Colors for various body elements.
pt_br: **textcolor**, **headingcolor**, **linkcolor**, **visitedlinkcolor**, **hoverlinkcolor** (cores CSS): cores para vários elementos do corpo.

source: A theme resembling the old Python documentation. There are currently no options beyond *nosidebar* and *sidebarwidth*.
pt_br: Um tema parecido com a documentação antiga do Python. Atualmente não há opções além de *nosidebar* e *sidebarwidth*.

source: A theme for the epub builder. This theme tries to save visual space which is a sparse resource on ebook readers. The following options are supported:
pt_br: Um tema para o construtor de EPUB. Este tema tenta salvar o espaço visual, que é um recurso escasso nos leitores de e-books. As seguintes opções são suportadas:

source: **relbar1** (true or false, default ``True``): If this is true, the ``relbar1`` block is inserted in the epub output, otherwise it is omitted.
pt_br: **relbar1** (true ou false, padrão ``True``): Se isso for verdade, o bloco ``relbar1`` é inserido na saída ``epub``, caso contrário, ele é omitido.

source: **footer** (true or false, default ``True``): If this is true, the ``footer`` block is inserted in the epub output, otherwise it is omitted.
pt_br: **footer** (true or false, padrão ``True``): Se isto for ``True``, o bloco ``footer`` é inserido na saída ``epub``, caso contrário, ele é omitido.

source: A simple bluish theme. The following options are supported beyond *nosidebar* and *sidebarwidth*:
pt_br: Um simples tema azulado. As seguintes opções são suportadas além de *nosidebar* e *sidebarwidth*:

source: 'alabaster', 'sphinx_rtd_theme' and 'bizstyle' theme.
pt_br: ``alabaster``, ``sphinx_rtd_theme`` e ``bizstyle``.

source: The 'default' theme has been renamed to 'classic'. 'default' is still available, however it will emit a notice that it is an alias for the new 'alabaster' theme.
pt_br: O tema *padrão* foi renomeado para *classic*, *default* ainda está disponível, no entanto, ele emitirá um aviso de que é um alias para o novo tema *alabastro*.

source: Third Party Themes
pt_br: Temas de terceiros

source: There are many third-party themes created for Sphinx. Some of these are for general use, while others are specific to an individual project.
pt_br: Existem muitos temas de terceiros criados para o Sphinx. Alguns deles são para uso geral, enquanto outros são específicos para um projeto individual.

source: sphinx-themes.org__ is a gallery that showcases various themes for Sphinx, with demo documentation rendered under each theme. Themes can also be found on PyPI__ (using the classifier ``Framework :: Sphinx :: Theme``), GitHub__ and GitLab__.
pt_br: sphinx-themes.org__ é uma galeria que apresenta vários temas para o Sphinx, com documentação de demonstração renderizada para cada tema. Os temas também podem ser encontrados no PyPI__ (usando o classificador ``Framework :: Sphinx :: Theme``), GitHub__ e GitLab__.
