Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/development/tutorials/extending_syntax.po
Languages: pt_br

source: Extending syntax with roles and directives
pt_br: Estendendo a sintaxe com papéis e diretivas

source: Overview
pt_br: Visão geral

source: The syntax of both reStructuredText and MyST can be extended by creating new **directives** - for block-level elements - and **roles** - for inline elements.
pt_br: A sintaxe de reStructuredText e MyST pode ser estendida criando novas **diretivas** - para elementos em nível de bloco - e **papéis** - para elementos embutidos.

source: In this tutorial we shall extend Sphinx to add:
pt_br: Neste tutorial vamos estender o Sphinx para adicionar:

source: A ``hello`` role, that will simply output the text ``Hello {text}!``.
pt_br: Um papel ``hello``, que simplesmente produzirá o texto ``Hello {text}!``.

source: A ``hello`` directive, that will simply output the text ``Hello {text}!``, as a paragraph.
pt_br: Uma diretiva ``hello``, que simplesmente produzirá o texto ``Hello {text}!``, como um parágrafo.

source: For this extension, you will need some basic understanding of Python, and we shall also introduce aspects of the docutils_ API.
pt_br: Para esta extensão, você precisará de algum conhecimento básico de Python e também apresentaremos aspectos da API do docutils_.

source: Setting up the project
pt_br: Configurando o projeto

source: You can either use an existing Sphinx project or create a new one using :program:`sphinx-quickstart`.
pt_br: Você pode usar um projeto Sphinx existente ou criar um novo usando :program:`sphinx-quickstart`.

source: With this we will add the extension to the project, within the :file:`source` folder:
pt_br: Com isso vamos adicionar a extensão ao projeto, dentro da pasta :file:`source`:

source: Create an :file:`_ext` folder in :file:`source`
pt_br: Crie uma pasta :file:`_ext` em :file:`source`

source: Create a new Python file in the :file:`_ext` folder called :file:`helloworld.py`
pt_br: Crie um novo arquivo Python na pasta :file:`_ext` chamado :file:`helloworld.py`

source: Here is an example of the folder structure you might obtain:
pt_br: Aqui está um exemplo da estrutura de pastas que você pode obter:

source: Writing the extension
pt_br: Escrevendo a extensão

source: Open :file:`helloworld.py` and paste the following code in it:
pt_br: Abra :file:`helloworld.py` e cole o seguinte código nele:

source: Some essential things are happening in this example:
pt_br: Algumas coisas essenciais estão acontecendo neste exemplo:

source: The role class
pt_br: A classe do papel

source: Our new role is declared in the ``HelloRole`` class.
pt_br: Nosso novo papel é declarado na classe ``HelloRole``.

source: This class extends the :class:`.SphinxRole` class. The class contains a ``run`` method, which is a requirement for every role. It contains the main logic of the role and it returns a tuple containing:
pt_br: Esta classe estende a classe :class:`.SphinxRole`. A classe contém um método ``run``, que é um requisito para cada papel. Contém a lógica principal do papel e retorna uma tupla contendo:

source: a list of inline-level docutils nodes to be processed by Sphinx.
pt_br: uma lista de nós docutils de nível em linha a serem processados ​​pelo Sphinx.

source: an (optional) list of system message nodes
pt_br: uma lista (opcional) de nós de mensagens do sistema

source: The directive class
pt_br: A classe da diretiva

source: Our new directive is declared in the ``HelloDirective`` class.
pt_br: Nossa nova diretiva é declarada na classe ``HelloDirective``.

source: This class extends the :class:`.SphinxDirective` class. The class contains a ``run`` method, which is a requirement for every directive. It contains the main logic of the directive and it returns a list of block-level docutils nodes to be processed by Sphinx. It also contains a ``required_arguments`` attribute, which tells Sphinx how many arguments are required for the directive.
pt_br: Esta classe estende a classe :class:`.SphinxDirective`. A classe contém um método ``run``, que é um requisito para toda diretiva. Ele contém a lógica principal da diretiva e retorna uma lista de nós docutils em nível de bloco a serem processados ​​pelo Sphinx. Ele também contém um atributo ``required_arguments``, que informa ao Sphinx quantos argumentos são necessários para a diretiva.

source: What are docutils nodes?
pt_br: O que são nós de docutils?

source: When Sphinx parses a document, it creates an "Abstract Syntax Tree" (AST) of nodes that represent the content of the document in a structured way, that is generally independent of any one input (rST, MyST, etc) or output (HTML, LaTeX, etc) format. It is a tree because each node can have children nodes, and so on:
pt_br: Quando o Sphinx analisa um documento, ele cria uma "Árvore Sintática Abstrata" (AST) de nós que representam o conteúdo do documento de uma forma estruturada, que geralmente é independente de qualquer entrada (rST, MyST, etc) ou saída (HTML , LaTeX, etc.). É uma árvore porque cada nó pode ter nós filhos e assim por diante:

source: The docutils_ package provides many `built-in nodes <docutils nodes_>`_, to represent different types of content such as text, paragraphs, references, tables, etc.
pt_br: O pacote docutils_ fornece muitos `nós embutidos <docutils nodes_>`_, para representar diferentes tipos de conteúdo, como texto, parágrafos, referências, tabelas, etc.

source: Each node type generally only accepts a specific set of direct child nodes, for example the ``document`` node should only contain "block-level" nodes, such as ``paragraph``, ``section``, ``table``, etc, whilst the ``paragraph`` node should only contain "inline-level" nodes, such as ``text``, ``emphasis``, ``strong``, etc.
pt_br: Cada tipo de nó geralmente aceita apenas um conjunto específico de nós filhos diretos, por exemplo, o nó ``document`` deve conter apenas nós de "nível de bloco", como ``paragraph``, ``section``, ``table ``, etc, enquanto o nó ``paragraph`` deve conter apenas nós de "nível em linha", como ``text``, ``emphasis``, ``strong``, etc.

source: The docutils documentation on `creating directives <docutils directives_>`_, and `creating roles <docutils roles_>`_.
pt_br: A documentação do docutils sobre a `criação de diretivas <docutils directives_>`_ e `criação de papéis <docutils roles_>`_.

source: The ``setup`` function
pt_br: A função ``setup``

source: This function is a requirement. We use it to plug our new directive into Sphinx.
pt_br: Esta função é um requisito. Nós o usamos para conectar nossa nova diretiva ao Sphinx.

source: The simplest thing you can do is to call the :meth:`.Sphinx.add_role` and :meth:`.Sphinx.add_directive` methods, which is what we've done here. For this particular call, the first argument is the name of the role/directive itself as used in a reST file. In this case, we would use ``hello``. For example:
pt_br: A coisa mais simples que você pode fazer é chamar os métodos :meth:`.Sphinx.add_role` e :meth:`.Sphinx.add_directive`, que é o que fizemos aqui. Para esta chamada específica, o primeiro argumento é o nome do próprio papel ou da própria diretiva usados em um arquivo reST. Neste caso, usaríamos ``hello``. Por exemplo:

source: We also return the :ref:`extension metadata <ext-metadata>` that indicates the version of our extension, along with the fact that it is safe to use the extension for both parallel reading and writing.
pt_br: Também retornamos os :ref:`metadados da extensão <ext-metadata>` que indicam a versão da nossa extensão, juntamente com o fato de que é seguro usar a extensão tanto para leitura quanto para escrita paralela.

source: Using the extension
pt_br: Usando a extensão

source: The extension has to be declared in your :file:`conf.py` file to make Sphinx aware of it. There are two steps necessary here:
pt_br: A extensão deve ser declarada em seu arquivo :file:`conf.py` para que o Sphinx saiba disso. Existem duas etapas necessárias aqui:

source: Add the :file:`_ext` directory to the `Python path`_ using ``sys.path.append``. This should be placed at the top of the file.
pt_br: Adicione o diretório :file:`_ext` ao `caminho do Python`_ usando ``sys.path.append``. Isso deve ser colocado no topo do arquivo.

source: Update or create the :confval:`extensions` list and add the extension file name to the list
pt_br: Atualize ou crie a lista :confval:`extensions` e adicione o nome do arquivo de extensão à lista

source: For example:
pt_br: Por exemplo:

source: Because we haven't installed our extension as a `Python package`_, we need to modify the `Python path`_ so Sphinx can find our extension. This is why we need the call to ``sys.path.append``.
pt_br: Por não termos instalado nossa extensão como um `pacote Python`_, precisamos modificar o `caminho Python`_ para que o Sphinx possa encontrar nossa extensão. É por isso que precisamos da chamada para ``sys.path.append``.

source: You can now use the extension in a file. For example:
pt_br: Agora você pode usar a extensão em um arquivo. Por exemplo:

source: The sample above would generate:
pt_br: A exemplo acima geraria:

source: Further reading
pt_br: Leitura adicional

source: This is the very basic principle of an extension that creates a new role and directive.
pt_br: Este é o princípio básico de uma extensão que cria um novo papel e uma nova diretiva.

source: For a more advanced example, refer to :ref:`tutorial-extend-build`.
pt_br: Para um exemplo mais avançado, consulte :ref:`tutorial-extend-build`.

source: If you wish to share your extension across multiple projects or with others, check out the :ref:`third-party-extensions` section.
pt_br: Se você deseja compartilhar sua extensão entre vários projetos ou com outras pessoas, confira a seção :ref:`third-party-extensions`.
