Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/development/tutorials/todo.po
Languages: pt_br

source: Developing a "TODO" extension
pt_br: Desenvolvendo uma extensão "TODO"

source: The objective of this tutorial is to create a more comprehensive extension than that created in :doc:`helloworld`. Whereas that guide just covered writing a custom :term:`directive`, this guide adds multiple directives, along with custom nodes, additional config values and custom event handlers. To this end, we will cover a ``todo`` extension that adds capabilities to include todo entries in the documentation, and to collect these in a central place. This is similar the ``sphinxext.todo`` extension distributed with Sphinx.
pt_br: O objetivo deste tutorial é criar uma extensão mais abrangente que a criada em :doc:`helloworld`. Considerando que esse guia apenas cobriu a escrita de uma :term:`diretiva` personalizado, este guia adiciona múltiplas diretivas, juntamente com nós personalizados, valores de configuração adicionais e manipuladores de eventos personalizados. Para este fim, iremos cobrir uma extensão ``todo`` que adiciona capacidades para incluir entradas de tarefas pendentes (ToDo significa para fazer, em inglês) na documentação, e coletá-las em um local central. Isto é semelhante à extensão ``sphinxext.todo`` distribuída com o Sphinx.

source: Overview
pt_br: Visão geral

source: To understand the design of this extension, refer to :ref:`important-objects` and :ref:`build-phases`.
pt_br: Para entender o design desta extensão, consulte :ref:`important-objects` e :ref:`build-phases`.

source: We want the extension to add the following to Sphinx:
pt_br: Queremos que a extensão adicione o seguinte ao Sphinx:

source: A ``todo`` directive, containing some content that is marked with "TODO" and only shown in the output if a new config value is set. Todo entries should not be in the output by default.
pt_br: Uma diretiva ``todo``, contendo algum conteúdo marcado com "TODO" e somente mostrado na saída se um novo valor de configuração for definido. As entradas "todo" não devem estar na saída por padrão.

source: A ``todolist`` directive that creates a list of all todo entries throughout the documentation.
pt_br: Uma diretiva ``todolist`` que cria uma lista de todas as entradas de tarefas em toda a documentação.

source: For that, we will need to add the following elements to Sphinx:
pt_br: Para isso, precisaremos adicionar os seguintes elementos ao Sphinx:

source: New directives, called ``todo`` and ``todolist``.
pt_br: Novas diretivas, chamadas ``todo`` e ``todolist``.

source: New document tree nodes to represent these directives, conventionally also called ``todo`` and ``todolist``. We wouldn't need new nodes if the new directives only produced some content representable by existing nodes.
pt_br: Novos nós de árvore de documentos para representar essas diretivas, convencionalmente também chamados de ``todo`` e ``todolist``. Não precisaríamos de novos nós se as novas diretivas produzissem apenas algum conteúdo representável pelos nós existentes.

source: A new config value ``todo_include_todos`` (config value names should start with the extension name, in order to stay unique) that controls whether todo entries make it into the output.
pt_br: Um novo valor de configuração ``todo_include_todos`` (os nomes dos valores de configuração devem começar com o nome da extensão, para permanecerem únicos) que controla se as entradas de tarefas chegam à saída.

source: New event handlers: one for the :event:`doctree-resolved` event, to replace the todo and todolist nodes, one for :event:`env-merge-info` to merge intermediate results from parallel builds, and one for :event:`env-purge-doc` (the reason for that will be covered later).
pt_br: Novos manipuladores de eventos: um para o evento :event:`doctree-resolved`, para substituir os nós de todo e todolist, um para :event:`env-merge-info` para mesclar resultados intermediários de construções paralelas, e um para :event:`env-purge-doc` (a razão para isso será abordada mais tarde).

source: Prerequisites
pt_br: Pré-requisitos

source: As with :doc:`helloworld`, we will not be distributing this plugin via PyPI so once again we need a Sphinx project to call this from. You can use an existing project or create a new one using :program:`sphinx-quickstart`.
pt_br: Assim como acontece com :doc:`helloworld`, não distribuiremos este plugin via PyPI, então mais uma vez precisamos de um projeto Sphinx para chamar isso. Você pode usar um projeto existente ou criar um novo usando :program:`sphinx-quickstart`.

source: We assume you are using separate source (:file:`source`) and build (:file:`build`) folders. Your extension file could be in any folder of your project. In our case, let's do the following:
pt_br: Presumimos que você esteja usando pastas de fonte (:file:`source`) e de construção (:file:`build`) separadas. Seu arquivo de extensão pode estar em qualquer pasta do seu projeto. No nosso caso, vamos fazer o seguinte:

source: Create an :file:`_ext` folder in :file:`source`
pt_br: Crie uma pasta :file:`_ext` em :file:`source`

source: Create a new Python file in the :file:`_ext` folder called :file:`todo.py`
pt_br: Crie um novo arquivo Python na pasta :file:`_ext` chamado :file:`todo.py`

source: Here is an example of the folder structure you might obtain:
pt_br: Aqui está um exemplo da estrutura de pastas que você pode obter:

source: Writing the extension
pt_br: Escrevendo a extensão

source: Open :file:`todo.py` and paste the following code in it, all of which we will explain in detail shortly:
pt_br: Abra :file:`todo.py` e cole o seguinte código nele, que explicaremos em detalhes em breve:

source: This is far more extensive extension than the one detailed in :doc:`helloworld`, however, we will will look at each piece step-by-step to explain what's happening.
pt_br: Esta é uma extensão muito mais extensa do que a detalhada em :doc:`helloworld`, no entanto, examinaremos cada parte passo a passo para explicar o que está acontecendo.

source: The node classes
pt_br: As classes de nós

source: Let's start with the node classes:
pt_br: Vamos começar com as classes de nós:

source: Node classes usually don't have to do anything except inherit from the standard docutils classes defined in :mod:`docutils.nodes`. ``todo`` inherits from ``Admonition`` because it should be handled like a note or warning, ``todolist`` is just a "general" node.
pt_br: As classes de nós geralmente não precisam fazer nada, exceto herdar das classes padrão do docutils definidas em :mod:`docutils.nodes`. ``todo`` herda de ``Admonition`` porque deve ser tratado como uma nota ou aviso, ``todolist`` é apenas um nó "geral".

source: Many extensions will not have to create their own node classes and work fine with the nodes already provided by `docutils <https://docutils.sourceforge.io/docs/ref/doctree.html>`__ and :ref:`Sphinx <nodes>`.
pt_br: Muitas extensões não terão que criar suas próprias classes de nós e funcionarão bem com os nós já fornecidos por `docutils <https://docutils.sourceforge.io/docs/ref/doctree.html>`__ e :ref:`Sphinx <nodes>`.

source: It is important to know that while you can extend Sphinx without leaving your ``conf.py``, if you declare an inherited node right there, you'll hit an unobvious :py:class:`~pickle.PickleError`. So if something goes wrong, please make sure that you put inherited nodes into a separate Python module.
pt_br: É importante saber que embora você possa estender o Sphinx sem sair do seu ``conf.py``, se você declarar um nó herdado ali mesmo, você encontrará um :py:class:`~pickle.PickleError` não óbvio. Portanto, se algo der errado, certifique-se de colocar os nós herdados em um módulo Python separado.

source: For more details, see:
pt_br: Para mais detalhes, consulte:

source: The directive classes
pt_br: As classes de diretiva

source: A directive class is a class deriving usually from :class:`docutils.parsers.rst.Directive`. The directive interface is also covered in detail in the `docutils documentation`_; the important thing is that the class should have attributes that configure the allowed markup, and a ``run`` method that returns a list of nodes.
pt_br: Uma classe de diretiva é uma classe que normalmente deriva de :class:`docutils.parsers.rst.Directive`. A interface da diretiva também é abordada em detalhes na `documentação do docutils`_; o importante é que a classe possua atributos que configurem a marcação permitida, e um método ``run`` que retorne uma lista de nós.

source: Looking first at the ``TodolistDirective`` directive:
pt_br: Olhando primeiro para a diretiva ``TodolistDirective``:

source: It's very simple, creating and returning an instance of our ``todolist`` node class. The ``TodolistDirective`` directive itself has neither content nor arguments that need to be handled. That brings us to the ``TodoDirective`` directive:
pt_br: É muito simples criar e retornar uma instância da nossa classe de nó ``todolist``. A diretiva ``TodolistDirective`` em si não possui conteúdo nem argumentos que precisam ser manipulados. Isso nos leva à diretiva ``TodoDirective``:

source: Several important things are covered here. First, as you can see, we're now subclassing the :class:`~sphinx.util.docutils.SphinxDirective` helper class instead of the usual :class:`~docutils.parsers.rst.Directive` class. This gives us access to the :ref:`build environment instance <important-objects>` using the ``self.env`` property. Without this, we'd have to use the rather convoluted ``self.state.document.settings.env``. Then, to act as a link target (from ``TodolistDirective``), the ``TodoDirective`` directive needs to return a target node in addition to the ``todo`` node. The target ID (in HTML, this will be the anchor name) is generated by using ``env.new_serialno`` which returns a new unique integer on each call and therefore leads to unique target names. The target node is instantiated without any text (the first two arguments).
pt_br: Várias coisas importantes são abordadas aqui. Primeiro, como você pode ver, agora estamos criando uma subclasse da classe auxiliar :class:`~sphinx.util.docutils.SphinxDirective` em vez da classe :class:`~docutils.parsers.rst.Directive` usual. Isso nos dá acesso à :ref:`instância de ambiente de construção <important-objects>` usando a propriedade ``self.env``. Sem isso, teríamos que usar o bastante complicado ``self.state.document.settings.env``. Então, para atuar como um link alvo (de ``TodolistDirective``), a diretiva ``TodoDirective`` precisa retornar um nó alvo além do nó ``todo``. O ID do alvo (em HTML, este será o nome da âncora) é gerado usando ``env.new_serialno`` que retorna um novo número inteiro exclusivo em cada chamada e, portanto, leva a nomes de alvos exclusivos. O nó alvo é instanciado sem nenhum texto (os dois primeiros argumentos).

source: On creating admonition node, the content body of the directive are parsed using ``self.state.nested_parse``. The first argument gives the content body, and the second one gives content offset. The third argument gives the parent node of parsed result, in our case the ``todo`` node. Following this, the ``todo`` node is added to the environment. This is needed to be able to create a list of all todo entries throughout the documentation, in the place where the author puts a ``todolist`` directive. For this case, the environment attribute ``todo_all_todos`` is used (again, the name should be unique, so it is prefixed by the extension name). It does not exist when a new environment is created, so the directive must check and create it if necessary. Various information about the todo entry's location are stored along with a copy of the node.
pt_br: Ao criar o nó de admonição, o corpo do conteúdo da diretiva é analisado usando ``self.state.nested_parse``. O primeiro argumento fornece o corpo do conteúdo e o segundo fornece o deslocamento do conteúdo. O terceiro argumento fornece o nó pai do resultado analisado, no nosso caso o nó ``todo``. Em seguida, o nó ``todo`` é adicionado ao ambiente. Isto é necessário para poder criar uma lista de todas as entradas de tarefas ao longo da documentação, no local onde o autor coloca uma diretiva ``todolist``. Para este caso, o atributo de ambiente ``todo_all_todos`` é usado (novamente, o nome deve ser único, portanto é prefixado pelo nome da extensão). Não existe quando um novo ambiente é criado, portanto a diretiva deve verificá-lo e criá-lo se necessário. Várias informações sobre a localização da entrada de tarefas são armazenadas junto com uma cópia do nó.

source: In the last line, the nodes that should be put into the doctree are returned: the target node and the admonition node.
pt_br: Na última linha são retornados os nós que devem ser colocados na doctree: o nó alvo e o nó de admonição.

source: The node structure that the directive returns looks like this::
pt_br: A estrutura do nó que a diretiva retorna é semelhante a esta::

source: The event handlers
pt_br: OS manipuladores de eventos

source: Event handlers are one of Sphinx's most powerful features, providing a way to do hook into any part of the documentation process. There are many events provided by Sphinx itself, as detailed in :ref:`the API guide <events>`, and we're going to use a subset of them here.
pt_br: Os manipuladores de eventos são um dos recursos mais poderosos do Sphinx, fornecendo uma maneira de se conectar a qualquer parte do processo de documentação. Existem muitos eventos fornecidos pelo próprio Sphinx, conforme detalhado no :ref:`guia de API <events>`, e usaremos um subconjunto deles aqui.

source: Let's look at the event handlers used in the above example. First, the one for the :event:`env-purge-doc` event:
pt_br: Vejamos os manipuladores de eventos usados ​​no exemplo acima. Primeiro, aquele para o evento :event:`env-purge-doc`:

source: Since we store information from source files in the environment, which is persistent, it may become out of date when the source file changes. Therefore, before each source file is read, the environment's records of it are cleared, and the :event:`env-purge-doc` event gives extensions a chance to do the same. Here we clear out all todos whose docname matches the given one from the ``todo_all_todos`` list. If there are todos left in the document, they will be added again during parsing.
pt_br: Como armazenamos informações dos arquivos fonte no ambiente, que é persistente, elas podem ficar desatualizadas quando o arquivo fonte for alterado. Portanto, antes de cada arquivo fonte ser lido, os registros do ambiente são limpos, e o evento :event:`env-purge-doc` dá às extensões a chance de fazer o mesmo. Aqui limpamos todos os todos cujo nome de documento corresponde ao fornecido na lista ``todo_all_todos``. Se ainda houver todos no documento, eles serão adicionados novamente durante a análise.

source: The next handler, for the :event:`env-merge-info` event, is used during parallel builds. As during parallel builds all threads have their own ``env``, there's multiple ``todo_all_todos`` lists that need to be merged:
pt_br: O próximo manipulador, para o evento :event:`env-merge-info`, é usado durante construções paralelas. Como durante construções paralelas todas as threads possuem seu próprio ``env``, existem múltiplas listas de ``todo_all_todos`` que precisam ser mescladas:

source: The other handler belongs to the :event:`doctree-resolved` event:
pt_br: O outro manipulador pertence ao evento :event:`doctree-resolved`:

source: The :event:`doctree-resolved` event is emitted at the end of :ref:`phase 3 (resolving) <build-phases>` and allows custom resolving to be done. The handler we have written for this event is a bit more involved. If the ``todo_include_todos`` config value (which we'll describe shortly) is false, all ``todo`` and ``todolist`` nodes are removed from the documents. If not, ``todo`` nodes just stay where and how they are. ``todolist`` nodes are replaced by a list of todo entries, complete with backlinks to the location where they come from. The list items are composed of the nodes from the ``todo`` entry and docutils nodes created on the fly: a paragraph for each entry, containing text that gives the location, and a link (reference node containing an italic node) with the backreference. The reference URI is built by :meth:`sphinx.builders.Builder.get_relative_uri` which creates a suitable URI depending on the used builder, and appending the todo node's (the target's) ID as the anchor name.
pt_br: O evento :event:`doctree-resolved` é emitido no final da :ref:`fase 3 (resolução) <build-phases>` e permite que a resolução personalizada seja feita. O manipulador que escrevemos para este evento é um pouco mais envolvente. Se o valor de configuração ``todo_include_todos`` (que descreveremos em breve) for falso, todos os nós ``todo`` e ``todolist`` serão removidos dos documentos. Caso contrário, os nós ``todo`` apenas permanecem onde e como estão. Os nós ``todolist`` são substituídos por uma lista de entradas de tarefas completas com backlinks para o local de onde elas vêm. Os itens da lista são compostos pelos nós da entrada ``todo`` e nós docutils criados dinamicamente: um parágrafo para cada entrada, contendo texto que fornece o local, e um link (nó de referência contendo um nó em itálico) com o referência retroativa. O URI de referência é construído por :meth:`sphinx.builders.Builder.get_relative_uri` que cria um URI adequado dependendo do construtor usado e anexando o ID do nó de tarefas (o alvo) como o nome da âncora.

source: The ``setup`` function
pt_br: A função ``setup``

source: As noted :doc:`previously <helloworld>`, the ``setup`` function is a requirement and is used to plug directives into Sphinx. However, we also use it to hook up the other parts of our extension. Let's look at our ``setup`` function:
pt_br: Como observado :doc:`anteriormente <helloworld>`, a função ``setup`` é um requisito e é usada para inserir diretivas no Sphinx. No entanto, também o usamos para conectar as outras partes da nossa extensão. Vejamos nossa função ``setup``:

source: The calls in this function refer to the classes and functions we added earlier. What the individual calls do is the following:
pt_br: As chamadas nesta função fazem referência às classes e funções que adicionamos anteriormente. O que as chamadas individuais fazem é o seguinte:

source: :meth:`~Sphinx.add_config_value` lets Sphinx know that it should recognize the new *config value* ``todo_include_todos``, whose default value should be ``False`` (this also tells Sphinx that it is a boolean value).
pt_br: :meth:`~Sphinx.add_config_value` permite ao Sphinx saber que ele deve reconhecer o novo *valor de configuração* ``todo_include_todos``, cujo valor padrão deve ser ``False`` (isso também diz ao Sphinx que é um valor booleano) .

source: If the third argument was ``'html'``, HTML documents would be full rebuild if the config value changed its value. This is needed for config values that influence reading (build :ref:`phase 1 (reading) <build-phases>`).
pt_br: Se o terceiro argumento fosse ``'html'``, os documentos HTML seriam reconstruídos completamente se o valor de configuração mudasse seu valor. Isto é necessário para valores de configuração que influenciam a leitura (:ref:`fase 1 (leitura) <build-phases>` da construção).

source: :meth:`~Sphinx.add_node` adds a new *node class* to the build system. It also can specify visitor functions for each supported output format. These visitor functions are needed when the new nodes stay until :ref:`phase 4 (writing) <build-phases>`. Since the ``todolist`` node is always replaced in :ref:`phase 3 (resolving) <build-phases>`, it doesn't need any.
pt_br: :meth:`~Sphinx.add_node` adiciona uma nova *classe de nó* ao sistema de construção. Ele também pode especificar funções de visitante para cada formato de saída compatível. Estas funções visitantes são necessárias quando os novos nós permanecem até a :ref:`fase 4 (escrita) <build-phases>`. Como o nó ``todolist`` é sempre substituído na :ref:`fase 3 (resolução) <build-phases>`, ele não precisa de nenhum.

source: :meth:`~Sphinx.add_directive` adds a new *directive*, given by name and class.
pt_br: :meth:`~Sphinx.add_directive` adiciona uma nova *diretiva*, dada pelo nome e pela classe.

source: Finally, :meth:`~Sphinx.connect` adds an *event handler* to the event whose name is given by the first argument. The event handler function is called with several arguments which are documented with the event.
pt_br: Finalmente, :meth:`~Sphinx.connect` adiciona um *manipulador de eventos* ao evento cujo nome é dado pelo primeiro argumento. A função manipuladora de eventos é chamada com vários argumentos que são documentados com o evento.

source: With this, our extension is complete.
pt_br: Com isso, nossa extensão está completa.

source: Using the extension
pt_br: Usando a extensão

source: As before, we need to enable the extension by declaring it in our :file:`conf.py` file. There are two steps necessary here:
pt_br: Como antes, precisamos habilitar a extensão declarando-a em nosso arquivo :file:`conf.py`. Existem duas etapas necessárias aqui:

source: Add the :file:`_ext` directory to the `Python path`_ using ``sys.path.append``. This should be placed at the top of the file.
pt_br: Adicione o diretório :file:`_ext` ao `caminho do Python`_ usando ``sys.path.append``. Isso deve ser colocado no topo do arquivo.

source: Update or create the :confval:`extensions` list and add the extension file name to the list
pt_br: Atualize ou crie a lista :confval:`extensions` e adicione o nome do arquivo de extensão à lista

source: In addition, we may wish to set the ``todo_include_todos`` config value. As noted above, this defaults to ``False`` but we can set it explicitly.
pt_br: Além disso, podemos desejar definir o valor de configuração ``todo_include_todos``. Como observado acima, o padrão é ``False``, mas podemos defini-lo explicitamente.

source: For example:
pt_br: Por exemplo:

source: You can now use the extension throughout your project. For example:
pt_br: Agora você pode usar a extensão em todo o seu projeto. Por exemplo:

source: somefile.rst
pt_br: algumarquivo.rst

source: someotherfile.rst
pt_br: outroarquivo.rst

source: Because we have configured ``todo_include_todos`` to ``False``, we won't actually see anything rendered for the ``todo`` and ``todolist`` directives. However, if we toggle this to true, we will see the output described previously.
pt_br: Como configuramos ``todo_include_todos`` para ``False``, na verdade não veremos nada renderizado para as diretivas ``todo`` e ``todolist``. No entanto, se mudarmos para true, veremos a saída descrita anteriormente.

source: Further reading
pt_br: Leitura adicional

source: For more information, refer to the `docutils`_ documentation and :doc:`/extdev/index`.
pt_br: Para mais informações, consulte a documentação do `docutils`_ e de :doc:`/extdev/index`.
