Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/restructuredtext/directives.po
Languages: pt_br, zh_cn

source: The :dudir:`table` directive serves as optional wrapper of the *grid* and *simple* syntaxes.
pt_br: A diretiva :dudir:`table` serve como sobreposição opcional da sintaxe *grid* e *simple*.
zh_cn: :dudir:`table` 指令用作 *grid* 和 *simple* 语法的可选包装器。

source: They work fine in HTML output, but rendering tables to LaTeX is complex. Check the :confval:`latex_table_style`.
pt_br: Eles funcionam bem na saída HTML, mas renderizar tabelas para LaTeX é complexo. Confira o :confval:`latex_table_style`.
zh_cn: 它们在HTML输出中工作良好，但将表格渲染为LaTeX很复杂。请检查 :confval:`latex_table_style` 。

source: Merged cells (multi-row, multi-column, both) from grid tables containing complex contents such as multiple paragraphs, blockquotes, lists, literal blocks, will render correctly to LaTeX output.
pt_br: Células mescladas (várias linhas, múltiplas colunas, ambas) de tabelas de grade contendo conteúdos complexos, como vários parágrafos, citações em bloco, listas, blocos literais, serão renderizadas corretamente na saída LaTeX.
zh_cn: 包含多个段落、块引用、列表、文字块等复杂内容的网格表中的合并单元格（多行、多列、两者）将正确渲染为LaTeX输出。

source: The partial support of the LaTeX builder for nesting a table in another has been extended. Formerly Sphinx would raise an error if ``longtable`` class was specified for a table containing a nested table, and some cases would not raise an error at Sphinx level but fail at LaTeX level during PDF build. This is a complex topic in LaTeX rendering and the output can sometimes be improved via the :rst:dir:`tabularcolumns` directive.
zh_cn: LaTeX生成器对在另一个表中嵌套表的部分支持得到了扩展。以前，如果为包含嵌套表的表指定了 ``longtable`` 类，Sphinx会引发错误，并且某些情况下不会在Sphinx级别引发错误，但在PDF构建期间会在LaTeX级别失败。这是LaTeX渲染中的一个复杂主题，有时可以通过 :rst:dir:`tabularcolumns` 指令来改进输出。

source: This directive influences only the LaTeX output, and only for the next table in source. The mandatory argument is a column specification (known as an "alignment preamble" in LaTeX idiom). Please refer to a LaTeX documentation, such as the `wiki page`_, for basics of such a column specification.
zh_cn: 此指令只影响LaTeX输出，并且仅适用于源文件中的下一个表。强制参数是列规范（在LaTeX习语中称为“对齐前导”）。有关此类列规范的基础知识，请参阅LaTeX文档，例如 `wiki page`_ 。

source: Sphinx renders tables with at most 30 rows using ``tabulary`` (or ``tabular`` if at least one cell contains either a code-block or a nested table), and those with more rows with ``longtable``. The advantage of using ``tabulary`` is that it tries to compute automatically (internally to LaTeX) suitable column widths.
zh_cn: Sphinx使用 ``tabulary`` （如果至少有一个单元格包含代码块或嵌套表，则使用 ``tabular``）渲染最多30行的表，并使用 ``longtable`` 渲染更多行的表。使用 ``tabulary`` 的优点是它尝试自动计算（在LaTeX内部）合适的列宽。

source: The ``tabulary`` algorithm often works well, but in some cases when a cell contains long paragraphs, the column will be given a large width and other columns whose cells contain only single words may end up too narrow. The :rst:dir:`tabularcolumns` can help solve this via providing to LaTeX a custom "alignment preamble" (aka "colspec"). For example ``lJJ`` will be suitable for a three-columns table whose first column contains only single words and the other two have cells with long paragraphs.
zh_cn: ``tabulary`` 算法通常效果很好，但在某些情况下，当单元格包含长段落时，该列将被赋予较大的宽度，而其他单元格仅包含单个单词的列可能会变得过窄。 :rst:dir:`tabularcolumns` 可以通过向LaTeX提供自定义的“alignment preamble”（又名“colspec”）来帮助解决这个问题。

source: Of course, a fully automated solution would be better, and it is still hoped for, but it is an intrinsic aspect of ``tabulary``, and the latter is in use by Sphinx ever since ``0.3``... It looks as if solving the problem of squeezed columns could require substantial changes to that LaTeX package. And no good alternative appears to exist, as of 2025.
zh_cn: 当然，完全自动化的解决方案会更好，并且仍然被寄予厚望，但这是 ``tabulary`` 的一个内在方面，而Sphinx自 ``0.3`` 以来一直在使用它……看起来解决挤压列的问题可能需要对LaTeX包进行重大更改。截至2025年，没有出现好的替代方案。

source: A way to solve the issue for all tables at once, is to inject in the LaTeX preamble (see :confval:`latex_elements`) a command such as ``\setlength{\tymin}{1cm}`` which causes all columns to be at least ``1cm`` wide (not counting inter-column whitespace). Currently, Sphinx configures ``\tymin`` to allow room for three characters at least.
zh_cn: 解决所有表格问题的一种方法是向LaTeX序言中注入命令（参见 :confval:`latex_elements`），例如 ``\setlength{\tymin}{1cm}``，这会导致所有列至少宽 ``1cm`` （不包括列间空白）。目前，Sphinx将 ``\tymin`` 配置为至少留出三个字符的空间。

source: Here is a more sophisticated "colspec", for a 4-columns table:
zh_cn: 这里是一个更复杂的“colspec”，用于4列表格：

source: This is used in Sphinx own PDF docs at :ref:`dev-deprecated-apis`. Regarding column widths, this "colspec" achieves the same as would ``:widths:`` option set to ``40 10 12 38`` but it injects extra effects.
zh_cn: 这在Sphinx自己的PDF文档中使用，见 :ref:`dev-deprecated-apis` 。关于列宽，这个“colspec”实现了与 ``:widths:`` 选项设置为 ``40 10 12 38`` 相同的效果，但它注入了额外的效果。

source: In case both :rst:dir:`tabularcolumns` and ``:widths:`` option of table directives are used, ``:widths:`` option will be ignored by the LaTeX builder. Of course it is obeyed by other builders.
zh_cn: 如果同时使用了 :rst:dir:`tabularcolumns` 和表指令的 ``:widths:`` 选项，``:widths:`` 选项将被LaTeX生成器忽略。当然，其他构建器会遵守它。

source: Literal blocks do not work at all with ``tabulary`` and Sphinx will then fall back to ``tabular`` LaTeX environment. It will employ the :rst:dir:`tabularcolumns` specification in that case only if it contains no usage of the ``tabulary`` specific column types (which are ``L``, ``R``, ``C`` and ``J``).
zh_cn: 文字块根本无法与 ``tabulary`` 一起使用，Sphinx将回退到 ``tabular`` LaTeX环境。只有当它不包含使用 ``tabulary`` 特定的列类型（即 ``L``、``R``、``C`` 和 ``J``）时，才会在这种情况下使用 :rst:dir:`tabularcolumns` 规范。

source: Besides the LaTeX ``l``, ``r``, ``c`` and ``p{width}`` column specifiers, and the ``tabulary`` specific ``L``, ``R``, ``C`` and ``J``, one can also use (with all table types) ``\X{a}{b}`` which configures the column width to be a fraction ``a/b`` of the total line width and ``\Y{f}`` where ``f`` is a decimal: for example ``\Y{0.2}`` means that the column will occupy ``0.2`` times the line width.
zh_cn: 除了LaTeX的 ``l``、``r``、``c`` 和 ``p{width}`` 列说明符，以及 ``tabulary`` 特定的 ``L``、``R``、``C`` 和 ``J`` 之外，还可以使用（所有表类型） ``\X{a}{b}``，它将列宽配置为总行宽的 ``a/b`` 分数，以及 ``\Y{f}``，其中 ``f`` 是小数：例如 ``\Y{0.2}`` 意味着该列将占用行宽的 ``0.2`` 倍。

source: Sphinx uses ``J`` (justified) by default with ``tabulary``, not ``L`` (flushed-left). To revert, include ``\newcolumntype{T}{L}`` in the LaTeX preamble, as in fact Sphinx uses ``T`` and sets it by default to be an alias of ``J``.
zh_cn: Sphinx默认使用 ``tabulary`` 中的 ``J`` （对齐），而不是 ``L`` （左对齐）。要恢复，请在LaTeX序言中包含 ``\newcolumntype{T}{L}``，因为Sphinx实际上使用 ``T`` 并将其默认设置为 ``J`` 的别名。

source: Formerly, Sphinx did not use ``tabulary`` if the table had at least one cell containing "problematic" elements such as lists, object descriptions, blockquotes (etc...) because such contents are not out-of-the-box compatible with ``tabulary``. At ``9.0`` a technique, which was already in use for merged cells, was extended to such cases, and the sole "problematic" contents are code-blocks and nested tables. So tables containing (only) cells with multiple paragraphs, bullet or enumerated lists, or line blocks, will now better fit to their contents (if not rendered by ``longtable``). Cells with object descriptions or admonitions will still have a tendency to induce the table to fill the full text area width, but columns in that table with no such contents will be tighter.
zh_cn: 以前，如果表格中至少有一个单元格包含列表、对象描述、块引用（等等...）等“有问题”的元素，因为这些内容与 ``tabulary`` 不兼容，所以Sphinx不会使用 ``tabulary`` 。在 ``9.0`` 中，一种已经用于合并单元格的技术被扩展到这种情况，唯一的“有问题”的内容是代码块和嵌套表。因此，包含（仅）具有多个段落、项目符号或枚举列表或行块的单元格的表格现在将更好地适应其内容（如果不是由 ``longtable`` 渲染）。具有对象描述或警告的单元格仍然倾向于使表格填满整个文本区域宽度，但该表格中没有此类内容的列将更紧凑。

source: To force usage of the LaTeX ``longtable`` environment pass ``longtable`` as a ``:class:`` option to :dudir:`table`, :dudir:`csv-table`, or :dudir:`list-table`. Use :ref:`rst-class <rstclass>` for other tables.
pt_br: Para forçar o uso do ambiente LaTeX ``longtable``,. passe ``longtable`` como uma opção ``:class:`` para :dudir:`table`, :dudir:`csv-table` ou :dudir:`list-table`. Use :ref:`rst-class <rstclass>` para outras tabelas.
zh_cn: 要强制使用LaTeX ``longtable`` 环境，请将 ``longtable`` 作为 ``:class:`` 选项传递给 :dudir:`table`、:dudir:`csv-table` 或 :dudir:`list-table`。其他表格请使用 :ref:`rst-class <rstclass>` 。

source: Math
pt_br: Mathemática
zh_cn: 数学

source: The input language for mathematics is LaTeX markup. This is the de-facto standard for plain-text math notation and has the added advantage that no further translation is necessary when building LaTeX output.
pt_br: A linguagem de entrada para matemática é marcação LaTeX. É de fato um padrão para notação matemática em texto simples e possui a vantagem de não precisar de tradução adicional para saída LaTeX.
zh_cn: 数学的输入语言是LaTeX标记。这是纯文本数学表示法的事实标准，而且还有一个优点，即在构建LaTeX输出时不需要进一步的翻译。

source: Keep in mind that when you put math markup in **Python docstrings** read by :mod:`autodoc <sphinx.ext.autodoc>`, you either have to double all backslashes, or use Python raw strings (``r"raw"``).
pt_br: Lembre-se quando introduzir simbolos matemáticos em **Python docstrings** lidas por :mod:`autodoc <sphinx.ext.autodoc>`, deve usar ou duplas barras invertidas ou usar string Python do tipo raw (``r"raw"``).
zh_cn: 请记住，当您将数学标记放在被 :mod:`autodoc <sphinx.ext.autodoc>` 读取的 **Python docstrings** 中时要么必须将所有反斜杠加倍，要么使用Python原始字符串（``r"raw"``）。

source: Directive for displayed math (math that takes the whole line for itself).
pt_br: Diretiva para math exibida (math controla toda a linha por si).
zh_cn: 指示显示的数学（取整行为自己的数学）。

source: The directive supports multiple equations, which should be separated by a blank line::
pt_br: A diretiva suporta múltiplas equações, que devem estar separadas por linhas em branco::
zh_cn: 指令支持多个方程式，这些方程式应该用空行分隔：

source: In addition, each single equation is set within a ``split`` environment, which means that you can have multiple aligned lines in an equation, aligned at ``&`` and separated by ``\\``::
pt_br: Adicionalmente, cada simples equação é configurada com ambiente ``split``, que significa que deve haver múltiplas linhas alinhadas na equação, alinhada em ``&`` e separada por ``\\``::
zh_cn: 此外，每个等式都是在一个“split”环境中设置的，这意味着您可以在一个等式中有多条对齐的直线，以“&amp;”对齐，并用“\\”分隔：

source: For more details, look into the documentation of the `AmSMath LaTeX package`_.
pt_br: Para maiores detalhes, veja a documentação em `AmSMath LaTeX package`_.
zh_cn: 有关详细信息，请参阅 `AmSMath LaTeX package`_ 的文档。

source: When the math is only one line of text, it can also be given as a directive argument::
pt_br: Quando math é somente uma linha de texto, também pode ser usada como argumento de diretiva::
zh_cn: 当数学只有一行文本时，它也可以作为一个指令参数：

source: Normally, equations are not numbered. If you want your equation to get a number, use the ``label`` option. When given, it selects an internal label for the equation, by which it can be cross-referenced, and causes an equation number to be issued. See :rst:role:`eq` for an example. The numbering style depends on the output format.
pt_br: Normalmente equações não são numeradas. Se desejar que as equações tenham um número, usar opção ``label``. Quando utilizada, irá ser escolhido um rótulo interno para a equação, através do qual poderá ser referenciada e vai causar o uso de número de equação. Ver :rst:role:`eq` para exemplo. O estilo de numeração depende do formato de saída.
zh_cn: 通常情况下，方程式不编号。如果你想让你的方程式得到一个数字，使用 ``标签`` 选项。当给定时，它将为表达式选择一个内部标签，通过该标签可以交叉引用，并生成一个表达式编号。参见 :rst:role:`eq` 为例。编号样式取决于输出格式。

source: Prevent wrapping of the given math in a math environment. When you give this option, you must make sure yourself that the math is properly set up. For example::
pt_br: Evita qualquer quebra no ambiente math. Quando usar essa opção, certifique-se que math está configurada corretamente. Por exemplo::
zh_cn: 防止在数学环境中换行给定的数学。当您提供此选项时，您必须自己确保数学正确设置。例如：

source: The directive option ``:nowrap:`` was renamed to ``:no-wrap:``.
zh_cn: 指令选项 ``:nowrap:`` 已重命名为 ``:no-wrap:``。

source: The previous name has been retained as an alias, but will be deprecated and removed in a future version of Sphinx.
zh_cn: 以前的名称已作为别名保留，但将在Sphinx的未来版本中弃用和删除。

source: Rendering options for math with HTML builders.
pt_br: Opções de renderização para matemática com construtores HTML.
zh_cn: 用HTML生成器呈现数学选项。

source: Explains how to configure LaTeX builder to support Unicode literals in math mark-up.
pt_br: Explica como configurar o construtor LaTeX para oferecer suporte a literais Unicode na marcação matemática.
zh_cn: 说明如何配置LaTeX builder以在数学标记中支持Unicode文本。

source: Grammar production displays
pt_br: Exibições de produção gramatical
zh_cn: 语法生成显示

source: Special markup is available for displaying the productions of a formal grammar. The markup is simple and does not attempt to model all aspects of BNF_ (or any derived forms), but provides enough to allow context-free grammars to be displayed in a way that causes uses of a symbol to be rendered as hyperlinks to the definition of the symbol. There is this directive:
zh_cn: 提供了特殊的标记来显示形式语法的生成。该标记很简单，并不试图模拟 BNF_ （或任何派生形式）的所有方面，但提供了足够的内容来允许以符号的使用方式显示上下文无关的语法，以便将符号的使用呈现为指向该符号定义的超链接。有以下指令：

source: This directive is used to enclose a group of productions. Each production is given on a single line and consists of a name, separated by a colon from the following definition. If the definition spans multiple lines, each continuation line must begin with a colon placed at the same column as in the first line. Blank lines are not allowed within ``productionlist`` directive arguments.
zh_cn: 此指令用于封闭一组生成。每个生成都在单独的一行上给出，并由冒号分隔名称和后续定义。如果定义跨越多行，则每个续行必须以与第一行相同的列处放置的冒号开头。在 ``productionlist`` 指令参数中不允许有空行。

source: The optional *production_group* directive argument serves to distinguish different sets of production lists that belong to different grammars. Multiple production lists with the same *production_group* thus define rules in the same scope. This can also be used to split the description of a long or complex grammar across multiple ``productionlist`` directives with the same *production_group*.
zh_cn: 可选的 *production_group* 指令参数用于区分属于不同语法的不同生成列表集。因此，具有相同 *production_group* 的多个生成列表在同一范围内定义规则。这也可用于将长或复杂语法的描述拆分为多个具有相同 *production_group* 的 ``productionlist`` 指令。

source: The definition can contain token names which are marked as interpreted text, (e.g. "``sum ::= `integer` "+" `integer```"), to generate cross-references to the productions of these tokens. Such cross-references implicitly refer to productions from the current group. To reference a production from another grammar, the token name must be prefixed with the group name and a colon, e.g. "``other-group:sum``". If the group of the token should not be shown in the production, it can be prefixed by a tilde, e.g., "``~other-group:sum``". To refer to a production from an unnamed grammar, the token should be prefixed by a colon, e.g., "``:sum``". No further reStructuredText parsing is done in the production, so that special characters (``*``, ``|``, etc) do not need to be escaped.
zh_cn: 定义可以包含标记为解释文本的标记名称（例如"``sum ::= `integer` "+" `integer```"），以生成对这些标记生成的交叉引用。此类交叉引用隐式引用来自当前组的生成。要引用来自另一个语法的生成，标记名称必须以组名称和冒号为前缀，例如“``other-group:sum``”。如果不应在生成中显示标记的组，则可以在其前面加上波浪号，例如“``~other-group:sum``”。要引用来自未命名语法的生成，标记应以冒号为前缀，例如“``:sum``”。在生成中不进行进一步的reStructuredText解析，因此不需要转义特殊字符（``*``、``|`` 等）。

source: Token productions can be cross-referenced outwith the production list by using the :rst:role:`token` role. If you have used a *production_group* argument, the token name must be prefixed with the group name and a colon, e.g., "``my_group:sum``" instead of just "``sum``". Standard :ref:`cross-referencing modifiers <xref-modifiers>` may be used with the ``:token:`` role, such as custom link text and suppressing the group name with a tilde (``~``).
zh_cn: 可以使用 :rst:role:`token` 角色在生成列表之外交叉引用标记生成。如果您使用了 *production_group* 参数，则标记名称必须以组名称和冒号为前缀，例如“``my_group:sum``”而不是仅“``sum``”。可以使用标准的 :ref:`cross-referencing modifiers <xref-modifiers>` 与 ``:token:`` 角色，例如自定义链接文本和使用波浪号（``~``）抑制组名称。

source: The following is an example taken from the Python Reference Manual::
pt_br: A seguir está um exemplo retirado do Manual de Referência do Python::
zh_cn: 以下是摘自《Python参考手册》的示例：

source: Footnotes
pt_br: Notas de Rodapé
zh_cn: 脚注

source: The LaTeX writer only refers the ``maxdepth`` option of first toctree directive in the document.
pt_br: O construtor LaTeX só usa a opção ``maxdepth`` para a primeira diretiva toctree do documento.
zh_cn: LaTeX编写器只引用文档中第一个toctree指令的 ``maxdepth`` 选项。

source: A note on available globbing syntax: you can use the standard shell constructs ``*``, ``?``, ``[...]`` and ``[!...]`` with the feature that these all don't match slashes. A double star ``**`` can be used to match any sequence of characters *including* slashes.
pt_br: Anotação sobre sintaxe global disponível: podem ser usadas construções ``*``, ``?``, ``[...]`` e ``[!...]`` com funcionalidade que não combinem com barras. Asterisco duplo ``**`` pode ser usada para combinar com qualquer sequência de caracteres *incluindo* barras.
zh_cn: 关于可用的globbing语法的一点说明：您可以使用标准的shell结构 ``*``，``?``、``[...]`` 和 ``[!...]`` 这些都不匹配斜杠。双星 ``**`` 可用于匹配任何字符序列 *包括* 斜杠。

source: There is a standard ``.. include`` directive, but it raises errors if the file is not found. This one only emits a warning.
pt_br: Existe uma diretiva padrão ``.. include``, mas ela levanta erros se o arquivo não for encontrado. Este apenas emite um aviso.
zh_cn: 有一个标准 ``..include`` 指令，但如果找不到该文件，则会引发错误。这只会发出警告。

source: For most builders name and format are the same. At the moment only builders derived from the html builder distinguish between the builder format and the builder name.
pt_br: Para muitos construtores nome e formato é o mesmo. Atualmente somente os construtores derivados do html podem distinguir entre formato do construtor e nome do construtor.
zh_cn: 对于大多数构建器，名称和格式都是相同的。目前，只有从html构建器派生的构建器才能区分构建器格式和构建器名称。

source: Note that the current builder tag is not available in ``conf.py``, it is only available after the builder is initialized.
pt_br: Note que o construtor atual não possui entrada no ``conf.py``, o construtor só está disponível depois de inicializado.
zh_cn: 请注意，当前的生成器标记在 ``conf.py`` 中不可用，它仅在构建器初始化后可用。

source: Module :py:mod:`zipfile`
pt_br: Módulo :py:mod:`zipfile`

source: Documentation of the :py:mod:`zipfile` standard module.
pt_br: Documentação do módulo padrão :py:mod:`zipfile`.

source: Similar to :rst:dir:`versionadded`, but describes when and what changed in the named feature in some way (new parameters, changed side effects, etc.).
pt_br: Semelhante a :rst:dir:`versionadded`, mas descreve quando e o que mudou no recurso nomeado de alguma forma (novos parâmetros, efeitos colaterais alterados, etc.).

source: Similar to :rst:dir:`versionadded`, but describes when the feature was deprecated. A *brief* explanation can also be given, for example to tell the reader what to use instead.
pt_br: Semelhante a :rst:dir:`versionadded`, mas descreve quando o recurso foi descontinuado. Uma explicação *breve* também pode ser dada, por exemplo, para dizer ao leitor o que usar em vez disso.

source: Similar to :rst:dir:`versionadded`, but describes when the feature was removed. An explanation may be provided to tell the reader what to use instead, or why the feature was removed.
pt_br: Semelhante a :rst:dir:`versionadded`, mas descreve quando o recurso foi removido. Uma explicação pode ser fornecida para dizer ao leitor o que usar ou por que o recurso foi removido.

source: single
pt_br: simples

source: pair
pt_br: par

source: triple
pt_br: triplo

source: see
pt_br: ver

source: seealso
pt_br: ver também

source: module, keyword, operator, object, exception, statement, builtin
pt_br: módulo, palavra chave, operador, objeto, exceção, comando, função interna

source: This directive influences only the LaTeX output for the next table in source. The mandatory argument is a column specification (known as an "alignment preamble" in LaTeX idiom). Please refer to a LaTeX documentation, such as the `wiki page`_, for basics of such a column specification.
pt_br: Esta diretiva influencia apenas a saída do LaTeX para a próxima tabela no código-fonte. O argumento obrigatório é uma especificação de coluna (conhecida como "preâmbulo de alinhamento" no idioma LaTeX). Por favor, consulte a documentação do LaTeX, como a `página wiki`_, para obter informações básicas sobre essa especificação de coluna.

source: :rst:dir:`tabularcolumns` conflicts with ``:widths:`` option of table directives. If both are specified, ``:widths:`` option will be ignored.
pt_br: :rst:dir:`tabularcolumns` entra em conflito com a opção ``:widths:`` das diretivas de tabela. Se ambos forem especificados, a opção ``:widths:`` será ignorada.

source: Sphinx will render tables with more than 30 rows with ``longtable``. Besides the ``l``, ``r``, ``c`` and ``p{width}`` column specifiers, one can also use ``\X{a}{b}`` (new in version 1.5) which configures the column width to be a fraction ``a/b`` of the total line width and ``\Y{f}`` (new in version 1.6) where ``f`` is a decimal: for example ``\Y{0.2}`` means that the column will occupy ``0.2`` times the line width.
pt_br: O Sphinx irá renderizar tabelas com mais de 30 linhas com ``longtable``. Além dos especificadores de colunas ``l``, ``r``, ``c`` e ``p{width}``, também é possível usar ``\X{a}{b}`` (novo no versão 1.5) que configura a largura da coluna como uma fração ``a/b`` da largura total da linha e ``\Y{f}`` (novo na versão 1.6) onde ``f`` é um decimal: por exemplo ``\Y{0.2}`` significa que a coluna ocupará ``0.2`` vezes a largura da linha.

source: When this directive is used for a table with at most 30 rows, Sphinx will render it with ``tabulary``. One can then use specific column types ``L`` (left), ``R`` (right), ``C`` (centered) and ``J`` (justified). They have the effect of a ``p{width}`` (i.e. each cell is a LaTeX ``\parbox``) with the specified internal text alignment and an automatically computed ``width``.
pt_br: Quando esta diretiva é usada para uma tabela com no máximo 30 linhas, o Sphinx irá renderizá-la com ``tabulary``. Pode-se então usar tipos de colunas específicos ``L`` (esquerda), ``R`` (direita), ``C`` (centralizado) e ``J`` (justificado). Eles têm o efeito de um ``p{width}`` (ou seja, cada célula é um LaTeX ``\parbox``) com o alinhamento interno do texto especificado e uma ``width`` calculada automaticamente.

source: Cells that contain list-like elements such as object descriptions, blockquotes or any kind of lists are not compatible with the ``LRCJ`` column types. The column type must then be some ``p{width}`` with an explicit ``width`` (or ``\X{a}{b}`` or ``\Y{f}``).
pt_br: Células que contêm elementos semelhantes a listas, como descrições de objetos, aspas ou qualquer tipo de lista, não são compatíveis com os tipos de coluna ``LRCJ``. O tipo de coluna deve então ser algum ``p{width}`` com uma ``width`` explícita (ou ``\X{a}{b}`` ou ``\Y{f}``).

source: Literal blocks do not work with ``tabulary`` at all. Sphinx will fall back to ``tabular`` or ``longtable`` environments and generate a suitable column specification.
pt_br: Blocos literais não funcionam com ``tabulary``. O Sphinx retornará aos ambientes ``tabular`` ou ``longtable`` e gerará uma especificação de coluna adequada.

source: In absence of the :rst:dir:`tabularcolumns` directive, and for a table with at most 30 rows and no problematic cells as described in the above warning, Sphinx uses ``tabulary`` and the ``J`` column-type for every column.
pt_br: Na ausência da diretiva :rst:dir:`tabularcolumns`, e para uma tabela com no máximo 30 linhas e sem células problemáticas como descrito no aviso acima, o Sphinx usa ``tabulary`` e o tipo de coluna ``J`` para cada coluna.
