Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/restructuredtext/directives.po
Languages: pt_br, zh_cn

source: Directives
pt_br: Diretivas
zh_cn: 指令

source: :ref:`As previously discussed <rst-directives>`, a directive is a generic block of explicit markup. While Docutils provides a number of directives, Sphinx provides many more and uses directives as one of the primary extension mechanisms.
pt_br: :ref:`Como discutido anteriormente <rst-directives>`, uma diretiva é um bloco genérico de marcação explícita. Enquanto o Docutils fornece várias diretivas, o Sphinx fornece muito mais e usa diretivas como um dos mecanismos de extensão primários.
zh_cn: :ref:`如前所述 <rst-directives>`，指令是显式标记的通用块。Docutils提供了许多指令，而Sphinx提供了更多的指令，并将指令用作主要扩展机制之一。

source: See :doc:`/usage/domains/index` for roles added by domains.
pt_br: Veja :doc:`/usage/domains/index` para papéis adicionados por domínios.
zh_cn: 参见 :doc:`/usage/domains/index` 了解域添加的角色。

source: Refer to the :ref:`reStructuredText Primer <rst-directives>` for an overview of the directives provided by Docutils.
pt_br: Confira o :ref:`Primer de reStructuredText <rst-directives>` para uma visão geral das diretivas fornecidas pelo Docutils.
zh_cn: 参考 :ref:`reStructuredText Primer <rst-directives>` 获取Docutils提供的指令的概述。

source: Table of contents
pt_br: Tabela de conteúdo
zh_cn: 目录

source: Since reStructuredText does not have facilities to interconnect several documents, or split documents into multiple output files, Sphinx uses a custom directive to add relations between the single files the documentation is made of, as well as tables of contents. The ``toctree`` directive is the central element.
pt_br: Como reStructuredText não tem funcionalidades para conectar diversos documentos ou dividir documentos em múltiplos arquivos de saída, Sphinx usa uma diretiva configurada para adicionar relações entre arquivos simples da documentação criada e de tabelas de conteúdos. A diretiva ``toctree`` é um elemento central.
zh_cn: 由于reStructuredText没有将多个文档互连或将文档拆分为多个输出文件的功能，Sphinx使用自定义指令在组成文档的各文件之间添加关系以及目录。 ``toctree`` 指令是核心元素。

source: Simple "inclusion" of one file in another can be done with the :dudir:`include` directive.
pt_br: A simples "inclusão" de um arquivo em outro pode ser feita com a diretiva :dudir:`include`.
zh_cn: 可以使用 :dudir:`include` 指令简单地将一个文件 ``包含`` 到另一个文件中。

source: To create table of contents for current document (.rst file), use the standard reStructuredText :dudir:`contents directive <table-of-contents>`.
pt_br: Para criar um índice para o documento atual (arquivo .rst), use o padrão reStructuredText :dudir:`diretiva de conteúdo <table-of-contents>`.
zh_cn: 要为当前文档（.rst文件）创建目录，请使用标准reStructuredText的 :dudir:`ToC指令 <table-of-contents>`。

source: This directive inserts a "TOC tree" at the current location, using the individual TOCs (including "sub-TOC trees") of the documents given in the directive body. Relative document names (not beginning with a slash) are relative to the document the directive occurs in, absolute names are relative to the source directory. A numeric ``maxdepth`` option may be given to indicate the depth of the tree; by default, all levels are included. [#]_
pt_br: Esta diretiva insere uma "árvore TOC" na localização atual, usando os TOCs individuais (incluindo "árvores subTOC") dos documentos fornecidos no corpo da diretiva. Os nomes de documentos relativos (não começando com uma barra) são relativos ao documento em que a diretiva ocorre, os nomes absolutos são relativos ao diretório fonte. Uma opção numérica ``maxdepth`` pode ser fornecida para indicar a profundidade da árvore; por padrão, todos os níveis são incluídos. [#]_
zh_cn: 本指令在当前位置插入一个“目录树”，使用指令正文中给出的文件的单个目录（包括“子目录树”）。相对文档名（不是以斜杠开头）相对于指令所在的文档，绝对名称相对于源目录。可以提供一个数字的 ``maxdepth`` 选项来指示树的深度；默认情况下，包括所有级别。[#]_

source: The representation of "TOC tree" is changed in each output format. The builders that output multiple files (e.g. HTML) treat it as a collection of hyperlinks. On the other hand, the builders that output a single file (e.g. LaTeX, man page, etc.) replace it with the content of the documents on the TOC tree.
pt_br: A representação da "árvore TOC" é alterada em cada formato de saída. Os construtores que geram vários arquivos (por exemplo, HTML) os tratam como uma coleção de hiperlinks. Por outro lado, os construtores que geram um único arquivo (por exemplo, LaTeX, página man, etc.) substituem-no pelo conteúdo dos documentos na árvore TOC.
zh_cn: “目录树”的表示在每种输出格式中都不同。输出多个文件的构建器（例如HTML）将其视为超链接的集合。另一方面，输出单个文件的构建器（例如LaTeX、手册页等）将其替换为目录树上文档的内容。

source: Consider this example (taken from the Python docs' library reference index)::
pt_br: Considere esse exemplo (obtido da biblioteca da documentação do Python, índice de referência)::
zh_cn: 考虑以下示例（取自Python文档的库引用索引）：：

source: This accomplishes two things:
pt_br: Serve para dois objetivos:
zh_cn: 这可以完成两件事：

source: Tables of contents from all those documents are inserted, with a maximum depth of two, that means one nested heading. ``toctree`` directives in those documents are also taken into account.
pt_br: Tabelas de conteúdos para todos os documentos que forem inseridos, com um nível máximo de profundidade de dois, o que significa um subnível de cabeçalho. Diretivas ``toctree`` nesses documentos também são levadas em conta.
zh_cn: 将插入所有这些文档的目录，最大深度为2，即一个嵌套标题。这些文档中的 ``toctree`` 指令也被考虑在内。

source: Sphinx knows the relative order of the documents ``intro``, ``strings`` and so forth, and it knows that they are children of the shown document, the library index. From this information it generates "next chapter", "previous chapter" and "parent chapter" links.
pt_br: O Sphinx conhece a ordem relativa dos documentos ``intro``, ``strings`` e assim por diante, e sabe que eles são filhos do documento mostrado, o índice da biblioteca. A partir dessas informações, ele gera os links "próximo capítulo", "capítulo anterior" e "capítulo pai".
zh_cn: Sphinx知道文档 ``intro``、 ``strings`` 等的相对顺序，并且知道它们是所显示文档的子级，即库索引。根据这些信息，它生成“下一章”、“上一章”和“父章”链接。

source: **Entries**
pt_br: **Entradas**
zh_cn: **条目**

source: Document titles in the :rst:dir:`toctree` will be automatically read from the title of the referenced document. If that isn't what you want, you can specify an explicit title and target using a similar syntax to reStructuredText hyperlinks (and Sphinx's :ref:`cross-referencing syntax <xref-syntax>`). This looks like::
pt_br: Os títulos dos documentos em :rst:dir:`toctree` serão lidos automaticamente a partir do título do documento referenciado. Se isso não for o que você deseja, você pode especificar um título e alvo explícitos usando uma sintaxe semelhante para hiperlinks de reStructuredText (e :ref:`sintaxe de referência cruzada <xref-syntax>` do Sphinx). Isso se parece com::
zh_cn: :rst:dir:`toctree` 中的文档标题将自动从引用文档的标题中读取。如果这不是您想要的，您可以使用类似于reStructuredText超链接（以及Sphinx的 :ref:`cross-referencing syntax <xref-syntax>`）的语法来指定显式标题和目标。它看起来像这样：：

source: The second line above will link to the ``strings`` document, but will use the title "All about strings" instead of the title of the ``strings`` document.
pt_br: A segunda linha acima terá um link para o documento ``strings``, mas usará o título "All about strings" ao invés do título do documento ``strings``.
zh_cn: 上面的第二行将链接到 ``strings`` 文档，但将使用标题“All about strings”而不是“strings”文档的标题。

source: You can also add external links, by giving an HTTP URL instead of a document name.
pt_br: Você também pode adicionar links externos, fornecendo uma URL HTTP em vez do nome de documento.
zh_cn: 您还可以通过提供HTTP URL而不是文档名来添加外部链接。

source: The special entry name ``self`` stands for the document containing the toctree directive. This is useful if you want to generate a "sitemap" from the toctree.
pt_br: O nome de entrada especial ``self`` representa o documento que contém a diretiva toctree. Isso é útil se você deseja gerar um "sitemap" a partir da toctree.
zh_cn: 特殊条目名 ``self`` 表示包含toctree指令的文档。如果要从目录树生成 ``站点地图``，这很有用。

source: In the end, all documents in the :term:`source directory` (or subdirectories) must occur in some ``toctree`` directive; Sphinx will emit a warning if it finds a file that is not included, because that means that this file will not be reachable through standard navigation.
pt_br: No final, todos os documentos no :term:`diretório fonte` (ou subdiretórios) devem ocorrer em alguma diretiva ``toctree``; O Sphinx emitirá um aviso se encontrar um arquivo que não está incluído, porque isso significa que esse arquivo não será acessível através da navegação padrão.
zh_cn: 最后， :term:`source directory` （或子目录）中的所有文档都必须出现在某个 ``toctree`` 指令中；如果Sphinx发现未包含的文件，则会发出警告，因为这意味着无法通过标准导航访问该文件。

source: Use :confval:`exclude_patterns` to explicitly exclude documents or directories from building completely. Use :ref:`the "orphan" metadata <metadata>` to let a document be built, but notify Sphinx that it is not reachable via a toctree.
pt_br: Usa :confval:`exclude_patterns` para excluir explicitamente documentos ou diretórios da construção completamente. Usa :ref:`os metadados "órfãos" <metadata>` para permitir que um documento seja construído, mas notifica o Sphinx de que não está acessível através de uma toctree.
zh_cn: 使用 :confval:`exclude_patterns` 显式地从生成中排除文档或目录。使用 :ref:`the "orphan" metadata <metadata>` 来构建文档，但通知Sphinx不能通过toctree访问它。

source: The "root document" (selected by :confval:`root_doc`) is the "root" of the TOC tree hierarchy. It can be used as the documentation's main page, or as a "full table of contents" if you don't give a ``:maxdepth:`` option.
pt_br: O "documento raiz" (selecionado por :confval:`root_doc`) é a "raiz" da hierarquia da árvore TOC. Ele pode ser usado como a página principal da documentação ou como um "índice completo" se você não fornecer a opção ``:maxdepth:``.
zh_cn: “根文档”（由 :confval:`root_doc` 选择）是目录树层次结构的“根”。它可以用作文档的主页，或者如果不提供 ``:maxdepth:`` 选项，则用作“完整目录”。

source: Added support for external links and "self" references.
pt_br: Adicionado suporte para links externos e referências a "self".
zh_cn: 添加对外部链接和“self”引用的支持。

source: Options
pt_br: Opções
zh_cn: 选项

source: Assign `class attributes`_. This is a :dudir:`common option <common-options>`. For example::
pt_br: Atribui `atributos de classe`_. Esta é uma :dudir:`opção comum <common-options>`. Por exemplo::
zh_cn: 分配 `class attributes`_。这是一个 :dudir:`common option <common-options>`。例如：

source: An implicit target name that can be referenced using :rst:role:`ref`. This is a :dudir:`common option <common-options>`. For example::
pt_br: Um nome de alvo implícito que pode ser referenciado usando :rst:role:`ref`. Esta é uma :dudir:`opção comum <common-options>`. Por exemplo::
zh_cn: 一个隐式目标名称，可以使用 :rst:role:`ref` 引用。这是一个 :dudir:`common option <common-options>`。例如：

source: Add a caption to the toctree. For example::
pt_br: Adiciona uma legenda ao toctree. Por exemplo::
zh_cn: 为toctree添加标题。例如::

source: If you want to have section numbers even in HTML output, add the ``:numbered:`` option to the *top-level* toctree. For example::
pt_br: Se você quiser ter números de seção mesmo na saída HTML, adicione a opção ``:numbered:`` ao toctree *top-level*. Por exemplo::
zh_cn: 如果您想在HTML输出中也有章节编号，请将 ``:numbered:`` 选项添加到 *顶级* toctree。例如::

source: Section numbering then starts at the heading of ``foo``. Sub-toctrees are automatically numbered (don't give the ``numbered`` flag to those).
pt_br: A numeração de seção então começa no cabeçalho de ``foo``. Sub-toctrees são numeradas automaticamente (não dê o sinalizador ``numbered`` para elas).
zh_cn: 章节编号从 ``foo`` 的标题开始。子目录树会自动编号（不要为这些目录树提供 ``numbered`` 标志）。

source: Numbering up to a specific depth is also possible, by giving the depth as a numeric argument to ``numbered``.
pt_br: Numerar até uma profundidade específica também é possível, dando a profundidade como um argumento numérico para ``numbered``.
zh_cn: 通过将深度作为“numbered”的数字参数，也可以对特定深度进行编号。

source: Added the numeric *depth* argument.
pt_br: Adicionado o argumento numérico *depth*.
zh_cn: 添加了数字 *depth* 参数。

source: Only list document titles, not other headings of the same level. For example::
pt_br: Lista apenas títulos de documentos, não outros títulos do mesmo nível. Por exemplo::
zh_cn: 仅列出文档标题，而不是同一级别的其他标题。例如::

source: Parse glob wildcards in toctree entries. All entries are matched against the list of available documents, and matches are inserted into the list alphabetically. For example::
pt_br: Analisa curingas glob em entradas toctree. Todas as entradas são comparadas com a lista de documentos disponíveis, e as correspondências são inseridas na lista em ordem alfabética. Por exemplo::
zh_cn: 在目录树条目中解析glob通配符。将所有条目与可用文档列表进行匹配，并按字母顺序将匹配项插入列表中。例如::

source: This includes first all documents whose names start with ``intro``, then all documents in the ``recipe`` folder, then all remaining documents (except the one containing the directive, of course.) [#]_
pt_br: Isso inclui primeiro todos os documentos cujos nomes começam com ``intro``, depois todos os documentos na pasta ``recipe`` e, em seguida, todos os documentos restantes (exceto aquele que contém a diretiva, é claro). [#]_
zh_cn: 这首先包括名称以 ``intro`` 开头的所有文档，然后是 ``recipe`` 文件夹中的所有文档，然后是所有剩余的文档（当然，除了包含指令的文档） [#]_

source: Reverse the order of the entries in the list. This is particularly useful when using the ``:glob:`` option.
pt_br: Inverte a ordem das entradas na lista. Isso é particularmente útil ao usar a opção ``:glob:``.
zh_cn: 将列表中的条目顺序反转。这在使用 ``:glob:`` 选项时特别有用。

source: A hidden toctree only defines the document hierarchy. It will not insert links into the document at the location of the directive.
pt_br: Um toctree oculto define apenas a hierarquia do documento. Ele não inserirá links no documento no local da diretiva.
zh_cn: 隐藏的toctree仅定义文档层次结构。它不会在指令的位置将链接插入文档中。

source: This makes sense if you have other means of navigation, e.g. through manual links, HTML sidebar navigation, or if you use the ``:includehidden:`` option on the top-level toctree.
pt_br: Isso faz sentido se você tiver outros meios de navegação, por exemplo, por meio de links manuais, navegação na barra lateral HTML ou se você usar a opção ``:includehidden:`` na toctree de nível superior.
zh_cn: 如果您有其他导航方式，例如通过手动链接、HTML侧边栏导航，或者如果您在顶级toctree上使用 ``:includehidden:`` 选项，这就有意义了。

source: If you want one global table of contents showing the complete document structure, you can add the ``:includehidden:`` option to the *top-level* toctree directive. All other toctrees on child pages can then be made invisible with the ``:hidden:`` option. The top-level toctree with ``:includehidden:`` will then include their entries.
pt_br: Se você quiser uma tabela de conteúdo global mostrando a estrutura completa do documento, você pode adicionar a opção ``:includehidden:`` à diretiva toctree *top-level*. Todas as outras toctrees em páginas filhas podem então ser tornadas invisíveis com a opção ``:hidden:``. A toctree de nível superior com ``:includehidden:`` incluirá então suas entradas.
zh_cn: 如果您想要一个显示完整文档结构的全局目录，可以将 ``:includehidden:`` 选项添加到 *顶级* toctree指令。然后，子页面上的所有其他目录树都可以使用 ``:hidden:`` 选项变得不可见。然后，带有 ``:includehidden:`` 的顶级toctree将包含它们的条目。

source: Special names
pt_br: Nomes especiais
zh_cn: 特殊的名称

source: Sphinx reserves some document names for its own use; you should not try to create documents with these names -- it will cause problems.
pt_br: Sphinx reserva alguns nomes de documentos para seu próprio uso; não tente criar documentos usando esses nomes -- isso irá causar problemas.
zh_cn: Sphinx保留了一些文档名供自己使用；您不应该尝试用这些名称创建文档--这会导致问题。

source: The special document names (and pages generated for them) are:
pt_br: Nomes especiais de documentos (e páginas geradas para eles) são:
zh_cn: 特殊文件名（以及为其生成的页面）为：

source: This is used for the general index, which is populated with entries from :rst:dir:`index` directives and all index-generating :ref:`object descriptions <basic-domain-markup>`. For example, see Sphinx's :ref:`genindex`.
pt_br: Isto é usado para o índice geral, que é preenchido com entradas das diretivas :rst:dir:`index` e todas as :ref:`descrições de objetos <basic-domain-markup>` geradoras de índice. Por exemplo, veja :ref:`genindex` do Sphinx.
zh_cn: 这用于通用索引，其中包含来自 :rst:dir:`index` 指令和所有生成索引的 :ref:`object descriptions <basic-domain-markup>` 的条目。例如，参见Sphinx的 :ref:`genindex`。

source: This is used for the Python module index, which contains one entry per :rst:dir:`py:module` directive. For example, see Sphinx's :ref:`py-modindex`.
pt_br: Isso éusado para o índice de módulo Python contém uma entrada por diretiva :rst:dir:`py:module`. Por exemplo, veja o :ref:`py-modindex` do Sphinx.
zh_cn: 这用于Python模块索引，其中每个 :rst:dir:`py:module` 指令都有一个条目。例如，参见Sphinx的 :ref:`py-modindex`。

source: This is used for the search page, which contains a form that uses the generated JSON search index and JavaScript to full-text search the generated documents for search words; it works on every major browser. For example, see Sphinx's :ref:`search`.
pt_br: Isso éusado para a página de pesquisa, que contém um formulário que usa o índice de pesquisa em JSON gerado e JavaScript para pesquisa de texto inteiro em documentos gerados por palavras da pesquisa; funciona nos diversos navegadores que oferecem suporte a JavaScript moderno. Por exemplo, veja :ref:`search` do Sphinx.
zh_cn: 这用于搜索页面，其中包含一个使用生成的JSON搜索索引和JavaScript的表单，以对生成的文档进行全文搜索；它适用于每个主要浏览器。例如，参见Sphinx的 :ref:`search`。

source: Every name beginning with ``_``
pt_br: Todo nome começando com ``_``
zh_cn: 以 ``_`` 开头的每个名称

source: Though few such names are currently used by Sphinx, you should not create documents or document-containing directories with such names. (Using ``_`` as a prefix for a custom template directory is fine.)
pt_br: Embora poucos desses nomes sejam usados atualmente pelo Sphinx, você não deve criar documentos ou diretórios que contenham documentos com esses nomes. (Usar ``_`` como um prefixo para um diretório de modelo personalizado é adequado.)
zh_cn: 虽然Sphinx目前使用的此类名称很少，但您不应使用此类名称创建文档或包含文档的目录。(将 ``_`` 用作自定义模板目录的前缀是可以的。)

source: Be careful with unusual characters in filenames. Some formats may interpret these characters in unexpected ways:
pt_br: Tenha cuidado com caracteres incomuns em nomes de arquivos. Alguns formatos podem interpretar esses caracteres de maneiras inesperadas:
zh_cn: 在文件名中使用不寻常的字符时要小心。某些格式可能会以意想不到的方式解释这些字符：

source: Do not use the colon ``:`` for HTML based formats. Links to other parts may not work.
pt_br: Não use dois pontos ``:`` para formatos baseados em HTML. Links para outras partes podem não funcionar.
zh_cn: 不要在基于HTML的格式中使用冒号 ``:``。链接到其他部分可能无法工作。

source: Do not use the plus ``+`` for the ePub format. Some resources may not be found.
pt_br: Não use o sinal de mais ``+`` no formato ePub. Alguns recursos podem não ser encontrados.
zh_cn: ePub格式不使用加号 ``+``。某些资源可能找不到。

source: Paragraph-level markup
pt_br: Marcação de nível de parágrafo
zh_cn: 段落级标记

source: These directives create short paragraphs and can be used inside information units as well as normal text.
pt_br: Essas diretivas criam parágrafos curtos e podem ser usadas em unidades de informação interna, bem como em texto normal.
zh_cn: 这些指令创建简短的段落，可以在信息单元内部使用，也可以在普通文本中使用。

source: Admonitions, messages, and warnings
pt_br: Advertências, mensagens e avisos
zh_cn: Admonitions、messages和warnings

source: The admonition directives create 'admonition' elements, a standardised system of communicating different types of information, from a helpful :rst:dir:`tip` to matters of paramount :rst:dir:`danger`. These directives can be used anywhere an ordinary body element can, and can contain arbitrary body elements. There are nine specific named admonitions and the generic :rst:dir:`admonition` directive.
pt_br: As diretivas de advertência criam elementos de 'admonition', um sistema padronizado de comunicação de diferentes tipos de informação, de uma :rst:dir:`tip` útil a questões de :rst:dir:`danger` primordial. Essas diretivas podem ser usadas em qualquer lugar que um elemento de corpo comum possa, e podem conter elementos de corpo arbitrários. Há nove advertências específicas nomeadas e a diretiva genérica :rst:dir:`admonition`.
zh_cn: Admonition指令创建“admonition”元素，这是一种标准化的信息传递系统，从有用的 :rst:dir:`tip` 到至关重要的 :rst:dir:`danger`。这些指令可以在普通正文元素可以使用的任何地方使用，并且可以包含任意正文元素。有九个特定的命名admonitions和通用的 :rst:dir:`admonition` 指令。

source: Information that requires the reader's attention. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pt_br: Informações que exigem a atenção do leitor. O conteúdo da diretiva deve ser escrito em frases completas e incluir toda a pontuação apropriada.
zh_cn: 需要读者注意的信息。指令的内容应以完整的句子编写，并包含所有适当的标点符号。

source: Example:
pt_br: Exemplo:
zh_cn: 举例如下：

source: Please may I have your attention.
pt_br: Por favor, posso ter sua atenção?
zh_cn: 请问我可以引起您的注意吗。

source: Information with regard to which the reader should exercise care. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pt_br: Informações com às quais o leitor deve ter cuidado. O conteúdo da diretiva deve ser escrito em frases completas e incluir toda a pontuação apropriada.
zh_cn: 有关读者应谨慎行事的信息。指令的内容应以完整的句子编写，并包含所有适当的标点符号。

source: Exercise due caution.
pt_br: Tenha o devido cuidado.
zh_cn: 请谨慎行事。

source: Information which may lead to near and present danger if not heeded. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pt_br: Informações que podem levar a perigo próximo e presente se não forem atendidas. O conteúdo da diretiva deve ser escrito em frases completas e incluir toda a pontuação apropriada.
zh_cn: 如果不注意，可能会导致近在咫尺的危险的信息。指令的内容应以完整的句子编写，并包含所有适当的标点符号。

source: Let none think to fly the danger for soon or late love is his own avenger.
pt_br: Que ninguém pense em fugir do perigo, pois cedo ou tarde o amor é seu próprio vingador.
zh_cn: 不要认为可以逃避危险，因为迟早爱情会成为他自己的复仇者。

source: Information relating to failure modes of some description. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pt_br: Informações relacionadas a modos de falha de alguma descrição. O conteúdo da diretiva deve ser escrito em frases completas e incluir toda a pontuação apropriada.
zh_cn: 一些指令的故障模式相关信息。指令的内容应以完整的句子编写，并包含所有适当的标点符号。

source: ERROR 418: I'm a teapot.
zh_cn: ERROR 418：我是一把茶壶。

source: Information that is helpful to the reader. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pt_br: Informações que é útil para o leitor. O conteúdo da diretiva deve ser escrito em frases completas e incluir toda a pontuação apropriada.
zh_cn: 对读者有帮助的信息。指令的内容应以完整的句子编写，并包含所有适当的标点符号。

source: Look under the flowerpot.
pt_br: Veja sob o pote de flor.
zh_cn: 看看花盆下面。

source: Information that is of paramount importance and which the reader must not ignore. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pt_br: Informações que são de suma importância e que o leitor não deve ignorar. O conteúdo da diretiva deve ser escrito em frases completas e incluir toda a pontuação apropriada.
zh_cn: 这是一个至关重要的信息，读者不能忽视。指令的内容应以完整的句子编写，并包含所有适当的标点符号。

source: This is a statement of paramount importance.
pt_br: Esta é uma declaração de suma importância.
zh_cn: 这是一个至关重要的声明。

source: An especially important bit of information that the reader should know. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pt_br: Uma informação especialmente importante que o leitor deve saber. O conteúdo da diretiva deve ser escrito em frases completas e incluir toda a pontuação apropriada.
zh_cn: 读者应该知道的特别重要的信息。指令的内容应以完整的句子编写，并包含所有适当的标点符号。

source: This function is not suitable for sending tins of spam.
pt_br: Esta função não é adequada para enviar latas de presuntos.
zh_cn: 此功能不适合发送垃圾邮件。
