Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/restructuredtext/directives.po
Languages: pt_br, zh_cn

source: Some useful tidbit of information for the reader. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pt_br: Algumas informações úteis para o leitor. O conteúdo da diretiva deve ser escrito em frases completas e incluir toda a pontuação apropriada.
zh_cn: 为读者提供一些有用的信息。指令的内容应以完整的句子编写，并包含所有适当的标点符号。

source: Remember your sun cream!
pt_br: Lembre-se de usar filtro solar!
zh_cn: 记得涂防晒霜！

source: An important bit of information that the reader should be very aware of. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pt_br: Uma informação importante que o leitor deve estar ciente. O conteúdo da diretiva deve ser escrito em frases completas e incluir toda a pontuação apropriada.
zh_cn: 读者应该非常清楚的重要信息。指令的内容应以完整的句子编写，并包含所有适当的标点符号。

source: Beware of the dog.
pt_br: Cuidado com o cachorro.
zh_cn: 当心狗。

source: A generic admonition, with an optional title. The content of the directive should be written in complete sentences and include all appropriate punctuation.
pt_br: Uma advertência genérica, com um título opcional. O conteúdo da diretiva deve ser escrito em frases completas e incluir toda a pontuação apropriada.
zh_cn: 通用admonition，带有可选标题。指令的内容应以完整的句子编写，并包含所有适当的标点符号。

source: This is a title
pt_br: Isso é um título
zh_cn: 这是一个标题

source: This is the content of the admonition.
pt_br: Este é o conteúdo da advertência.
zh_cn: 这是admonition的内容。

source: Many sections include a list of references to module documentation or external documents. These lists are created using the :rst:dir:`seealso` directive.
pt_br: Muitas seções incluem uma lista de referências à documentação do módulo ou documentos externos. Essas listas são criadas usando a diretiva :rst:dir:`seealso`.
zh_cn: 许多部分包括对模块文档或外部文档的参考列表。这些列表是使用 :rst:dir:`seealso` 指令创建的。

source: The :rst:dir:`!seealso` directive is typically placed in a section just before any subsections. The content of the :rst:dir:`seealso` directive should be either a single line or a reStructuredText `definition list`_.
pt_br: A diretiva :rst:dir:`!seealso` é tipicamente colocada em uma seção logo antes de qualquer subseção. O conteúdo da diretiva :rst:dir:`seealso` deve ser uma única linha ou uma `lista de definições`_ reStructuredText.
zh_cn: :rst:dir:`!seealso` 指令通常放置在任何子部分之前的部分中。 :rst:dir:`seealso` 指令的内容应为单行或reStructuredText `definition list`_。

source: Example::
pt_br: Exemplo::
zh_cn: 例如：

source: Python's :py:mod:`zipfile` module
zh_cn: Python的 :py:mod:`zipfile` 模块

source: Documentation of Python's standard :py:mod:`zipfile` module.
zh_cn: Python标准模块 :py:mod:`zipfile` 的文档。

source: `GNU tar manual, Basic Tar Format <https://example.org>`_
pt_br: `Manual do GNU tar, Formato básico do Tar <https://example.org>`_
zh_cn: `GNU tar manual，基本Tar格式 <https://example.org>`_

source: Documentation for tar archive files, including GNU tar extensions.
pt_br: Documentação para arquivos tar, incluindo extensões do GNU tar.
zh_cn: tar归档文件的文档，包括GNU tar扩展。

source: Collapsible text
zh_cn: 可折叠文本

source: Each admonition directive supports a ``:collapsible:`` option, to make the content of the admonition collapsible (where supported by the output format). This can be useful for content that is not always relevant. By default, collapsible admonitions are initially open, but this can be controlled with the ``open`` and ``closed`` arguments to the ``:collapsible:`` option, which change the default state. In output formats that don't support collapsible content, the text is always included. For example:
zh_cn: 每个admonition指令都支持 ``:collapsible:`` 选项，以使admonition的内容可折叠（由输出格式支持）。这对于并非始终相关的内容非常有用。默认情况下，可折叠的admonitions最初是打开的，但可以使用 ``:collapsible:`` 选项的 ``open`` 和 ``closed`` 参数来控制，这会更改默认状态。在不支持可折叠内容的输出格式中，文本始终包含在内。例如：

source: This note is collapsible, and initially open by default.
zh_cn: 此注释是可折叠的，并且默认情况下最初是打开的。

source: Example
zh_cn: 示例

source: This example is collapsible, and initially open.
zh_cn: 这个例子是可折叠的，并且最初是打开的。

source: This hint is collapsible, but initially closed.
zh_cn: 这个提示是可折叠的，但最初是关闭的。

source: Describing changes between versions
pt_br: Descrevendo alterações entre versões
zh_cn: 描述版本之间的变更

source: This directive documents the version of the project which added the described feature. When this applies to an entire module or component, it should be placed at the top of the relevant section before any prose.
pt_br: Esta diretiva documenta a versão do projeto que adicionou o recurso descrito. Quando isso se aplica a todo um módulo ou componente, deve ser colocado no topo da seção relevante antes de qualquer detalhe.
zh_cn: 此指令记录添加所描述功能的项目版本。当这适用于整个模块或组件时，应将其放置在相关部分的顶部，在任何散文之前。

source: The first argument must be given and is the version in question; you can add a second argument consisting of a *brief* explanation of the change.
pt_br: O primeiro argumento deve ser fornecido e é a versão em questão; você pode adicionar um segundo argumento consistindo em uma explicação *breve* da mudança.
zh_cn: 必须给出第一个参数，并且是有问题的版本；您可以添加第二个参数，其中包含对更改的*简要*解释。

source: There must be no blank line between the directive head and the explanation; this is to make these blocks visually continuous in the markup.
pt_br: Não deve haver nenhuma linha em branco entre o cabeçalho da diretiva e a explicação; isso faz com que esses blocos sejam visualmente contínuos na marcação.
zh_cn: 指令头和解释之间不得有空行；这是为了使这些块在标记中在视觉上连续。

source: The :rst:dir:`versionadded` directive was renamed to :rst:dir:`version-added`. The previous name is retained as an alias.
zh_cn: :rst:dir:`versionadded` 指令已重命名为 :rst:dir:`version-added`。以前的名称保留为别名。

source: The *spam* parameter.
pt_br: O parâmetro *spam*.
zh_cn: *spam* 参数。

source: Similar to :rst:dir:`version-added`, but describes when and what changed in the named feature in some way (new parameters, changed side effects, etc.).
zh_cn: 类似于 :rst:dir:`version-added`，但描述了命名功能以某种方式更改的时间和内容（新参数、更改的副作用等）。

source: The :rst:dir:`versionchanged` directive was renamed to :rst:dir:`version-changed`. The previous name is retained as an alias.
zh_cn: :rst:dir:`versionchanged` 指令已重命名为 :rst:dir:`version-changed`。以前的名称保留为别名。

source: The *spam* parameter is now of type *boson*.
pt_br: O parâmetro *spam* agora é do tipo *boson*.
zh_cn: *spam* 参数现在是 *boson* 类型。

source: Similar to :rst:dir:`version-added`, but describes when the feature was deprecated. A *brief* explanation can also be given, for example to tell the reader what to use instead.
zh_cn: 类似于 :rst:dir:`version-added`，但描述了功能何时被弃用。还可以给出 *简要* 解释，例如告诉读者使用什么来代替。

source: The :rst:dir:`deprecated` directive was renamed to :rst:dir:`version-deprecated`. The previous name is retained as an alias
zh_cn: :rst:dir:`deprecated` 指令已重命名为 :rst:dir:`version-deprecated`。以前的名称保留为别名

source: Use :py:func:`!spam` instead.
pt_br: Use :py:func:`!spam`.
zh_cn: 改用 :py:func:`!spam` 。

source: Similar to :rst:dir:`version-added`, but describes when the feature was removed. An explanation may be provided to tell the reader what to use instead, or why the feature was removed.
zh_cn: 类似于 :rst:dir:`version-added`，但描述了功能何时被删除。可以提供解释以告诉读者使用什么来代替，或为什么删除该功能。

source: The :rst:dir:`versionremoved` directive was renamed to :rst:dir:`version-removed`. The previous name is retained as an alias.
zh_cn: :rst:dir:`versionremoved` 指令已重命名为 :rst:dir:`version-removed`。以前的名称保留为别名。

source: The :py:func:`!spam` function is more flexible, and should be used instead.
pt_br: A função :py:func:`!spam` é mais flexível e deve ser usada em seu lugar.
zh_cn: :py:func:`!spam` 函数更灵活，应该改用它。

source: Presentational
pt_br: Apresentação
zh_cn: 展示性的

source: A rubric is like an informal heading that doesn't correspond to the document's structure, i.e. it does not create a table of contents node.
pt_br: Um rubric é como um título informal que não corresponde à estrutura do documento, ou seja, não cria um nó de índice.
zh_cn: rubic就像一个非正式的标题，不对应于文档的结构，即它不会创建目录节点。

source: If the *title* of the rubric is "Footnotes" (or the selected language's equivalent), this rubric is ignored by the LaTeX writer, since it is assumed to only contain footnote definitions and therefore would create an empty heading.
pt_br: Se o *title* da rubrica for "Notas de rodapé" (ou o equivalente do idioma selecionado), esta rubrica é ignorada pelo escritor de LaTeX, pois presume-se que contenha apenas definições de notas de rodapé e, portanto, criaria um título vazio.
zh_cn: 如果rubric的 *标题* 是“脚注”（或所选语言的等价物），则LaTeX编写器将忽略此评估准则，因为它假定仅包含脚注定义，因此会创建一个空标题。

source: Assign `class attributes`_. This is a :dudir:`common option <common-options>`.
pt_br: Atribui `atributos de classe`_. Esta é uma :dudir:`opção comum <common-options>`.
zh_cn: 分配 `class attributes`_。这是一个 :dudir:`common option <common-options>`。

source: An implicit target name that can be referenced using :rst:role:`ref`. This is a :dudir:`common option <common-options>`.
pt_br: Um nome de alvo implícito que pode ser referenciado usando :rst:role:`ref`. Esta é uma :dudir:`opção comum <common-options>`.
zh_cn: 一个隐式目标名称，可以使用 :rst:role:`ref` 引用。这是一个 :dudir:`common option <common-options>`。

source: Use this option to specify the heading level of the rubric. In this case the rubric will be rendered as ``<h1>`` to ``<h6>`` for HTML output, or as the corresponding non-numbered sectioning command for LaTeX (see :confval:`latex_toplevel_sectioning`).
pt_br: Use esta opção para especificar o nível do título do rubric. Neste caso o rubric será renderizado como ``<h1>`` a ``<h6>`` para saída HTML, ou como o comando de seccionamento não numerado correspondente para LaTeX (veja :confval:`latex_toplevel_sectioning`).
zh_cn: 使用此选项指定rubric的标题级别。在这种情况下，rubric将呈现为HTML输出的 ``<h1>`` 到 ``<h6>``，或作为LaTeX的相应非编号分节命令（请参见 :confval:`latex_toplevel_sectioning`）。

source: This directive creates a centered boldfaced line of text.
pt_br: Esta diretiva cria uma linha de texto em negrito centralizada.
zh_cn: 此指令创建一行居中的粗体文本。

source: This presentation-only directive is a legacy from older versions. Use a :ref:`rst-class <rstclass>` directive instead and add an appropriate style.
pt_br: Esta diretiva somente para apresentação é um legado de versões anteriores. Use uma diretiva :ref:`rst-class <rstclass>` ao invés e adicione um estilo apropriado.
zh_cn: 这个仅用于演示的指令是旧版本的遗留。请改用 :ref:`rst-class <rstclass>` 指令并添加适当的样式。

source: This directive must contain a bullet list. It will transform it into a more compact list by either distributing more than one item horizontally, or reducing spacing between items, depending on the builder.
pt_br: Esta diretiva deve conter uma lista com marcadores. Isso a transformará em uma lista mais compacta, distribuindo mais de um item horizontalmente ou reduzindo o espaçamento entre os itens, dependendo do construtor.
zh_cn: 此指令必须包含项目符号列表。它将通过水平分布多个项目或减少项目之间的间距（取决于构建器）将其转换为一个更紧凑的列表。

source: The number of columns; defaults to 2. For example::
pt_br: O número de colunas; o padrão é 2. Por exemplo:
zh_cn: 列数；默认为2。例如::

source: Showing code examples
pt_br: Mostrando exemplos de código
zh_cn: 显示代码示例

source: There are multiple ways to show syntax-highlighted literal code blocks in Sphinx:
pt_br: Existem várias maneiras de mostrar blocos de código literal com destaque de sintaxe no Sphinx:
zh_cn: 有多种方法可以在Sphinx中显示语法高亮的文字代码块：

source: using :ref:`reStructuredText doctest blocks <rst-doctest-blocks>`;
pt_br: usando :ref:`blocos de doctest em reStructuredText <rst-doctest-blocks>`;
zh_cn: 使用 :ref:`reStructuredText doctest blocks <rst-doctest-blocks>`；

source: using :ref:`reStructuredText literal blocks <rst-literal-blocks>`, optionally in combination with the :rst:dir:`highlight` directive;
pt_br: usando :ref:`blocos literais de reStructuredText <rst-literal-blocks>`, opcionalmente em combinação com a diretiva :rst:dir:`highlight`;
zh_cn: 使用 :ref:`reStructuredText literal blocks <rst-literal-blocks>`，可选择与 :rst:dir:`highlight` 指令结合使用；

source: using the :rst:dir:`code-block` directive;
pt_br: usando a diretiva :rst:dir:`code-block`;
zh_cn: 用 :rst:dir:`code-block`；

source: and using the :rst:dir:`literalinclude` directive.
pt_br: e usando a diretiva :rst:dir:`literalinclude`.
zh_cn: 用 :rst:dir:`literalinclude`。

source: Doctest blocks can only be used to show interactive Python sessions, while the remaining three can be used for other languages. Of these three, literal blocks are useful when an entire document, or at least large sections of it, use code blocks with the same syntax and which should be styled in the same manner. On the other hand, the :rst:dir:`code-block` directive makes more sense when you want more fine-tuned control over the styling of each block or when you have a document containing code blocks using multiple varied syntaxes. Finally, the :rst:dir:`literalinclude` directive is useful for including entire code files in your documentation.
pt_br: Os blocos de doctest só podem ser usados ​​para mostrar sessões Python interativas, enquanto os três restantes podem ser usados ​​para outras linguagens. Destes três, os blocos literais são úteis quando um documento inteiro, ou pelo menos grandes seções dele, usa blocos de código com a mesma sintaxe e que devem ser estilizados da mesma maneira. Por outro lado, a diretiva :rst:dir:`code-block` faz mais sentido quando você deseja um controle mais refinado sobre o estilo de cada bloco ou quando você tem um documento contendo blocos de código usando várias sintaxes variadas. Finalmente, a diretiva :rst:dir:`literalinclude` é útil para incluir arquivos de código inteiros em sua documentação.
zh_cn: Doctest块只能用于显示交互式Python会话，而其余三个可以用于其他语言。在这三者中，当整个文档或至少其大部分使用具有相同语法的代码块并且应以相同方式进行样式设置时，文字块非常有用。另一方面，当您想要对每个块的样式进行更精细的控制或当您有一个包含使用多种不同语法的代码块的文档时，使用 :rst:dir:`code-block` 指令更有意义。最后，:rst:dir:`literalinclude` 指令对于在文档中包含整个代码文件非常有用。

source: In all cases, Syntax highlighting is provided by `Pygments <https://pygments.org>`_. When using literal blocks, this is configured using any :rst:dir:`highlight` directives in the source file. When a ``highlight`` directive is encountered, it is used until the next ``highlight`` directive is encountered. If there is no ``highlight`` directive in the file, the global highlighting language is used. This defaults to ``python`` but can be configured using the :confval:`highlight_language` config value. The following values are supported:
pt_br: Em todos os casos, o realce de sintaxe é fornecido por `Pygments <https://pygments.org>`_. Ao usar blocos literais, isso é configurado usando qualquer diretiva :rst:dir:`highlight` no arquivo fonte. Quando uma diretiva ``highlight`` é encontrada, ela é usada até que a próxima diretiva ``highlight`` seja encontrada. Se não houver nenhuma diretiva ``highlight`` no arquivo, a linguagem de realce global será usada. O padrão é ``python``, mas pode ser configurado usando o valor de configuração :confval:`highlight_language`. Os seguintes valores são suportados:
zh_cn: 在所有情况下，语法高亮由 `Pygments <https://pygments.org>`_ 提供。使用文字块时，使用源文件中的任何 :rst:dir:`highlight` 指令进行配置。当遇到 ``highlight`` 指令时，它将被使用，直到遇到下一个 ``highlight`` 指令。如果文件中没有 ``highlight`` 指令，则使用全局高亮语言。默认情况下为 ``python``，但可以使用 :confval:`highlight_language` 配置值进行配置。支持以下值：

source: ``none`` (no highlighting)
pt_br: ``none`` (sem realce)
zh_cn: ``无`` （不突出显示）

source: ``default`` (similar to ``python3`` but with a fallback to ``none`` without warning highlighting fails; the default when :confval:`highlight_language` isn't set)
pt_br: ``default`` (semelhante a ``python3``, mas com um fallback para ``none`` sem aviso o realce falha; o padrão quando :confval:`highlight_language` não está definido)
zh_cn: ``默认`` （类似于 ``python3``，但有一个回退到 ``none``，没有警告高亮显示失败；当 :confval:`highlight_language` 未设置时的默认值)

source: ``guess`` (let Pygments guess the lexer based on contents, only works with certain well-recognizable languages)
pt_br: ``guess`` (deixa Pygments adivinhar o lexador com base no conteúdo, só funciona com certas linguagens bem reconhecíveis)
zh_cn: ``guess`` （让Pygments根据内容猜测lexer，只适用于某些可识别的语言）

source: ... and any other `lexer alias that Pygments supports`__
pt_br: ... e qualquer outro `alias de lexador compatível com Pygments`__
zh_cn: ... 以及其他Pygments支持的lexer别名`_

source: If highlighting with the selected language fails (i.e. Pygments emits an "Error" token), the block is not highlighted in any way.
pt_br: Se o realce com o idioma selecionado falhar (ou seja, o Pygments emitir um token "Error"), o bloco não será realçado de forma alguma.
zh_cn: 如果使用所选语言高亮显示失败（即Pygments发出“错误”标记），则块不会以任何方式高亮显示。

source: The list of lexer aliases supported is tied to the Pygment version. If you want to ensure consistent highlighting, you should fix your version of Pygments.
pt_br: A lista de aliases de lexador suportados está vinculada à versão do Pygment. Se quiser garantir um realce consistente, você deve corrigir sua versão do Pygments.
zh_cn: 支持的lexer别名列表被绑定到加长版本。如果您想确保一致的高亮显示，您应该修正您的Pygments版本。

source: This language is used until the next ``highlight`` directive is encountered. As discussed previously, *language* can be any lexer alias supported by Pygments.
pt_br: Esta linguagem é usada até que a próxima diretiva ``highlight`` seja encontrada. Conforme discutido anteriormente, *language* pode ser qualquer alias de lexador suportado pelo Pygments.
zh_cn: 在遇到下一个 ``highlight`` 指令之前，将使用此语言。如前所述， *language* 可以是Pygments支持的任何lexer别名。

source: Enable to generate line numbers for code blocks.
pt_br: Habilite a geração de números de linha para blocos de código.
zh_cn: 允许为代码块生成行号。

source: This option takes an optional number as threshold parameter. If any threshold given, the directive will produce line numbers only for the code blocks longer than N lines. If not given, line numbers will be produced for all of code blocks.
pt_br: Esta opção utiliza um número opcional como parâmetro de limite. Se for fornecido algum limite, a diretiva produzirá números de linha apenas para os blocos de código maiores que N linhas. Se não for fornecido, os números de linha serão produzidos para todos os blocos de código.
zh_cn: 此选项接受一个可选数字作为阈值参数。如果给定任何阈值，指令将只为超过N行的代码块生成行号。如果没有给出，将为所有代码块生成行号。

source: If given, minor errors on highlighting are ignored.
pt_br: Se fornecido, pequenos erros no realce serão ignorados.
zh_cn: 如果给出，高亮显示的小错误将被忽略。

source: The directive's alias name :rst:dir:`sourcecode` works as well. This directive takes a language name as an argument. It can be `any lexer alias supported by Pygments <https://pygments.org/docs/lexers/>`_. If it is not given, the setting of :rst:dir:`highlight` directive will be used. If not set, :confval:`highlight_language` will be used. To display a code example *inline* within other text, rather than as a separate block, you can use the :rst:role:`code` role instead.
pt_br: O nome alternativo da diretiva :rst:dir:`sourcecode` também funciona. Esta diretiva leva um nome da linguagem como argumento. Pode ser `qualquer alias de lexador suportado por Pygments <https://pygments.org/docs/lexers/>`_. Se não for fornecido, a configuração da diretiva :rst:dir:`highlight` será usada. Se não for definido, :confval:`highlight_language` será usado. Para exibir um exemplo de código *em linha* dentro de outro texto, em vez de como um bloco separado, você pode usar o papel :rst:role:`code`.
zh_cn: :rst:dir:`sourcecode` 指令的别名也可以使用。此指令将语言名称作为参数。它可以是 `Pygments 支持的任何lexer别名 <https://pygments.org/docs/lexers/>`_。如果没有给出，将使用 :rst:dir:`highlight` 指令的设置。如果未设置，将使用 :confval:`highlight_language`。要在其他文本中*内联*显示代码示例，而不是作为单独的块，可以改用 :rst:role:`code` 角色。

source: The ``language`` argument becomes optional.
pt_br: O argumento ``language`` se torna opcional.
zh_cn: “语言”参数变成可选的。

source: Enable to generate line numbers for the code block::
pt_br: Habilite a geração de números de linha para o bloco de código::
zh_cn: 允许为代码块生成行号::

source: Set the first line number of the code block. If present, ``linenos`` option is also automatically activated::
pt_br: Define o número da primeira linha do bloco de código. Se presente, a opção ``linenos`` também é ativada automaticamente::
zh_cn: 设置代码块的第一行号。如果存在，“linenos”选项也会自动激活::

source: Emphasize particular lines of the code block::
pt_br: Enfatiza linhas específicas do bloco de código::
zh_cn: 强调代码块的特定行::

source: LaTeX supports the ``emphasize-lines`` option.
pt_br: LaTeX tem suporte à opção ``emphasize-lines``.
zh_cn: LaTeX支持“强调线”选项。

source: Ignore minor errors on highlighting.
zh_cn: 忽略高亮显示的小错误。

source: Set a caption to the code block.
pt_br: Define uma legenda para o bloco de código.
zh_cn: 为代码块设置标题。

source: Define implicit target name that can be referenced by using :rst:role:`ref`. For example::
pt_br: Define o nome do alvo implícito que pode ser referenciado usando :rst:role:`ref`. Por exemplo::
zh_cn: 定义可以通过使用 :rst:role:`ref` 引用的隐式目标名称。例如::

source: In order to cross-reference a code-block using either the :rst:role:`ref` or the :rst:role:`numref` role, it is necessary that both :strong:`name` and :strong:`caption` be defined. The argument of :strong:`name` can then be given to :rst:role:`numref` to generate the cross-reference. Example::
pt_br: Para fazer referência cruzada de um bloco de código usando o papel :rst:role:`ref` ou :rst:role:`numref`, é necessário que ambos :strong:`name` e :strong:`caption` ser definido. O argumento de :strong:`name` pode então ser dado a :rst:role:`numref` para gerar a referência cruzada. Exemplo::
zh_cn: 为了使用 :rst:role:`ref` 或 :rst:role:`numref` 角色交叉引用代码块，必须定义 :strong:`name` 和 :strong:`caption`。然后，:strong:`name` 的参数可以提供给 :rst:role:`numref` 以生成交叉引用。例如::

source: When using :rst:role:`ref`, it is possible to generate a cross-reference with only :strong:`name` defined, provided an explicit title is given. Example::
pt_br: Ao usar :rst:role:`ref`, é possível gerar uma referência cruzada com apenas :strong:`name` definido, desde que um título explícito seja fornecido. Exemplo::
zh_cn: 使用 :rst:role:`ref` 时，只要定义了 :strong:`name` 并给出了显式标题，就可以生成交叉引用。例如::

source: Strip indentation characters from the code block. When number given, leading N characters are removed. When no argument given, leading spaces are removed via :func:`textwrap.dedent`. For example::
pt_br: Retira os caracteres de recuo do bloco de código. Quando o número é fornecido, os N caracteres iniciais são removidos. Quando nenhum argumento é fornecido, os espaços iniciais são removidos via :func:`textwrap.dedent`. Por exemplo::
zh_cn: 从代码块中删除缩进字符。当给出数字时，删除前导N个字符。当没有给出参数时，通过 :func:`textwrap.dedent` 删除前导空格。例如::

source: Support automatic dedent.
pt_br: Suporte automático a dedent.
zh_cn: 支持自动取消缩进。

source: Longer displays of verbatim text may be included by storing the example text in an external file containing only plain text. The file may be included using the ``literalinclude`` directive. [#]_ For example, to include the Python source file :file:`example.py`, use:
zh_cn: 可以通过将示例文本存储在仅包含纯文本的外部文件中来包含更长的逐字文本显示。可以使用 ``literalinclude`` 指令包含该文件。[#]_ 例如，要包含Python源文件 :file:`example.py`，请使用：

source: The file name is usually relative to the current file's path. However, if it is absolute (starting with ``/``), it is relative to the top source directory.
pt_br: O nome do arquivo geralmente é relativo ao caminho do arquivo atual. No entanto, se for absoluto (começando com ``/``), é relativo ao diretório fonte superior.
zh_cn: 文件名通常相对于当前文件的路径。但是，如果它是绝对的（以 ``/`` 开头），则它是相对于顶级源目录的。

source: General options
zh_cn: 通用选项

source: Add a caption above the included content. If no argument is given, the filename is used as the caption.
zh_cn: 在包含的内容上方添加标题。如果没有给出参数，则使用文件名作为标题。

source: Options for formatting
zh_cn: 格式化选项

source: Strip indentation characters from the included content. When a number is given, the leading N characters are removed. When no argument given, all common leading indentation is removed (using :func:`textwrap.dedent`).
zh_cn: 从包含的内容中删除缩进字符。当给出数字时，删除前导N个字符。当没有给出参数时，删除所有常见的前导缩进（使用 :func:`textwrap.dedent`）。
