Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/restructuredtext/directives.po
Languages: pt_br, zh_cn

source: Expand tabs to N spaces.
zh_cn: 将制表符展开为N个空格。

source: Explicitly specify the encoding of the file. This overwrites the default encoding (UTF-8). For example:
zh_cn: 明确指定文件的编码。这将覆盖默认编码（UTF-8）。例如：

source: Show line numbers alongside the included content. By default, line numbers are counted from 1. This can be changed by the options ``:lineno-start:`` and ``:lineno-match:``.
zh_cn: 在包含的内容旁边显示行号。默认情况下，行号从1开始计数。可以通过选项 ``:lineno-start:`` 和 ``:lineno-match:`` 进行更改。

source: Set line number for the first line to show. If given, this automatically activates ``:linenos:``.
zh_cn: 设置要显示的第一行的行号。如果给出，这将自动激活 ``:linenos:``。

source: When including only parts of a file and show the original line numbers. This is only allowed only when the selection consists of contiguous lines.
zh_cn: 在仅包含文件的某些部分并显示原始行号时。仅当选择由连续行组成时才允许这样做。

source: Emphasise particular lines of the included content. For example:
zh_cn: 强调包含内容的特定行。例如：

source: Select a highlighting language (`Pygments lexer`_) different from the current file's standard language (set by :rst:dir:`highlight` or :confval:`highlight_language`).
zh_cn: 选择与当前文件的标准语言（由 :rst:dir:`highlight` 或 :confval:`highlight_language` 设置）不同的高亮语言（`Pygments lexer`_）。

source: Ignore minor errors in highlighting.
zh_cn: 忽略高亮显示中的小错误。

source: Options for selecting the content to include
zh_cn: 选择要包含的内容的选项

source: For Python files, only include the specified class, function or method:
zh_cn: 对于Python文件，仅包含指定的类、函数或方法：

source: Specify exactly which lines to include::
zh_cn: 指定要包含的确切行::

source: This includes line 1, line 3, lines 5 to 10, and line 20 to the end.
zh_cn: 这包括第1行、第3行、第5行到第10行，以及第20行到末尾。

source: Another way to control which part of the file is included is to use the ``start-after`` and ``end-before`` options (or only one of them). If ``start-after`` is given as a string option, only lines that follow the first line containing that string are included. If ``end-before`` is given as a string option, only lines that precede the first lines containing that string are included. The ``start-at`` and ``end-at`` options behave in a similar way, but the lines containing the matched string are included.
zh_cn: 控制包含文件的哪一部分的另一种方法是使用 ``start-after`` 和 ``end-before`` 选项（或仅其中之一）。如果 ``start-after`` 作为字符串选项给出，则仅包含跟随包含该字符串的第一行的行。如果 ``end-before`` 作为字符串选项给出，则仅包含在包含该字符串的第一行之前的行。 ``start-at`` 和 ``end-at`` 选项的行为类似，但包含匹配字符串的行。

source: ``start-after``/``start-at`` and ``end-before``/``end-at`` can have same string. ``start-after``/``start-at`` filter lines before the line that contains the option string (``start-at`` will keep the line). Then ``end-before``/``end-at`` filter lines after the line that contains the option string (``end-at`` will keep the line and ``end-before`` skip the first line).
zh_cn: ``start-after``/``start-at`` 和 ``end-before``/``end-at`` 可以具有相同的字符串。``start-after``/``start-at`` 过滤包含选项字符串之前的行（``start-at`` 将保留该行）。然后 ``end-before``/``end-at`` 过滤包含选项字符串之后的行（``end-at`` 将保留该行，``end-before`` 跳过第一行）。

source: Added the ``start-after`` and ``end-before`` options.
zh_cn: 添加 ``start after`` 和 ``end before`` 选项。

source: Added the ``start-at``, and ``end-at`` options.
pt_br: Adicionadas as opções ``start-at`` e ``end-at``.
zh_cn: 添加 ``start-at`` 和 ``end-at`` 选项。

source: To only select ``[second-section]`` of an INI file such as the following, use ``:start-at: [second-section]`` and ``:end-before: [third-section]``:
zh_cn: 要仅选择如下INI文件的 ``[second-section]``，请使用 ``:start-at: [second-section]`` 和 ``:end-before: [third-section]``：

source: These options can be useful when working with tag comments. Using ``:start-after: [initialise]`` and ``:end-before: [initialised]`` keeps the lines between between the two comments below:
zh_cn: 当使用标签注释时，这些选项非常有用。使用 ``:start-after: [initialise]`` 和 ``:end-before: [initialised]`` 保留下面两个注释之间的行：

source: When lines have been selected in any of the ways described above, the line numbers in ``emphasize-lines`` refer to these selected lines, counted consecutively starting from 1.
zh_cn: 当以上述任何方式选择了行时，``emphasize-lines`` 中的行号指的是这些选定的行，从1开始连续计数。

source: Prepend a line before the included code. This can be useful for example when highlighting PHP code that doesn't include the ``<?php`` or ``?>`` markers.
zh_cn: 在包含的代码之前添加一行。例如，当突出显示不包含 ``<?php`` 或 ``?>`` 标记的PHP代码时，这非常有用。

source: Append a line after the included code. This can be useful for example when highlighting PHP code that doesn't include the ``<?php`` or ``?>`` markers.
zh_cn: 在包含的代码之后添加一行。例如，当突出显示不包含 ``<?php`` 或 ``?>`` 标记的PHP代码时，这非常有用。

source: Show the diff of two files. For example:
zh_cn: 显示两个文件的差异。例如：

source: This shows the diff between ``example.txt`` and ``example.txt.orig`` with unified diff format.
zh_cn: 这显示了 ``example.txt`` 和 ``example.txt.orig`` 之间的统一diff格式的差异。

source: Added support for absolute filenames.
zh_cn: 添加对绝对文件名的支持。

source: With both ``start-after`` and ``lines`` in use, the first line as per ``start-after`` is considered to be with line number ``1`` for ``lines``.
pt_br: Com ``start-after`` e ``lines`` em uso, a primeira linha de ``start-after`` é considerada como sendo o número de linha ``1`` para ``lines``.
zh_cn: 当“start after”和“lines”同时使用时，根据“start after”的第一行被认为是“lines”的行号“1”。

source: Glossary
pt_br: Glossário
zh_cn: 术语表

source: This directive must contain a reStructuredText definition-list-like markup with terms and definitions. The definitions will then be referenceable with the :rst:role:`term` role. Example::
pt_br: Esta diretiva deve conter uma marcação semelhante a uma lista de definições reStructuredText com termos e definições. As definições serão então referenciáveis ​​com o papel :rst:role:`term`. Exemplo::
zh_cn: 此指令必须包含类似于reStructuredText定义列表的标记，其中包含术语和定义。然后，可以使用 :rst:role:`term` 角色引用这些定义。例如：：

source: In contrast to regular definition lists, *multiple* terms per entry are allowed, and inline markup is allowed in terms. You can link to all of the terms. For example::
pt_br: Em contraste com as listas de definição regulares, são permitidos *múltiplos* termos por entrada e a marcação em linha é permitida em termos. Você pode vincular todos os termos. Por exemplo::
zh_cn: 与常规定义列表不同，每个条目允许*多个*术语，术语中允许使用内联标记。你可以链接到所有的术语。例如：：

source: (When the glossary is sorted, the first term determines the sort order.)
pt_br: (Quando o glossário está ordenado, o primeiro termo determina a ordem de classificação.)
zh_cn: （词汇表排序时，第一个术语决定排序顺序。）

source: If you want to specify "grouping key" for general index entries, you can put a "key" as "term : key". For example::
pt_br: Se você deseja especificar uma "chave de agrupamento" para entradas de índice geral, você pode colocar uma "chave" como "termo : chave". Por exemplo::
zh_cn: 如果要为一般索引项指定“分组键”，可以将“key”作为“term:key”。例如：：

source: Note that "key" is used for grouping key as is. The "key" isn't normalized; key "A" and "a" become different groups. The whole characters in "key" is used instead of a first character; it is used for "Combining Character Sequence" and "Surrogate Pairs" grouping key.
pt_br: Observe que "chave" é usada para agrupar a chave como está. A "chave" não está normalizada; as chaves "A" e "a" tornam-se grupos diferentes. Os caracteres inteiros em "chave" são usados ​​em vez do primeiro caractere; é usado para a chave de agrupamento "Combining Character Sequence" e "Surrogate Pairs".
zh_cn: 注意，“key”用于按原样分组键。“key”没有被规范化；key“A”和“A”成为不同的组。使用“key”中的整个字符而不是第一个字符；它用于“组合字符序列”和“代理项对”分组键。

source: In i18n situation, you can specify "localized term : key" even if original text only have "term" part. In this case, translated "localized term" will be categorized in "key" group.
pt_br: Na situação de i18n, você pode especificar "termo localizado : chave" mesmo que o texto original tenha apenas a parte "termo". Neste caso, o “termo localizado” traduzido será categorizado no grupo “chave”.
zh_cn: 在i18n的情况下，即使原始文本只有“term”部分，也可以指定“localized term:key”。在这种情况下，翻译后的“本地化术语”将归入“关键”组。

source: Now supports multiple terms and inline markup in terms.
pt_br: Agora oferece suporte a vários termos e marcação embutida em termos.
zh_cn: 现在支持多个术语和内联标记。

source: Index key for glossary term should be considered *experimental*.
pt_br: A chave de índice para o termo do glossário deve ser considerada *experimental*.
zh_cn: 术语表术语的索引键应该被认为是*实验性的*。

source: Sort the entries alphabetically.
pt_br: Ordena as entradas alfabeticamente.
zh_cn: 按字母顺序排序条目。

source: In internationalized documentation, sort according to translated terms.
pt_br: Na documentação internacionalizada, ordena de acordo com os termos traduzidos.
zh_cn: 在国际化文档中，根据翻译的术语进行排序。

source: Meta-information markup
pt_br: Marcação Meta-Informação
zh_cn: 元信息标记

source: Identifies the author of the current section. The argument should include the author's name such that it can be used for presentation and email address. The domain name portion of the address should be lower case. Example::
pt_br: Identifica o autor da seção corrente. O argumento deve incluir nome do autor que será usado na apresentação do endereço de email. O nome do domínio deve ser minúsculo. Exemplo::
zh_cn: 标识当前节的作者。参数应包括作者的姓名，以便可以用于演示文稿和电子邮件地址。地址的域名部分应为小写。例子：：

source: By default, this markup isn't reflected in the output in any way (it helps keep track of contributions), but you can set the configuration value :confval:`show_authors` to ``True`` to make them produce a paragraph in the output.
pt_br: Por padrão, essa marcação não é refletida na saída de forma alguma (ela ajuda a acompanhar as contribuições), mas você pode definir o valor de configuração :confval:`show_authors` como ``True`` para fazê-los produzir um parágrafo na saída.
zh_cn: 默认情况下，此标记不会以任何方式反映在输出中（这有助于跟踪贡献），但您可以将配置值 :confval:`show_authors` 设置为 ``True`` 以使它们在输出中生成段落。

source: The :rst:dir:`codeauthor` directive, which can appear multiple times, names the authors of the described code, just like :rst:dir:`sectionauthor` names the author(s) of a piece of documentation. It too only produces output if the :confval:`show_authors` configuration value is ``True``.
pt_br: A diretiva :rst:dir:`codeauthor`, na qual podem aparecer diversas vezes nomes dos autores do código descrito, como nome de autor(es) :rst:dir:`sectionauthor` dos pedaços de documentação. Só haverá saída se o valor de :confval:`show_authors` for ``True``.
zh_cn: 这个 :rst:dir:`codeauthor` 可以出现多次、指定代码的作者，就像 :rst:dir:`sectionauthor` 指定文档片段的作者。它也只在 :confval:`show_authors` 配置值为 ``True`` 时生成输出。

source: Index-generating markup
pt_br: Marcação geração índice
zh_cn: 索引生成标记

source: Sphinx automatically creates index entries from all object descriptions (like functions, classes or attributes) like discussed in :doc:`/usage/domains/index`.
pt_br: O Sphinx cria automaticamente entradas de índice a partir de todas as descrições de objetos (como funções, classes ou atributos) como discutido em :doc:`/usage/domains/index`.
zh_cn: Sphinx会自动从所有对象描述（如函数、类或属性）中创建索引条目，如 :doc:`/usage/domains/index` 中所述。

source: However, there is also explicit markup available, to make the index more comprehensive and enable index entries in documents where information is not mainly contained in information units, such as the language reference.
pt_br: Contudo, também existe marcação disponível, para tornar o índice mais abrangente e habilitar entradas no índice nos documentos onde a informação não está contida nas unidades de informação, como referência ao idioma.
zh_cn: 但是，也可以使用显式标记，使索引更全面，并使索引条目能够在信息单元（如语言引用）中不主要包含在信息单元中的文档中。

source: This directive contains one or more index entries. Each entry consists of a type and a value, separated by a colon.
pt_br: Essa diretiva contem uma ou mais entradas no índice. Cada entrada consiste de um tipo e valor, separado por dois pontos.
zh_cn: 此指令包含一个或多个索引项。每个条目由一个类型和一个值组成，用冒号分隔。

source: For example::
pt_br: Por exemplo::
zh_cn: 例如：

source: This directive contains five entries, which will be converted to entries in the generated index which link to the exact location of the index statement (or, in case of offline media, the corresponding page number).
pt_br: A diretiva contém cinco entradas, as quais serão convertidas em entradas no índice gerado com link exato para o local onde está o comando de indexação (em caso de mídia offline, corresponde ao número da página).
zh_cn: 此指令包含五个条目，将被转换为生成的索引中的条目，这些条目链接到索引语句的确切位置（如果是脱机媒体，则是相应的页码）。

source: Since index directives generate cross-reference targets at their location in the source, it makes sense to put them *before* the thing they refer to -- e.g. a heading, as in the example above.
pt_br: Como diretivas de índice geram alvos de referências-cruzadas em suas localizações no fonte, faz sentido colocar essas *antes* do objeto ao qual se referem. ex: cabeçalho, como no exemplo acima.
zh_cn: 由于索引指令在源代码中的位置生成交叉引用目标，所以将它们放在它们引用的对象（比如标题） *之前* 是有意义的，如上面的示例所示。

source: The possible entry types are:
pt_br: Os tipos de entrada podem ser:
zh_cn: 可能的条目类型有：

source: Creates a single index entry. Can be made a sub-entry by separating the sub-entry text with a semicolon (this notation is also used below to describe what entries are created). Examples:
pt_br: Cria uma única entrada de índice. Pode ser feita uma subentrada separando o texto da subentrada com um ponto e vírgula (esta notação também é usada abaixo para descrever quais entradas são criadas). Exemplos:
zh_cn: 创建单个索引条目。可通过加入分号来制作子条目（此符号也用于下面描述创建的条目）。例如：

source: ``single: execution`` creates an index entry labelled ``execution``.
pt_br: ``single: execution`` cria uma entrada de índice chamada ``execution``.
zh_cn: ``single: execution`` 创建一个标签为 ``execution`` 的索引条目。

source: ``single: execution; context`` creates an sub-entry of ``execution`` labelled ``context``.
pt_br: ``single: execution; context`` cria uma subentrada de ``execution`` chamada ``context``.
zh_cn: ``single: execution; context`` 给 ``execution`` 条目创建一个子条目 ``context``。

source: A shortcut to create two index entries. The pair of values must be separated by a semicolon. Example:
pt_br: Um atalho para criar duas entradas de índice. O par de valores deve ser separado por ponto e vírgula. Exemplo:
zh_cn: 创建两个索引条目的快捷方式。值对必须用分号分隔。例如：

source: This would create two index entries; ``loop; statement`` and ``statement; loop``.
pt_br: Isto criaria duas entradas de índice; ``loop; statement`` e ``statement; loop``.
zh_cn: 创建两个索引条目； ``loop; statement`` 和 ``statement; loop``。

source: A shortcut to create three index entries. All three values must be separated by a semicolon. Example:
pt_br: Um atalho para criar três entradas de índice. Todos os três valores devem ser separados por ponto e vírgula. Exemplo:
zh_cn: 创建三个索引条目的快捷方式。所有三个值必须用分号分隔。例如：

source: This would create three index entries; ``module; search path``, ``search; path, module``, and ``path; module search``.
pt_br: Isto criaria três entradas de índice; ``module; search path``, ``search; path, module`` e ``path; module search``.
zh_cn: 这将创建三个索引条目 ``module; search path``、``search; path, module`` 和 ``path; module search``。

source: A shortcut to create an index entry that refers to another entry. Example:
pt_br: Um atalho para criar uma entrada de índice que se refere a outra entrada. Exemplo:
zh_cn: 一个创建引用另一个条目的索引条目的快捷方式。例如：

source: This would create an index entry referring from ``entry`` to ``other`` (i.e. 'entry': See 'other').
pt_br: Isto criaria uma entrada de índice referente a ``entry`` para ``other`` (ou seja, 'entry': Veja 'other').
zh_cn: 这将创建一个索引条目，从 ``entry`` 引用到 ``other`` （即 ``entry`` ：参见 ``other``）。

source: Like ``see``, but inserts 'see also' instead of 'see'.
pt_br: Como ``see``, mas insere 'see also' em vez de 'see'.
zh_cn: 像 ``see``，但插入“另请参见”而不是“参见”。

source: These **deprecated** shortcuts all create two index entries. For example, ``module: hashlib`` creates the entries ``module; hashlib`` and ``hashlib; module``.
pt_br: Todos esses atalhos **descontinuados** criam duas entradas de índice. Por exemplo, ``module: hashlib`` cria as entradas ``module; hashlib`` e ``hashlib; module``.
zh_cn: 这些 **已弃用** 的快捷方式都创建两个索引条目。例如， ``module: hashlib`` 创建条目 ``module; hashlib`` 和 ``hashlib; module``。

source: These Python-specific entry types are deprecated.
pt_br: Esses tipos de entrada específicos do Python estão descontinuados.
zh_cn: 这些特定于Python的条目类型已被弃用。

source: Removal version set to Sphinx 9.0. Using these entry types will now emit warnings with the ``index`` category.
pt_br: Versão de remoção definida como Sphinx 9.0. Usar esses tipos de entrada agora emitirá avisos com a categoria ``index``.
zh_cn: 删除版本设置为Sphinx 9.0。使用这些条目类型现在将发出带有 ``index`` 类别的警告。

source: You can mark up "main" index entries by prefixing them with an exclamation mark. The references to "main" entries are emphasized in the generated index. For example, if two pages contain ::
pt_br: Marcar entradas no índices "main" através da prefixação com ponto de exclamação "!". Referências as entradas principais são enfatizadas e geradas no índice. Por examplo, se duas páginas contêm::
zh_cn: 您可以用感叹号作为前缀来标记“main”索引项。在生成的索引中强调了对“main”条目的引用。例如，如果两页包含：

source: and one page contains ::
pt_br: e uma página contém::
zh_cn: 其中一页包含：

source: then the backlink to the latter page is emphasized among the three backlinks.
pt_br: então a ligação com outra página é enfatizada dentre a estrutura de links.
zh_cn: 然后在三个反向链接中强调到后一页的反向链接。

source: For index directives containing only "single" entries, there is a shorthand notation::
pt_br: Para diretivas de índice contendo somente entradas "simples", existe uma notação com sintaxe curta::
zh_cn: 对于只包含“单个”项的索引指令，有一种简写的表示法：

source: This creates four index entries.
pt_br: Isso cria quatro entradas no índice.
zh_cn: 这将创建四个索引项。

source: Added ``see`` and ``seealso`` types, as well as marking main entries.
pt_br: Adicionado tipos "ver" e "ver também", bem como marcando entradas principais.
zh_cn: 添加了 ``see`` 和 ``seealso`` 类型，并标记了主条目。

source: While the :rst:dir:`index` directive is a block-level markup and links to the beginning of the next paragraph, there is also a corresponding role that sets the link target directly where it is used.
pt_br: Enquanto a diretiva :rst:dir:`index` é uma marca em nível de bloco e o link aponta para o começo do próximo parágrafo, também uma regra que configura diretamente onde o alvo do link é usado.
zh_cn: 而 :rst:dir:`index` 指令是一个块级标记，链接到下一段的开头，还有一个相应的角色，它直接在使用它的位置设置链接目标。

source: The content of the role can be a simple phrase, which is then kept in the text and used as an index entry. It can also be a combination of text and index entry, styled like with explicit targets of cross-references. In that case, the "target" part can be a full entry as described for the directive above. For example::
pt_br: O contexto da regra pode ser uma simples frase, a qual existe no text e é usada como ponto de entrada. Também pode haver uma combinação do text e entrada no índice, com estilo explícito em referências cruzadas. Nesse caso parte do "alvo" pode ser uma entrada completa como descrito na diretiva acima. Por exemplo::
zh_cn: 角色的内容可以是一个简单的短语，然后保存在文本中并用作索引项。它也可以是文本和索引项的组合，样式类似于显式的交叉引用目标。在这种情况下，“目标”部分可以是上述指令所述的完整条目。例如::

source: Including content based on tags
pt_br: Incluindo conteúdo baseado em tags
zh_cn: 根据tags表达式的值决定是否包含内容

source: Include the content of the directive only if the *expression* is true. The expression should consist of tags, like this::
pt_br: Incluir o conteúdo da diretiva somente se a *expressão* for verdadeira. A expressão deve consistir de marcas, como essa::
zh_cn: 仅当 *expression* 为真时才包含指令的内容。表达式应该由标记组成，如下所示：

source: Undefined tags are false, defined tags are true (tags can be defined via the :option:`--tag <sphinx-build --tag>` command-line option or within :file:`conf.py`, see :ref:`here <conf-tags>`). Boolean expressions (like ``(latex or html) and draft``) are supported and may use parentheses.
pt_br: Tags indefinidas são falsas, tags definidas são verdadeiras (tags podem ser definidas através da opção de linha de comando :option:`--tag <sphinx-build --tag>` ou dentro do :file:`conf.py`, veja :ref:`aqui <conf-tags>`). Expressões booleanas (como ``(latex or html) and draft``) são suportadas e podem usar parênteses.
zh_cn: 未定义的标签为假，定义的标签为真（标签可以通过命令行选项 :option:`--tag <sphinx-build --tag>` 或在 :file:`conf.py` 中定义，见 :ref:`here <conf-tags>`）。支持布尔表达式（如 ``(latex or html) and draft``）并且可以使用括号。

source: The *format* and the *name* of the current builder (``html``, ``latex`` or ``text``) are always set as a tag [#]_. To make the distinction between format and name explicit, they are also added with the prefix ``format_`` and ``builder_``, e.g. the epub builder defines the tags ``html``, ``epub``, ``format_html`` and ``builder_epub``.
pt_br: O *formato* e o *nome* do construtor corrente (``html``, ``latex`` ou ``text``) são sempre configurados com a marca tag [#]_. Para fazer distinção entre formato e o nome explícito, eles são adicionados com o prefixo ``format_`` e ``builder_``, ex: o construtor epub define marcas ``html``, ``epub``, ``format_html`` e ``builder_epub``.
zh_cn: 当前生成器的 *format* 和 *name* （``html``、``latex`` 或 ``text``）始终设置为标记 [#]_ 。为了明确区分格式和名称，还添加了前缀 ``format_`` 和 ``builder_`` ，例如epub builder定义了标记 ``html``、``epub``, ``format_html`` 和 ``builder_epub``。

source: These standard tags are set *after* the configuration file is read, so they are not available there.
pt_br: Essas tags padrões são configuradas *após* o arquivo de configuração ter sido lido, portanto não estão disponíveis lá.
zh_cn: 这些标准标记是在读取配置文件之后设置的，因此它们在那里不可用。

source: All tags must follow the standard Python identifier syntax as set out in the `Identifiers and keywords <https://docs.python.org/3/reference/lexical_analysis.html#identifiers>`_ documentation. That is, a tag expression may only consist of tags that conform to the syntax of Python variables. In ASCII, this consists of the uppercase and lowercase letters ``A`` through ``Z``, the underscore ``_`` and, except for the first character, the digits ``0`` through ``9``.
pt_br: Todas as tags devem seguir a sintaxe de identificador padrão do Python, conforme estabelecido na documentação `Identificadores e palavras-chave <https://docs.python.org/pt-br/3/reference/lexical_analysis.html#identifiers>`_. Ou seja, uma expressão de tag pode consistir apenas em tags que estejam em conformidade com a sintaxe das variáveis ​​Python. Em ASCII, consiste em letras maiúsculas e minúsculas ``A`` a ``Z``, o sublinhado ``_`` e, exceto o primeiro caractere, os dígitos ``0`` a ``9``.
zh_cn: 所有标记都必须遵循 `Identifiers and keywords <https://docs.python.org/3/reference/lexical_analysis.html\identifiers>`_ 文件中规定的标准Python标识符语法。也就是说，标记表达式只能由符合Python变量语法的标记组成。在ASCII中，它由大小写字母 ``A`` 到 ``Z``、下划线 ``_`` 和数字 ``0`` 到 ``9`` 组成，第一个字符除外。

source: Added the name of the builder and the prefixes.
pt_br: Adicionado o nome do construtor e os prefixos.
zh_cn: 添加了构建器的名称和前缀。

source: This directive is designed to control only content of document. It could not control sections, labels and so on.
pt_br: Essa diretiva é desenhada para controlar sómente conteúdo do documento. Não pode controlar seções, rótulos e outros.
zh_cn: 本指令仅用于控制文件的内容。它不能控制分区、标签等。

source: Tables
pt_br: Tabelas
zh_cn: 表格

source: Use :ref:`reStructuredText tables <rst-tables>`, i.e. either
pt_br: Usar :ref:`reStructuredText tables <rst-tables>`, ex. qualquer
zh_cn: 使用 :ref:`reStructuredText tables <rst-tables>`，比如

source: grid table syntax (:duref:`ref <grid-tables>`),
pt_br: grid sintaxe tabela (:duref:`ref <grid-tables>`),
zh_cn: 网格表语法（:duref:`ref <grid-tables>`），

source: simple table syntax (:duref:`ref <simple-tables>`),
pt_br: sintaxe tabela simples (:duref:`ref <simple-tables>`),
zh_cn: 简单表语法（:duref:`ref <simple-tables>`），

source: :dudir:`csv-table` syntax,
pt_br: :dudir:`csv-table` sintaxe,
zh_cn: :dudir:`csv-table` 语法，

source: or :dudir:`list-table` syntax.
pt_br: ou :dudir:`list-table` sintaxe.
zh_cn: 或者 :dudir:`list-table` 语法。
