Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/restructuredtext/directives.po
Languages: pt_br, zh_cn

source: Formerly, the ``L`` column-type was used (text is flushed-left). To revert to this, include ``\newcolumntype{T}{L}`` in the LaTeX preamble, as in fact Sphinx uses ``T`` and sets it by default to be an alias of ``J``.
pt_br: Anteriormente, o tipo de coluna ``L`` era usado (o texto fica alinhado à esquerda). Para reverter isso, inclua ``\newcolumntype{T}{L}`` no preâmbulo do LaTeX, pois na verdade o Sphinx usa ``T`` e o define por padrão como um alias de ``J``.

source: A frequent issue with ``tabulary`` is that columns with little contents appear to be "squeezed". One can add to the LaTeX preamble for example ``\setlength{\tymin}{40pt}`` to ensure a minimal column width of ``40pt``, the ``tabulary`` default of ``10pt`` being too small.
pt_br: Um problema frequente com ``tabulary`` é que colunas com pouco conteúdo parecem estar "comprimidas". Pode-se adicionar ao preâmbulo do LaTeX, por exemplo, ``\setlength{\tymin}{40pt}`` para garantir uma largura mínima de coluna de ``40pt``, sendo o padrão ``tabulary`` de ``10pt`` também pequeno.

source: Special markup is available for displaying the productions of a formal grammar. The markup is simple and does not attempt to model all aspects of BNF (or any derived forms), but provides enough to allow context-free grammars to be displayed in a way that causes uses of a symbol to be rendered as hyperlinks to the definition of the symbol. There is this directive:
pt_br: Marcação especial está disponível para exibir as produções de uma gramática formal. A marcação é simples e não tenta modelar todos os aspectos da BNF (ou quaisquer formas derivadas), mas fornece o suficiente para permitir que gramáticas livres de contexto sejam exibidas de uma forma que faça com que os usos de um símbolo sejam renderizados como hiperlinks para a definição do símbolo. Existe esta diretiva:

source: This directive is used to enclose a group of productions. Each production is given on a single line and consists of a name, separated by a colon from the following definition. If the definition spans multiple lines, each continuation line must begin with a colon placed at the same column as in the first line. Blank lines are not allowed within ``productionlist`` directive arguments.
pt_br: Esta diretiva é usada para incluir um grupo de produções. Cada produção é fornecida em uma única linha e consiste em um nome, separado por dois pontos da definição a seguir. Se a definição abranger várias linhas, cada linha de continuação deverá começar com dois pontos colocados na mesma coluna da primeira linha. Linhas em branco não são permitidas nos argumentos da diretiva ``productionlist``.

source: The definition can contain token names which are marked as interpreted text (e.g., "``sum ::= `integer` "+" `integer```") -- this generates cross-references to the productions of these tokens. Outside of the production list, you can reference to token productions using :rst:role:`token`.
pt_br: A definição pode conter nomes de tokens que são marcados como texto interpretado (por exemplo, "``soma ::= `integer` "+" `integer```") -- isso gera referências cruzadas para as produções desses tokens. Fora da lista de produção, você pode fazer referência a produções de tokens usando :rst:role:`token`.

source: The *productionGroup* argument to :rst:dir:`productionlist` serves to distinguish different sets of production lists that belong to different grammars. Multiple production lists with the same *productionGroup* thus define rules in the same scope.
pt_br: O argumento *productionGroup* para :rst:dir:`productionlist` serve para distinguir diferentes conjuntos de listas de produção que pertencem a diferentes gramáticas. Várias listas de produção com o mesmo *productionGroup* definem, portanto, regras no mesmo escopo.

source: Inside of the production list, tokens implicitly refer to productions from the current group. You can refer to the production of another grammar by prefixing the token with its group name and a colon, e.g, "``otherGroup:sum``". If the group of the token should not be shown in the production, it can be prefixed by a tilde, e.g., "``~otherGroup:sum``". To refer to a production from an unnamed grammar, the token should be prefixed by a colon, e.g., "``:sum``".
pt_br: Dentro da lista de produção, os tokens referem-se implicitamente às produções do grupo atual. Você pode se referir à produção de outra gramática prefixando o token com seu nome de grupo e dois pontos, por exemplo, "``outroGrupo:soma``". Se o grupo do token não deve ser mostrado na produção, ele pode ser prefixado com um til, por exemplo, "``~outroGrupo:soma``". Para se referir a uma produção de uma gramática sem nome, o token deve ser prefixado por dois pontos, por exemplo, "``:soma``".

source: Outside of the production list, if you have given a *productionGroup* argument you must prefix the token name in the cross-reference with the group name and a colon, e.g., "``myGroup:sum``" instead of just "``sum``". If the group should not be shown in the title of the link either an explicit title can be given (e.g., "``myTitle <myGroup:sum>``"), or the target can be prefixed with a tilde (e.g., "``~myGroup:sum``").
pt_br: Fora da lista de produção, se você forneceu um argumento *grupoProdução* você deve prefixar o nome do token na referência cruzada com o nome do grupo e dois pontos, por exemplo, "``meuGrupo:soma``" em vez de apenas "``soma``". Se o grupo não deve ser mostrado no título do link, um título explícito pode ser fornecido (por exemplo, "``meuTítulo <meuGrupo:soma>``") ou o alvo pode ser prefixado com um til (por exemplo, "``~meuGrupo:soma``").

source: Note that no further reStructuredText parsing is done in the production, so that you don't have to escape ``*`` or ``|`` characters.
pt_br: Observe que nenhuma análise adicional de reStructuredText é feita na produção, então você não precisa escapar dos caracteres ``*`` ou ``|``.
