Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/restructuredtext/field-lists.po
Languages: pt_br

source: Field Lists
pt_br: Listas de campos

source: :ref:`As previously discussed <rst-field-lists>`, field lists are sequences of fields marked up like this::
pt_br: :ref:`Como discutido anteriormente <rst-field-lists>`, listas de campos são sequências de campos marcados assim::

source: Sphinx extends standard docutils behavior for field lists and adds some extra functionality that is covered in this section.
pt_br: O Sphinx estende o comportamento padrão do docutils para listas de campos e adiciona algumas funcionalidades extras que são abordadas nesta seção.

source: The values of field lists will be parsed as strings. You cannot use Python collections such as lists or dictionaries.
pt_br: Os valores das listas de campos serão analisados ​​como strings. Você não pode usar coleções do Python, como listas ou dicionários.

source: File-wide metadata
pt_br: Metadados de todo o arquivo

source: A field list near the top of a file is normally parsed by docutils as the *docinfo* and shown on the page. However, in Sphinx, a field list preceding any other markup is moved from the *docinfo* to the Sphinx environment as document metadata, and is not displayed in the output.
pt_br: Uma lista de campos próxima ao topo de um arquivo é normalmente analisada pelo docutils como *docinfo* e mostrada na página. No entanto, no Sphinx, uma lista de campos que precede qualquer outra marcação é movida do *docinfo* para o ambiente Sphinx como metadados do documento e não é exibida na saída.

source: A field list appearing after the document title *will* be part of the *docinfo* as normal and will be displayed in the output.
pt_br: Uma lista de campos que aparece após o título do documento *fará* parte do *docinfo* normalmente e será exibida na saída.

source: Special metadata fields
pt_br: Campos especiais de metadados

source: Sphinx provides custom behavior for bibliographic fields compared to docutils.
pt_br: O Sphinx fornece um comportamento personalizado para campos bibliográficos em comparação com os documentos.

source: At the moment, these metadata fields are recognized:
pt_br: No momento, esses campos metadados são reconhecidos:

source: The maximum depth for a table of contents of this file. ::
pt_br: A profundidade máxima para um índice deste arquivo. ::

source: This metadata affects the depth of the local toctree. But it does not affect the depth of the *global* toctree. So this does not change the sidebar of themes that use the global toctree.
pt_br: Esses metadados afetam a profundidade do toctree local. Mas isso não afeta a profundidade do toctree *global*. Então isso não altera a barra lateral dos temas que utilizam o toctree global.

source: If set, the web application won't display a comment form for a page generated from this source file. ::
pt_br: Se definido, a aplicação web não exibirá um formulário de comentários para uma página gerada a partir desse arquivo fonte. ::

source: If set, warnings about this file not being included in any toctree will be suppressed. ::
pt_br: Se definido, avisos sobre este arquivo não sendo incluído em qualquer ``toctree`` serão suprimidos::

source: Disable full text search for this document.
pt_br: Desabilita pesquisa de texto completo para este documento.

source: The ``:no-search:`` option only disables full text search, meaning that object search will still be available even if ``:no-search:`` is set.
pt_br: A opção ``:no-search:`` desabilita apenas a pesquisa de texto completo, o que significa que a pesquisa de objetos ainda estará disponível mesmo se ``:no-search:`` estiver definido.

source: The file-wide metadata option ``:nosearch:`` was renamed to ``:no-search:``. The previous name has been retained as an alias, but will be deprecated and removed in a future version of Sphinx.
pt_br: A opção de metadados para todo o arquivo ``:nosearch:`` foi renomeada para ``:no-search:``. O nome anterior foi mantido como um apelido, mas será descontinuado e removido em uma versão futura do Sphinx.
