Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/internals/authors.po
Languages: es, fr, zh_cn

source: Sphinx authors
es: Autores de Sphinx
fr: Auteurs de Sphinx
zh_cn: Sphinx 作者

source: Sphinx is written and maintained by Georg Brandl <georg@python.org>.
es: Sphinx es escrito y mantenido por Georg Brandl <georg@python.org>.
fr: Sphinx est écrit et maintenu par Georg Brandl <georg@python.org>.
zh_cn: Sphinx由Georg Brandl <georg@python.org> 编写和维护。

source: Substantial parts of the templates were written by Armin Ronacher <armin.ronacher@active-4.com>.
es: Partes sustanciales de las plantillas fueron escritos por Armin Ronacher <armin.ronacher@active-4.com>.
fr: Des parties substantielles des modèles ont été écrites par Armin Ronacher <armin.ronacher@active-4.com>.
zh_cn: 模板主要由 Armin Ronacher 编写。<armin.ronacher@active-4.com>.

source: Other co-maintainers:
es: Otros co-mantenedores:
fr: Autres coresponsables de la maintenance :
zh_cn: 其他协作维护人员：

source: Alastair Houghton -- Apple Help builder
es: Alastair Houghton -- generador de Apple Help
fr: Alastair Houghton -- Générateur d'aide Apple
zh_cn: Alastair Houghton -- Apple 帮助文档编写者

source: Alexander Todorov -- inheritance_diagram tests and improvements
es: Alexander Todorov -- pruebas inheritance_diagram y mejoras
fr: Alexander Todorov -- tests et améliorations du diagramme_héritage
zh_cn: Alexander Todorov -- 测试并改进了 inheritance_diagram

source: Andi Albrecht -- agogo theme
es: Andi Albrecht -- plantilla agogo
fr: Andi Albrecht -- thème agogo
zh_cn: Andi Albrecht -- 创建 agogo 主题

source: Jakob Lykke Andersen -- Rewritten C++ domain
es: Jakob Lykke Andersen -- Reescrito dominio de C++
fr: Jakob Lykke Andersen -- réécriture du Domaine C++
zh_cn: Jakob Lykke Andersen -- 重写 C++ 域

source: Henrique Bastos -- SVG support for graphviz extension
es: Henrique Bastos -- Soporte SVG para extension graphviz
fr: Henrique Bastos -- Support SVG pour l'extension graphviz
zh_cn: Henrique Bastos -- SVG 支持 Graphviz 扩展

source: Daniel Bültmann -- todo extension
es: Daniel Bültmann -- extension todo
fr: Daniel Bültmann -- extension todo
zh_cn: Daniel Bültmann -- todo 扩展

source: Marco Buttu -- doctest extension (pyversion option)
es: Marco Buttu -- doctest extensión (opción pyversion)
fr: Marco Buttu -- extension doctest (option pyversion)
zh_cn: Marco Buttu --文档测试扩展 (Matalab pyversion 选项)

source: Nathan Damon -- bugfix in validation of static paths in html builders
zh_cn: Nathan Damon -- 修正了 HTML 生成器中固定路径赋值的 bug。

source: Etienne Desautels -- apidoc module
es: Etienne Desautels -- modulo apidoc
fr: Etienne Desautels -- module apidoc
zh_cn: Etienne Desautels -- apidoc 模块

source: Michael Droettboom -- inheritance_diagram extension
es: Michael Droettboom -- extension inheritance_diagram
fr: Michael Droettboom -- extension de diagramme_d'héritage
zh_cn: Michael Droettboom -- inheritance_diagram 扩展

source: Charles Duffy -- original graphviz extension
es: Charles Duffy -- extension original graphviz
fr: Charles Duffy -- extension originale de graphviz
zh_cn: Charles Duffy -- 初版 Graphviz 扩展

source: Kevin Dunn -- MathJax extension
es: Kevin Dunn -- extension MathJax
zh_cn: Kevin Dunn -- MathJax 扩展

source: Josip Dzolonga -- coverage builder
es: Josip Dzolonga -- contructor de coverage
fr: Josip Dzolonga -- constructeur de couverture
zh_cn: Josip Dzolonga -- 封面生成器

source: Buck Evan -- dummy builder
es: Buck Evan -- constructor falso
fr: Buck Evan -- constructeur factice
zh_cn: Buck Evan -- 傻瓜生成器

source: Matthew Fernandez -- todo extension fix
es: Matthew Fernandez -- corregir extensión todo
fr: Matthew Fernandez -- Correction de l'extension todo
zh_cn: Matthew Fernandez -- 修正了 Todo 扩展

source: Hernan Grecco -- search improvements
es: Hernan Grecco -- mejoras de búsqueda
fr: Hernan Grecco -- améliorations de recherche
zh_cn: Hernan Grecco -- 搜索优化

source: Horst Gutmann -- internationalization support
es: Horst Gutmann -- apoyo a la internacionalización
fr: Horst Gutmann -- soutien à l'internationalisation
zh_cn: Horst Gutmann --国际化支持

source: Martin Hans -- autodoc improvements
es: Martin Hans -- mejoras en autodoc
fr: Martin Hans -- améliorations de l'autodoc
zh_cn: Martin Hans -- 改进 Autodoc

source: Zac Hatfield-Dodds -- doctest reporting improvements, intersphinx performance
zh_cn: Zac Hatfield-Dodds -- 改进文档测试报告功能和 intersphinx 表现

source: Doug Hellmann -- graphviz improvements
es: Doug Hellmann -- mejoras en graphviz
fr: Doug Hellmann -- amélioration de graphviz
zh_cn: Doug Hellmann -- 改进 Graphviz

source: Tim Hoffmann -- theme improvements
es: Tim Hoffmann -- mejoras de temas
fr: Tim Hoffmann -- améliorations des thèmes
zh_cn: Tim Hoffmann -- 改进主题

source: Antti Kaihola -- doctest extension (skipif option)
fr: Antti Kaihola -- extension doctest (option skipif)
zh_cn: Antti Kaihola -- 文档测试扩展 （skipif 选项）

source: Dave Kuhlman -- original LaTeX writer
es: Dave Kuhlman -- escritor original para LaTeX
fr: Dave Kuhlman -- auteur original de LaTeX
zh_cn: Dave Kuhlman -- 初版 LaTeX 编写器

source: Blaise Laflamme -- pyramid theme
es: Blaise Laflamme -- plantilla pyramid
fr: Blaise Laflamme -- thème pyramid
zh_cn: Blaise Laflamme -- pyramid 主题

source: Chris Lamb -- reproducibility fixes
fr: Chris Lamb -- corrections de reproductibilité
zh_cn: Chris Lamb -- 修复再生性

source: Thomas Lamb -- linkcheck builder
es: Thomas Lamb -- constructor para linkcheck
fr: Thomas Lamb -- constructeur linkcheck
zh_cn: Thomas Lamb -- 链接检查创建器

source: Łukasz Langa -- partial support for autodoc
es: Łukasz Langa -- soporte parcial para autodoc
fr: Łukasz Langa -- support partiel pour autodoc
zh_cn: Łukasz Langa -- autodoc 支持的主要部分

source: Martin Larralde -- additional napoleon admonitions
fr: Martin Larralde -- admonitions napoleon supplémentaires
zh_cn: Martin Larralde -- 外加的 Napoleon 条例

source: Ian Lee -- quickstart improvements
es: Ian Lee -- mejoras en quickstart
fr: Ian Lee -- améliorations au démarrage rapide
zh_cn: Ian Lee -- 改进 quickstart

source: Robert Lehmann -- gettext builder (GSOC project)
es: Robert Lehmann -- constructor para gettext (Proyecto GSOC)
fr: Robert Lehmann -- constructeur gettext (projet GSOC)
zh_cn: Robert Lehmann -- gettext 创建器 (GSOC 项目)

source: Dan MacKinlay -- metadata fixes
es: Dan MacKinlay -- correcciones de metadatos
fr: Dan MacKinlay -- corrections des métadonnées
zh_cn: Dan MacKinlay -- metadata 修复

source: Martin Mahner -- nature theme
es: Martin Mahner -- plantilla nature
fr: Martin Mahner -- thème nature
zh_cn: Martin Mahner -- 自然主题

source: Will Maier -- directory HTML builder
es: Will Maier -- directorio de constructor de HTML
fr: Will Maier -- constructeur de répertoire HTML
zh_cn: Will Maier -- 直接的 HTML 创建器

source: Jacob Mason -- websupport library (GSOC project)
es: Jacob Mason -- biblioteca websupport (proyecto GSOC)
fr: Jacob Mason -- librairie websupport (projet GSOC)
zh_cn: Jacob Mason -- Websupport 图书馆 (GSOC 项目)

source: Glenn Matthews -- python domain signature improvements
es: Glenn Matthews -- Mejoras en la firma de dominios python
fr: Glenn Matthews -- améliorations de la signature du domaine python
zh_cn: Glenn Matthews -- python 域标识优化

source: Kurt McKee -- documentation updates
es: Kurt McKee -- actualizaciones de documentación
fr: Kurt McKee -- mises à jour de la documentation
zh_cn: Kurt McKee -- 文档更新

source: Roland Meister -- epub builder
es: Roland Meister -- constructor para epub
fr: Roland Meister -- constructeur epub
zh_cn: Roland Meister -- epub 开发者

source: Ezio Melotti -- collapsible sidebar JavaScript
es: Ezio Melotti -- barra lateral pegable en JavaScript
fr: Ezio Melotti -- barre latérale repliable JavaScript
zh_cn: Ezio Melotti -- 可折叠侧边栏JavaScript

source: Bruce Mitchener -- Minor epub improvement
es: Bruce Mitchener -- Mejora menor en epub
fr: Bruce Mitchener -- Amélioration mineure d'epub
zh_cn: Bruce Mitchener -- 次级 epub 优化

source: Daniel Neuhäuser -- JavaScript domain, Python 3 support (GSOC)
es: Daniel Neuhäuser -- dominio para JavaScript, suporte para Python 3 (GSOC)
fr: Daniel Neuhäuser -- domaine JavaScript, support Python 3 (GSOC)
zh_cn: Daniel Neuhäuser -- JavaScript 域，支持Python 3 (GSOC)

source: Julien Palard -- Colspan and rowspan in text builder
fr: Julien Palard -- Colspan et rowspan dans le constructeur texte
zh_cn: Julien Palard -- 文本生成器的合并单元格及跨行功能

source: Christopher Perkins -- autosummary integration
es: Christopher Perkins -- integracion con autosummary
fr: Christopher Perkins -- intégration automatique de résumés
zh_cn: Christopher Perkins -- 集成自动摘要功能

source: Benjamin Peterson -- unittests
fr: Benjamin Peterson -- tests unitaires
zh_cn: Benjamin Peterson -- unittests 单元测试框架

source: \T. Powers -- HTML output improvements
es: \T. Powers -- mejora en la salida HTML
fr: \T. Powers -- Améliorations de la sortie HTML
zh_cn: \T. Powers -- HTML 输出优化

source: Jeppe Pihl -- literalinclude improvements
es: Jeppe Pihl -- mejoras en literalinclude
fr: Jeppe Pihl -- améliorations literalinclude
zh_cn: Jeppe Pihl -- literalinclude 优化

source: Rob Ruana -- napoleon extension
es: Rob Ruana -- extension napoleon
fr: Rob Ruana -- extension napoleon
zh_cn: Rob Ruana -- napoleon 扩展

source: Vince Salvino -- JavaScript search improvements
zh_cn: Vince Salvino -- JavaScript 搜索优化

source: Stefan Seefeld -- toctree improvements
es: Stefan Seefeld -- mejoras en toctree
fr: Stefan Seefeld -- améliorations toctree
zh_cn: Stefan Seefeld -- toctree 优化

source: Gregory Szorc -- performance improvements
es: Gregory Szorc -- mejoras en el rendimiento
fr: Gregory Szorc -- amélioration de la performance
zh_cn: Gregory Szorc -- 性能优化

source: Taku Shimizu -- epub3 builder
es: Taku Shimizu -- constructor de epub3
fr: Taku Shimizu -- constructeur epub3
zh_cn: Taku Shimizu -- epub3 生成器

source: Antonio Valentino -- qthelp builder, docstring inheritance
es: Antonio Valentino -- constructor qthelp, herencia docstring
fr: Antonio Valentino -- constructeur qthelp, héritage docstring
zh_cn: Antonio Valentino -- qthelp 生成器, docstring 增强

source: Filip Vavera -- napoleon todo directive
fr: Filip Vavera -- directive napoleon todo
zh_cn: Filip Vavera -- napoleon 待办指令

source: Pauli Virtanen -- autodoc improvements, autosummary extension
es: Pauli Virtanen -- mejoras en autodoc, extensión autosummary
fr: Pauli Virtanen -- améliorations de l'autodoc, extension autosummary
zh_cn: Pauli Virtanen -- autodoc 优化, autosummary 扩展

source: Eric N. Vander Weele -- autodoc improvements
fr: Eric N. Vander Weele -- améliorations autodoc
zh_cn: Eric N. Vander Weele -- autodoc 优化

source: Stefan van der Walt -- autosummary extension
es: Stefan van der Walt -- extensión autosummary
fr: Stefan van der Walt -- Extension autosummary
zh_cn: Stefan van der Walt -- 自动摘要扩展

source: Thomas Waldmann -- apidoc module fixes
es: Thomas Waldmann -- arreglos en el modulo apidoc
fr: Thomas Waldmann -- correction du module apidoc
zh_cn: Thomas Waldmann -- apidoc 模块修复

source: John Waltman -- Texinfo builder
es: John Waltman -- constructor para Texinfo
fr: John Waltman -- Bâtisseur Texinfo
zh_cn: John Waltman -- Texinfo 生成器

source: Barry Warsaw -- setup command improvements
es: Barry Warsaw -- mejoras en comandos de instalacion
fr: Barry Varsovie -- Améliorations de la commande d'installation
zh_cn: Barry Warsaw -- setup 命令优化

source: Sebastian Wiesner -- image handling, distutils support
es: Sebastian Wiesner -- manejo de imagen, soporte para distutils
fr: Sebastian Wiesner -- traitement d'image, support distutils
zh_cn: Sebastian Wiesner -- 图像编辑工具, distutils 模块支持

source: Michael Wilson -- Intersphinx HTTP basic auth support
es: Michael Wilson -- soporte de autenticación básica de HTTP en InterSphinx
fr: Michael Wilson -- Intersphinx HTTP support des droits d'auteur de base d'Intersphinx
zh_cn: Michael Wilson -- Sphinx 内置 HTTP 基础方法支持

source: Matthew Woodcraft -- text output improvements
es: Matthew Woodcraft -- mejoras en la salida de texto
fr: Matthew Woodcraft -- Améliorations de la sortie texte
zh_cn: Matthew Woodcraft -- 文本输出优化

source: Joel Wurtz -- cellspanning support in LaTeX
es: Joel Wurtz -- soporte para cellspanning en LaTeX
fr: Joel Wurtz -- le support de cellspanning dans LaTeX
zh_cn: Joel Wurtz -- LaTeX 单元格大小调整支持

source: Hong Xu -- svg support in imgmath extension and various bug fixes
es: Hong Xu -- SVG apoyo en extensión imgmath y varias correcciones de errores
fr: Hong Xu -- support de svg dans l'extension imgmath et diverses corrections de bogues
zh_cn: Hong Xu -- imgmath 扩展中的 svg 支持，修复许多漏洞

source: Stephen Finucane -- setup command improvements and documentation
es: Stephen Finucane -- mejoras en comandos de configuración y documentación
fr: Stephen Finucane -- Améliorations et documentation des commandes d'installation
zh_cn: Stephen Finucane -- 优化 setup 命令并编写相关文档

source: Daniel Pizetta -- inheritance diagram improvements
es: Daniel Pizetta -- mejoras en el diagrama de herencia
fr: Daniel Pizetta -- améliorations des diagrammes d'héritage
zh_cn: Daniel Pizetta -- 增强图表优化

source: KINEBUCHI Tomohiko -- typing Sphinx as well as docutils
fr: KINEBUCHI Tomohiko -- dactylographie Sphinx ainsi que docutils
zh_cn: KINEBUCHI Tomohiko -- 编写 Sphinx 和 docutils 模块

source: Adrián Chaves (Gallaecio) -- coverage builder improvements
fr: Adrián Chaves (Gallaecio) -- Améliorations apportées au constructeur de couverture
zh_cn: Adrián Chaves (Gallaecio) -- 封面生成器优化。

source: Lars Hupfeldt Nielsen - OpenSSL FIPS mode md5 bug fix
zh_cn: Lars Hupfeldt Nielsen - 修复 OpenSSL FIPS mode md5 漏洞。

source: Many thanks for all contributions!
es: ¡Muchas gracias por todos los aportes!
fr: Un grand merci pour toutes les contributions !
zh_cn: 我们在此诚挚感谢所有开发者的辛勤付出！！

source: There are also a few modules or functions incorporated from other authors and projects:
es: También hay unos pocos módulos o funciones incorporadas de otros autores y proyectos:
fr: Il y a aussi quelques modules ou fonctions incorporés d'autres auteurs et projets :
zh_cn: 有少部分模块和功能是从从其他开发者和项目合并过来的：

source: sphinx.util.jsdump uses the basestring encoding from simplejson, written by Bob Ippolito, released under the MIT license
es: sphinx.util.jsdump utiliza la cadena de codificación de simplejson, escrito por Bob Ippolito, publicado bajo la licencia MIT
fr: sphinx.util.jsdump utilise l'encodage des basestring de simplejson, écrit par Bob Ippolito, publié sous licence MIT
zh_cn: sphinx.util.jsdump 使用了 basestring 超类，simplejson 编码, 由 Bob Ippolito 编写, 根据麻省理工学院的许可证发布。

source: sphinx.util.stemmer was written by Vivake Gupta, placed in the Public Domain
es: sphinx.util.stemmer fue escrito por Vivake Gupta, colocado en el Dominio Publico
fr: sphinx.util.stemmer a été écrit par Vivake Gupta, placé dans le domaine public
zh_cn: sphinx.util.stemmer 由 Vivake Gupta 编写，位于 Public Domain。

source: Other contributors, listed alphabetically, are:
es: Otros contribuyentes, en orden alfabético, son:
fr: Les autres contributeurs, classés par ordre alphabétique, sont :
