Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/internals/code-of-conduct.po
Languages: ja, pt_br, zh_cn

source: Sphinx Code of Conduct
ja: Sphinx行動規範
pt_br: Código de Conduta do Sphinx
zh_cn: sphinx行为准则

source: Like the technical community as a whole, the Sphinx team and community is made up of volunteers from all over the world. Diversity is a strength, but it can also lead to communication issues and unhappiness. To that end, we have a few ground rules that we ask people to adhere to.
ja: 技術コミュニティー全体と同様に、Sphinxのチームとコミュニティーも、世界中から集まったボランティアで構成されています。多様性は強みですが、コミュニケーションの問題や不幸にもつながります。そのために、次のいつくかの規則に従ってください。
pt_br: Como a comunidade técnica como um todo, a equipe e a comunidade Sphinx são formadas por voluntários de todo o mundo. Diversidade é um ponto forte, mas também pode levar a problemas de comunicação e infelicidade. Para esse fim, temos algumas regras básicas que pedimos às pessoas que sigam.
zh_cn: 像整个技术社区一样，sphinx团队和社区由来自世界各地的志愿者组成。多样性是一种优势，但它也可能导致沟通问题和不愉快。为此，我们有一些基本规则，我们要求人们遵守。

source: **Be friendly and patient.**
ja: **友好的で忍耐強くなりましょう。**
pt_br: **Seja amigável e paciente.**
zh_cn: 友好耐心

source: **Be welcoming.** We strive to be a community that welcomes and supports people of all backgrounds and identities. This includes, but is not limited to members of any race, ethnicity, culture, national origin, colour, immigration status, social and economic class, educational level, sex, sexual orientation, gender identity and expression, age, size, family status, political belief, religion, and mental and physical ability.
ja: **歓迎しましょう。** 私たちは、あらゆる経歴や個性を持つ人々を歓迎し、支援するコミュニティを目指しています。これには、人種、民族、文化、出身国、肌の色、移民の状態、社会的・経済的階級、教育レベル、性別、性的指向、性同一性と表現、年齢、体格、家族の状態、政治的信条、宗教、精神的・身体的能力などが含まれます。
pt_br: **Seja acolhedor.** Nós nos esforçamos para ser uma comunidade que recebe e apoia pessoas de todas as origens e identidades. Isso inclui, mas não está limitado a membros de qualquer raça, etnia, cultura, nacionalidade, cor, status de imigração, classe social e econômica, nível educacional, sexo, orientação sexual, identidade e expressão de gênero, idade, tamanho, situação familiar, crença política, religião e capacidade mental e física.
zh_cn: 我们努力成为一个欢迎和支持各种背景和身份的人的社区。这包括但不限于任何种族、族裔、文化、民族血统、肤色、移民状况、社会经济阶层、教育程度、性别、性取向、性别认同和表达、年龄、大小、家庭状况、政治信仰、宗教信仰、身心能力。

source: **Be considerate.** Your work will be used by other people, and you in turn will depend on the work of others. Any decision you take will affect users and colleagues, and you should take those consequences into account when making decisions. Remember that we're a world-wide community, so you might not be communicating in someone else's primary language.
ja: **注意してください。** あなたの仕事は他の人に使われ、あなたは他の人の仕事に依存します。どのような決定もユーザーや同僚に影響するため、決定を行う際にはこれらの結果を考慮する必要があります。私たちは世界規模のコミュニティなので、あなたがコミュニケーションを取っている言語が、誰かにとっては母国語ではないかもしれません。
pt_br: **Seja atencioso.** Seu trabalho será usado por outras pessoas e você, por sua vez, dependerá do trabalho de outros. Qualquer decisão que você tomar afetará usuários e colegas, e você deve levar essas consequências em consideração ao tomar decisões. Lembre-se de que somos uma comunidade mundial, então você pode não estar se comunicando no idioma principal de outra pessoa.
zh_cn: 善解人意。你的工作会被别人利用，而你又会依赖别人的工作。你所做的任何决定都会影响到用户和同事，你在做决定时应该考虑到这些后果。请记住，我们是一个世界性的社区，因此您可能不会使用其他人的主要语言进行交流。

source: **Be respectful.** Not all of us will agree all the time, but disagreement is no excuse for poor behavior and poor manners. We might all experience some frustration now and then, but we cannot allow that frustration to turn into a personal attack. It's important to remember that a community where people feel uncomfortable or threatened is not a productive one. Members of the Sphinx community should be respectful when dealing with other members as well as with people outside the Sphinx community.
ja: **敬意を持って。** 全員が常に同意しているわけではありませんが、意見の相違は、不品行や不作法の言い訳にはなりません。私たちは時々フラストレーションを経験するかもしれませんが、そのフラストレーションが個人的な攻撃に変わることを許すことはできません。人々が居心地の悪さや脅威を感じているコミュニティは、生産的なコミュニティではないことを覚えておくことが重要です。Sphinxコミュニティーのメンバーは、他のメンバーやSphinxコミュニティー以外の人々と接する際には敬意を払うべきです。
pt_br: **Seja respeitoso.** Nem todos nós concordaremos o tempo todo, mas discordar não é desculpa para mau comportamento e falta de educação. Todos nós podemos sentir alguma frustração de vez em quando, mas não podemos permitir que essa frustração se transforme em um ataque pessoal. É importante lembrar que uma comunidade onde as pessoas se sentem desconfortáveis ​​ou ameaçadas não é produtiva. Os membros da comunidade Sphinx devem ser respeitosos ao lidar com outros membros, bem como com pessoas de fora da comunidade Sphinx.
zh_cn: 要有礼貌。不是所有人都会一直意见一致，但意见不合不能成为不良行为和不良举止的借口。我们可能会时不时地经历一些挫折，但我们不能让这种挫折变成人身攻击。重要的是要记住，一个让人感到不舒服或受到威胁的社区并不是一个富有成效的社区。sphinx社区的成员在与其他成员以及sphinx社区以外的人打交道时应该尊重他人。

source: **Be careful in the words that you choose.** We are a community of professionals, and we conduct ourselves professionally. Be kind to others. Do not insult or put down other participants. Harassment and other exclusionary behavior aren't acceptable. This includes, but is not limited to:
ja: **言葉の選択に注意してください。** 私たちはプロのコミュニティであり、プロとして行動します。他人に親切にしましょう。他の参加者を侮辱したり、けなしたりしないでください。嫌がらせや排他的な行動は許されません。これには次のものが含まれますが、これだけではありません。
pt_br: **Tenha cuidado com as palavras que você escolher.** Somos uma comunidade de profissionais e nos conduzimos de maneira profissional. Seja gentil com os outros. Não insulte ou rebaixe os outros participantes. O assédio e outros comportamentos de exclusão não são aceitáveis. Isso inclui, mas não está limitado a:
zh_cn: 在你选择的词上要小心。我们是一个专业的社区，我们的行为很专业。善待他人。不要侮辱或贬低其他参与者。骚扰和其他排外行为是不可接受的。这包括但不限于：

source: Violent threats or language directed against another person.
ja: 他人に対する暴力的な脅迫または言葉。
pt_br: Ameaças violentas ou linguagem dirigida contra outra pessoa.
zh_cn: 针对他人的暴力威胁或语言。

source: Discriminatory jokes and language.
ja: 差別的なジョークや言葉。
pt_br: Piadas discriminatórias e linguagem.
zh_cn: 歧视性的笑话和语言。

source: Posting sexually explicit or violent material.
ja: 性的に露骨で暴力的な内容の投稿。
pt_br: Publicar material sexualmente explícito ou violento.
zh_cn: 张贴色情或暴力材料。

source: Posting (or threatening to post) other people's personally identifying information ("doxing").
ja: 他人の個人識別情報を投稿("doxing")する(投稿すると脅す)こと。
pt_br: Publicar (ou ameaçar publicar) informações de identificação pessoal de outras pessoas ("doxing").
zh_cn: 发布（或威胁发布）他人的个人身份信息（“打瞌睡”）。

source: Personal insults, especially those using racist or sexist terms.
ja: 個人的な侮辱、特に人種差別用語や性差別用語を使用した侮辱。
pt_br: Insultos pessoais, especialmente aqueles que usam termos racistas ou sexistas.
zh_cn: 人身侮辱，尤指使用种族主义或性别歧视的词语。

source: Unwelcome sexual attention.
ja: うれしくない性的関心。
pt_br: Atenção sexual indesejada.
zh_cn: 不受欢迎的性注意。

source: Advocating for, or encouraging, any of the above behavior.
ja: 上記の行動のいずれかを支持または奨励すること。
pt_br: Defender ou encorajar qualquer um dos comportamentos acima.
zh_cn: 提倡或鼓励上述行为。

source: Repeated harassment of others. In general, if someone asks you to stop, then stop.
ja: 他人への嫌がらせを繰り返す。一般的に、誰かに止めてほしいと言われたら、やめてください。
pt_br: Assédio repetido de outras pessoas. Em geral, se alguém pede para você parar, pare.
zh_cn: 多次骚扰他人。一般来说，如果有人要你停下来，那就停下来。

source: **When we disagree, try to understand why.** Disagreements, both social and technical, happen all the time and Sphinx is no exception. It is important that we resolve disagreements and differing views constructively. Remember that we're different. Different people have different perspectives on issues. Being unable to understand why someone holds a viewpoint doesn't mean that they're wrong. Don't forget that it is human to err and blaming each other doesn't get us anywhere. Instead, focus on helping to resolve issues and learning from mistakes.
ja: **同意できない場合は、その理由を理解してください。** 社会的にも技術的にも意見の相違は常にあり、Sphinxも例外ではありません。意見の相違や見解の相違を建設的に解決することが重要です。私たちは違うということを覚えておいてください。問題に対する見方は人によって違う。人がなぜその視点を持っているのか理解できないからといって、それが間違っているとは限りません。過ちを犯してお互いを責めるのは人間の常であることを忘れないでください。代わりに、問題の解決を支援し、ミスから学ぶことに集中しましょう。
pt_br: **Quando discordamos, tente entender o porquê.** Desentendimentos, tanto sociais quanto técnicos, acontecem o tempo todo e o Sphinx não é exceção. É importante que resolvamos divergências e visões divergentes de forma construtiva. Lembre-se de que somos diferentes. Pessoas diferentes têm perspectivas diferentes sobre os problemas. Ser incapaz de entender por que alguém tem um ponto de vista não significa que ele esteja errado. Não se esqueça que errar é humano e culpar uns aos outros não nos leva a lugar nenhum. Em vez disso, concentre-se em ajudar a resolver problemas e aprender com os erros.
zh_cn: 当我们不同意的时候，试着去理解为什么社会和技术上的分歧总是会发生，shpinx也不例外。我们必须建设性地解决分歧和不同意见。记住我们是不同的。不同的人对问题有不同的看法。不能理解为什么有人持有观点并不意味着他们错了。别忘了犯错是人之常情，互相指责并不能让我们一事无成。相反，集中精力帮助解决问题和从错误中吸取教训。

source: This isn't an exhaustive list of things that you can't do. Rather, take it in the spirit in which it's intended - a guide to make it easier to enrich all of us and the technical communities in which we participate. This code of conduct applies to all spaces of the Sphinx community.
ja: これは、すべてを網羅したリストではありません。むしろ、それが意図している精神、つまり私たち全員と私たちが参加する技術コミュニティをより簡単に豊かにするためのガイドとして受け入れましょう。この行動規範は、Sphinxコミュニティーのすべてのスペースに適用されます。
pt_br: Esta não é uma lista exaustiva de coisas que você não pode fazer. Em vez disso, leve-o no espírito a que se destina -- um guia para tornar mais fácil o enriquecimento de todos nós e das comunidades técnicas das quais participamos. Este código de conduta se aplica a todos os espaços da comunidade Sphinx.
zh_cn: 这不是一个详尽的清单，你不能做的事情。相反，要以它的本意来理解它——一个使我们所有人和我们所参与的技术社区更容易丰富的指南。本行为准则适用于sphinx社区的所有空间。

source: Attribution
ja: 帰属
pt_br: Atribuição
zh_cn: 属性

source: Original text courtesy of the Speak Up! project: http://web.archive.org/web/20141109123859/http://speakup.io/coc.html.
ja: 原文はSpeak Up!プロジェクトから。 http://web.archive.org/web/20141109123859/http://speakup.io/coc.html
pt_br: Cortesia do texto original do Speak Up! projeto: http://web.archive.org/web/20141109123859/http://speakup.io/coc.html.
zh_cn: 原文敬请发言！项目名称：http://web.archive.org/web/20141109123859/http://speakup.io/coc语言.html。
