Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/internals/release-process.po
Languages: pt_br

source: Sphinx's release process
pt_br: Processo de lançamento do Sphinx

source: Versioning
pt_br: Versionamento

source: Sphinx adheres to :pep:`440` versions, with a ``major.minor.micro`` scheme for the *release segment* (e.g. 1.2.3). The major, minor, and micro version parts should be altered as follows:
pt_br: Sphinx adere às versões da :pep:`440`, com um esquema ``major.minor.micro`` para o *segmento de lançamento* (por exemplo, 1.2.3). As partes da versão principal, secundária e micro devem ser alteradas da seguinte forma:

source: The major version part should be incremented for incompatible behavior change and public API updates.
pt_br: A parte da versão principal (major) deve ser incrementada para alterações de comportamento incompatíveis e atualizações de API públicas.

source: The minor version part should be incremented for most releases of Sphinx, where backwards-compatibility of API and features are preserves.
pt_br: A parte da versão secundária (minor) deve ser incrementada para a maioria das versões do Sphinx, onde a compatibilidade com versões anteriores da API e dos recursos é preservada.

source: The micro version part should only be incremented for urgent bugfix-only releases.
pt_br: A parte da versão micro só deve ser incrementada para lançamentos urgentes somente para correção de bugs.

source: When the major version part is incremented, the minor and micro version parts must be set to ``0``. When the minor version part is incremented, the micro version part must be set to ``0``.
pt_br: Quando a parte da versão principal é incrementada, as partes da versão secundária e micro devem ser definidas como ``0``. Quando a parte da versão secundária é incrementada, a parte da versão micro deve ser definida como ``0``.

source: New major versions should come with a beta-testing period before the final release.
pt_br: Novas versões principais devem vir com um período de testes beta antes do lançamento final.

source: Deprecating a feature
pt_br: Descontinuando um recurso

source: There are a couple reasons that code in Sphinx might be deprecated:
pt_br: Existem alguns motivos pelos quais o código no ``Sphinx`` pode ser descontinuado:

source: If a feature has been improved or modified in a backwards-incompatible way, the old feature or behavior will be deprecated.
pt_br: Se um recurso foi aprimorado ou modificado de maneira incompatível com versões anteriores, o recurso ou comportamento antigo será descontinuado.

source: Sometimes Sphinx will include a backport of a Python library that's not included in a version of Python that Sphinx currently supports. When Sphinx no longer needs to support the older version of Python that doesn't include the library, the library will be deprecated in Sphinx.
pt_br: Às vezes, o Sphinx incluirá um backport de uma biblioteca Python que não está incluída em uma versão do Python que o Sphinx atualmente oferece suporte. Quando o Sphinx não precisa mais dar suporte à versão mais antiga do Python que não inclui a biblioteca, a biblioteca será descontinuada no Sphinx.

source: As the :ref:`deprecation-policy` describes, the first release of Sphinx that deprecates a feature (``A.B``) should raise a ``RemovedInSphinxXXWarning`` (where ``XX`` is the Sphinx version where the feature will be removed) when the deprecated feature is invoked. Assuming we have good test coverage, these warnings are converted to errors when running the test suite with warnings enabled::
pt_br: Como a :ref:`deprecation-policy` descreve, o primeiro lançamento do Sphinx que descontinuou um recurso (``A.B``) deve levantar uma ``RemovedInSphinxXXWarning`` (sendo ``XX`` a versão do Sphinx na qual o recurso será removido) quando o recurso descontinuado for chamado. Supondo que tenhamos uma boa cobertura de teste, esses avisos serão convertidos em erros ao executar o conjunto de testes com avisos ativados::

source: Thus, when adding a ``RemovedInSphinxXXWarning`` you need to eliminate or silence any warnings generated when running the tests.
pt_br: Assim, ao adicionar um ``RemovedInSphinxXXWarning``, você precisa eliminar ou silenciar quaisquer avisos gerados ao executar os testes.

source: Deprecation policy
pt_br: Política de descontinuação

source: MAJOR and MINOR releases may deprecate certain features from previous releases. If a feature is deprecated in a release A.x, it will continue to work in all A.x.x versions (for all versions of x). It will continue to work in all B.x.x versions but raise deprecation warnings. Deprecated features will be removed at the C.0.0. It means the deprecated feature will work during 2 MAJOR releases at least.
pt_br: As versões MAJOR e MINOR podem descontinuar certos recursos de versões anteriores. Se um recurso foi descontinuado em uma versão A.x, ele continuará a funcionar em todas as versões A.x.x (para todas as versões de x). Ele continuará a funcionar em todas as versões B.x.x, mas vai levantar os avisos de descontinuação. Os recursos descontinuados serão removidos na C.0.0. Isso significa que o recurso descontinuado funcionará durante pelo menos 2 lançamentos MAJOR.

source: So, for example, if we decided to start the deprecation of a function in Sphinx 2.x:
pt_br: Então, por exemplo, se decidimos iniciar a descontinuação de uma função no Sphinx 2.x:

source: Sphinx 2.x will contain a backwards-compatible replica of the function which will raise a ``RemovedInSphinx40Warning``. This is a subclass of :exc:`python:PendingDeprecationWarning`, i.e. it will not get displayed by default.
pt_br: O Sphinx 2.x conterá uma réplica compatível com versões anteriores da função que vai levantar uma exceção ``RemovedInSphinx40Warning``. Esta é uma subclasse de :exc:`python:PendingDeprecationWarning`, ou seja, não será exibida por padrão.

source: Sphinx 3.x will still contain the backwards-compatible replica, but ``RemovedInSphinx40Warning`` will be a subclass of :exc:`python:DeprecationWarning` then, and gets displayed by default.
pt_br: O Sphinx 3.x ainda conterá a réplica compatível com versões anteriores, mas ``RemovedInSphinx40Warning`` será uma subclasse de :exc:`python:DeprecationWarning` e será exibida por padrão.

source: Sphinx 4.0 will remove the feature outright.
pt_br: O Sphinx 4.0 removerá o recurso imediatamente.

source: Deprecation warnings
pt_br: Avisos de descontinuação

source: Sphinx will enable its ``RemovedInNextVersionWarning`` warnings by default, if :envvar:`python:PYTHONWARNINGS` is not set. Therefore you can disable them using:
pt_br: O Sphinx habilitará seus avisos ``RemovedInNextVersionWarning`` por padrão, se :envvar:`python:PYTHONWARNINGS` não estiver definido. Portanto, você pode desativá-los usando:

source: ``export PYTHONWARNINGS=`` and do ``make html`` (Linux/Mac)
pt_br: ``export PYTHONWARNINGS=`` e executar ``make html`` (Linux/Mac)

source: ``set PYTHONWARNINGS=`` and do ``make html`` (Windows)
pt_br: ``set PYTHONWARNINGS=`` e executar ``make html`` (Windows)

source: But you can also explicitly enable the pending ones using e.g. ``PYTHONWARNINGS=default`` (see the :ref:`Python docs on configuring warnings <python:describing-warning-filters>`) for more details.
pt_br: Mas você também pode ativar explicitamente os pendentes usando, por exemplo, ``PYTHONWARNINGS=default`` (veja a :ref:`documentação do Python sobre configuração de avisos <python:describing-warning-filters>`) para mais detalhes.

source: Python version support policy
pt_br: Política de suporte a versões do Python

source: Sphinx supports at all minor versions of Python released in the past 3 years from the anticipated release date with a minimum of 3 minor versions of Python. This policy is derived from `SPEC 0`_, a scientific Python domain standard.
pt_br: O Sphinx oferece suporte a todas as versões secundárias do Python lançadas nos últimos 43 anos a partir da data de lançamento prevista, com um mínimo de 3 versões secundárias do Python. Esta política é derivada da `SPEC 0`_, um padrão científico de domínio Python.

source: For example, a version of Sphinx released in May 2025 would support Python 3.11, 3.12, and 3.13.
pt_br: Por exemplo, uma versão do Sphinx lançada em maio de 2025 teria suporte ao Python 3.11, 3.12 e 3.13.

source: This is a summary table with the current policy:
pt_br: Esta é uma tabela resumo com a política atual:

source: Date
pt_br: Data

source: 05 Oct 2023
pt_br: 05 Out 2023

source: 04 Oct 2024
pt_br: 04 Out 2024

source: 24 Oct 2025
pt_br: 24 Out 2025

source: 01 Oct 2026
pt_br: 01 Out 2026

source: 01 Oct 2027
pt_br: 01 Out 2027

source: Release procedures
pt_br: Procedimentos de lançamento

source: The release procedures are listed in :file:`utils/release-checklist.rst`.
pt_br: Os procedimentos de lançamento estão listados em :file:`utils/release-checklist.rst`.
