Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/tutorial/deploying.po
Languages: pt_br, zh_cn

source: Appendix: Deploying a Sphinx project online
pt_br: Apêndice: Fazendo deploy de um projeto Sphinx online
zh_cn: 附录：将Sphinx项目部署上线

source: When you are ready to show your documentation project to the world, there are many options available to do so. Since the HTML generated by Sphinx is static, you can decouple the process of building your HTML documentation from hosting such files in the platform of your choice. You will not need a sophisticated server running Python: virtually every web hosting service will suffice.
pt_br: Quando você estiver pronto para mostrar seu projeto de documentação ao mundo, há muitas opções disponíveis para fazê-lo. Como o HTML gerado pelo Sphinx é estático, você pode dissociar o processo de construção de sua documentação HTML da hospedagem de tais arquivos na plataforma de sua escolha. Você não precisará de um servidor sofisticado executando Python: praticamente todos os serviços de hospedagem na web serão suficientes.
zh_cn: 当您准备好向世界展示您的文档项目时，有许多可用的选项可以做到这一点。由于 Sphinx 生成的 HTML 是静态的，您可以将构建 HTML 文档的过程与在您选择的平台上托管此类文件分开。您不需要运行 Python 的复杂服务器：几乎每个 Web 托管服务都足够了。

source: Therefore, the challenge is less how or where to serve the static HTML, but rather how to pick a workflow that automatically updates the deployed documentation every time there is a change in the source files.
pt_br: Portanto, o desafio é menos como ou onde servir o HTML estático, mas sim como escolher um fluxo de trabalho que atualize automaticamente a documentação implantada sempre que houver uma alteração nos arquivos fonte.
zh_cn: 因此，挑战不在于如何或在哪里提供静态 HTML，而在于如何选择一种工作流程，每次源文件发生更改时自动更新已部署的文档。

source: The following sections describe some of the available options to deploy your online documentation, and give some background information. If you want to go directly to the practical part, you can skip to :ref:`publishing-sources`.
pt_br: As seções a seguir descrevem algumas das opções disponíveis para implantar sua documentação on-line e fornecem algumas informações básicas. Se quiser ir direto para a parte prática, você pode pular para :ref:`publishing-sources`.
zh_cn: 接下来的部分描述了一些可用的选项来部署您的在线文档，并提供了一些背景信息。如果您想直接进入实用部分，可以跳到 :ref:`publishing-sources`。

source: Sphinx-friendly deployment options
pt_br: Opções de deployment compatíveis com Sphinx
zh_cn: 对Sphinx友好的部署选项

source: There are several possible options you have to host your Sphinx documentation. Some of them are:
pt_br: Existem várias opções possíveis para hospedar sua documentação do Sphinx. Alguns deles são:
zh_cn: 您有几种可能的选项来托管您的 Sphinx 文档。其中一些是：

source: `Read the Docs`_ is an online service specialized in hosting technical documentation written in Sphinx, as well as MkDocs. They have a number of extra features, such as versioned documentation, traffic and search analytics, custom domains, user-defined redirects, and more.
pt_br: `Read the Docs`_ é um serviço online especializado em hospedar documentação técnica escrita em Sphinx, bem como MkDocs. Eles têm vários recursos extras, como documentação com versão, análise de tráfego e pesquisa, domínios personalizados, redirecionamentos definidos pelo usuário e muito mais.
zh_cn: `Read the Docs`_ 是一个专门托管使用 Sphinx 和 MkDocs 编写的技术文档的在线服务。他们有许多额外的功能，例如版本化文档、流量和搜索分析、自定义域名、用户定义的重定向等。

source: `GitHub Pages`_ is a simple static web hosting tightly integrated with `GitHub`_: static HTML is served from one of the branches of a project, and usually sources are stored in another branch so that the output can be updated every time the sources change (for example using `GitHub Actions`_). It is free to use and supports custom domains.
pt_br: `GitHub Pages`_ é uma hospedagem web estática simples totalmente integrada com `GitHub`_: HTML estático é servido a partir de um dos ramos de um projeto, e geralmente os fontes são armazenados em outro ramo para que a saída possa ser atualizada toda vez que o mudança de fontes (por exemplo, usando `GitHub Actions`_). Seu uso é gratuito e oferece suporte a domínios personalizados.
zh_cn: `GitHub Pages`_ 是一个与 `GitHub`_ 紧密集成的简单静态 Web 托管服务：静态 HTML 从项目的一个分支提供服务，通常源文件存储在另一个分支中，以便每次源文件更改时都可以更新输出（例如使用 `GitHub Actions`_）。它是免费的，并支持自定义域名。

source: `GitLab Pages`_ is a similar concept to GitHub Pages, integrated with `GitLab`_ and usually automated with `GitLab CI`_ instead.
pt_br: `GitLab Pages`_ é um conceito semelhante ao GitHub Pages, integrado com `GitLab`_ e geralmente automatizado com `GitLab CI`_.
zh_cn: `GitLab Pages`_ 是与 GitHub Pages 类似的概念，集成了 `GitLab`_，通常使用 `GitLab CI`_ 进行自动化。

source: `Netlify`_ is a sophisticated hosting for static sites enhanced by client-side web technologies like JavaScript (so-called `"Jamstack"`_). They offer support for headless content management systems and serverless computing.
pt_br: `Netlify`_ é uma hospedagem sofisticada para sites estáticos aprimorada por tecnologias web do lado do cliente como JavaScript (chamado `"Jamstack"`_). Eles oferecem suporte para sistemas de gerenciamento de conteúdo headless e computação sem servidor.
zh_cn: `Netlify`_ 是一个复杂的静态网站托管服务，通过客户端 Web 技术（所谓的 `"Jamstack"`_）进行增强。他们提供对无头内容管理系统和无服务器计算的支持。

source: **Your own server**
pt_br: **Seu próprio servidor**
zh_cn: **您自己的服务器**

source: You can always use your own web server to host Sphinx HTML documentation. It is the option that gives more flexibility, but also more complexity.
pt_br: Você sempre pode usar seu próprio servidor web para hospedar a documentação HTML do Sphinx. É a opção que dá mais flexibilidade, mas também mais complexidade.
zh_cn: 您始终可以使用自己的 Web 服务器来托管 Sphinx HTML 文档。这是提供更多灵活性的选项，但也更复杂。

source: All these options have zero cost, with the option of paying for extra features.
pt_br: Todas essas opções têm custo zero, com opção de pagamento por recursos extras.
zh_cn: 所有这些选项都是免费的，并且可以选择支付额外的功能费用。

source: Embracing the "Docs as Code" philosophy
pt_br: Abraçando a filosofia "Documentação como Código"
zh_cn: 拥抱“代码即文档”理念

source: The free offerings of most of the options listed above require your documentation sources to be publicly available. Moreover, these services expect you to use a `Version Control System`_, a technology that tracks the evolution of a collection of files as a series of snapshots ("commits"). The practice of writing documentation in plain text files with the same tools as the ones used for software development is commonly known as `"Docs as Code"`_.
pt_br: As ofertas gratuitas da maioria das opções listadas acima exigem que suas fontes de documentação estejam disponíveis publicamente. Além disso, esses serviços esperam que você use um `Sistema de Controle de Versão`_, uma tecnologia que rastreia a evolução de uma coleção de arquivos como uma série de instantâneos ("commits"). A prática de escrever documentação em arquivos de texto simples com as mesmas ferramentas usadas para desenvolvimento de software é comumente conhecida como `"Documentação como Código"`_.
zh_cn: 上述大多数选项的免费服务要求您的文档源文件公开可用。此外，这些服务期望您使用 `Version Control System`_，这是一种将一组文件的演变跟踪为一系列快照（“提交”）的技术。使用与软件开发相同的工具在纯文本文件中编写文档的做法通常被称为 `"Docs as Code"`_。

source: The most popular Version Control System nowadays is Git_, a free and open source tool that is the backbone of services like GitHub and GitLab. Since both Read the Docs and Netlify have integrations with GitHub and GitLab, and both GitHub and GitLab have an integrated Pages product, the most effective way of automatically build your documentation online is to upload your sources to either of these Git hosting services.
pt_br: O sistema de controle de versão mais popular atualmente é o Git_, uma ferramenta gratuita e de código aberto que é a espinha dorsal de serviços como GitHub e GitLab. Como tanto o Read the Docs quanto o Netlify têm integrações com GitHub e GitLab, e tanto GitHub quanto GitLab têm um produto Pages integrado, a maneira mais eficaz de construir automaticamente sua documentação online é fazer upload de suas fontes para qualquer um desses serviços de hospedagem Git.
zh_cn: 如今最流行的版本控制系统是 Git_，这是一款免费且开源的工具，是 GitHub 和 GitLab 等服务的支柱。由于 Read the Docs 和 Netlify 都与 GitHub 和 GitLab 集成，而且 GitHub 和 GitLab 都有一个集成的 Pages 产品，因此在线自动构建文档的最有效方法是将源文件上传到这些 Git 托管服务中的任意一个。

source: Publishing your documentation sources
pt_br: Publicando suas fontes de documentação
zh_cn: 公开您的文档源文件

source: The quickest way to upload an existing project to GitHub is to:
pt_br: A maneira mais rápida de fazer upload de um projeto existente para o GitHub é:
zh_cn: 将现有项目上传到 GitHub 的最快方法是：

source: `Sign up for a GitHub account <https://github.com/signup>`_.
pt_br: `Inscreva-se para uma conta GitHub <https://github.com/signup>`_.
zh_cn: `注册一个GitHub账户 <https://github.com/signup>`_。

source: `Create a new repository <https://github.com/new>`_.
pt_br: `Crie um novo repositório <https://github.com/new>`_.
zh_cn: `创建一个新的存储库 <https://github.com/new>`_。

source: Open `the "Upload files" page`_ of your new repository.
pt_br: Abra `a página "Upload files"`_ do seu novo repositório.
zh_cn: 打开你的新存储库的 `the "Upload files" page`_ 。

source: Select the files on your operating system file browser (in your case ``README.rst``, ``lumache.py``, the makefiles under the ``docs`` directory, and everything under ``docs/source``) and drag them to the GitHub interface to upload them all.
pt_br: Selecione os arquivos no navegador de arquivos do seu sistema operacional (no seu caso ``README.rst``, ``lumache.py``, os makefiles no diretório ``docs`` e tudo em ``docs/source`` ) e arraste-os para a interface do GitHub para fazer upload de todos eles.
zh_cn: 选择操作系统文件浏览器中的文件（在您的情况下为 ``README.rst``、``lumache.py``、``docs`` 目录下的 makefiles 以及 ``docs/source`` 下的所有内容），并将它们拖到 GitHub 界面中以上传它们。

source: Click on the :guilabel:`Commit changes` button.
pt_br: Clique no botão :guilabel:`Commit changes`.
zh_cn: 点击 :guilabel:`Commit changes` 按钮。

source: Make sure you don't upload the ``docs/build`` directory, as it contains the output generated by Sphinx and it will change every time you change the sources, complicating your workflow.
pt_br: Certifique-se de não fazer upload do diretório ``docs/build``, pois ele contém a saída gerada pelo Sphinx e mudará toda vez que você alterar as fontes, complicando seu fluxo de trabalho.
zh_cn: 确保不要上传 ``docs/build`` 目录，因为它包含 Sphinx 生成的输出，每次更改源文件时都会更改，从而使您的工作流程复杂化。

source: These steps do not require access to the command line or installing any additional software. To learn more, read `this quickstart tutorial`_ or consult the `official GitHub documentation`_
pt_br: Estas etapas não requerem acesso à linha de comando ou instalação de qualquer software adicional. Para saber mais, leia `este tutorial de início rápido`_ ou consulte a `documentação oficial do GitHub`_
zh_cn: 这些步骤不需要访问命令行或安装任何其他软件。要了解更多信息，请阅读 `this quickstart tutorial`_ 或查阅 `official GitHub documentation`_

source: Similarly to GitHub, the fastest way to upload your project to GitLab is using the web interface:
pt_br: Da mesma forma que no GitHub, a maneira mais rápida de enviar seu projeto para o GitLab é usando a interface web:
zh_cn: 与 GitHub 类似，将项目上传到 GitLab 的最快方法是使用 Web 界面：

source: `Sign up for a GitLab account <https://gitlab.com/users/sign_up>`_.
pt_br: `Inscreva-se para uma conta GitLab <https://gitlab.com/users/sign_up>`_.
zh_cn: `注册一个 GitLab 账户 <https://gitlab.com/users/sign_up>`_。

source: `Create a new blank project <https://gitlab.com/projects/new>`_.
pt_br: `Crie um novo projeto vazio <https://gitlab.com/projects/new>`_.
zh_cn: `创建一个新的空白项目 <https://gitlab.com/projects/new>`_。

source: Upload the project files (in your case ``README.rst``, ``lumache.py``, the makefiles under the ``docs`` directory, and everything under ``docs/source``) one by one using the :guilabel:`Upload File` button [#f1]_.
pt_br: Faça o upload dos arquivos do projeto (no seu caso ``README.rst``, ``lumache.py``, os makefiles no diretório ``docs`` e tudo em ``docs/source`` ) um de cada vez usando o botão :guilabel:`Upload File` [#f1]_.
zh_cn: 使用 :guilabel:`Upload File` 按钮 [#f1]_ 一次上传项目文件（在您的情况下为 ``README.rst``、``lumache.py``、``docs`` 目录下的 makefiles 以及 ``docs/source`` 下的所有内容）。

source: Again, these steps do not require additional software on your computer. To learn more, you can:
pt_br: Novamente, essas etapas não requerem software adicional em seu computador. Para saber mais, você pode:
zh_cn: 同样，这些步骤不需要在您的计算机上安装其他软件。要了解更多信息，您可以：

source: Follow `this tutorial`_ to install Git on your machine.
pt_br: Siga `este tutorial`_ para instalar o Git em sua máquina.
zh_cn: 按照 `this tutorial`_ 在您的计算机上安装 Git。

source: Browse the `GitLab User documentation`_ to understand the possibilities of the platform.
pt_br: Explore a `documentação do usuário do GitLab`_ para entender as possibilidades da plataforma.
zh_cn: 浏览 `GitLab User documentation`_ 以了解该平台的可能性。

source: At the time of writing, `uploading whole directories to GitLab using only the web interface <https://gitlab.com/gitlab-org/gitlab/-/issues/228490>`_ is not yet implemented.
pt_br: No momento em que este artigo foi escrito, o `upload de diretórios inteiros para o GitLab usando apenas a interface da web <https://gitlab.com/gitlab-org/gitlab/-/issues/228490>`_ ainda não estava implementado.
zh_cn: 在撰写本文时，`仅使用 Web 界面将整个目录上传到 GitLab <https://gitlab.com/gitlab-org/gitlab/-/issues/228490>`_ 尚未实现。

source: Publishing your HTML documentation
pt_br: Publicando sua documentação em HTML
zh_cn: 发布您的 HTML 文档

source: `Read the Docs`_ offers integration with both GitHub and GitLab. The quickest way of getting started is to follow :doc:`the RTD tutorial <readthedocs:tutorial/index>`, which is loosely based on this one. You can publish your sources on GitHub as explained :ref:`in the previous section <publishing-sources>`, then skip directly to :ref:`readthedocs:tutorial/index:Creating a Read the Docs account`. If you choose GitLab instead, the process is similar.
pt_br: `Read the Docs`_ oferece integração com GitHub e GitLab. A maneira mais rápida de começar é seguir :doc:`o tutorial do RTD <readthedocs:tutorial/index>`, que é vagamente baseado neste. Você pode publicar suas fontes no GitHub conforme explicado :ref:`na seção anterior <publishing-sources>` e, em seguida, pular diretamente para :ref:`readthedocs:tutorial/index:Creating a Read the Docs account`. Se você escolher o GitLab, o processo será semelhante.
zh_cn: `Read the Docs`_ 提供与 GitHub 和 GitLab 的集成。开始的最快方法是按照 :doc:`the RTD tutorial <readthedocs:tutorial/index>`，它大致基于本教程。您可以按照 :ref:`上一节 <publishing-sources>` 中的说明在 GitHub 上发布您的源文件，然后直接跳到 :ref:`readthedocs:tutorial/index:Creating a Read the Docs account`。如果您选择 GitLab，过程类似。

source: `GitHub Pages`_ requires you to :ref:`publish your sources <publishing-sources>` on `GitHub`_. After that, you will need an automated process that performs the ``make html`` step every time the sources change. That can be achieved using `GitHub Actions`_.
pt_br: `GitHub Pages`_ requer que você :ref:`publique suas fontes <publishing-sources>` no `GitHub`_. Depois disso, você precisará de um processo automatizado que execute a etapa ``make html`` toda vez que as fontes forem alteradas. Isso pode ser conseguido usando `GitHub Actions`_.
zh_cn: `GitHub Pages`_ 要求您在 `GitHub`_ 上 :ref:`发布您的源文件 <publishing-sources>`。之后，您将需要一个自动化过程，每次源文件更改时执行 ``make html`` 步骤。这可以使用 `GitHub Actions`_ 来实现。

source: After you have published your sources on GitHub, create a file named ``.github/workflows/sphinx.yml`` in your repository with the following contents:
pt_br: Depois de publicar suas fontes no GitHub, crie um arquivo chamado ``.github/workflows/sphinx.yml`` em seu repositório com o seguinte conteúdo:
zh_cn: 在您将源文件发布到 GitHub 之后，在您的存储库中创建一个名为 ``.github/workflows/sphinx.yml`` 的文件，内容如下：

source: This contains a GitHub Actions workflow with a single job of four steps:
pt_br: Contém um fluxo de trabalho do GitHub Actions com um único "job" de quatro etapas:
zh_cn: 这包含一个 GitHub Actions 工作流，其中有四个步骤的作业：

source: Checkout the code.
pt_br: Fazer checkout do código.
zh_cn: 签出代码。

source: Build the HTML documentation using Sphinx.
pt_br: Construir a documentação HTML usando Sphinx.
zh_cn: 使用 Sphinx 构建 HTML 文档。

source: Attach the HTML output the artifacts to the GitHub Actions job, for easier inspection.
pt_br: Anexar a saída HTML dos artefatos ao trabalho GitHub Actions, para facilitar a inspeção.
zh_cn: 将 HTML 输出附加到 GitHub Actions 作业的工件，以便于检查。

source: If the change happens on the default branch, take the contents of ``docs/build/html`` and push it to the ``gh-pages`` branch.
pt_br: Se a mudança acontecer no branch padrão, pegue o conteúdo de ``docs/build/html`` e envie-o para o branch ``gh-pages``.
zh_cn: 如果更改发生在默认分支上，请将 ``docs/build/html`` 的内容推送到 ``gh-pages`` 分支。

source: Next, you need to specify the dependencies for the ``make html`` step to be successful. For that, create a file ``docs/requirements.txt`` and add the following contents:
pt_br: Em seguida, você precisa especificar as dependências para que a atapa ``make html`` seja bem-sucedido. Para isso, crie um arquivo ``docs/requirements.txt`` e adicione o seguinte conteúdo:
zh_cn: 接下来，您需要指定 ``make html`` 步骤成功所需的依赖项。为此，请创建一个文件 ``docs/requirements.txt`` 并添加以下内容：

source: And finally, you are ready to `enable GitHub Pages on your repository`_. For that, go to :guilabel:`Settings`, then :guilabel:`Pages` on the left sidebar, select the ``gh-pages`` branch in the "Source" dropdown menu, and click :guilabel:`Save`. After a few minutes, you should be able to see your HTML at the designated URL.
pt_br: E finalmente, você está pronto para `ativar páginas do GitHub em seu repositório`_. Para isso, vá em :guilabel:`Settings`, depois em :guilabel:`Pages` na barra lateral esquerda, selecione o brnach ``gh-pages`` no menu suspenso "Source" e clique em :guilabel:`Save`. Depois de alguns minutos, você poderá ver seu HTML no URL designado.

source: `GitLab Pages`_, on the other hand, requires you to :ref:`publish your sources <publishing-sources>` on `GitLab`_. When you are ready, you can automate the process of running ``make html`` using `GitLab CI`_.
pt_br: `GitLab Pages`_, por outro lado, exige que você :ref:`publique suas fontes <publishing-sources>` no `GitLab`_. Quando estiver pronto, você pode automatizar o processo de execução do ``make html`` usando o `GitLab CI`_.
zh_cn: `GitLab Pages`_ 另一方面，要求您在 `GitLab`_ 上 :ref:`发布您的源文件 <publishing-sources>`。当您准备好后，您可以使用 `GitLab CI`_ 自动化运行 ``make html`` 的过程。

source: After you have published your sources on GitLab, create a file named ``.gitlab-ci.yml`` in your repository with these contents:
pt_br: Depois de publicar suas fontes no GitLab, crie um arquivo chamado ``.gitlab-ci.yml`` em seu repositório com este conteúdo:
zh_cn: 在您将源文件发布到 GitLab 之后，在您的存储库中创建一个名为 ``.gitlab-ci.yml`` 的文件，内容如下：

source: This contains a GitLab CI workflow with one job of several steps:
pt_br: Contém um fluxo de trabalho de GitLab CI com um job de várias etapas:
zh_cn: 它包含一个 GitLab CI 工作流，其中有多个步骤的一个作业：

source: Install the necessary dependencies.
pt_br: Instalar as dependências necessárias.
zh_cn: 安装必要的依赖项。

source: Move the output to a known artifacts location.
pt_br: Mover a saída para um local de artefatos conhecido.
zh_cn: 将输出移动到已知的工件位置。

source: You will need to `validate your account`_ by entering a payment method (you will be charged a small amount that will then be reimbursed).
pt_br: Você precisará `validar sua conta`_ inserindo um método de pagamento (será cobrado um pequeno valor que será reembolsado).
zh_cn: 需要通过输入付款方式来 `validate your account`_ （将收取一小笔费用，然后将予以退还）。

source: After that, if the pipeline is successful, you should be able to see your HTML at the designated URL.
pt_br: Depois disso, se o pipeline for bem-sucedido, você poderá ver seu HTML no URL designado.
zh_cn: 然后，如果工作流成功，您应该能够在指定的 URL 看到您的 HTML。

source: And finally, you are ready to `publish GitHub Pages from a branch`_. For that, go to :guilabel:`Settings`, then :guilabel:`Pages` on the left sidebar, select the ``Deploy from a branch`` item in the "Source" dropdown menu, select the ``gh-page`` branch in the "Branch" dropdown menu, and click :guilabel:`Save`. After a few minutes, you should be able to see your HTML at the designated URL.
zh_cn: 最后，您可以 `publish GitHub Pages from a branch`_ 了。为此，请转到 :guilabel:`Settings`，然后在左侧边栏中选择 :guilabel:`Pages`，在“Source”下拉菜单中选择“Deploy from a branch”项，在“Branch”下拉菜单中选择 ``gh-page`` 分支，然后单击 :guilabel:`Save`。几分钟后，您应该能够在指定的 URL 看到您的 HTML。
