Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/tutorial/narrative-documentation.po
Languages: pt_br, zh_cn

source: Narrative documentation in Sphinx
pt_br: Documentação narrativa no Sphinx
zh_cn: Sphinx叙述性文档

source: Structuring your documentation across multiple pages
pt_br: Estruturando sua documentação em múltiplas páginas
zh_cn: 跨多个页面构建文档结构

source: The file ``index.rst`` created by ``sphinx-quickstart`` is the :term:`root document`, whose main function is to serve as a welcome page and to contain the root of the "table of contents tree" (or *toctree*). Sphinx allows you to assemble a project from different files, which is helpful when the project grows.
pt_br: O arquivo ``index.rst`` criado por ``sphinx-quickstart`` é o :term:`documento raiz`, cuja principal função é servir como uma página de boas-vindas e conter a raiz da "árvore do tabela de conteúdo" (ou *toctree*). O Sphinx permite montar um projeto a partir de diferentes arquivos, o que é útil quando o projeto cresce.
zh_cn: 由 ``sphinx-quickstart`` 创建的 ``index.rst`` 文件是 :term:`根文档 <root document>`，其主要功能是作为欢迎页面并包含“目录树”（或 *toctree*）的根。Sphinx允许您从不同的文件组装项目，这在项目增长时非常有用。

source: As an example, create a new file ``docs/source/usage.rst`` (next to ``index.rst``) with these contents:
pt_br: Como exemplo, crie um novo arquivo ``docs/source/usage.rst`` (ao lado de ``index.rst``) com este conteúdo:
zh_cn: 作为示例，创建一个新文件 ``docs/source/usage.rst`` （在 ``index.rst`` 旁边），内容如下：

source: This new file contains two :ref:`section <rst-sections>` headers, normal paragraph text, and a :rst:dir:`code-block` directive that renders a block of content as source code, with appropriate syntax highlighting (in this case, generic ``console`` text).
pt_br: Este novo arquivo contém dois cabeçalhos de :ref:`seção <rst-sections>`, texto de parágrafo normal e uma diretiva :rst:dir:`code-block` que renderiza um bloco de conteúdo como código-fonte, com realce de sintaxe apropriado (neste caso, texto genérico ``console``).
zh_cn: 此新文件包含两个 :ref:`章节 <rst-sections>` 标题、普通段落文本和一个 :rst:dir:`code-block` 指令，该指令将一块内容呈现为源代码，并具有适当的语法高亮显示（在本例中为通用的 ``console`` 文本）。

source: The structure of the document is determined by the succession of heading styles, which means that, by using ``---`` for the "Installation" section after ``===`` for the "Usage" section, you have declared "Installation" to be a *subsection* of "Usage".
pt_br: A estrutura do documento é determinada pela sucessão de estilos de cabeçalho, o que significa que, ao usar ``---`` para a seção "Installation" depois de ``===`` para a seção "Usage", você declarou "Installation" como uma *subseção* de "Usage".
zh_cn: 文档的结构由标题样式的连续决定，这意味着，通过在“用法”部分使用 ``===`` 后使用 ``---`` 来表示“安装”部分，您已将“安装”声明为“用法”的*子部分*。

source: To complete the process, add a ``toctree`` :ref:`directive <rst-directives>` at the end of ``index.rst`` including the document you just created, as follows:
pt_br: Para completar o processo, adicione uma :ref:`diretiva <rst-directives>` ``toctree`` no final de ``index.rst`` incluindo o documento que você acabou de criar, como segue:
zh_cn: 要完成此过程，请在 ``index.rst`` 的末尾添加一个 ``toctree`` :ref:`指令 <rst-directives>`，包括您刚创建的文档，如下所示：

source: This step inserts that document in the root of the *toctree*, so now it belongs to the structure of your project, which so far looks like this:
pt_br: Este passo insere esse documento na raiz do *toctree*, então agora ele pertence à estrutura do seu projeto, que até agora está assim:
zh_cn: 此步骤将该文档插入到 *toctree* 的根中，因此它现在属于您的项目结构，到目前为止看起来是这样的：

source: If you build the HTML documentation running ``make html``, you will see that the ``toctree`` gets rendered as a list of hyperlinks, and this allows you to navigate to the new page you just created. Neat!
pt_br: Se você construir a documentação HTML executando ``make html``, você verá que o ``toctree`` é renderizado como uma lista de hiperlinks, e isso permite que você navegue para a nova página que acabou de criar. Bem organizado!
zh_cn: 如果您运行 ``make html`` 构建HTML文档，您将看到 ``toctree`` 被渲染为超链接列表，这使您可以导航到刚创建的新页面。很整洁！

source: Documents outside a *toctree* will result in ``WARNING: document isn't included in any toctree`` messages during the build process, and will be unreachable for users.
pt_br: Documentos fora de um *toctree* resultarão em mensagens ``AVISO: o documento não está incluído em nenhum toctree`` durante o processo de construção e ficarão inacessíveis para os usuários.
zh_cn: 不在 *toctree* 中的文档将在构建过程中导致 ``WARNING: document isn't included in any toctree`` 消息，并且用户将无法访问。

source: Adding cross-references
pt_br: Adicionando referências cruzadas
zh_cn: 添加交叉引用

source: One powerful feature of Sphinx is the ability to seamlessly add :ref:`cross-references <xref>` to specific parts of the documentation: a document, a section, a figure, a code object, etc. This tutorial is full of them!
pt_br: Um recurso poderoso do Sphinx é a capacidade de adicionar :ref:`referências cruzadas <xref>=` para partes específicas da documentação: um documento, uma seção, uma figura, um objeto código, etc. Este tutorial está cheio deles!
zh_cn: Sphinx的一个强大功能是能够无缝地向文档的特定部分添加 :ref:`交叉引用 <xref>`：一个文档、一个章节、一个图形、一个代码对象等。本教程充满了它们！

source: To add a cross-reference, write this sentence right after the introduction paragraph in ``index.rst``:
pt_br: Para adicionar uma referência cruzada, escreva esta frase logo após o parágrafo de introdução em ``index.rst``:
zh_cn: 要添加交叉引用，请在 ``index.rst`` 的介绍段落后编写以下句子：

source: The :rst:role:`doc` :ref:`role <rst-roles>` you used automatically references a specific document in the project, in this case the ``usage.rst`` you created earlier.
pt_br: O :ref:`papel <rst-roles>` :rst:role:`doc` que você usou automaticamente faz referência a um documento específico no projeto, neste caso o ``usage.rst`` que você criou anteriormente.
zh_cn: 您使用的 :rst:role:`doc` :ref:`角色 <rst-roles>` 会自动引用项目中的特定文档，在这种情况下是您之前创建的 ``usage.rst``。

source: Alternatively, you can also add a cross-reference to an arbitrary part of the project. For that, you need to use the :rst:role:`ref` role, and add an explicit *label* that acts as :duref:`a target <hyperlink-targets>`.
pt_br: Alternativamente, você também pode adicionar uma referência cruzada a uma parte arbitrária do projeto. Para isso, você precisa usar o papel :rst:role:`ref`, e adicionar um *rótulo* explícito que atue como :duref:`um alvo <hyperlink-targets>`.
zh_cn: 或者，您还可以向项目的任意部分添加交叉引用。为此，您需要使用 :rst:role:`ref` 角色，并添加一个充当 :duref:`目标 <hyperlink-targets>` 的显式 *标签*。

source: For example, to reference the "Installation" subsection, add a label right before the heading, as follows:
pt_br: Por exemplo, para fazer referência à subseção "Installation", adicione um rótulo logo antes do título da seguinte forma:
zh_cn: 例如，要引用“安装”子部分，请在标题前添加一个标签，如下所示：

source: And make the sentence you added in ``index.rst`` look like this:
pt_br: E faça com que a frase que você adicionou em ``index.rst`` fique assim:
zh_cn: 并使您在 ``index.rst`` 中添加的句子如下所示：

source: Notice a trick here: the ``install`` part specifies how the link will look like (we want it to be a specific word, so the sentence makes sense), whereas the ``<installation>`` part refers to the actual label we want to add a cross-reference to. If you do not include an explicit title, hence using ``:ref:`installation```, the section title will be used (in this case, ``Installation``). Both the ``:doc:`` and the ``:ref:`` roles will be rendered as hyperlinks in the HTML documentation.
pt_br: Observe um truque aqui: a parte ``install`` especifica como será a aparência do link (queremos que seja uma palavra específica, para que a frase faça sentido), enquanto a parte ``<installation>`` refere-se ao rótulo real ao qual queremos adicionar uma referência cruzada. Se você não incluir um título explícito, portanto usando ``:ref:`installation```, o título da seção será usado (neste caso, ``Installation``). Ambas os papéis ``:doc:`` e ``:ref:`` serão renderizadas como hiperlinks na documentação HTML.
zh_cn: 请注意这里的一个技巧：``install`` 部分指定了链接的外观（我们希望它是一个特定的单词，以使句子有意义），而 ``<installation>`` 部分则指的是我们要添加交叉引用的实际标签。如果您不包含显式标题，因此使用 ``:ref:`installation```，则将使用章节标题（在本例中为 ``Installation``）。 ``:doc:`` 和 ``:ref:`` 角色都将被渲染为HTML文档中的超链接。

source: What about :doc:`documenting code objects in Sphinx </tutorial/describing-code>`? Read on!
pt_br: E quanto a :doc:`documentar objetos código no Sphinx </tutorial/describing-code>`? Continue lendo!
zh_cn: 那么在Sphinx中 :doc:`记录代码对象 </tutorial/describing-code>` 呢？继续阅读！
