Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: String that specifies the :term:`document name` of the LaTeX file's master document. All documents referenced by the *startdoc* document in ToC trees will be included in the LaTeX file. (If you want to use the default master document for your LaTeX build, provide your :confval:`master_doc` here.)
pt_br: String que especifica o :term:`nome do documento <document name>` do documento mestre do arquivo LaTeX. Todos os documentos referenciados pelo documento *startdoc* nas árvores ToC serão incluídos no arquivo LaTeX. (Se você deseja usar o documento mestre padrão para sua construção LaTeX, forneça seu :confval:`master_doc` aqui.)

source: File name of the LaTeX file in the output directory.
pt_br: Nome de arquivo do arquivo LaTeX no diretório de saída.

source: LaTeX document title. Can be empty to use the title of the *startdoc* document. This is inserted as LaTeX markup, so special characters like a backslash or ampersand must be represented by the proper LaTeX commands if they are to be inserted literally.
pt_br: Título do documento LaTeX. Pode estar vazio para usar o título do documento *startdoc*. Isso é inserido como marcação LaTeX, portanto, caracteres especiais como uma barra invertida ou "e" comercial devem ser representados pelos comandos LaTeX apropriados se forem inseridos literalmente.

source: Author for the LaTeX document. The same LaTeX markup caveat as for *title* applies. Use ``\\and`` to separate multiple authors, as in: ``'John \\and Sarah'`` (backslashes must be Python-escaped to reach LaTeX).
pt_br: Autor do documento LaTeX. A mesma advertência de marcação LaTeX que para *title* se aplica. Use ``\\and`` para separar vários autores, como em: ``'John \\and Sarah'`` (as barras invertidas devem ter escape do Python para chegar ao LaTeX).

source: LaTeX theme. See :confval:`latex_theme`.
pt_br: Tema LaTeX. Veja :confval:`latex_theme`.

source: Must be :code-py:`True` or :code-py:`False`. If True, the *startdoc* document itself is not included in the output, only the documents referenced by it via ToC trees. With this option, you can put extra stuff in the master document that shows up in the HTML, but not the LaTeX output.
pt_br: Deve ser :code-py:`True` ou :code-py:`False`. Se verdadeiro, o próprio documento *startdoc* não é incluído na saída, apenas os documentos referenciados por ele por meio de árvores ToC. Com esta opção, você pode colocar coisas extras no documento mestre que aparecem no HTML, mas não na saída LaTeX.

source: The 6th item ``toctree_only``. Tuples with 5 items are still accepted.
pt_br: O 6º item de ``toctree_only``. Tuplas com 5 itens são aceitos.

source: In the past including your own document class required you to prepend the document class name with the string "sphinx". This is not necessary anymore.
pt_br: Anteriormente incluindo classe do seu próprio documento podia ser prefixado a nome da classe com a string "sphinx". Não é mais necessário.

source: If given, this must be the name of an image file (path relative to the :term:`configuration directory`) that is the logo of the documentation. It is placed at the top of the title page.
pt_br: Se fornecido, este deve ser o nome de um arquivo de imagem (caminho relativo ao diretório de configuração) que serve como logotipo da documentação. Ele é posicionado no topo da página de título.

source: This value determines the topmost sectioning unit. The default setting is ``'section'`` if :confval:`latex_theme` is ``'howto'``, and ``'chapter'`` if it is ``'manual'``. The alternative in both cases is to specify ``'part'``, which means that LaTeX document will use the :code-tex:`\\part` command.
pt_br: Este valor determina a unidade de seção superior. A configuração padrão é ``'section'`` se :confval:`latex_theme` for ``'howto'``, e ``'chapter'`` se for ``'manual'``. A alternativa em ambos os casos é especificar ``'part'``, o que significa que o documento LaTeX vai usar o comando :code-tex:`\\part`.

source: In that case the numbering of sectioning units one level deep gets off-sync with HTML numbering, as by default LaTeX does not reset :code-tex:`\\chapter` numbering (or :code-tex:`\\section` for ``'howto'`` theme) when encountering :code-tex:`\\part` command.
pt_br: Nesse caso, a numeração das unidades de seção em um nível de profundidade fica dessincronizada com a numeração HTML, pois por padrão o LaTeX não redefine a numeração de :code-tex:`\\chapter` (ou de :code-tex:`\\section` para o tema ``'howto'``) ao encontrar o comando :code-tex:`\\part`.

source: A list of document names to append as an appendix to all manuals. This is ignored if :confval:`latex_theme` is set to :code-py:`'howto'`.
pt_br: Uma lista de nomes dos documentos a serem anexados como apêndice a todos os manuais. Isso será ignorado se :confval:`latex_theme` estiver definido como :code-py:`'howto'`.

source: Add page references after internal references. This is very useful for printed copies of the manual.
pt_br: Adiciona referências de página após as referências internas. Isso é muito útil para cópias impressas do manual.

source: Control how to display URL addresses. This is very useful for printed copies of the manual. The setting can have the following values:
pt_br: Controla como os endereços URL são exibidos. Isso é muito útil para cópias impressas do manual. A configuração pode ter os seguintes valores:

source: Do not display URLs
pt_br: Não exibe URLs

source: Display URLs in footnotes
pt_br: Exibe URLs em notas de rodapé

source: Display URLs inline in parentheses
pt_br: Exibe URLs embutidas em parênteses

source: This value is now a string; previously it was a boolean value, and a true value selected the :code-py:`'inline'` display. For backwards compatibility, :code-py:`True` is still accepted.
pt_br: O valor é uma string; anteriormente era um valor boleano e valor verdadeiro slsecionava a exibição :code-py:`'inline'`. Por retrocompatibilidade, :code-py:`True` ainda é aceito.

source: Use standard LaTeX's :code-tex:`\\multicolumn` for merged cells in tables.
pt_br: Usa o recurso padrão do LaTeX `:code-tex:`\\multicolumn` para células mescladas em tabelas.

source: Sphinx's own macros are used for merged cells from grid tables. They allow general contents (literal blocks, lists, blockquotes, ...) but may have problems if the :rst:dir:`tabularcolumns` directive was used to inject LaTeX mark-up of the type ``>{..}``, ``<{..}``, ``@{..}`` as column specification.
pt_br: As próprias macros do Sphinx são usadas para células mescladas de tabelas de grade. Eles permitem conteúdos gerais (blocos literais, listas, blocos de citação, ...) mas podem ter problemas se a diretiva :rst:dir:`tabularcolumns` foi usada para injetar marcação LaTeX do tipo ``>{..}``, ``<{..}``, ``@{..}`` como especificação de coluna.

source: Use LaTeX's standard :code-tex:`\\multicolumn`; this is incompatible with literal blocks in horizontally merged cells, and also with multiple paragraphs in such cells if the table is rendered using ``tabulary``.
pt_br: Usa o padrão do LaTeX :code-tex:`\\multicolumn`; isso é incompatível com blocos literais nas células mescladas horizontalmente e também com vários parágrafos em tais células se a tabela for renderizada usando ``tabulary``.

source: A list of styling classes (strings). Currently supported:
pt_br: Uma lista de classes de estilo (strings). Atualmente há suporte a:

source: No vertical lines, and only 2 or 3 horizontal lines (the latter if there is a header), using the booktabs_ package.
pt_br: Sem linhas verticais, e apenas 2 ou 3 linhas horizontais (esta última se houver cabeçalho), usando o pacote booktabs_.

source: No lines whatsoever.
pt_br: Completamente sem linhas.

source: If you want to use a special colour for the *contents* of the cells of a given column use ``>{\noindent\color{<color>}}``, possibly in addition to the above.
pt_br: Se você quiser usar uma cor especial para o *conteúdo* das células de uma determinada coluna, use ``>{\noindent\color{<color>}}``, possivelmente além do acima.

source: Multi-row merged cells, whether single column or multi-column currently ignore any set column, row, or cell colour.
pt_br: Células mescladas de várias linhas, sejam de coluna única ou de várias colunas, atualmente ignoram qualquer definição de coluna, linha ou cor de célula.

source: In a document not using ``'booktabs'`` globally, it is possible to style an individual table via the ``booktabs`` class, but it will be necessary to add ``r'\usepackage{booktabs}'`` to the LaTeX preamble.
pt_br: Em um documento que não usa ``'booktabs'`` globalmente, é possível estilizar uma tabela individual através da classe ``booktabs``, mas será necessário adicionar ``r'\usepackage{booktabs}'`` ao preâmbulo do LaTeX.

source: On the other hand one can use ``colorrows`` class for individual tables with no extra package (as Sphinx since 5.3.0 always loads colortbl_).
pt_br: Por outro lado pode-se usar a classe ``colorrows`` para tabelas individuais sem nenhum pacote extra (já que o Sphinx desde a versão 5.3.0 sempre carrega colortbl_).

source: Options for text output
pt_br: Opções para saída texto

source: These options influence text output.
pt_br: Essas opções influenciam a saída texto.

source: Determines which end-of-line character(s) are used in text output.
pt_br: Determina caracter usado como final de linha na saída texto.

source: A string of 7 characters that should be used for underlining sections. The first character is used for first-level headings, the second for second-level headings and so on.
pt_br: String de 7 caracteres que deve ser usada para seções contidas. O primeiro caracter é usado para cabeçalhos do primeiro nível, segundo caracter para segundo nível e assim sucessivamente.

source: Options for manual page output
pt_br: Opções para saída página de manual

source: These options influence manual page output.
pt_br: Essas opções influenciam a saída página manual.

source: Options for Texinfo output
pt_br: Opções para saída TexInfo

source: These options influence Texinfo output.
pt_br: Essas opções influenciam a saída Texinfo.

source: File name (no extension) of the Texinfo file in the output directory.
pt_br: Nome de arquivo (sem extensão) do arquivo Texinfo no diretório de saída.

source: The name that will appear in the top-level ``DIR`` menu file.
pt_br: O nome que vai aparecer no arquivo de menu de topo de nível ``DIR``.

source: Descriptive text to appear in the top-level ``DIR`` menu file.
pt_br: Um texto descritivo que vai aparecer no arquivo de menu de topo de nível ``DIR``.

source: Specifies the section which this entry will appear in the top-level ``DIR`` menu file.
pt_br: Especifica a seção na qual esta entrada vai aparecer no arquivo de menu de topo de nível ``DIR``.

source: A list of document names to append as an appendix to all manuals.
pt_br: Lista de nomes de documentos que serão anexados para todos manuais.

source: Keys that you may want to override include:
pt_br: Chaves que podem ser sobrepostas são:

source: Texinfo markup inserted near the beginning of the file.
pt_br: Marcação TexInfo inserida próxima do início do arquivo.

source: Options for QtHelp output
pt_br: Opções para saída QtHelp

source: Options for the linkcheck builder
pt_br: Opções para construtor linkcheck

source: the link in the document matches the source URI pattern, and
pt_br: o link no documento corresponde ao padrão de URI de origem e

source: the redirect location matches the canonical URI pattern.
pt_br: o local de redirecionamento corresponde ao padrão de URI canônico.

source: Use :confval:`linkcheck_anchors_ignore_for_url` to check a URL, but skip verifying that the anchors exist.
pt_br: Use :confval:`linkcheck_anchors_ignore_for_url` para verificar uma URL, mas pulando a verificação de se as âncoras existem.

source: Pass authentication information when doing a ``linkcheck`` build.
pt_br: Passa informações de autenticação ao fazer uma construção ``linkcheck``.

source: A regular expression that matches a URI.
pt_br: Uma expressão regular que corresponde a uma URI.

source: The value is a dictionary that maps header name to its value.
pt_br: O valor é um dicionário que mapeia nome de cabeçalho para seu valor.

source: Options for the C domain
pt_br: Opções para o domínio C

source: Options for the C++ domain
pt_br: Opções para domínio C++

source: Options for the Javascript domain
pt_br: Opções para o domínio JavaScript

source: Options for the Python domain
pt_br: Opções para o domínio Python

source: Examples
pt_br: Exemplos

source: The examples below use the following :rst:dir:`py:function` directive:
pt_br: Os exemplos abaixo usam a seguinte diretiva :rst:dir:`py:function`:

source: For the Python domain, the signature length depends on whether the type parameters or the list of arguments are being formatted. For the former, the signature length ignores the length of the arguments list; for the latter, the signature length ignores the length of the type parameters list.
pt_br: Para o domínio Python, o comprimento da assinatura depende se os parâmetros de tipo ou a lista de argumentos estão sendo formatados. Para o primeiro, o comprimento da assinatura ignora o comprimento da lista de argumentos; para este último, o comprimento da assinatura ignora o comprimento da lista de parâmetros de tipo.

source: Now also removes ``<BLANKLINE>``.
pt_br: Agora també remove ``<BLANKLINE>``.

source: Extension options
pt_br: Opções Extensão
