Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: A list of `glob-style patterns`_ that should be excluded when looking for source files. They are matched against the source file names relative to the source directory, using slashes as directory separators on all platforms. :confval:`exclude_patterns` has priority over :confval:`include_patterns`.
pt_br: Uma lista de `padrões estilo glob`_ que deve ser desconsiderada quando buscando arquivos fonte. Eles são verificados contra nomes de arquivo fonte relativos ao diretório fonte, usando barras com separador de diretório em todas as plataformas. :confval:`exclude_patterns` tem prioridade sobre :confval:`include_patterns`.

source: Example patterns:
pt_br: Padrões de exemplo:

source: :code-py:`'library/xml.rst'` -- ignores the ``library/xml.rst`` file
pt_br: :code-py:`'library/xml.rst'` -- ignora o arquivo de ``library/xml.rst``

source: :code-py:`'library/xml'` -- ignores the ``library/xml`` directory
pt_br: :code-py:`'library/xml'` -- ignora o diretório de ``library/xml``

source: :code-py:`'library/xml*'` -- ignores all files and directories starting with :code-py:`library/xml`
pt_br: :code-py:`'library/xml*'` -- ignora todos os arquivos e diretórios iniciando com :code-py:`library/xml`

source: :code-py:`'**/.git'` -- ignores all ``.git`` directories
pt_br: :code-py:`'**/.git'` -- ignora todos diretórios ``.git``

source: :code-py:`'Thumbs.db'` -- ignores all ``Thumbs.db`` files
pt_br: :code-py:`'Thumbs.db'` -- ignora todos diretórios ``Thumbs.db``

source: :confval:`exclude_patterns` is also consulted when looking for static files in :confval:`html_static_path` and :confval:`html_extra_path`.
pt_br: :confval:`exclude_patterns` também é consultado quando buscando por arquivos estáticos no :confval:`html_static_path` e :confval:`html_extra_path`.

source: A list of `glob-style patterns`_ that are used to find source files. They are matched against the source file names relative to the source directory, using slashes as directory separators on all platforms. By default, all files are recursively included from the source directory. :confval:`exclude_patterns` has priority over :confval:`include_patterns`.
pt_br: Uma lista de `padrões de estilo glob`_ que são usados ​​para encontrar arquivos fonte. Eles são comparados com os nomes dos arquivos de origem relativos ao diretório fonte, usando barras como separadores de diretório em todas as plataformas. Por padrão, todos os arquivos são incluídos recursivamente no diretório fonte. :confval:`exclude_patterns` tem prioridade sobre :confval:`include_patterns`.

source: :code-py:`'**'` -- all files in the source directory and subdirectories, recursively
pt_br: :code-py:`'**'` -- todos os arquivos no diretório fonte e subdiretórios, recursivamente

source: :code-py:`'library/xml'` -- just the ``library/xml`` directory
pt_br: :code-py:`'library/xml'` -- apenas o diretório de ``library/xml``

source: :code-py:`'library/xml*'` -- all files and directories starting with ``library/xml``
pt_br: :code-py:`'library/xml*'` -- todos os arquivos e diretórios iniciando com ``library/xml``

source: :code-py:`'**/doc'` -- all ``doc`` directories (this might be useful if documentation is co-located with source files)
pt_br: :code-py:`'**/doc'` -- todos os diretórios ``doc`` (isso pode ser útil se a documentação estiver co-localizada com arquivos fonte)

source: Sphinx builds a tree of documents based on the :rst:dir:`toctree` directives contained within the source files. This sets the name of the document containing the master ``toctree`` directive, and hence the root of the entire tree. Example:
pt_br: O Sphinx constrói uma árvore de documentos baseada nas diretivas :rst:dir:`toctree` contidas nos arquivos fonte. Isto define o nome do documento que contém a diretiva mestre ``toctree`` e, portanto, a raiz de toda a árvore. Exemplo:

source: Default is :code-py:`'index'` (previously :code-py:`'contents'`).
pt_br: O padrão é :code-py:`'index'` (anteriormente :code-py:`'contents'`).

source: The :confval:`!root_doc` alias.
pt_br: O apelido :confval:`!root_doc`.

source: The file encoding of all source files. The recommended encoding is ``'utf-8-sig'``.
pt_br: A codificação de arquivo de todos arquivos fonte. A codificação recomendada é ``'utf-8-sig'``.

source: Support for source encodings other than UTF-8 is deprecated. Sphinx 11 will only support UTF-8 files.
pt_br: O suporte para codificações de origem diferentes de UTF-8 foi descontinuado. O Sphinx 11 suportará apenas arquivos UTF-8.

source: A dictionary mapping the file extensions (suffixes) of source files to their file types. Sphinx considers all files files with suffixes in :code-py:`source_suffix` to be source files. Example:
pt_br: Um dicionário que mapeia as extensões de arquivo (sufixos) dos arquivos fonte para seus tipos de arquivo. O Sphinx considera todos os arquivos com sufixos em :code-py:`source_suffix` como arquivos fonte. Exemplo:

source: By default, Sphinx only supports the :code-py:`'restructuredtext'` file type. Further file types can be added with extensions that register different source file parsers, such as `MyST-Parser`_. Refer to the extension's documentation to see which file types it supports.
pt_br: Por padrão, o Sphinx dá suporte apenas ao tipo de arquivo :code-py:`'restructuredtext'`. Outros tipos de arquivos podem ser adicionados com extensões que registram diferentes analisadores de arquivos fonte, como `MyST-Parser`_. Consulte a documentação da extensão para ver a quais tipos de arquivo ela tem suporte.

source: If the value is a string or sequence of strings, Sphinx will consider that they are all :code-py:`'restructuredtext'` files.
pt_br: Se o valor for uma string ou sequência de strings, o Sphinx considerará que todos eles são arquivos :code-py:`'restructuredtext'`.

source: File extensions must begin with a dot (``'.'``).
pt_br: As extensões de arquivo devem começar com um ponto (``'.'``).

source: Support a list of file extensions.
pt_br: Suporte a uma lista de extensões de arquivos.

source: Change to a map of file extensions to file types.
pt_br: Muda para um mapa de extensões de arquivo para tipos de arquivo.

source: Options for smart quotes
pt_br: Opções para aspas inteligentes

source: If :code-py:`True`, the `Smart Quotes transform`__ will be used to convert quotation marks and dashes to typographically correct entities.
pt_br: Se :code-py:`True`, a `transformação Smart Quotes`__ será usada para converter aspas e travessões em entidades tipograficamente corretas.

source: Replaces the now-removed :confval:`!html_use_smartypants`. It applies by default to all builders except ``man`` and ``text`` (see :confval:`smartquotes_excludes`.)
pt_br: Substitui :confval:`!html_use_smartypants`, agora removida. Aplica-se por padrão para todos os construtores, exceto ``man`` e ``text`` (ver :confval:`smartquotes_excludes`.)

source: A `docutils.conf`__ file located in the :term:`configuration directory` (or a global :file:`~/.docutils` file) is obeyed unconditionally if it *deactivates* smart quotes via the corresponding `Docutils option`__. But if it *activates* them, then :confval:`smartquotes` does prevail.
pt_br: Um arquivo `docutils.conf`__ localizado no :term:`diretório de configuração` (ou em um arquivo global :file:`~/.docutils`) é respeitado incondicionalmente se ele *desativa* aspas inteligentes através da correspondente `opção do Docutils`__. Mas se *ativa*, então :confval:`smartquotes`, não prevalece.

source: Customise the Smart Quotes transform. See below for the permitted codes. The default :code-py:`'qDe'` educates normal **q**\ uote characters ``"``, ``'``, em- and en-**D**\ ashes ``---``, ``--``, and **e**\ llipses ``...``..
pt_br: Personaliza a transformação Smart Quotes (aspas inteligentes). Veja abaixo os códigos permitidos. O padrão :code-py:`'qDe'` educa os caracteres normais de aspas (**q**\ uote) ``"``, ``'``, travessão e meia-risca (em- e en-**D**\ ashes) ``---``, ``--``, e reticências (**e**\ llipses) ``...``..

source: Convert quotation marks
pt_br: Converte aspas simples e duplas comuns

source: Convert backtick quotation marks (:literal:`\`\`double''` only)
pt_br: Converte aspas com sinal de crase ou backticks (:literal:`\`\`duplas''` apenas)

source: Convert backtick quotation marks (:literal:`\`\`double''` and :literal:`\`single'`)
pt_br: Converte aspas com sinal de crase ou backticks (:literal:`\`\`duplas''` e :literal:`\`simples'`)

source: Convert dashes (convert ``--`` to em-dashes and ``---`` to en-dashes)
pt_br: Converte traços (converte ``--`` para travessões e ``---`` para meia-risca)

source: Convert dashes (old school) (convert ``--`` to en-dashes and ``---`` to em-dashes)
pt_br: Converte traços no modo "das antigas" (converte ``--`` para meia-risca e ``---`` para travessões)

source: Convert dashes (inverted old school) (convert ``--`` to em-dashes and ``---`` to en-dashes)
pt_br: Converte traços no modo "das antigas" invertido (converte ``--`` para travessões e ``---`` para meia-risca)

source: Convert ellipses ``...``
pt_br: Converte reticências ``...``

source: Convert ``'&quot;'`` entities to ``'"'``
pt_br: Converte entidades ``'&quot;'`` para ``'"'``

source: Control when the Smart Quotes transform is disabled. Permitted keys are :code-py:`'builders'` and :code-py:`'languages'`, and The values are lists of strings.
pt_br: Contra quando a transformação Smart Quotes está desabilitada. As chaves permitidas são :code-py:`'builders'` e :code-py:`'languages'`, e os valores são listas de strings.

source: Each entry gives a sufficient condition to ignore the :confval:`smartquotes` setting and deactivate the Smart Quotes transform. Example:
pt_br: Cada entrada fornece uma condição suficiente para ignorar a configuração :confval:`smartquotes` e desativar a transformação Smart Quotes. Exemplo:

source: Currently, in case of invocation of :program:`make` with multiple targets, the first target name is the only one which is tested against the :code-py:`'builders'` entry and it decides for all. Also, a ``make text`` following ``make html`` needs to be issued in the form ``make text SPHINXOPTS="-E"`` to force re-parsing of source files, as the cached ones are already transformed. On the other hand the issue does not arise with direct usage of :program:`sphinx-build` as it caches (in its default usage) the parsed source files in per builder locations.
pt_br: Atualmente, em caso de chamada do :program:`make` com múltiplos alvos, o primeiro nome será o único validado nas opções :code-py:`'builders'` e decidirá por todos. Também um ``make text`` seguido por ``make html`` aninhado será emitido no formato ``make text SPHINXOPTS="-E"`` para forçar a transmissão dos arquivos fonte, como cache que já foi transformado. De outra maneira o requerimento não se realizará no uso do :program:`sphinx-build` como cache (que é o uso padrão) dos arquivos fonte submetidos para cada construtor.

source: An alternative way to effectively deactivate (or customise) the smart quotes for a given builder, for example ``latex``, is to use ``make`` this way:
pt_br: Uma maneira alternativa de efetivamente desativar (ou personalizar) as aspas inteligentes para um determinado construtor, por exemplo, ``latex``, é usar o ``make`` desta maneira:

source: This can follow some ``make html`` with no problem, in contrast to the situation from the prior note.
pt_br: Isto pode seguir algum ``make html`` sem problemas, em contraste com a situação da nota anterior.

source: Options for templating
pt_br: Opções de temas

source: A string with the fully-qualified name of a callable (or simply a class) that returns an instance of :class:`~sphinx.application.TemplateBridge`. This instance is then used to render HTML documents, and possibly the output of other builders (currently the changes builder). (Note that the template bridge must be made theme-aware if HTML themes are to be used.) Example:
pt_br: String com nome totalmente qualificado de chamável (ou simplesmente uma classe) que retorna uma instância de :class:`~sphinx.application.TemplateBridge`. Essa instância é então usada para renderizar a criação de documentos HTML ou de outros construtores (construtor corrente). (Note que a ligação do modelo do tema deve comportar HTML se temas são usados.) Exemplo:

source: A list of paths that contain extra templates (or templates that overwrite builtin/theme-specific templates). Relative paths are taken as relative to the :term:`configuration directory`. Example:
pt_br: A lista de caminhos que contêm modelos extras (ou modelos que sobrepõe temas internos ou específicos do tema). Caminhos relativos são tratados como relativos ao :term:`diretório de configuração`. Exemplo:

source: As these files are not meant to be built, they are automatically excluded when discovering source files.
pt_br: Como esses arquivos não são destinados para serem construídos, eles são automaticamente excluídos ao descobrir arquivos fonte.

source: Options for warning control
pt_br: Opções para controle de avisos

source: Add the type of each warning as a suffix to the warning message. For example, ``WARNING: [...] [index]`` or ``WARNING: [...] [toc.circular]``. This setting can be useful for determining which warnings types to include in a :confval:`suppress_warnings` list.
pt_br: Adiciona o tipo de cada aviso como sufixo à mensagem de aviso. Por exemplo, ``WARNING: [...] [index]`` ou ``WARNING: [...] [toc.circular]``. Esta configuração pode ser útil para determinar quais tipos de avisos incluir em uma lista de :confval:`suppress_warnings`.

source: The default is now :code-py:`True`.
pt_br: O padrão é agora :code-py:`True`.

source: A list of warning codes to suppress arbitrary warning messages.
pt_br: Uma lista de códigos de aviso para suprimir mensagens de aviso arbitrárias.

source: By default, Sphinx supports the following warning codes:
pt_br: Por padrão, o Sphinx tem suporte aos seguintes códigos de aviso:

source: Extensions can also define their own warning types. Those defined by the first-party ``sphinx.ext`` extensions are:
pt_br: As extensões também podem definir seus próprios tipos de aviso. Aqueles definidos pelas extensões do ``sphinx.ext`` são:

source: You can choose from these types. You can also give only the first component to exclude all warnings attached to it.
pt_br: Você pode escolher entre esses tipos. Você também pode fornecer apenas o primeiro componente para excluir todos os avisos anexados a ele.

source: ``ref.citation``, ``ref.doc``, ``ref.keyword``, ``ref.numref``, ``ref.option``, ``ref.ref``, and ``ref.term``.
pt_br: ``ref.citation``, ``ref.doc``, ``ref.keyword``, ``ref.numref``, ``ref.option``, ``ref.ref`` e ``ref.term``.

source: ``app.add_directive``, ``app.add_generic_role``, ``app.add_node``, ``app.add_role``, and ``app.add_source_parser``.
pt_br: ``app.add_directive``, ``app.add_generic_role``, ``app.add_node``, ``app.add_role`` e ``app.add_source_parser``.

source: ``ref.footnote``, ``download.not_readable``, and ``image.not_readable``.
pt_br: ``ref.footnote``, ``download.not_readable`` e ``image.not_readable``.

source: ``toc.excluded`` and ``toc.not_readable``.
pt_br: ``toc.excluded`` e ``toc.not_readable``.

source: ``config.cache``, ``intersphinx.external``, and ``toc.no_title``.
pt_br: ``config.cache``, ``intersphinx.external`` e ``toc.no_title``.

source: ``docutils`` and ``autosummary.import_cycle``.
pt_br: ``docutils`` e ``autosummary.import_cycle``.

source: ``autodoc.mocked_object``, ``duplicate_declaration.c``, ``duplicate_declaration.cpp``, ``i18n.babel``, ``i18n.not_readable``, ``i18n.not_writeable``, ``ref.any``, ``toc.duplicate_entry``, ``toc.empty_glob``, and ``toc.not_included``.
pt_br: ``autodoc.mocked_object``, ``duplicate_declaration.c``, ``duplicate_declaration.cpp``, ``i18n.babel``, ``i18n.not_readable``, ``i18n.not_writeable``, ``ref.any``, ``toc.duplicate_entry``, ``toc.empty_glob`` e ``toc.not_included``.

source: Builder options
pt_br: Opções do construtor

source: Options for HTML output
pt_br: Opções para saída HTML

source: These options influence HTML output. Various other builders are derived from the HTML output, and also make use of these options.
pt_br: Essas opções influenciam a saída HTML. Vários outros construtores são derivados da saída HTML e também fazem uso dessas opções.

source: The theme for HTML output. See the :doc:`HTML theming section </usage/theming>`.
pt_br: O tema para saída HTML. Veja a :doc:`seção de temas HTML </usage/theming>`.

source: The default theme is now :code-py:`'alabaster'`.
pt_br: O tema padrão é agora :code-py:`'alabaster'`.

source: A dictionary of options that influence the look and feel of the selected theme. These are theme-specific. The options understood by the :ref:`builtin themes <builtin-themes>` are described :ref:`here <builtin-themes>`.
pt_br: Um dicionário de opções que influenciam a aparência do tema selecionado. Estes são específicos do tema. As opções compreendidas pelos :ref:`temas embutidos <builtin-themes>` são descritas :ref:`aqui <builtin-themes>`.

source: A list of paths that contain custom themes, either as subdirectories or as zip files. Relative paths are taken as relative to the :term:`configuration directory`.
pt_br: Uma lista de caminhos que contêm temas personalizados, como subdiretórios ou arquivos zip. Caminhos relativos são considerados relativos ao :term:`diretório de configuração`.

source: Stylesheets to use for HTML pages. The stylesheet given by the selected theme is used by default A file of that name must exist either in Sphinx's :file:`static/` path or in one of the custom paths given in :confval:`html_static_path`. If you only want to add or override a few things from the theme, use CSS ``@import`` to import the theme's stylesheet.
pt_br: Folhas de estilo para usar em páginas HTML. A folha de estilo fornecida pelo tema selecionado é usada por padrão. Um arquivo com esse nome deve existir no caminho :file:`static/` do Sphinx ou em um dos caminhos personalizados fornecidos em :confval:`html_static_path`. Se você deseja apenas adicionar ou substituir algumas coisas do tema, use CSS ``@import`` para importar a folha de estilo do tema.

source: The value can be a iterable of strings.
pt_br: O valor pode ser um iterável de strings.

source: The "title" for HTML documentation generated with Sphinx's own templates. This is appended to the ``<title>`` tag of individual pages, and used in the navigation bar as the "topmost" element.
pt_br: O "título" para documentação HTML gerada pelos modelos do Sphinx. Anexado na tag ``<title>`` das páginas individuais e usada na barra de navegação do elemento "superior".

source: A shorter "title" for HTML documentation. This is used for links in the header and in the HTML Help documentation.
pt_br: Um "título" mais curto para documentação HTML. Isso é usado para links no cabeçalho e na documentaçõ de Ajuda em HTML.

source: The base URL which points to the root of the HTML documentation. It is used to indicate the location of document using :rfc:`the Canonical Link Relation <6596>`.
pt_br: O URL base que aponta para a raiz da documentação HTML. É usado para indicar o local do documento usando :rfc:`a relação de link canônico <6596>`.

source: The style of line numbers for code-blocks.
pt_br: O estilo de números de linha para blocos de código.

source: Display line numbers using ``<table>`` tag
pt_br: Exibe números de linha usando a tag ``<table>``

source: Display line numbers using ``<span>`` tag
pt_br: Exibe números de linha usando a tag ``<span>``

source: It defaults to :code-py:`'inline'`.
pt_br: Tem como padrão :code-py:`'inline'`.

source: A dictionary of values to pass into the template engine's context for all pages. Single values can also be put in this dictionary using :program:`sphinx-build`'s :option:`--html-define <sphinx-build --html-define>` command-line option.
pt_br: Dicionário de valores para passar ao contexto do mecanismo de modelos para todas páginas. Valores simples podem ser usados nesse dicionário usando a opção de linha de comando :option:`--html-define <sphinx-build --html-define>` do :program:`sphinx-build`.

source: If given, this must be the name of an image file (path relative to the :term:`configuration directory`) that is the logo of the documentation, or a URL that points an image file for the logo. It is placed at the top of the sidebar; its width should therefore not exceed 200 pixels.
pt_br: Se fornecido, deve ser o nome de um arquivo de imagem (caminho relativo ao :term:`diretório de configuração <configuration directory>`) que é o logotipo da documentação, ou URL que aponta um arquivo de imagem para o logotipo. Ele é colocado na parte superior da barra lateral; sua largura, portanto, não deve exceder 200 pixels.

source: The image file will be copied to the ``_static`` directory, but only if the file does not already exist there.
pt_br: O arquivo de imagem será copiado para diretório ``_static``, mas somente se o arquivo não existir nesse local.

source: Also accepts a URL.
pt_br: Também aceita uma URL.

source: If given, this must be the name of an image file (path relative to the :term:`configuration directory`) that is the favicon_ of the documentation, or a URL that points an image file for the favicon. Browsers use this as the icon for tabs, windows and bookmarks. It should be a 16-by-16 pixel icon in the PNG, SVG, GIF, or ICO file formats.
pt_br: Se fornecido, deve ser o nome de um arquivo de imagem (caminho relativo ao :term:`diretório de configuração <configuration directory>`) que é o favicon_ dos documentação, ou URL que aponta um arquivo de imagem para o favicon. Os navegadores usam isso como ícone para abas, janelas e favoritos. Deve ser um ícone de 16 por 16 pixels nos formatos de arquivo PNG, SVG, GIF ou ICO.

source: The image file will be copied to the ``_static``, but only if the file does not already exist there.
pt_br: O arquivo de imagem será copiado para ``_static``, mas somente se o arquivo não existir nesse local.

source: Also accepts the URL for the favicon.
pt_br: Também aceita a URL do favicon.

source: A list of CSS files. The entry must be a *filename* string or a tuple containing the *filename* string and the *attributes* dictionary. The *filename* must be relative to the :confval:`html_static_path`, or a full URI with scheme like :code-py:`'https://example.org/style.css'`. The *attributes* dictionary is used for the ``<link>`` tag's attributes.
pt_br: Uma lista de arquivos CSS. A entrada deve ser uma string *nome de arquivo* ou uma tupla contendo a string *nome de arquivo* e o dicionário de *atributos*. O *nome de arquivo* deve ser relativo ao :confval:`html_static_path`, ou um URI completo com esquema como :code-py:`'https://example.org/style.css'`. O dicionário *attributes* é usado para os atributos da tag ``<link>``.

source: The special attribute *priority* can be set as an integer to load the CSS file at an earlier or later step. For more information, refer to :meth:`.Sphinx.add_css_file`.
pt_br: O atributo especial *priority* pode ser definido como um inteiro para carregar o arquivo CSS em um passo anterior ou posterior. Para mais informações, consulte :meth:`.Sphinx.add_css_file`.

source: Support the *priority* attribute
pt_br: Suporte ao atributo *priority*.
