Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: ``hu`` -- Hungarian
pt_br: ``hu`` -- Húngaro

source: ``id`` -- Indonesian
pt_br: ``id`` -- Indonésio

source: ``it`` -- Italian
pt_br: ``it`` -- Italiano

source: ``ja`` -- Japanese
pt_br: ``ja`` -- Japonês

source: ``ko`` -- Korean
pt_br: ``ko`` -- Koreano

source: ``lt`` -- Lithuanian
pt_br: ``lt`` -- Lituano

source: ``lv`` -- Latvian
pt_br: ``lv`` -- Letão

source: ``mk`` -- Macedonian
pt_br: ``mk`` -- Macedônio

source: ``nb_NO`` -- Norwegian Bokmal
pt_br: ``nb_NO`` -- Norueguês Bokmal

source: ``ne`` -- Nepali
pt_br: ``ne`` -- Nepalês

source: ``nl`` -- Dutch
pt_br: ``nl`` -- Holandês

source: ``pl`` -- Polish
pt_br: ``pl`` -- Polonês

source: ``pt`` -- Portuguese
pt_br: ``pt`` -- Português

source: ``pt_BR`` -- Brazilian Portuguese
pt_br: ``pt_BR`` -- Português do Brasil

source: ``pt_PT`` -- European Portuguese
pt_br: ``pt_PT`` -- Português Portugal

source: ``ro`` -- Romanian
pt_br: ``ro`` -- Romeno

source: ``ru`` -- Russian
pt_br: ``ru`` -- Russo

source: ``sk`` -- Slovak
pt_br: ``sk`` -- Eslovêno

source: ``sl`` -- Slovenian
pt_br: ``sl`` -- Eslovênia

source: ``sq`` -- Albanian
pt_br: ``sq`` -- Albanês

source: ``sr`` -- Serbian
pt_br: ``sr`` -- Sérvio

source: ``sr@latin`` -- Serbian (Latin)
pt_br: ``sr@latin`` -- Sérvio (Latim)

source: ``sr_RS`` -- Serbian (Cyrillic)
pt_br: ``sr_RS`` -- Sérvio (Cirílico)

source: ``sv`` -- Swedish
pt_br: ``sv`` -- Sueco

source: ``ta`` -- Tamil
pt_br: ``ta`` -- Tâmil

source: ``tr`` -- Turkish
pt_br: ``tr`` -- Turco

source: ``uk_UA`` -- Ukrainian
pt_br: ``uk_UA`` -- Ucraniano

source: ``vi`` -- Vietnamese
pt_br: ``vi`` -- Vietnamita

source: ``zh_CN`` -- Simplified Chinese
pt_br: ``zh_CN`` -- Chinês Simplificado

source: ``zh_TW`` -- Traditional Chinese
pt_br: ``zh_TW`` -- Chinês Traditional

source: Directories in which to search for additional message catalogs (see :confval:`language`), relative to the source directory. The directories on this path are searched by the :mod:`gettext` module.
pt_br: Diretórios para pesquisar por catálogos de mensagens adicionais (veja :confval:`language`), relativos ao diretório fonte. Os diretórios desse caminho de pesquisa serão usados pelo módulo :mod:`gettext`.

source: Internal messages are fetched from a text domain of ``sphinx``; so if you add the directory :file:`./locales` to this setting, the message catalogs (compiled from ``.po`` format using :program:`msgfmt`) must be in :file:`./locales/{language}/LC_MESSAGES/sphinx.mo`. The text domain of individual documents depends on :confval:`gettext_compact`.
pt_br: Mensagens internas do Sphinx são recuperadas de um domínio ``sphinx``; se adicionar o arquivo :file:`./locales` nessa configuração, o catálogo de mensagens (compilado no formato ``.po`` usando o programa :program:`msgfmt`) deve estar em :file:`./locales/{language}/LC_MESSAGES/sphinx.mo`. O domínio textual de documentos individuais depende de :confval:`gettext_compact`.

source: The :option:`-v option to sphinx-build <sphinx-build -v>` is useful to check the :confval:`!locale_dirs` setting is working as expected. If the message catalog directory not found, debug messages are emitted.
pt_br: A opção :option:`-v do sphinx-build <sphinx-build -v>` é útil para verificar se a configuração :confval:`!locale_dirs` está funcionando conforme o esperado. Se o diretório do catálogo de mensagens não for encontrado, mensagens de depuração serão emitidas.

source: Use ``locales`` directory as a default value
pt_br: Usar diretório ``locales`` como valor padrão.

source: If True, "fuzzy" messages in the message catalogs are used for translation.
pt_br: Se True, as mensagens aproximadas, isto é, marcadas com "fuzzy" nos catálogos de mensagens são usadas para tradução.

source: If :code-py:`True`, a document's text domain is its docname if it is a top-level project file and its very base directory otherwise.
pt_br: Se :code-py:`True`, o domínio de texto de um documento será seu docname se for um arquivo de projeto de nível superior e, caso contrário, seu diretório base.

source: If :code-py:`False`, a document's text domain is the docname, in full.
pt_br: Se :code-py:`False`, o domínio de texto de um documento é o docname, por extenso.

source: If set to a string, every document's text domain is set to this string, making all documents use single text domain.
pt_br: Se definido com uma string, o domínio de texto de todos os documentos é esta string, fazendo com que todos os documentos usem um único domínio de texto.

source: With :code-py:`gettext_compact = True`, the document :file:`markup/code.rst` ends up in the ``markup`` text domain. With this option set to :code-py:`False`, it is ``markup/code``. With this option set to :code-py:`'sample'`, it is ``sample``.
pt_br: Com :code-py:`gettext_compact = True`, o documento :file:`markup/code.rst` termina no domínio de texto ``markup``. Com esta opção definida como :code-py:`False`, é ``markup/code``. Com esta opção definida como :code-py:`'sample'`, é ``sample``.

source: Allow string values.
pt_br: Permite valores de string.

source: If :code-py:`True`, Sphinx generates UUID information for version tracking in message catalogs. It is used to:
pt_br: Se :code-py:`True`, Sphinx gera informação UUID para rastrear versão os catálogos de mensagens. Usado para:

source: Add a UUID line for each *msgid* in ``.pot`` files.
pt_br: Adiciona uma linha de UUID para cada *msgid* nos arquivos ``.pot``.

source: Calculate similarity between new msgids and previously saved old msgids. (This calculation can take a long time.)
pt_br: Calcula a similaridade entre novas msgids e as anteriormente salvas msgids antigas. (Esse cálculo pode levar algum tempo.)

source: If you want to accelerate the calculation, you can use a third-party package (Levenshtein_) by running :command:`pip install levenshtein`.
pt_br: Se deseja acelerar o cálculo, pode usar um pacote de terceiros (Levenshtein_) executando :command:`pip install levenshtein`.

source: If :code-py:`True`, Sphinx generates location information for messages in message catalogs.
pt_br: Se :code-py:`True`, Sphinx gera informação de local de mensagens em catálogos de mensagens.

source: If :code-py:`True`, Sphinx builds a ``.mo`` file for each translation catalog file.
pt_br: Se :code-py:`True`, Sphinx constrói um arquivo ``.mo`` para cada catálogo de mensagens.

source: Enable ``gettext`` translation for certain element types. Example:
pt_br: Habilita a tradução ``gettext`` para certos tipos de elementos. Exemplo:

source: The following element types are supported:
pt_br: Os seguintes tipos de elementos são suportados:

source: :code-py:`'index'` -- index terms
pt_br: :code-py:`'index'` -- termos de índice

source: :code-py:`'literal-block'` -- literal blocks (``::`` annotation and ``code-block`` directive)
pt_br: :code-py:`'literal-block'` -- blocos literais (anotação ``::`` e diretiva ``code-block``)

source: :code-py:`'doctest-block'` -- doctest block
pt_br: :code-py:`'doctest-block'` -- bloco de doctest

source: :code-py:`'raw'` -- raw content
pt_br: :code-py:`'raw'` -- conteúdo bruto

source: :code-py:`'image'` -- image/figure uri
pt_br: :code-py:`'image'` -- uri de imagem/figura

source: The alt text for images is translated by default.
pt_br: O texto alternativo de imagens é traduzido por padrão.

source: Permit and prefer a set type.
pt_br: Permite e prefere um tipo definido.

source: The filename format for language-specific figures. The available format tokens are:
pt_br: O formato do nome do arquivo para figuras específicas de idioma. Os tokens de formato disponíveis são:

source: ``{root}``: the filename, including any path component, without the file extension. For example: ``images/filename``.
pt_br: ``{root}``: o nome do arquivo, incluindo componentes de caminho, porem sem a extensão do arquivo. Por exemplo: ``images/filename``.

source: ``{path}``: the directory path component of the filename, with a trailing slash if non-empty. For example: ``images/``.
pt_br: ``{path}``: o caminho do diretório do nome do arquivo, com barra final se não for vazio. Por exemplo: ``images/``.

source: ``{basename}``: the filename without the directory path or file extension components. For example: ``filename``.
pt_br: ``{basename}``: nome do arquivo sem o caminho do diretório e sem a extensão do arquivo. Por exemplo: ``filename``.

source: ``{ext}``: the file extension. For example: ``.png``.
pt_br: ``{ext}``: a extensão do arquivo. Por exemplo: ``.png``.

source: ``{language}``: the translation language. For example: ``en``.
pt_br: ``{language}``: idioma da tradução. Por exemplo: ``en``.

source: ``{docpath}``: the directory path component for the current document, with a trailing slash if non-empty. For example: ``dirname/``.
pt_br: ``{docpath}``: o caminho do diretório do documento atual, com barra final se não for vazio. Por exemplo: ``dirname/``.

source: By default, an image directive :code-rst:`.. image:: images/filename.png`, using an image at :file:`images/filename.png`, will use the language-specific figure filename :file:`images/filename.en.png`.
pt_br: Por padrão, uma diretiva de imagem :code-rst:`.. image:: images/filename.png`, usando uma imagem em :file:`images/filename.png`, usará um nome de arquivo da figura específico do idioma :file:`images/filename.en.png`.

source: If :confval:`!figure_language_filename` is set as below, the language-specific figure filename will be :file:`images/en/filename.png` instead.
pt_br: Se :confval:`!figure_language_filename` for definido como abaixo, o nome do arquivo da figura específico do idioma será :file:`images/en/filename.png`.

source: Added ``{path}`` and ``{basename}`` tokens.
pt_br: Adic. ``{path}`` e ``{basename}`` termos.

source: Added ``{docpath}`` token.
pt_br: Adicionado o token ``{docpath}``.

source: Control which, if any, classes are added to indicate translation progress. This setting would likely only be used by translators of documentation, in order to quickly indicate translated and untranslated content.
pt_br: Controla quais classes serão adicionadas, se houver, para indicar o progresso da tradução. Esta configuração provavelmente seria usada apenas por tradutores de documentação, para indicar rapidamente o conteúdo traduzido e não traduzido.

source: Add ``translated`` and ``untranslated`` classes to all nodes with translatable content.
pt_br: Adiciona as classes ``translated`` e ``untranslated`` para todos os nós com conteúdo traduzido.

source: Only add the ``translated`` class.
pt_br: Adiciona apenas a classe ``translated``.

source: Only add the ``untranslated`` class.
pt_br: Adiciona apenas a classe ``untranslated``.

source: Do not add any classes to indicate translation progress.
pt_br: Não adiciona qualquer classe para indicar o progresso de tradução. not add any classes to indicate translation progress.

source: Options for markup
pt_br: Opções para marcação

source: The name of a reStructuredText role (builtin or Sphinx extension) to use as the default role, that is, for text marked up ```like this```. This can be set to :code-py:`'py:obj'` to make ```filter``` a cross-reference to the Python function "filter".
pt_br: O nome de um papel reStructuredText (embutido ou extensão Sphinx) para usar o papel padrão, isso é, para o texto marcado ```como esse```. Pode ser definido para :code-py:`'py:obj'` para tornar ```filter``` uma referência cruzada para a função Python "filter".

source: The default role can always be set within individual documents using the standard reStructuredText :dudir:`default-role` directive.
pt_br: O papel padrão pode ser sempre definido dentro de documentos individuais usando a diretiva reStructuredText :dudir:`default-role`.

source: Keep warnings as "system message" paragraphs in the rendered documents. Warnings are always written to the standard error stream when :program:`sphinx-build` is run, regardless of this setting.
pt_br: Mantém os avisos como parágrafos de "mensagens do sistema" nos documentos renderizados. Os avisos são sempre escritos no fluxo de erros padrão quando :program:`sphinx-build` é executado, independentemente desta configuração.

source: When enabled, emphasise placeholders in :rst:dir:`option` directives. To display literal braces, escape with a backslash (``\{``). For example, ``option_emphasise_placeholders=True`` and ``.. option:: -foption={TYPE}`` would render with ``TYPE`` emphasised.
pt_br: Quando habilitado, enfatiza os espaços reservados nas diretivas :rst:dir:`option`. Para exibir chaves literais, escape com uma barra invertida (``\{``). Por exemplo, ``option_emphasise_placeholders=True`` e ``.. option:: -foption={TYPE}`` seriam renderizados com ``TYPE`` enfatizado.

source: The name of the default :doc:`domain </usage/domains/index>`. Can also be :code-py:`None` to disable a default domain. The default is :code-py:`'py'`, for the Python domain.
pt_br: O nome do :doc:`domínio </usage/domains/index>` padrão. Também pode ser :code-py:`None` para desabilitar um domínio padrão. O padrão é :code-py:`'py'`, para o domínio Python.

source: Those objects in other domain (whether the domain name is given explicitly, or selected by a :rst:dir:`default-domain` directive) will have the domain name explicitly prepended when named (e.g., when the default domain is C, Python functions will be named "Python function", not just "function"). Example:
pt_br: Esses objetos em outro domínio (onde o nome de domínio é dado explicitamente ou selecionado por uma diretiva :rst:dir:`default-domain`) irá ter o nome de domínio prefixado quando renomeado (por exemplo, quando o domínio padrão é C, as funções Python serão nomeadas "função Python", não "função"). Exemplo:

source: A string of reStructuredText that will be included at the end of every source file that is read. This is a possible place to add substitutions that should be available in every file (another being :confval:`rst_prolog`). Example:
pt_br: Uma string de reStructuredText que pode ser incluída ao final de todo arquivo fonte que for lido. Isso é possível adicionar uma substituição que estará disponível em todo arquivo (outro como :confval:`rst_prolog`). Exemplo:

source: A string of reStructuredText that will be included at the beginning of every source file that is read. This is a possible place to add substitutions that should be available in every file (another being :confval:`rst_epilog`). Example:
pt_br: Uma string de reStructuredText que será incluída no início de cada arquivo fonte que é lido. Este é um local possível para adicionar substituições que devem estar disponíveis em todos os arquivos (outro sendo :confval:`rst_epilog`). Um exemplo:

source: A boolean that decides whether :rst:dir:`codeauthor` and :rst:dir:`sectionauthor` directives produce any output in the built files.
pt_br: Booleano que decide diretivas para diretório :rst:dir:`codeauthor` e :rst:dir:`sectionauthor` quanto a geração nos arquivos.

source: Trim spaces before footnote references that are necessary for the reStructuredText parser to recognise the footnote, but do not look too nice in the output.
pt_br: Espaços antes das referências de rodapé são necessários para o analisador de reStructuredText reconhecer notas de rodapé, mas não tem aparência boa na saída.

source: Options for Maths
pt_br: Opções para matemática

source: These options control maths markup and notation.
pt_br: Essas opções controlam a marcação e notação matemática.

source: A string used for formatting the labels of references to equations. The ``{number}`` place-holder stands for the equation number.
pt_br: Uma string usada para formatar os rótulos das referências às equações. O marcador de posição ``{number}`` representa o número da equação.

source: Example: ``'Eq.{number}'`` gets rendered as, for example, ``Eq.10``.
pt_br: Exemplo: ``'Eq.{number}'`` é renderizado como, por exemplo, ``Eq.10``.

source: Force all displayed equations to be numbered. Example:
pt_br: Força todas as equações exibidas a serem numeradas. Exemplo:

source: If :code-py:`True`, displayed math equations are numbered across pages when :confval:`numfig` is enabled. The :confval:`numfig_secnum_depth` setting is respected. The :rst:role:`eq`, not :rst:role:`numref`, role must be used to reference equation numbers.
pt_br: Se :code-py:`True`, equações matemáticas serão exibidas como numeradas através das páginas quando :confval:`numfig` estiver habilitada. A configuração :confval:`numfig_secnum_depth` será respeitada. O papel :rst:role:`eq`, e não :rst:role:`numref`, deve ser usado para referenciar número de equações.

source: A string that defines the separator between section numbers and the equation number when :confval:`numfig` is enabled and :confval:`numfig_secnum_depth` is positive.
pt_br: Uma string que define o separador entre os números da seção e o número da equação quando :confval:`numfig` está habilitada e :confval:`numfig_secnum_depth` é positiva.

source: Example: :code-py:`'-'` gets rendered as ``1.2-3``.
pt_br: Exemplo: :code-py:`'-'` é renderizado como ``1.2-3``.

source: Options for the nitpicky mode
pt_br: Opções para modo nitpicky

source: Enables nitpicky mode if :code-py:`True`. In nitpicky mode, Sphinx will warn about *all* references where the target cannot be found. This is recommended for new projects as it ensures that all references are to valid targets.
pt_br: Habilita o modo nitpicky se :code-py:`True`. No modo nitpicky (em português, minuncioso), o Sphinx avisará sobre *todas* as referências onde o alvo não pode ser encontrado. Isto é recomendado para novos projetos, pois garante que todas as referências sejam a metas válidas.

source: You can activate this mode temporarily using the :option:`--nitpicky <sphinx-build --nitpicky>` command-line option. See :confval:`nitpick_ignore` for a way to mark missing references as "known missing".
pt_br: Você pode ativar este modo temporariamente usando a opção de linha de comando :option:`--nitpicky <sphinx-build --nitpicky>`. Veja :confval:`nitpick_ignore` para uma maneira de marcar referências ausentes como "sabidamente ausentes".

source: A set or list of :code-py:`(warning_type, target)` tuples that should be ignored when generating warnings in :confval:`"nitpicky mode" <nitpicky>`. Note that ``warning_type`` should include the domain name if present. Example:
pt_br: Um conjunto ou lista de tuplas :code-py:`(warning_type, target)` que devem ser ignoradas ao gerar avisos no :confval:`"modo nitpicky" <nitpicky>`. Observe que ``warning_type`` deve incluir o nome do domínio, se presente. Exemplo:

source: Changed allowable container types to a set, list, or tuple
pt_br: Tipos de contêiner permitidos alterados para conjunto, lista ou tupla

source: An extended version of :confval:`nitpick_ignore`, which instead interprets the ``warning_type`` and ``target`` strings as regular expressions. Note that the regular expression must match the whole string (as if the ``^`` and ``$`` markers were inserted).
pt_br: Uma versão estendida da :confval:`nitpick_ignore`, que interpreta as strings ``warning_type`` e ``target`` como expressões regulares. Note que a expressão regular deve corresponder a toda a string (como se os marcadores ``^`` e ``$`` tivessem sido inseridos.)

source: For example, ``(r'py:.*', r'foo.*bar\.B.*')`` will ignore nitpicky warnings for all python entities that start with ``'foo'`` and have ``'bar.B'`` in them, such as :code-py:`('py:const', 'foo_package.bar.BAZ_VALUE')` or :code-py:`('py:class', 'food.bar.Barman')`.
pt_br: Por exemplo, ``(r'py:.*', r'foo.*bar\.B.*')`` vai ignorar avisos nitpicky para todas as entidades python que comecem com ``'foo'`` e tenham ``'bar.B'`` neles, tal como :code-py:`('py:const', 'foo_package.bar.BAZ_VALUE')` ou :code-py:`('py:class', 'food.bar.Barman')`.

source: Options for object signatures
pt_br: Opções para assinaturas de objetos

source: A boolean that decides whether parentheses are appended to function and method role text (e.g. the content of ``:func:`input```) to signify that the name is callable.
pt_br: Booleano que decide onde parênteses são anexados a texto de papéis de função ou método (por exemplo, conteúdo de ``:func:`input```) para significar que o nome é chamável.

source: If a signature's length in characters exceeds the number set, each parameter within the signature will be displayed on an individual logical line.
pt_br: Se o comprimento de uma assinatura em caracteres exceder o número definido, cada parâmetro dentro da assinatura será exibido em uma linha lógica individual.

source: When :code-py:`None`, there is no maximum length and the entire signature will be displayed on a single logical line.
pt_br: Quando :code-py:`None`, não há comprimento máximo e toda a assinatura será exibida em uma única linha lógica.

source: A 'logical line' is similar to a hard line break---builders or themes may choose to 'soft wrap' a single logical line, and this setting does not affect that behaviour.
pt_br: Uma "linha lógica" é semelhante a uma quebra de linha rígida --- construtores ou temas podem optar por uma "quebra suavemente" de uma única linha lógica, e esta configuração não afeta esse comportamento.

source: Domains may provide options to suppress any hard wrapping on an individual object directive, such as seen in the C, C++, and Python domains (e.g. :rst:dir:`py:function:single-line-parameter-list`).
pt_br: Os domínios podem fornecer opções para suprimir qualquer quebra rígida em uma diretiva de objeto individual, como visto nos domínios C, C++ e Python (por exemplo, :rst:dir:`py:function:single-line-parameter-list`).

source: When backslash stripping is enabled then every occurrence of ``\\`` in a domain directive will be changed to ``\``, even within string literals. This was the behaviour before version 3.0, and setting this variable to :code-py:`True` will reinstate that behaviour.
pt_br: Quando a remoção da barra invertida está habilitada, então cada ocorrência de ``\\`` em uma diretiva de domínio será alterada para ``\``, mesmo dentro de literais de string. Este era o comportamento antes da versão 3.0, e definir esta variável como :code-py:`True` irá restabelecer esse comportamento.

source: Create table of contents entries for domain objects (e.g. functions, classes, attributes, etc.).
pt_br: Cria entradas na tabela de conteúdo para objetos de domínio (por exemplo, funções, classes, atributos, etc.).

source: A string that determines how domain objects (functions, classes, attributes, etc.) are displayed in their table of contents entry.
pt_br: Uma string que determina como os objetos de domínio (funções, classes, atributos, etc.) são exibidos na entrada do índice.

source: Use :code-py:`'domain'` to allow the domain to determine the appropriate number of parents to show. For example, the Python domain would show :code-py:`Class.method()` and :code-py:`function()`, leaving out the :code-py:`module.` level of parents.
pt_br: Use :code-py:`'domain'` para permitir que o domínio determine o número apropriado de pais a serem exibidos. Por exemplo, o domínio Python mostraria :code-py:`Class.method()` e :code-py:`function()`, deixando de fora o nível :code-py:`module.` dos pais. Esta é a configuração padrão.

source: Use :code-py:`'hide'` to only show the name of the element without any parents (i.e. :code-py:`method()`).
pt_br: Use :code-py:`'hide'` para mostrar apenas o nome do elemento sem nenhum pai (ou seja, :code-py:`method()`).

source: Use :code-py:`'all'` to show the fully-qualified name for the object (i.e. :code-py:`module.Class.method()`), displaying all parents.
pt_br: Use :code-py:`'all'` para mostrar o nome totalmente qualificado do objeto (ou seja, :code-py:`module.Class.method()`), exibindo todos os pais.

source: Options for source files
pt_br: Opções de arquivos fonte
