Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: The basename for the Apple Help Book. The default is the :confval:`project name <project>` with spaces removed.
pt_br: O nome base para o Apple Help Book. O padrão é :confval:`nome do projeto <project>` com espaços removidos.

source: The bundle ID for the help book bundle.
pt_br: O ID do Conjunto para livro de ajuda itens.

source: You *must* set this value in order to generate Apple Help.
pt_br: Esse valor *deve* ser configurado para gerar Ajuda Apple.

source: The bundle version, as a string.
pt_br: A versão empacotada, como um string.

source: The development region. Defaults to Apple’s recommended setting, :code-py:`'en-us'`.
pt_br: A região de desenvolvimento. Usa como padrão a configuração recomendada da Apple, :code-py:`'en-us'`.

source: Path to the help bundle icon file or :code-py:`None` for no icon. According to Apple's documentation, this should be a 16-by-16 pixel version of the application's icon with a transparent background, saved as a PNG file.
pt_br: O caminho para o pacote de ajuda ou :code-py:`None` para nenhum ícone. De acordo com a documentação da Apple, esta deve ser uma versão de 16x16 pixels do ícone do aplicativo com um fundo transparente, salvo como um arquivo PNG.

source: The product tag for use with :confval:`applehelp_kb_url`.
pt_br: A etiqueta produto usada com :confval:`applehelp_kb_url`.

source: The URL for your knowledgebase server, e.g. ``https://example.com/kbsearch.py?p='product'&q='query'&l='lang'``. At runtime, Help Viewer will replace ``'product'`` with the contents of :confval:`applehelp_kb_product`, ``'query'`` with the text entered by the user in the search box, and ``'lang'`` with the user's system language.
pt_br: A URL para seu servidor de base de conhecimento, por exemplo, ``https://example.com/kbsearch.py?p='product'&q='query'&l='lang'``. Em tempo de execução, o Help Viewer substituirá ``'product'`` pelo conteúdo de :confval:`applehelp_kb_product`, ``'query'`` pelo texto inserido pelo usuário na caixa de pesquisa e ``'lang'`` pelo idioma do sistema do usuário.

source: Set this to to :code-py:`None` to disable remote search.
pt_br: Defina isso para :code-py:`None` para desabilitar a pesquisa remota.

source: The URL for remote content. You can place a copy of your Help Book's ``Resources`` directory at this location and Help Viewer will attempt to use it to fetch updated content.
pt_br: O URL para conteúdo remoto. Você pode colocar uma cópia do diretório ``Resources`` de seu Livro de Ajuda neste local e o Visualizador de Ajuda tentará usá-la para buscar conteúdo atualizado.

source: For example, if you set it to ``https://example.com/help/Foo/`` and Help Viewer wants a copy of ``index.html`` for an English speaking customer, it will look at ``https://example.com/help/Foo/en.lproj/index.html``.
pt_br: Por exemplo, se você definir para ``https://example.com/help/Foo/`` e Visualizador Help utiliza uma cópia de ``index.html`` para idioma Inglês, irá parecer com ``https://example.com/help/Foo/en.lproj/index.html``.

source: Set this to to :code-py:`None` for no remote content.
pt_br: Defina isso para :code-py:`None` para nenhum conteúdo remoto.

source: Tell the help indexer to index anchors in the generated HTML. This can be useful for jumping to a particular topic using the ``AHLookupAnchor`` function or the ``openHelpAnchor:inBook:`` method in your code. It also allows you to use ``help:anchor`` URLs; see the Apple documentation for more information on this topic.
pt_br: Informa ao indexador help para ancorar índices gerados em HTML. Pode ser útil na hora de navegar para um tópico em particular usando função ``AHLookupAnchor`` ou o método ``openHelpAnchor:inBook:`` em seu código. Também possibilita uso de URLs ``help:anchor``; veja a documentação Apple para maiores informações sobre esse tópico.

source: Controls the minimum term length for the help indexer. If :code-py:`None`, use the default length.
pt_br: Controla o tamanho mínimo para indexador de ajuda. Se :code-py:`None`, usa o tamanho padrão.

source: Either a language specification (to use the built-in stopwords), or the path to a stopwords plist, or :code-py:`None` if you do not want to use stopwords. The default stopwords plist can be found at ``/usr/share/hiutil/Stopwords.plist`` and contains, at time of writing, stopwords for the following languages:
pt_br: Especificação do idioma (usado para palavras-chave), ou o caminho para plist de palavras-chave ou :code-py:`None` caso não desejar palavras-chave. A plist padrão de palavras-chave pode ser encontrada em ``/usr/share/hiutil/Stopwords.plist`` e contém, em tempo de geração, stopwords para os idiomas:

source: German (``de``)
pt_br: Alemão (``de``)

source: English (``en``)
pt_br: Inglês (``en``)

source: Spanish (``es``)
pt_br: Espanhol (``es``)

source: French (``fr``)
pt_br: Francês (``fr``)

source: Hungarian (``hu``)
pt_br: Húngaro (``hu``)

source: Italian (``it``)
pt_br: Italiano (``it``)

source: Swedish (``sv``)
pt_br: Sueco (``sv``)

source: Specifies the locale to generate help for. This is used to determine the name of the ``.lproj`` directory inside the Help Book’s ``Resources``, and is passed to the help indexer.
pt_br: Especifíca para qual locale será gerado o Help. Isso é usado para determinar o nome do diretório ``.lproj`` dento do Help ``Resources``, e é passado ao indexador de ajuda.

source: Specifies the help book title.
pt_br: Especifica o título do livro de ajuda.

source: Specifies the identity to use for code signing. Use :code-py:`None` if code signing is not to be performed.
pt_br: Especifica a identidade a ser usada para assinatura de código. Use :code-py:`None` se a assinatura de código não for realizada.

source: Defaults to the value of the :envvar:`!CODE_SIGN_IDENTITY` environment variable, which is set by Xcode for script build phases, or :code-py:`None` if that variable is not set.
pt_br: O padrão é o valor da variável de ambiente :envvar:`!CODE_SIGN_IDENTITY`, que é definida pelo Xcode para fases de construção de script, ou :code-py:`None` se essa variável não estiver definida.

source: A *list* of additional arguments to pass to :program:`codesign` when signing the help book.
pt_br: Uma *lista* argumentos adicionais para passar ao :program:`codesign` quando assinando o livro de help.

source: Defaults to a list based on the value of the :envvar:`!OTHER_CODE_SIGN_FLAGS` environment variable, which is set by Xcode for script build phases, or the empty list if that variable is not set.
pt_br: O padrão é uma lista baseada no valor da variável de ambiente :envvar:`!OTHER_CODE_SIGN_FLAGS`, que é definida pelo Xcode para fases de construção de script, ou a lista vazia se essa variável não estiver definida.

source: The path to the :program:`codesign` program.
pt_br: O caminho para o programa :program:`codesign`.

source: The path to the :program:`hiutil` program.
pt_br: O caminho para o programa :program:`hiutil`.

source: Do not run the indexer or the code signing tool, no matter what other settings are specified.
pt_br: Não executa o indexador ou a ferramenta de assinatura de código, não importa quais outras configurações sejam especificadas.

source: This is mainly useful for testing, or where you want to run the Sphinx build on a non-macOS platform and then complete the final steps on a Mac for some reason.
pt_br: Isso é útil principalmente para testes ou quando você deseja executar a construção do Sphinx em uma plataforma que não seja macOS e, por algum motivo, concluir as etapas finais em um Mac.

source: Options for EPUB output
pt_br: Opções para saída EPUB

source: These options influence EPUB output. This builder derives from the HTML builder, so the HTML options also apply where appropriate.
pt_br: Essas opções influenciam a saída de EPUB. Este construtor deriva do construtor HTML, então as opções HTML também se aplicam quando apropriado.

source: The actual value for some of these options is not important, but they are required for the `Dublin Core metadata`_.
pt_br: O valor real de algumas dessas opções não é importante, mas elas são necessárias para os `metadados do Dublin Core`_.

source: The basename for the EPUB file.
pt_br: O nome base para o arquivo EPUB.

source: The HTML theme for the EPUB output. Since the default themes are not optimised for small screen space, using the same theme for HTML and EPUB output is usually not wise. This defaults to :code-py:`'epub'`, a theme designed to save visual space.
pt_br: O tema HTML para a saída EPUB. Como os temas padrão não são otimizados para espaço de tela pequeno, usar o mesmo tema para saída HTML e EPUB geralmente não é sensato. O padrão é :code-py:`'epub'`, um tema projetado para economizar espaço visual.

source: The title of the document.
pt_br: O título do documento.

source: It defaults to the :confval:`!project` option (previously :confval:`!html_title`).
pt_br: O padrão é a opção :confval:`!project` (anteriormente :confval:`!html_title`).

source: The description of the document.
pt_br: A descrição do documento.

source: Renamed from :confval:`!epub3_description`
pt_br: Renomeada de :confval:`!epub3_description`

source: The author of the document. This is put in the Dublin Core metadata.
pt_br: O autor do documento. Isso é colocado em metadados Dublin Core.

source: The name of a person, organisation, etc. that played a secondary role in the creation of the content of an EPUB Publication.
pt_br: O nome de uma pessoa, organização, etc. que desempenhou um papel secundário na criação do conteúdo de uma publicação EPUB.

source: Renamed from :confval:`!epub3_contributor`
pt_br: Renomeada de :confval:`!epub3_contributor`

source: The language of the document. This is put in the Dublin Core metadata.
pt_br: Idioma do documento. Isso é colocado em metadados Dublin Core.

source: The publisher of the document. This is put in the Dublin Core metadata. You may use any sensible string, e.g. the project homepage.
pt_br: Editor ou publicador do documento. Isso é colocado metadados Dublin Core. Pode ser qualquer string, como página e nome projeto.

source: The copyright of the document. See :confval:`copyright` for permitted formats.
pt_br: Os direitos autorais ou `copyright` do documento. Veja :confval:`copyright` para formatos permitidos.

source: An identifier for the document. This is put in the Dublin Core metadata. For published documents this is the ISBN number, but you can also use an alternative scheme, e.g. the project homepage.
pt_br: Identificador para o documento. Isso é colocado nos metadados Dublin Core. Para documentos publicados é o número ISBN, mas pode ser usado um schema alternativo como, por exemplo, site do projeto.

source: The publication scheme for the :confval:`epub_identifier`. This is put in the Dublin Core metadata. For published books the scheme is ``'ISBN'``. If you use the project homepage, ``'URL'`` seems reasonable.
pt_br: Esquema da publicação para :confval:`epub_identifier`. Isso é colocado nos metadados do Dublin Core. Para livros publicados o esquema é ``'ISBN'``. Se usar o site do projeto, ``'URL'`` parece razoável.

source: A unique identifier for the document. This is put in the Dublin Core metadata. You may use a `XML's Name format`_ string. You can't use hyphen, period, numbers as a first character.
pt_br: Identificador único para o documento. Isso é colocado nos metadados Dublin Core. Pode ser usado uma string de `formato de NOME do XML`_. Não pode conter hífen, ponto ou números como primeiro caractere.

source: The cover page information. This is a tuple containing the filenames of the cover image and the html template. The rendered html cover page is inserted as the first item in the spine in :file:`content.opf`. If the template filename is empty, no html cover page is created. No cover at all is created if the tuple is empty.
pt_br: Informação de rosto. É uma tupla contendo nomes de arquivo da imagem de rosto do modelo html. A página de rosto html renderizada é inserida como primeiro item no :file:`content.opf`. Se o nome de arquivo do modelo estiver vazio, nenhuma página de rosto html será criada. Nenhuma capa será criada se a tupla estiver vazia.

source: Examples:
pt_br: Exemplos:

source: A list of CSS files. The entry must be a *filename* string or a tuple containing the *filename* string and the *attributes* dictionary. The *filename* must be relative to the :confval:`html_static_path`, or a full URI with scheme like :code-py:`'https://example.org/style.css'`. The *attributes* dictionary is used for the ``<link>`` tag's attributes. For more information, see :confval:`html_css_files`.
pt_br: Uma lista de arquivos CSS. A entrada deve ser uma string *nome de arquivo* ou uma tupla contendo a string *nome de arquivo* e o dicionário de *atributos*. O *nome de arquivo* deve ser relativo ao :confval:`html_static_path`, ou um URI completo com esquema como :code-py:`'https://example.org/style.css'`. O dicionário *attributes* é usado para os atributos da tag ``<link>``. Para mais informações, veja :confval:`html_css_files`.

source: Meta data for the guide element of :file:`content.opf`. This is a sequence of tuples containing the *type*, the *uri* and the *title* of the optional guide information. See `the OPF documentation <https://idpf.org/epub>`_ for details. If possible, default entries for the *cover* and *toc* types are automatically inserted. However, the types can be explicitly overwritten if the default entries are not appropriate.
pt_br: Metadados para elementos guia do arquivo :file:`content.opf`. Essa é a sequência de pares contendo *type*, *uri* e *title* da informação opcional guia. Veja a `documentação de OPF em <https://idpf.org/epub>`_ para mais detalhes. Se possível, as entradas padrão para tipos *cover* e *toc* são automaticamente inseridas. Contudo, os tipos podem ser explicitamente sobrepostos se as entradas padrão não forem apropriadas.

source: The default value is :code-py:`()`.
pt_br: O valor padrão é :code-py:`()`.

source: Additional files that should be inserted before the text generated by Sphinx. It is a list of tuples containing the file name and the title. If the title is empty, no entry is added to :file:`toc.ncx`.
pt_br: Arquivo adicional deve ser inserido antes do texto gerado pelo Sphinx. Lista de pares contendo nome de arquivo e título. Se título está vazio, nenhuma entrada é adicionada para o arquivo :file:`toc.ncx`.

source: Additional files that should be inserted after the text generated by Sphinx. It is a list of tuples containing the file name and the title. This option can be used to add an appendix. If the title is empty, no entry is added to :file:`toc.ncx`.
pt_br: Arquivos adicionais que devem ser inseridos após o texto gerado pelo Sphinx. Lista de pares contendo nome do arquivo e título. Essa opção é usada para adicionar sufixo. Se o título está vazio, nenhuma entrada é adicionada para o arquivo :file:`toc.ncx`.

source: A sequence of files that are generated/copied in the build directory but should not be included in the EPUB file.
pt_br: Sequência de arquivos que são gerados/copiados no diretório de construção mas não devem ser incluídos no arquivo EPUB.

source: The depth of the table of contents in the file :file:`toc.ncx`. It should be an integer greater than zero.
pt_br: A profundidade da tabela de conteúdos do arquivo :file:`toc.ncs`. Deve ser um inteiro maior que zero.

source: A deeply nested table of contents may be difficult to navigate.
pt_br: Um índice muito aninhado pode ser difícil de navegar.

source: This flag determines if a ToC entry is inserted again at the beginning of its nested ToC listing. This allows easier navigation to the top of a chapter, but can be confusing because it mixes entries of different depth in one list.
pt_br: Esse indicador determina se a entrada TOC será inserida novamente no início da TOC subordinada. Isso permite navegação mais fácil no topo do capítulo, mas pode ser confuso por misturar diversos níveis de hierárquia na lista.

source: This setting control the scope of the EPUB table of contents. The setting can have the following values:
pt_br: Controla o escopo da tabela de conteúdos para EPUB. A configuração pode ter os seguintes valores:

source: Include all ToC entries that are not hidden
pt_br: Inclui todas as entradas de ToC não ocultas

source: Include all ToC entries
pt_br: Inclui todas as entradas de ToC

source: Try and fix image formats that are not supported by some EPUB readers. At the moment palette images with a small colour table are upgraded. This is disabled by default because the automatic conversion may lose information. You need the Python Image Library (Pillow_) installed to use this option.
pt_br: Tenta corrigir formatos de imagem que não são suportados por alguns leitores de EPUB. No momento, as imagens de paleta com uma pequena tabela de cores estão sendo atualizadas. Isso está desativado por padrão porque a conversão automática pode resultar em perda de informações. Você precisa ter a biblioteca Python Image Library (Pillow_) instalada para usar esta opção.

source: This option specifies the maximum width of images. If it is set to a valuevgreater than zero, images with a width larger than the given value are scaled accordingly. If it is zero, no scaling is performed. You need the Python Image Library (Pillow_) installed to use this option.
pt_br: Esta opção especifica a largura máxima das imagens. Se for definida com um valor maior que zero, as imagens com largura superior ao valor especificado serão redimensionadas proporcionalmente. Se for zero, nenhum redimensionamento será realizado. É necessário ter a biblioteca de imagens Python (Pillow_) instalada para usar esta opção.

source: Control how to display URL addresses. This is very useful for readers that have no other means to display the linked URL. The setting can have the following values:
pt_br: Controla como os endereços URL são exibidos. Isso é muito útil para leitores que não têm outros meios de visualizar o link. A configuração pode ter os seguintes valores:

source: Display URLs inline in parentheses.
pt_br: Exibe URLs localmente em parênteses

source: Display URLs in footnotes.
pt_br: Exibe URLS em notas de rodapé.

source: Do not display URLs.
pt_br: Não exibe URLs.

source: The display of inline URLs can be customised by adding CSS rules for the class ``link-target``.
pt_br: A exibição de URLs pode ser personalizada adicionando regras CSS para a classe ``link-target``.

source: Add an index to the EPUB document.
pt_br: Adiciona um índice ao documento EPUB.

source: It specifies writing direction. It can accept :code-py:`'horizontal'` and :code-py:`'vertical'`
pt_br: Especifica a direção da escrita. Pode ser :code-py:`'horizontal'` e :code-py:`'vertical'`

source: page progression
pt_br: progressão página

source: left to right
pt_br: esquerda para direita

source: right to left
pt_br: direita para esquerda

source: iBook's Scroll Theme support
pt_br: Suporte Rolagem do Tema iBook's

source: scroll-axis is vertical.
pt_br: scroll-axis é vertical.

source: scroll-axis is horizontal.
pt_br: scroll-axis é horizontal.

source: Options for LaTeX output
pt_br: Opções para saída LaTeX

source: These options influence LaTeX output.
pt_br: Essas opções influenciam a saída do LaTeX.

source: The LaTeX engine to build the documentation. The setting can have the following values:
pt_br: O mecanismo LaTeX para construir a documentação. A configuração pode ter os valores:

source: :code-py:`'pdflatex'` -- PDFLaTeX (default)
pt_br: :code-py:`'pdflatex'` -- PDFLaTeX (padrão)

source: :code-py:`'xelatex'` -- XeLaTeX (default if :confval:`language` is one of ``el``, ``zh_CN``, or ``zh_TW``)
pt_br: :code-py:`'xelatex'` -- XeLaTeX (padrão se :confval:`language` for um de ``el``, ``zh_CN`` ou ``zh_TW``)

source: :code-py:`'uplatex'` -- upLaTeX (default if :confval:`language` is :code-py:`'ja'`)
pt_br: :code-py:`'uplatex'` -- upLaTeX (padrão se :confval:`language` for :code-py:`'ja'`)

source: ``'pdflatex'``\ 's support for Unicode characters is limited. If your project uses Unicode characters, setting the engine to ``'xelatex'`` or ``'lualatex'`` and making sure to use an OpenType font with wide-enough glyph coverage is often easier than trying to make ``'pdflatex'`` work with the extra Unicode characters. Since Sphinx 2.0, the default typeface is GNU FreeFont, which has good coverage of Latin, Cyrillic, and Greek glyphs.
pt_br: O suporte do ``'pdflatex'`` a caracteres Unicode é limitado. Se o seu projeto utiliza caracteres Unicode, configurar o mecanismo para ``'xelatex'`` ou ``'lualatex'`` e garantir o uso de uma fonte OpenType com cobertura de glifos suficientemente ampla costuma ser mais fácil do que tentar fazer o ``'pdflatex'`` funcionar com os caracteres Unicode adicionais. Desde o Sphinx 2.0, a fonte padrão é a GNU FreeFont, que possui boa cobertura de glifos latinos, cirílicos e gregos.

source: Sphinx 2.0 adds support for occasional Cyrillic and Greek letters or words in documents using a Latin language and ``'pdflatex'``. To enable this, the :ref:`fontenc` key of :ref:`latex_elements <latex_elements_confval>` must be used appropriately.
pt_br: O Sphinx 2.0 adiciona suporte para letras ou palavras cirílicas e gregas ocasionais em documentos que utilizam um idioma latino e o pacote ``'pdflatex'``. Para habilitar esse recurso, a chave :ref:`fontenc` de :ref:`latex_elements <latex_elements_confval>` deve ser usada adequadamente.

source: Contrarily to :ref:`MathJaX math rendering in HTML output <math-support>`, LaTeX requires some extra configuration to support Unicode literals in :rst:dir:`math`: the only comprehensive solution (as far as we know) is to use ``'xelatex'`` or ``'lualatex'`` *and* to add ``r'\usepackage{unicode-math}'`` (e.g. via the :ref:`preamble` key of :ref:`latex_elements <latex_elements_confval>`). You may prefer ``r'\usepackage[math-style=literal]{unicode-math}'`` to keep a Unicode literal such as ``α`` (U+03B1) as-is in output, rather than being rendered as :math:`\alpha`.
pt_br: Ao contrário da :ref:`renderização matemática de MathJaX na saída HTML <math-support>`, o LaTeX requer alguma configuração extra para oferecer suporte a literais Unicode em :rst:dir:`math`: a única solução abrangente (até onde sabemos) é usar ``'xelatex'`` ou ``'lualatex'`` *e* para adicionar ``r'\usepackage{unicode-math}'`` (por exemplo, através da chave :ref:`preamble` de :ref:latex_elements <latex_elements_confval>`). Você pode preferir ``r'\usepackage[math-style=literal]{unicode-math}'`` para manter um Unicode literal como ``α`` (U+03B1) como está na saída, em vez de sendo renderizado como :math:`\alpha`.

source: Use ``'xelatex'`` (and LaTeX package ``xeCJK``) by default for Chinese documents.
pt_br: Usa ``'xelatex'`` (e o pacote LaTeX ``xeCJK``) por padrão para documentos chineses.

source: Use ``'xelatex'`` by default for Greek documents.
pt_br: Usa ``'xelatex'`` por padrão para documentos gregos.

source: Add ``'uplatex'`` support.
pt_br: Adiciona suporte a ``'uplatex'``.

source: Use ``'uplatex'`` by default for Japanese documents.
pt_br: Usa ``'uplatex'`` por padrão para documentos japoneses.

source: This value determines how to group the document tree into LaTeX source files. It must be a list of tuples ``(startdocname, targetname, title, author, theme, toctree_only)``, where the items are:
pt_br: Este valor determina como agrupar a árvore de documentos em arquivos fonte LaTeX. Deve ser uma lista de tuplas ``(startdocname, targetname, title, author, theme, toctree_only)``, onde os itens são:
