Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: Configuration
pt_br: Configuração

source: The :term:`configuration directory` must contain a file named :file:`conf.py`. This file (containing Python code) is called the "build configuration file" and contains (almost) all configuration needed to customise Sphinx input and output behaviour.
pt_br: O :term:`diretório de configuração <configuration directory>` deve conter um arquivo chamado :file:`conf.py`. Esse arquivo (contendo código Python) é chamado "arquivo de configuração da construção" e (geralmente) contém toda configuração necessária para personalizar o comportamento das entradas e saídas do Sphinx.

source: An optional file `docutils.conf`_ can be added to the configuration directory to adjust `Docutils`_ configuration if not otherwise overridden or set by Sphinx.
pt_br: Um arquivo opcional `docutils.conf`_ pode ser adicionado ao diretório de configuração para ajustar a configuração do `Docutils`_ se não for substituído ou definido pelo Sphinx.

source: Important points to note:
pt_br: Pontos importantes a notar:

source: If not otherwise documented, values must be strings, and their default is the empty string.
pt_br: Se não documentado de outra maneira, valores devem ser strings e seus conteúdos padrão são strings vazias.

source: The term "fully-qualified name" (FQN) refers to a string that names an importable Python object inside a module; for example, the fully-qualified name :code-py:`"sphinx.builders.Builder"` means the :code-py:`Builder` class in the :code-py:`sphinx.builders` module.
pt_br: O termo "nome totalmente qualificado" (do inglês fully-qualified name - FQN) refere-se a uma string que nomeia um objeto Python importável dentro de um módulo; por exemplo:, o nome totalmente qualificado :code-py:`"sphinx.builders.Builder"` quer dizer a classe :code-py:`Builder` no módulo :code-py:`sphinx.builders`.

source: Document names use ``/`` as the path separator and do not contain the file name extension.
pt_br: Nomes dos documentos usam ``/`` como separador do caminho e não contêm o nome da extensão do arquivo.

source: Where glob-style patterns are permitted, you can use the standard shell constructs (``*``, ``?``, ``[...]``, and ``[!...]``) with the feature that none of these will match slashes (``/``). A double star ``**`` can be used to match any sequence of characters *including* slashes.
pt_br: One padrões estilo glob são permitidos, você pode usar as construções padrões do shell (``*``, ``?``, ``[...]`` e ``[!...]``) com a funcionalidade que nenhuma dessas vai corresponder barras (``/``). Asterisco duplo ``**`` pode ser usada para combinar com qualquer sequência de caracteres *incluindo* barras.

source: The configuration file is executed as Python code at build time (using :func:`importlib.import_module`, with the current directory set to the :term:`configuration directory`), and therefore can execute arbitrarily complex code.
pt_br: O arquivo de configuração é executado com código Python em tempo de construção (usando :func:`importlib.import_module`, com o diretório atual definido para o :term:`diretório de configuração`) e suporta a execução arbitrária de códigos complexos.

source: Sphinx then reads simple names from the file's namespace as its configuration. In general, configuration values should be simple strings, numbers, or lists or dictionaries of simple values.
pt_br: O Sphinx então lê nomes simples do espaço de nomes do arquivo como sua configuração. Em geral, os valores de configuração devem ser sequências simples, números ou listas ou dicionários de valores simples.

source: The contents of the config namespace are pickled (so that Sphinx can find out when configuration changes), so it may not contain unpickleable values -- delete them from the namespace with ``del`` if appropriate. Modules are removed automatically, so deleting imported modules is not needed.
pt_br: O conteúdo do espaço de nomes config é obtido (é assim que Sphinx pode encontrar modificações externas da configuração), portando não pode conter valores impossíveis de interpretação -- remova esses no espaço de nomes com o comando ``del`` conforme apropriado. Módulos são removidos automaticamente, de forma que excluir módulos importados não é necessário.

source: Project tags
pt_br: Tags do projeto

source: There is a special object named ``tags`` available in the config file, which exposes the :ref:`project tags <tags>`. Tags are defined either via the :option:`--tag <sphinx-build --tag>` command-line option or :code-py:`tags.add('tag')`. Note that the builder's name and format tags are not available in :file:`conf.py`.
pt_br: Existe um objeto especial chamado ``tags`` disponível no arquivo de configuração, que expõe as :ref:`tags do projeto <tags>`. Tags são definidas através da opção de linha de comando :option:`--tag <sphinx-build --tag>` ou :code-py:`tags.add('tag')`. Observe que o nome do construtor e as tags de formato não estão disponíveis em :file:`conf.py`.

source: It can be used to query and change the defined tags as follows:
pt_br: Pode ser usado para consultar e alterar as tags definidas da seguinte forma:

source: To query whether a tag is set, use :code-py:`'tag' in tags`.
pt_br: Para consultar se uma tag está definida, use :code-py:`'tag' in tags`.

source: To add a tag, use :code-py:`tags.add('tag')`.
pt_br: Para adicionar uma tag, use :code-py:`tags.add('tag')`.

source: To remove a tag, use :code-py:`tags.remove('tag')`.
pt_br: Para remover uma tag, use :code-py:`tags.remove('tag')`.

source: Project information
pt_br: Informações do projeto

source: Type
pt_br: Tipo

source: Default
pt_br: Padrão

source: The documented project's name. Example:
pt_br: O nome do projeto documento. Exemplo:

source: The project's author(s). Example:
pt_br: Os autores do projeto. Exemplo:

source: A copyright statement. Permitted styles are as follows, where 'YYYY' represents a four-digit year.
pt_br: Uma instrução de direitos autorais. Os estilos permitidos são os seguintes, onde 'AAAA' representa um ano de quatro dígitos.

source: :code-py:`copyright = 'YYYY'`
pt_br: :code-py:`copyright = 'AAAA'`

source: :code-py:`copyright = 'YYYY, Author Name'`
pt_br: :code-py:`copyright = 'AAAA, Nome do Autor'`

source: :code-py:`copyright = 'YYYY Author Name'`
pt_br: :code-py:`copyright = 'AAAA Nome do Autor'`

source: :code-py:`copyright = 'YYYY-YYYY, Author Name'`
pt_br: :code-py:`copyright = 'AAAA-AAAA, Nome do Autor'`

source: :code-py:`copyright = 'YYYY-YYYY Author Name'`
pt_br: :code-py:`copyright = 'AAAA-AAAA Nome do Autor'`

source: If the string :code-py:`'%Y'` appears in a copyright line, it will be replaced with the current four-digit year. For example:
pt_br: Se a string :code-py:`'%Y'` aparecer em uma linha de direitos autorais, ela será substituída pelo ano atual de quatro dígitos. Por exemplo:

source: :code-py:`copyright = '%Y, Author Name'`
pt_br: :code-py:`copyright = '%Y, Nome do Autor'`

source: :code-py:`copyright = 'YYYY-%Y, Author Name'`
pt_br: :code-py:`copyright = 'YYYY-%Y, Nome do Autor'`

source: The :code-py:`project_copyright` alias.
pt_br: O apelido :code-py:`project_copyright`.;

source: The value may now be a sequence of copyright statements in the above form, which will be displayed each to their own line.
pt_br: O valor agora pode ser uma sequência de declarações de direitos autorais no formato acima, que serão exibidas cada uma em sua própria linha.

source: Copyright statements support the :code-py:`'%Y'` placeholder.
pt_br: As declarações de direitos autorais oferecem suporte ao espaço reservado :code-py:`'%Y'`.

source: The major project version, used as the replacement for the :code-rst:`|version|` :ref:`default substitution <default-substitutions>`.
pt_br: A versão principal do projeto, usada como substituto para a :ref:`substituição padrão <default-substitutions>` :code-rst:`|version|`.

source: This may be something like :code-py:`version = '4.2'`. The full project version is defined in :confval:`release`.
pt_br: Isso pode ser algo como :code-py:`version = '4.2'`. A versão completa do projeto é definida em :confval:`release`.

source: If your project does not draw a meaningful distinction between between a 'full' and 'major' version, set both :code-py:`version` and :code-py:`release` to the same value.
pt_br: Se o seu projeto não fizer uma distinção significativa entre uma versão 'completa' e 'principal', defina :code-py:`version` e :code-py:`release` com o mesmo valor.

source: The full project version, used as the replacement for the :code-rst:`|release|` :ref:`default substitution <default-substitutions>`, and e.g. in the HTML templates.
pt_br: A versão completa do projeto, usada como substituto para a :ref:`substituição padrão <default-substitutions>` :code-rst:`|release|` e, por exemplo, nos modelos HTML.

source: This may be something like :code-py:`release = '4.2.1b0'`. The major (short) project version is defined in :confval:`version`.
pt_br: Isso pode ser algo como :code-py:`release = '4.2.1b0'`. A versão principal (curta) do projeto é definida em :confval:`version`.

source: General configuration
pt_br: Configurações gerais

source: Set a minimum supported version of Sphinx required to build the project. The format should be a ``'major.minor'`` version string like ``'1.1'`` Sphinx will compare it with its version and refuse to build the project if the running version of Sphinx is too old. By default, there is no minimum version.
pt_br: Define uma versão mínima suportada do Sphinx necessária para construir o projeto. O formato deve ser uma string de versão ``'major.minor'`` como ``'1.1'`` O Sphinx irá compará-lo com sua versão e se recusará a construir o projeto se a versão em execução do Sphinx for muito antiga. Por padrão, não há versão mínima.

source: Allow a ``'major.minor.micro'`` version string.
pt_br: Permite uma string de versão ``'major.minor.micro'``.

source: A list of strings that are module names of :doc:`Sphinx extensions <extensions/index>`. These can be extensions bundled with Sphinx (named ``sphinx.ext.*``) or custom first-party or third-party extensions.
pt_br: Uma lista de strings que são nomes de módulos de :doc:`extensões Sphinx <extensions/index>`. Essas podem ser extensões inclusas no Sphinx (chamadas ``sphinx.ext.*``) e extensões de originais personalizadas ou de terceiros..

source: To use a third-party extension, you must ensure that it is installed and include it in the :code-py:`extensions` list, like so:
pt_br: Para usar uma extensão de terceiros, você deve garantir que ela esteja instalada e incluí-la na lista :code-py:`extensions`, assim:

source: There are two options for first-party extensions. The configuration file itself can be an extension; for that, you only need to provide a :func:`setup` function in it. Otherwise, you must ensure that your custom extension is importable, and located in a directory that is in the Python path.
pt_br: Existem duas opções para extensões originais. O próprio arquivo de configuração pode ser uma extensão; para isso, você só precisa fornecer uma função :func:`setup` nele. Caso contrário, você deverá garantir que sua extensão personalizada seja importável e esteja localizada em um diretório que esteja no caminho do Python.

source: Ensure that absolute paths are used when modifying :data:`sys.path`. If your custom extensions live in a directory that is relative to the :term:`configuration directory`, use :meth:`pathlib.Path.resolve` like so:
pt_br: Certifique-se de que caminhos absolutos sejam usados ​​ao modificar :data:`sys.path`. Se suas extensões personalizadas residem em um diretório relativo ao :term:`diretório de configuração`, use :meth:`pathlib.Path.resolve` assim:

source: The directory structure illustrated above would look like this:
pt_br: A estrutura de diretórios ilustrada acima ficaria assim:

source: If set, this value must be a dictionary specifying version requirements for extensions in :confval:`extensions`. The version strings should be in the ``'major.minor'`` form. Requirements do not have to be specified for all extensions, only for those you want to check. Example:
pt_br: Se definido, este valor deve ser um dicionário especificando os requerimentos das extensões em :confval:`extensions`. As strings de versão devem estar no formato ``major.minor``. Requerimentos não precisam ser especificado para todas as extensões, apenas para as que devem ser verificadas. Exemplo:

source: This requires that the extension declares its version in the :code-py:`setup()` function. See :ref:`dev-extensions` for further details.
pt_br: Isto requer que a extensão declare sua versão na função :code-py:`setup()`. Veja :ref:`dev-extensions` para mais detalhes.

source: A URL to cross-reference :rst:role:`manpage` roles. If this is defined to ``https://manpages.debian.org/{path}``, the :literal:`:manpage:`man(1)`` role will link to <https://manpages.debian.org/man(1)>. The patterns available are:
pt_br: Um URL para fazer referência cruzada aos papéis :rst:role:`manpage`. Se estiver definido para ``https://manpages.debian.org/{path}``, o papel :literal:`:manpage:`man(1)`` será vinculado a <https://manpages.debian.org/man(1)>. Os padrões disponíveis são:

source: The manual page (``man``)
pt_br: A página de manual (``man``)

source: The manual section (``1``)
pt_br: A seção do manual (``1``)

source: The original manual page and section specified (``man(1)``)
pt_br: ``path`` - a página de manual original e a seção especificada (``man(1)``)

source: This also supports manpages specified as ``man.1``.
pt_br: Também suporta páginas especificadas como ``man.1``.

source: These values determine how to format the current date, used as the replacement for the :code-rst:`|today|` :ref:`default substitution <default-substitutions>`.
pt_br: Esses valores determinam como formatar a data atual, usada como substituto para o :ref:`substituto padrão <default-substitutions>` :code-rst:`|today|`.

source: If you set :confval:`today` to a non-empty value, it is used.
pt_br: Se configurar :confval:`today` para um valor não vazio, ele será usado.

source: Otherwise, the current time is formatted using :func:`time.strftime` and the format given in :confval:`today_fmt`.
pt_br: Caso contrário, horário corrente será usado no formato :func:`time.strftime` e o formato :confval:`today_fmt`.

source: The default for :confval:`today` is :code-py:`''`, and the default for :confval:`today_fmt` is :code-py:`'%b %d, %Y'` (or, if translation is enabled with :confval:`language`, an equivalent format for the selected locale).
pt_br: O padrão para :confval:`today` é :code-py:`''` e o padrão para :confval:`today_fmt` é :code-py:`'%b %d, %Y'` (ou se tradução estiver habilitada com :confval:`language`, um formato será selecionado na localidade equivalente).

source: Options for figure numbering
pt_br: Opções para numeração de figuras

source: If :code-py:`True`, figures, tables and code-blocks are automatically numbered if they have a caption. The :rst:role:`numref` role is enabled. Obeyed so far only by HTML and LaTeX builders.
pt_br: Se :code-py:`True`, figuras, tabelas e blocos de código são automaticamente numerados, caso tenham legenda. Se o papel :rst:role:`numref` estivar habilitada. Abrange atualmente os construtores de HTML e LaTeX.

source: The LaTeX builder always assigns numbers whether this option is enabled or not.
pt_br: O construtor LaTeX sempre assinala números onde essa opção é habilitada ou não

source: A dictionary mapping :code-py:`'figure'`, :code-py:`'table'`, :code-py:`'code-block'` and :code-py:`'section'` to strings that are used for format of figure numbers. The marker ``%s`` will be replaced with the figure number.
pt_br: Um dicionário mapeando :code-py:`'figure'`, :code-py:`'table'`, :code-py:`'code-block'` e :code-py:`'section'` para strings que são usadas para o formato de números de figura. o marcador ``%s`` será substituído pelo número da figura.

source: The defaults are:
pt_br: Os padrões são:

source: If set to :code-py:`0`, figures, tables, and code-blocks are continuously numbered starting at ``1``.
pt_br: Se definido para :code-py:`0`, as figuras, os tabelas e os blocos de código são continuamente numerados iniciando em ``1``.

source: If :code-py:`1`, the numbering will be ``x.1``, ``x.2``, ... with ``x`` representing the section number. (If there is no top-level section, the prefix will not be added ). This naturally applies only if section numbering has been activated via the ``:numbered:`` option of the :rst:dir:`toctree` directive.
pt_br: Se :code-py:`1`, a numeração será ``x.1``, ``x.2``, ... com ``x`` representando o número da seção. (Se não houver seção de nível superior, o prefixo não será adicionado). Isso naturalmente se aplica, somente se numeração foi ativada através da opção ``:numbered:`` da diretiva :rst:dir:`toctree`.

source: If :code-py:`2`, the numbering will be ``x.y.1``, ``x.y.2``, ... with ``x`` representing the section number and ``y`` the sub-section number. If located directly under a section, there will be no ``y.`` prefix, and if there is no top-level section, the prefix will not be added.
pt_br: Se :code-py:`2`, a numeração será ``x.y.1``, ``x.y.2``, ... com ``x`` representando o número da seção e ``y`` o número da subseção. Se localizado diretamente abaixo de uma seção, não haverá prefixo ``y.``, e se não houver seção de nível superior, o prefixo não será adicionado.

source: Any other positive integer can be used, following the rules above.
pt_br: Qualquer outro número inteiro positivo pode ser utilizado, seguindo as regras acima.

source: The LaTeX builder obeys this setting if :confval:`numfig` is set to :code-py:`True`.
pt_br: O construtor LaTeX obedece essa configuração se :confval:`numfig` estiver definido para :code-py:`True`.

source: Options for highlighting
pt_br: Opções de realce

source: The default language to highlight source code in. The default is :code-py:`'default'`, which suppresses warnings if highlighting as Python code fails.
pt_br: A linguagem padrão para realçar o código-fonte. O padrão é :code-py:`'default'`, que suprime avisos se o realce como código Python falhar.

source: The value should be a valid Pygments lexer name, see :ref:`code-examples` for more details.
pt_br: O valor deve ser um nome de lexador válido do Pygments, veja :ref:`code-examples` para mais detalhes.

source: The default is now :code-py:`'default'`.
pt_br: O padrão é agora :code-py:`'default'`.

source: A dictionary that maps Pygments lexer names to their options. These are lexer-specific; for the options understood by each, see the `Pygments documentation <https://pygments.org/docs/lexers>`_.
pt_br: Um dicionário que mapeia nomes de analisadores léxicos de Pygments para suas opções. Estes são específicos do analisador léxico; para as opções compreendidas por cada um, consulte a `documentação do Pygments <https://pygments.org/docs/lexers>`_.

source: Example:
pt_br: Exemplo:

source: Allow configuring highlight options for multiple lexers.
pt_br: Permite configurar opções de realce para vários analisadores léxicos.

source: The style name to use for Pygments highlighting of source code. If not set, either the theme's default style or :code-py:`'sphinx'` is selected for HTML output.
pt_br: O nome do estilo usado para realce de código-fonte com Pygments. Se não definido, usa estilo padrão do tema ou :code-py:`'sphinx'` é selecionado na saída HTML.

source: If the value is a fully-qualified name of a custom Pygments style class, this is then used as custom style.
pt_br: Se o valor é completamente qualificado como um nome configurado de estilo de classe Pygments, então será usado como estilo personalizado.

source: Options for HTTP requests
pt_br: Opções para solicitações HTTP

source: If True, Sphinx verifies server certificates.
pt_br: Se verdadeiro, o Sphinx verifica os certificados do servidor.

source: A path to a certification file of CA or a path to directory which contains the certificates. This also allows a dictionary mapping hostnames to the certificate file path. The certificates are used to verify server certifications.
pt_br: Caminho para um arquivo de certificado de AC ou caminho para o diretório que contém os certificados. Também permite um dicionário mapeando nomes do host para o caminho do arquivo de certificado. Os certificados são usados para verificar os certificados do servidor.

source: Sphinx uses requests_ as a HTTP library internally. If :confval:`!tls_cacerts` is not set, Sphinx falls back to requests' default behaviour. See :ref:`requests:verification` for further details.
pt_br: O Sphinx usa requests_ como uma biblioteca HTTP internamente. Se :confval:`!tls_cacerts` não estiver definido, o Sphinx volta ao comportamento padrão do requests. Veja :ref:`requests:verification` para mais detalhes.

source: Set the User-Agent used by Sphinx for HTTP requests.
pt_br: Define o User-Agent usado pelo Sphinx para solicitações HTTP.

source: Options for internationalisation
pt_br: Opções para internacionalização

source: These options influence Sphinx's *Native Language Support*. See the documentation on :ref:`intl` for details.
pt_br: Essas opções influenciam no *Native Language Support* (que, em português, significa "suporte a idioma nativo") do Sphinx. Veja a documentação em :ref:`intl` para detalhes.

source: The code for the language the documents are written in. Any text automatically generated by Sphinx will be in that language. Also, Sphinx will try to substitute individual paragraphs from your documents with the translation sets obtained from :confval:`locale_dirs`. Sphinx will search language-specific figures named by :confval:`figure_language_filename` (e.g. the German version of ``myfigure.png`` will be ``myfigure.de.png`` by default setting) and substitute them for original figures. In the LaTeX builder, a suitable language will be selected as an option for the *Babel* package.
pt_br: O código para o idioma em que os documentos são escritos. Qualquer texto gerado automaticamente pelo Sphinx estará nesse idioma. Além disso, o Sphinx tentará substituir parágrafos individuais de seus documentos com os conjuntos de tradução obtidos em :confval:`locale_dirs`. O Sphinx irá pesquisar figuras específicas de um idioma nomeadas por :confval:`figure_language_filename` (por exemplo, a versão alemã de ``myfigure.png`` será ``myfigure.de.png`` por padrão) e as substituirá por figuras originais. No construtor LaTeX, um idioma adequado será selecionado como uma opção para o pacote *Babel*.

source: Support figure substitution
pt_br: Suporte substituição figura

source: The default is now :code-py:`'en'` (previously :code-py:`None`).
pt_br: O padrão agora é :code-py:`'en'` (anteriormente :code-py:`None`).

source: Currently supported languages by Sphinx are:
pt_br: Idiomas atualmente suportados são:

source: ``ar`` -- Arabic
pt_br: ``ar`` -- Árabe

source: ``bg`` -- Bulgarian
pt_br: ``bg`` -- Búlgaro

source: ``ca`` -- Catalan
pt_br: ``ca`` -- Catalão

source: ``cak`` -- Kaqchikel
pt_br: ``cak`` -- Caqchiquel

source: ``cy`` -- Welsh
pt_br: ``cy`` -- Galês

source: ``da`` -- Danish
pt_br: ``da`` -- Dinamarquês

source: ``de`` -- German
pt_br: ``de`` -- Alemão

source: ``el`` -- Greek
pt_br: ``el`` -- Grego

source: ``en`` -- English (default)
pt_br: ``en`` -- Inglês (padrão)

source: ``es`` -- Spanish
pt_br: ``es`` -- Espanhol

source: ``et`` -- Estonian
pt_br: ``et`` -- Estoniano

source: ``eu`` -- Basque
pt_br: ``eu`` -- Basco

source: ``fa`` -- Iranian
pt_br: ``fa`` -- Iraniano

source: ``fi`` -- Finnish
pt_br: ``fi`` -- Finlandês

source: ``fr`` -- French
pt_br: ``fr`` -- Francês

source: ``he`` -- Hebrew
pt_br: ``he`` -- Hebreu

source: ``hi_IN`` -- Hindi (India)
pt_br: ``hi_IN`` -- Hindi (Índia)

source: ``hr`` -- Croatian
pt_br: ``hr`` -- Croata
