Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/configuration.po
Languages: pt_br

source: A list of JavaScript files. The entry must be a *filename* string or a tuple containing the *filename* string and the *attributes* dictionary. The *filename* must be relative to the :confval:`html_static_path`, or a full URI with scheme like :code-py:`'https://example.org/script.js'`. The *attributes* dictionary is used for the ``<script>`` tag's attributes.
pt_br: Uma lista de arquivos JavaScript. A entrada deve ser uma string *filename* ou uma tupla contendo a string *filename* e o dicionário *attributes*. O *filename* deve ser relativo ao :confval:`html_static_path`, ou um URI completo com esquema como :code-py:`'https://example.org/script.js'`. O dicionário *attributes* é usado para os atributos da tag ``<script>``.

source: As a special attribute, *priority* can be set as an integer to load the JavaScript file at an earlier or later step. For more information, refer to :meth:`.Sphinx.add_js_file`.
pt_br: Como um atributo especial, *priority* pode ser definido como um inteiro para carregar o arquivo JavaScript em um passo anterior ou posterior. Para mais informações, consulte :meth:`.Sphinx.add_js_file`.

source: A list of paths that contain custom static files (such as style sheets or script files). Relative paths are taken as relative to the :term:`configuration directory`. They are copied to the output's :file:`_static` directory after the theme's static files, so a file named :file:`default.css` will overwrite the theme's :file:`default.css`.
pt_br: Lista de caminhos que contém arquivos estáticos (como folhas de estilo ou arquivos script). Relativos ao :term:`diretório de configuração`. São copiados para o arquivo saída :file:`_static` diretório após arquivos estáticos de tema, portante um arquivo chamado :file:`default.css` será sobreposto pelo arquivo tema :file:`default.css`.

source: As these files are not meant to be built, they are automatically excluded from source files.
pt_br: Como esses arquivos não são destinados para serem construídos, eles são automaticamente excluídos dos arquivos fontes.

source: For security reasons, dotfiles under :confval:`!html_static_path` will not be copied. If you would like to copy them intentionally, explicitly add each file to this setting:
pt_br: Por razões de segurança, dotfiles em :confval:`!html_static_path` não serão copiados. Se desejar copiá-los intencionalmente, adicione explicitamente cada arquivo a esta configuração::

source: An alternative approach is to use :confval:`html_extra_path`, which allows copying dotfiles under the directories.
pt_br: Uma abordagem alternativa é usar :confval:`html_extra_path`, que permite copiar dotfiles nos diretórios.

source: The paths in :confval:`html_static_path` can now contain subdirectories.
pt_br: O caminho em :confval:`html_static_path` agora pode conter subdiretórios.

source: The entries in :confval:`html_static_path` can now be single files.
pt_br: As entradas em :confval:`html_static_path` pode ser arquivos simples.

source: The files under :confval:`html_static_path` are excluded from source files.
pt_br: Os arquivos em :confval:`html_static_path` são excluídos dos arquivos fonte.

source: A list of paths that contain extra files not directly related to the documentation, such as :file:`robots.txt` or :file:`.htaccess`. Relative paths are taken as relative to the :term:`configuration directory`. They are copied to the output directory. They will overwrite any existing file of the same name.
pt_br: A lista de caminhos que contem arquivos extras, não diretamente relacionados com a documentação, como :file:`robots.txt` ou :file:`.htaccess`. Caminhos Relativos são obtidos no :term:`diretório de configuração`. Serão copiados para o diretório de saída. Irão sobrepor arquivo já existente com o mesmo nome.

source: The dotfiles in the extra directory will be copied to the output directory. And it refers :confval:`exclude_patterns` on copying extra files and directories, and ignores if path matches to patterns.
pt_br: Arquivos existentes nos diretórios extra poderão ser copiados para o diretório de saída. E referências excluídas :confval:`exclude_patterns` ao copiar arquivos e diretórios e desprezar quando padrões combinarem com as regras.

source: If set, a 'Last updated on:' timestamp is inserted into the page footer using the given :func:`~time.strftime` format. The empty string is equivalent to :code-py:`'%b %d, %Y'` (or a locale-dependent equivalent).
pt_br: Se definido, o registro de data e hora de 'Última atualização em:' é inserido no rodapé de página, usando formato :func:`~time.strftime` dado. A string vazia é equivalente a :code-py:`'%b %d, %Y'` (ou ao equivalente conforme a localidade).

source: Use GMT/UTC (+00:00) instead of the system's local time zone for the time supplied to :confval:`html_last_updated_fmt`. This is most useful when the format used includes the time.
pt_br: Usa GMT/UTC (+00:00) em vez do fuso horário local do sistema para o horário fornecido para :confval:`html_last_updated_fmt`. Isso é mais útil quando o formato usado inclui o horário.

source: Add link anchors for each heading and description environment.
pt_br: Adiciona âncoras de link para cada ambiente de título e descrição.

source: Text for link anchors for each heading and description environment. HTML entities and Unicode are allowed.
pt_br: Texto para âncoras de link para cada título e ambiente de descrição. Entidades HTML e Unicode são permitidas.

source: A dictionary defining custom sidebar templates, mapping document names to template names.
pt_br: Um dicionário que define modelos de barra lateral personalizados, mapeando nomes de documentos para nomes de modelos.

source: The keys can contain `glob-style patterns`_, in which case all matching documents will get the specified sidebars. (A warning is emitted when a more than one glob-style pattern matches for any document.)
pt_br: As chaves podem conter `padrões estilo glob`_, nos casos onde os documentos que atenderem o critério, terão barras laterais especificadas. (Um aviso é emitido quando mais de um padrão de estilo glob combinar com um documento.)

source: Each value must be a list of strings which specifies the complete list of sidebar templates to include. If all or some of the default sidebars are to be included, they must be put into this list as well.
pt_br: Cada valor deve ser uma lista de strings que a lista completa de modelos de barra lateral para inclusão. Se todas ou algumas barras laterais padrão são incluídas, elas devem estar nessa lista também.

source: The default sidebars (for documents that don't match any pattern) are defined by theme itself. The builtin themes use these templates by default: :code-py:`'localtoc.html'`, :code-py:`'relations.html'`, :code-py:`'sourcelink.html'`, and :code-py:`'searchbox.html'`.
pt_br: As barras laterais padrão (para documentos que não correspondem a nenhum padrão) são definidas pelo próprio tema. Os temas embutidos usam modelos por padrão: :code-py:`'localtoc.html'`, :code-py:`'relations.html'`, :code-py:`'sourcelink.html'` e :code-py:`'searchbox.html'`.

source: The bundled first-party sidebar templates that can be rendered are:
pt_br: Os modelos de barra lateral incluídos no Sphinx que podem ser renderizados são:

source: **localtoc.html** -- a fine-grained table of contents of the current document
pt_br: **localtoc.html** -- tabela detalhada de conteúdos do documento atual

source: **globaltoc.html** -- a coarse-grained table of contents for the whole documentation set, collapsed
pt_br: **globaltoc.html** -- tabela esparça de conteúdo de todo o conjunto documento, modo encolhido

source: **relations.html** -- two links to the previous and next documents
pt_br: **relations.html** -- links que apontam para o anterior e próximo documentos

source: **sourcelink.html** -- a link to the source of the current document, if enabled in :confval:`html_show_sourcelink`
pt_br: **sourcelink.html** -- link que aponta para o documento atual, se habilitado exibe :confval:`html_show_sourcelink`

source: **searchbox.html** -- the "quick search" box
pt_br: **searchbox.html** -- caixa "pesquisa rápida"

source: This will render the custom template ``windows-sidebar.html`` and the quick search box within the sidebar of the given document, and render the default sidebars for all other pages (except that the local TOC is replaced by the global TOC).
pt_br: Isso vai renderizar o modelo personalizado ``windows-sidebar.html`` e a caixa de pesquisa dentro da barra lateral de um dado documento e renderizar as barras laterais padrão para outras páginas (exceto a tabela local de conteúdo TOC que será substituída pela TOC global).

source: Note that this value only has no effect if the chosen theme does not possess a sidebar, like the builtin **scrolls** and **haiku** themes.
pt_br: Notar que esse valor só não tem efeito se o tema escolhido não possuir barra lateral, como os temas **scrolls** e **haiku**.

source: The ability to use globbing keys and to specify multiple sidebars.
pt_br: Habilidde em usar chaves globias e especificar múltiplas barras laterais.

source: A single string value for :confval:`!html_sidebars` will be removed.
pt_br: Um valor de string simples para :confval:`!html_sidebars` será removido.

source: :confval:`!html_sidebars` must be a list of strings, and no longer accepts a single string value.
pt_br: :confval:`!html_sidebars` deve ser uma lista de strings e não aceita mais um único valor de string.

source: Additional templates that should be rendered to HTML pages, must be a dictionary that maps document names to template names.
pt_br: Modelos adicionais são renderizados para páginas HTML, devem ter um dicionário que mapeia nomes de documentos para nomes de modelos.

source: This will render the template :file:`custom-download.html.jinja` as the page :file:`download.html`.
pt_br: Isso renderizará o modelo :file:`custom-download.html.jinja` como a página :file:`download.html`.

source: If True, generate domain-specific indices in addition to the general index. For e.g. the Python domain, this is the global module index.
pt_br: Se True, gera índices específicos do domínio além do índice geral. Por exemplo, para o domínio Python, é um índice global de módulos.

source: This value can be a Boolean or a list of index names that should be generated. To find out the index name for a specific index, look at the HTML file name. For example, the Python module index has the name ``'py-modindex'``.
pt_br: Esse valor pode ser Booleano ou lista de nomes de índices que devem ser gerados. Para encontrar o nome do índice para um índice específico, veja nome do arquivo HTML. Por exemplo: índice módulo Python tem nome ``'py-modindex'``.

source: Controls if an index is added to the HTML documents.
pt_br: Controla se um índice é adicionado aos documentos HTML.

source: Generates two versions of the index: once as a single page with all the entries, and once as one page per starting letter.
pt_br: Gera duas versões do índice: uma como uma única página com todas as entradas e uma como uma página por letra inicial.

source: If True, the reStructuredText sources are included in the HTML build as :file:`_sources/{docname}`.
pt_br: Se True, as fontes reStructuredText são incluídas no construtor HTML como :file:`_sources/{docname}`

source: If True (and :confval:`html_copy_source` is true as well), links to the reStructuredText sources will be added to the sidebar.
pt_br: Se True (e :confval:`html_copy_source` for verdadeiro também), links para fontes reStructuredText irão aparecer na barra lateral.

source: The suffix to append to source links (see :confval:`html_show_sourcelink`), unless files they have this suffix already.
pt_br: O sufixo a ser anexado aos links de fontes (veja :confval:`html_show_sourcelink`), a menos que os arquivos já tenham este sufixo.

source: If nonempty, an `OpenSearch <https://github.com/dewitt/opensearch>`_ description file will be output, and all pages will contain a ``<link>`` tag referring to it. Since OpenSearch doesn't support relative URLs for its search page location, the value of this option must be the base URL from which these documents are served (without trailing slash), e.g. :code-py:`'https://docs.python.org'`.
pt_br: Se não estiver vazio, um arquivo de descrição `OpenSearch <https://github.com/dewitt/opensearch>`_ será gerado e todas as páginas conterão uma tag ``<link>`` referente a ele. Como o OpenSearch não oferece suporte a URLs relativos para o local da página de pesquisa, o valor dessa opção deve ser o URL base do qual esses documentos são veiculados (sem barra final), por exemplo, :code-py:`'https://docs.python.org'`.

source: The file name suffix (file extension) for generated HTML files.
pt_br: O sufixo do nome do arquivo (extensão de arquivo) para arquivos HTML gerados.

source: The suffix for generated links to HTML files. Intended to support more esoteric server setups.
pt_br: O sufixo para links gerados para arquivos HTML. Destinado a suportar configurações de servidor mais esotéricas.

source: If True, "© Copyright ..." is shown in the HTML footer, with the value or values from :confval:`copyright`.
pt_br: Se True, "© Copyright ..." é mostrado no rodapé de HTML, com o valor ou valores de :confval:`copyright`.

source: Show a summary of the search result, i.e., the text around the keyword.
pt_br: Mostra um resumo do resultado da pesquisa, ou seja, o texto em torno da palavra-chave.

source: Add "Created using Sphinx_" to the HTML footer.
pt_br: Adiciona "Criado usando Sphinx_" no rodapé HTML.

source: Encoding of HTML output files. This encoding name must both be a valid Python encoding name and a valid HTML ``charset`` value.
pt_br: Codificação arquivos de saída HTML. Esse nome da codificação deve ser válido no Python e no valor de ``charset`` HTML.

source: If True, a list all whose items consist of a single paragraph and/or a sub-list all whose items etc... (recursive definition) will not use the ``<p>`` element for any of its items. This is standard docutils behaviour. Default: :code-py:`True`.
pt_br: Se True, uma lista com todos os itens que consistem em um único parágrafo e/ou uma sublista com todos os itens etc... (definição recursiva) não usará o elemento ``<p>`` para nenhum de seus itens. Este é o comportamento padrão dos docutils. Padrão: ``True``.

source: Suffix for section numbers in HTML output. Set to :code-py:`' '` to suppress the final dot on section numbers.
pt_br: Sufixo para números de seção na saída HTML. Defina como :code-py:`' '` para suprimir o ponto final nos números de seção.

source: Language to be used for generating the HTML full-text search index. This defaults to the global language selected with :confval:`language`. English (:code-py:`'en'`) is used as a fall-back option if there is no support for this language.
pt_br: Idioma a ser usado para gerar o índice de pesquisa de texto completo em HTML. O padrão é o idioma global selecionado com :confval:`language`. Inglês (:code-py:`'en'`) é usado se não houver suporte para o idioma informado.

source: Support exists for the following languages:
pt_br: Há suporte para os seguintes idiomas:

source: ``en`` -- English
pt_br: ``en`` -- Inglês

source: ``no`` -- Norwegian
pt_br: ``no`` -- Norueguês

source: ``zh`` -- Chinese
pt_br: ``zh`` -- Chinês

source: Accelerating build speed
pt_br: Acelerando velocidade de montagem

source: Each language (except Japanese) provides its own stemming algorithm. Sphinx uses a Python implementation by default. If you want to accelerate building the index file, you can use a third-party package (PyStemmer_) by running :command:`pip install PyStemmer`.
pt_br: Cada idioma (exceto Japonês) provê seu próprio algoritmo uso. Sphinx usa uma implementação Python por padrão. Se você quiser acelerar a construção do arquivo de índice, poderá usar um pacote de terceiros (PyStemmer_) executando :command:`pip install PyStemmer`.

source: Support English (``en``) and Japanese (``ja``).
pt_br: Suporte para inglês (``en``) e japonês (``ja``).

source: Added additional languages.
pt_br: Adicionado outros idiomas.

source: A dictionary with options for the search language support. The meaning of these options depends on the language selected. Currently, only Japanese and Chinese support options.
pt_br: Um dicionário com opções de suporte a pesquisa em outros idiomas. O significado depende do idioma selecionado. Atualmente, somente japonês e chinês têm suporte a opções.

source: Japanese
pt_br: Japonês

source: ``type`` -- the type of the splitter to use.
pt_br: ``type`` -- o tipo do divisor para usar.

source: The other options depend on the splitter used.
pt_br: As outras opções dependem do divisor usado.

source: The TinySegmenter algorithm, used by default.
pt_br: O algoritmo TinySegmenter, usado por padrão.

source: The MeCab binding To use this splitter, the 'mecab' python binding or dynamic link library ('libmecab.so' for Linux, 'libmecab.dll' for Windows) is required.
pt_br: A ligação MeCab. Para usar este divisor, é necessária a ligação python 'mecab' ou a biblioteca de ligação dinâmica ('libmecab.so' para Linux, 'libmecab.dll' para Windows).

source: The Janome binding. To use this splitter, `Janome <https://pypi.org/project/Janome/>`_ is required.
pt_br: A ligação Janome. Para usar este divisor, `Janome <https://pypi.org/project/Janome/>`_ é exigido.

source: ``'mecab'``, ``'janome'`` and ``'default'`` is deprecated. To keep compatibility, ``'mecab'``, ``'janome'`` and ``'default'`` are also acceptable.
pt_br: ``'mecab'``, ``'janome'`` e ``'default'`` foram descontinuados. Para manter a compatibilidade, ``'mecab'``, ``'janome'`` e ``'default'`` também são aceitos.

source: Options for :code-py:`'mecab'`:
pt_br: Opções para :code-py:`'mecab'`:

source: _`dic_enc option` is the encoding for the MeCab algorithm.
pt_br: _`dic_enc option` é a codificação do algoritmo MeCab.

source: _`dict option` is the dictionary to use for the MeCab algorithm.
pt_br: _`dict option` é o dicionário para usar algoritmo MeCab.

source: _`lib option` is the library name for finding the MeCab library via ``ctypes`` if the Python binding is not installed.
pt_br: A _`opção lib` é o nome da biblioteca para encontrar biblioteca MeCab via ``ctypes`` se o build do Python não estiver instalado.

source: For example:
pt_br: Por exemplo:

source: Options for :code-py:`'janome'`:
pt_br: Opções para :code-py:`'janome'`:

source: _`user_dic option` is the user dictionary file path for Janome.
pt_br: _`user_dic option` é caminho para arquivo dicionário do Janome.

source: _`user_dic_enc option` is the encoding for the user dictionary file specified by ``user_dic`` option. Default is 'utf8'.
pt_br: _`user_dic_enc option` é o código de página para arquivo dicionário especificado opção ``user_dic``. Padrão 'utf8'.

source: Chinese
pt_br: Chinês

source: The ``jieba`` dictionary path for using a custom dictionary.
pt_br: O caminho de dicionário ``jieba`` para usar um dicionário personalizado.

source: Allow any custom splitter in the *type* setting for Japanese.
pt_br: Permite qualquer divisor personalizado na configuração *type* para japonês.

source: The name of a JavaScript file (relative to the :term:`configuration directory`) that implements a search results scorer. If empty, the default will be used.
pt_br: O nome de um arquivo JavaScript (relativo ao :term:`diretório de configuração`) que implementa um marcador de pontuação de resultados pesquisa. Se vazio, o padrão é usado.

source: The scorer must implement the following interface, and may optionally define the :code-js:`score()` function for more granular control.
pt_br: O marcador de pontuação deve implementar a seguinte interface e pode, opcionalmente, definir a função :code-js:`score()` para um controle mais granular.

source: Link images that have been resized with a scale option (*scale*, *width*, or *height*) to their original full-resolution image. This will not overwrite any link given by the *target* option on the the :dudir:`image` directive, if present.
pt_br: Vincula imagens que foram redimensionadas com uma opção de escala (*scale*, *width* ou *height*) à sua imagem original de resolução máxima. Isso não substituirá nenhum link fornecido pela opção *target* na diretiva :dudir:`image`, se presente.

source: To disable this feature on a per-image basis, add the ``no-scaled-link`` class to the image directive:
pt_br: Para desabilitar esse recurso por imagem, adicione a classe ``no-scaled-link`` à diretiva de imagem:

source: Images with the ``no-scaled-link`` class will not be linked.
pt_br: Imagens com a classe ``no-scaled-link`` não serão vinculadas.

source: The maths renderer to use for HTML output. The bundled renders are *mathjax* and *imgmath*. You must also load the relevant extension in :confval:`extensions`.
pt_br: O renderizador matemático a ser usado para saída HTML. Os renderizadores agrupados são *mathjax* e *imgmath*. Você também deve carregar a extensão relevante em :confval:`extensions`.

source: Options for Single HTML output
pt_br: Opções para saída Single HTML

source: These options influence Single HTML output. This builder derives from the HTML builder, so the HTML options also apply where appropriate.
pt_br: Essas opções influenciam a saída Single HTML. Este construtor deriva do construtor HTML, então as opções HTML também se aplicam quando apropriado.

source: This has the same effect as :confval:`html_sidebars`, but the only permitted key is :code-py:`'index'`, and all other keys are ignored.
pt_br: Isso tem o mesmo efeito que :confval:`html_sidebars`, mas a única chave permitida é :code-py:`'index'`, e todas as outras chaves são ignoradas.

source: Options for HTML help output
pt_br: Opções para ajuda saída HTML

source: These options influence HTML help output. This builder derives from the HTML builder, so the HTML options also apply where appropriate.
pt_br: Essas opções influenciam a saída de ajuda HTML. Este construtor deriva do construtor HTML, então as opções HTML também se aplicam quando apropriado.

source: Output file base name for HTML help builder. The default is the :confval:`project name <project>` with spaces removed and ``doc`` appended.
pt_br: Emite o nome base do arquivo para o construtor de ajuda HTML. O padrão é :confval:`nome do projeto <project>` com espaços removidos e ``doc`` anexado.

source: This is the file name suffix for generated HTML help files.
pt_br: Este é o sufixo do nome do arquivo para arquivos de ajuda HTML gerados.

source: Suffix for generated links to HTML files.
pt_br: Sufixo para links gerados para arquivos HTML.

source: Options for Apple Help output
pt_br: Opções para saída Ajuda Apple

source: These options influence Apple Help output. This builder derives from the HTML builder, so the HTML options also apply where appropriate.
pt_br: Essas opções influenciam saída Ajuda Apple. Esse construtor deriva do construtor HTML, portanto opções também se aplicam onde apropriadas.

source: Apple Help output will only work on Mac OS X 10.6 and higher, as it requires the :program:`hiutil` and :program:`codesign` command-line tools, neither of which are Open Source.
pt_br: Saída Ajuda Apple só funciona no Mac OS X 10.6 e posterior, como requer :program:`hiutil` e :program:`codesign` na linha de comando, ambos não são Open Source.

source: You can disable the use of these tools using :confval:`applehelp_disable_external_tools`, but the result will not be a valid help book until the indexer is run over the ``.lproj`` directories within the bundle.
pt_br: Pode desabilitar essa funcionalidade usando :confval:`applehelp_disable_external_tools`, mas o resultado só será válido quando o indexador for executado nos diretórios ``.lproj``.
