Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/installation.po
Languages: pt_br

source: Installing Sphinx
pt_br: Instalando Sphinx

source: Sphinx is a Python application. It can be installed in one of the ways described below.
pt_br: Sphinx é uma aplicação Python. Ele pode ser instalado de uma das maneiras descritas abaixo.

source: Installation methods
pt_br: Métodos de instalação

source: After installation, you can check that Sphinx is available by running ::
pt_br: Após a instalação, você pode verificar se o Sphinx está disponível executando ::

source: This should print out the Sphinx version number.
pt_br: Isso deve imprimir o número da versão do Sphinx.

source: For local development, it is generally recommended to install Sphinx into a non-global environment (using for example `venv`__ or `conda`__ environments). This will allow for the use of separate sphinx versions and third-party extensions for each sphinx project.
pt_br: Para desenvolvimento local, geralmente é recomendado instalar o Sphinx em um ambiente não global (usando, por exemplo, ambientes `venv`__ ou `conda`__). Isso permitirá o uso de versões separadas do Sphinx e extensões de terceiros para cada projeto do Sphinx.

source: PyPI package
pt_br: Pacote PyPI

source: Sphinx packages are published on the `Python Package Index <https://pypi.org/project/Sphinx/>`_ (PyPI). The preferred tool for installing packages from PyPI is :command:`pip`, which is included in all modern versions of Python.
pt_br: Os pacotes Sphinx são publicados no `Python Package Index <https://pypi.org/project/Sphinx/>`_ (PyPI). A ferramenta preferida para instalar pacotes do PyPI é :command:`pip`, que está incluída em todas as versões modernas do Python.

source: Run the following command::
pt_br: Execute o seguinte comando::

source: To avoid issues when rebuilding your environment, it is advisable to pin sphinx and third-party extension versions in a `requirements.txt file`__::
pt_br: Para evitar problemas ao reconstruir seu ambiente, é aconselhável fixar versões do sphinx e de extensões de terceiros em um arquivo `requirements.txt`__::

source: Or, if writing documentation for a Python package, place the dependencies in the `pyproject.toml file`__::
pt_br: Ou, se estiver escrevendo documentação para um pacote Python, coloque as dependências no `arquivo pyproject.toml`__::

source: Conda package
pt_br: Pacote conda

source: To work with :command:`conda`, you need a conda-based Python distribution such as `anaconda`__, `miniconda`__, `miniforge`__ or `micromamba`__.
pt_br: Para trabalhar com :command:`conda`, você precisa de uma distribuição Python baseada em conda como `anaconda`__, `miniconda`__, `miniforge`__ ou `micromamba`__.

source: Sphinx is available both via the *anaconda main* channel (maintained by Anaconda Inc.)
pt_br: O Sphinx está disponível através do canal *anaconda principal* (mantido pela Anaconda Inc.)

source: as well as via the *conda-forge* community channel ::
pt_br: bem como através do canal da comunidade *conda-forge* ::

source: OS-specific package manager
pt_br: Gerenciador de pacotes específico do sistema operacional

source: You may install a global version of Sphinx into your system using OS-specific package managers. However, be aware that this is less flexible and you may run into compatibility issues if you want to work across different projects.
pt_br: Você pode instalar uma versão global do Sphinx em seu sistema usando gerenciadores de pacotes específicos do sistema operacional. No entanto, esteja ciente de que isso é menos flexível e você poderá enfrentar problemas de compatibilidade se quiser trabalhar em projetos diferentes.

source: Install either ``python3-sphinx`` using :command:`apt-get`:
pt_br: Instale ``python3-sphinx`` usando :command:`apt-get`:

source: If it not already present, this will install Python for you.
pt_br: Se Python não estiver presente, este também será automaticamente instalado.

source: Install ``python-sphinx`` using :command:`yum`:
pt_br: Instale ``python-sphinx`` usando :command:`yum`:

source: Other distributions
pt_br: Outras distribuições

source: Most Linux distributions have Sphinx in their package repositories. Usually the package is called ``python3-sphinx``, ``python-sphinx`` or ``sphinx``. Be aware that there are at least two other packages with ``sphinx`` in their name: a speech recognition toolkit (*CMU Sphinx*) and a full-text search database (*Sphinx search*).
pt_br: Muitas distribuições Linux possuem Sphinx em seus repositórios. Normalmente o pacote tem o nome ``python3-sphinx``, ``python-sphinx`` ou ``sphinx``. Preste atenção pois existem ao menos dois outros pacotes com ``sphinx`` em seus nomes: uma ferramenta de reconhecimento voz (*CMU Sphinx*) e outra mecanismo banco de dados texto completo (*Sphinx search*).

source: Sphinx can be installed using `Homebrew`__, `MacPorts`__.
pt_br: Sphinx pode ser instalado usando `Homebrew`__, `MacPorts`__.

source: For more information, refer to the `package overview`__.
pt_br: Para mais informações, consulte a `visão geral do pacote`__.

source: Install either ``python3x-sphinx`` using :command:`port`:
pt_br: Instale ``python3x-sphinx`` usando :command:`port`:

source: To set up the executable paths, use the ``port select`` command:
pt_br: Para configurar os caminhos dos executáveis, use o comando ``port select``:

source: Sphinx can be install using `Chocolatey`__.
pt_br: Sphinx pode ser instalado usando `Chocolatey`__.

source: You would need to `install Chocolatey <https://chocolatey.org/install>`_ before running this.
pt_br: Você precisaria `instalar Chocolatey <https://chocolatey.org/install>`_ antes de executar isso.

source: For more information, refer to the `chocolatey page`__.
pt_br: Para mais informações, consulte a `página do chocolatey`__.

source: Docker images for Sphinx are published on the `Docker Hub`_. There are two kind of images:
pt_br: Imagens docker para Sphinx são publicadas no `Docker Hub`_. Há dois tipos de imagens:

source: Former one is used for standard usage of Sphinx, and latter one is mainly used for PDF builds using LaTeX. Please choose one for your purpose.
pt_br: A primeira é usada para o uso padrão do Sphinx, e a segunda é usada principalmente para construções de PDF usando LaTeX. Escolha uma para o seu propósito.

source: sphinxdoc/sphinx-latexpdf contains TeXLive packages. So the image is very large (over 2GB!).
pt_br: sphinxdoc/sphinx-latexpdf contém pacotes TeXLive. Então, a imagem é bem grande (mais de 2GB!).

source: When using docker images, please use ``docker run`` command to invoke sphinx commands. For example, you can use following command to create a Sphinx project:
pt_br: Ao usar imagens docker, use o comando ``docker run`` para invocar comandos sphinx. Por exemplo, você pode usar o seguinte comando para criar um projeto Sphinx:

source: And you can use the following command to build HTML document:
pt_br: E você pode usar o seguinte comando para construir o documento HTML:

source: For more details, please read `README file`__ of docker images.
pt_br: Para obter mais detalhes, leia o `arquivo README`__ das imagens do docker.

source: Installation of the latest development release
pt_br: Instalação da versão de desenvolvimento mais recente

source: You can install the latest development from *PyPI* using the ``--pre`` flag::
pt_br: Você pode instalar o desenvolvimento mais recente do *PyPI* usando o sinalizador ``--pre``::

source: You will not generally need (or want) to do this, but it can be useful if you see a possible bug in the latest stable release.
pt_br: Geralmente você não precisará (ou desejará) fazer isso, mas pode ser útil se você encontrar um possível bug na versão estável mais recente.

source: Installation from source
pt_br: Instalar a partir dos fontes

source: You can install Sphinx directly from a clone of the `Git repository`__. This can be done either by cloning the repo and installing from the local clone, on simply installing directly via :command:`git`.
pt_br: Para instalar Sphinx diretamente dos fontes, clone um `repositório Git`__. Isso pode ser feito clonando o repositório e instalando a partir de um clone local, ou simplesmente instalando diretamente a partir do :command:`git`.

source: You can also download a snapshot of the Git repo in either `tar.gz`__ or `zip`__ format. Once downloaded and extracted, these can be installed with :command:`pip` as above.
pt_br: Também pode baixar um snapshot do repositório Git em formato `tar.gz`__ ou `zip`__. Quando baixado e descompactado esses podem sem instalados com :command:`pip` como acima.
