Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/referencing.po
Languages: pt_br

source: Cross-references
pt_br: Referências cruzadas

source: In HTML output, the link's ``title`` attribute (that is e.g. shown as a tool-tip on mouse-hover) will always be the full target name.
pt_br: Na saída HTML, o atributo ``título`` do link (por exemplo, mostrado como uma dica de ferramenta ao passar o mouse) sempre será o nome completo do alvo.

source: Cross-referencing objects
pt_br: Objetos de referência cruzada

source: These roles are described with their respective domains:
pt_br: Esses papéis são descritos com seus respectivos domínios:

source: Cross-referencing arbitrary locations
pt_br: Referência cruzada de locais arbitrários

source: To support cross-referencing to arbitrary locations in any document, the standard reStructuredText labels are used. For this to work label names must be unique throughout the entire documentation. There are two ways in which you can refer to labels:
pt_br: Para oferecer suporte a referência cruzada para locais arbitrários em qualquer documento, os rótulos reStructuredText padrão são usados. Para que isso funcione, os nomes dos rótulos devem ser exclusivos em toda a documentação. Existem duas maneiras de se referir aos rótulos:

source: If you place a label directly before a section title, you can reference to it with ``:ref:`label-name```. For example::
pt_br: Se você colocar um rótulo diretamente antes do título de uma seção, você pode fazer referência a ele com ``:ref:`nome-rótulo```. Por exemplo::

source: The ``:ref:`` role would then generate a link to the section, with the link title being "Section to cross-reference". This works just as well when section and reference are in different source files.
pt_br: O papel ``:ref:`` geraria então um link para a seção, com o título do link sendo "Section to cross-reference". Isso funciona tão bem quando a seção e a referência estão em arquivos fontes diferentes.

source: Automatic labels also work with figures. For example::
pt_br: Rótulos automáticos também funcionam com figuras. Por exemplo::

source: In this case, a reference ``:ref:`my-figure``` would insert a reference to the figure with link text "Figure caption".
pt_br: Neste caso, uma referência ``:ref:`minha-imagem``` iria inserir uma referência à imagem com o texto do link "Legenda da imagem".

source: The same works for tables that are given an explicit caption using the :dudir:`table` directive.
pt_br: O mesmo funciona para tabelas que recebem uma legenda explícita usando a diretiva :dudir:`table`.

source: Labels that aren't placed before a section title can still be referenced, but you must give the link an explicit title, using this syntax: ``:ref:`Link title <label-name>```.
pt_br: Rótulos que não são colocados antes de um título de seção ainda podem ser referenciados, mas você deve dar ao link um título explícito, usando esta sintaxe: ``:ref:`Título do link <nome-rótulo>```.

source: Reference labels must start with an underscore. When referencing a label, the underscore must be omitted (see examples above).
pt_br: Os rótulos de referência devem começar com um sublinhado. Ao fazer referência a um rótulo, o sublinhado deve ser omitido (veja exemplos acima).

source: Using :rst:role:`ref` is advised over standard reStructuredText links to sections (like ```Section title`_``) because it works across files, when section headings are changed, will raise warnings if incorrect, and works for all builders that support cross-references.
pt_br: Usar :rst:role:`ref` é aconselhável em vez de links reStructuredText padrão para seções (como ```Título da seção`_``) porque funciona em arquivos, quando os títulos das seções são alterados, vai levantar avisos se incorretos e funciona para todos os construtores que oferecem suporte a referências cruzadas.

source: Cross-referencing documents
pt_br: Fazendo referência cruzada a documentos

source: There is also a way to directly link to documents:
pt_br: Também existe uma maneira de vincular diretamente aos documentos:

source: Link to the specified document; the document name can be specified in absolute or relative fashion. For example, if the reference ``:doc:`parrot``` occurs in the document ``sketches/index``, then the link refers to ``sketches/parrot``. If the reference is ``:doc:`/people``` or ``:doc:`../people```, the link refers to ``people``.
pt_br: Link para o documento especificado; o nome do documento pode ser especificado de forma absoluta ou relativa. Por exemplo, se a referência ``:doc:`papagaio``` ocorre no documento ``rascunhos/index``, então o link refere-se a ``rascunhos/papagaio``. Se a referência for ``:doc:`/pessoas``` ou ``:doc:`../pessoas```, o link se refere a ``pessoas``.

source: If no explicit link text is given (like usual: ``:doc:`Monty Python members </people>```), the link caption will be the title of the given document.
pt_br: Se nenhum texto de link explícito for fornecido (como de costume: ``:doc:`Membros do Monty Python </pessoas>```), a legenda do link será o título do documento fornecido.

source: Referencing downloadable files
pt_br: Fazendo referência a arquivos baixáveis

source: This role lets you link to files within your source tree that are not reStructuredText documents that can be viewed, but files that can be downloaded.
pt_br: Esse papel permite vincular arquivos em sua árvore de fontes que não são documentos reStructuredText que podem ser visualizados, mas arquivos que podem ser baixados.

source: When you use this role, the referenced file is automatically marked for inclusion in the output when building (obviously, for HTML output only). All downloadable files are put into a ``_downloads/<unique hash>/`` subdirectory of the output directory; duplicate filenames are handled.
pt_br: Quando você usa esse papel, o arquivo referenciado é automaticamente marcado para inclusão na saída durante a construção (obviamente, apenas para saída HTML). Todos os arquivos para download são colocados em um subdiretório ``_downloads/<hash único>/`` do diretório de saída; nomes de arquivos duplicados são tratados.

source: An example::
pt_br: Um exemplo::

source: The given filename is usually relative to the directory the current source file is contained in, but if it absolute (starting with ``/``), it is taken as relative to the top source directory.
pt_br: O nome de arquivo fornecido geralmente é relativo ao diretório no qual o arquivo fonte atual está contido, mas se for absoluto (começando com ``/``), será considerado relativo ao diretório fonte superior.

source: The ``example.py`` file will be copied to the output directory, and a suitable link generated to it.
pt_br: O arquivo ``example.py`` será copiado para o diretório de saída e um link adequado será gerado para ele.

source: Not to show unavailable download links, you should wrap whole paragraphs that have this role::
pt_br: Para não mostrar links de download indisponíveis, você deve agrupar parágrafos inteiros que tenham este papel::

source: Cross-referencing figures by figure number
pt_br: Fazendo referência cruzada a figuras por número de figura

source: :rst:role:`numref` role can also refer sections. And :rst:role:`numref` allows ``{name}`` for the link text.
pt_br: Papel :rst:role:`numref` também pode fazer referência a seções. E :rst:role:`numref` permite ``{name}`` para o texto do link.

source: Link to the specified figures, tables, code-blocks and sections; the standard reStructuredText labels are used. When you use this role, it will insert a reference to the figure with link text by its figure number like "Fig. 1.1".
pt_br: Link para as figuras, tabelas, blocos de código e seções especificadas; os rótulos reStructuredText padrão são usados. Ao usar este papel, ele irá inserir uma referência à figura com o texto do link pelo número da figura como "Fig. 1.1".

source: If an explicit link text is given (as usual: ``:numref:`Image of Sphinx (Fig. %s) <my-figure>```), the link caption will serve as title of the reference. As placeholders, `%s` and `{number}` get replaced by the figure number and `{name}` by the figure caption. If no explicit link text is given, the :confval:`numfig_format` setting is used as fall-back default.
pt_br: Se um texto de link explícito for fornecido (como de costume: ``:numref:`Imagem da Sphinx (Fig. %s) <minha-figura>```), a legenda do link servirá como título da referência. Como espaços reservados, `%s` e `{number}` são substituídos pelo número da figura e `{name}` pela legenda da figura. Se nenhum texto de link explícito for fornecido, a configuração :confval:`numfig_format` é usada como padrão substituto.

source: If :confval:`numfig` is ``False``, figures are not numbered, so this role inserts not a reference but the label or the link text.
pt_br: Se :confval:`numfig` for ``False``, as figuras não são numeradas, então este papel insere não uma referência, mas o rótulo ou o texto do link.

source: Cross-referencing other items of interest
pt_br: Fazendo referência cruzada a outros itens de interesse

source: The following roles do possibly create a cross-reference, but do not refer to objects:
pt_br: Os seguintes papéis possivelmente criam uma referência cruzada, mas não se referem a objetos:

source: A configuration value or setting. Index entries are generated. Also generates a link to the matching :rst:dir:`confval` directive, if it exists.
pt_br: Um valor de configuração ou uma definição. Entradas de índice são geradas. Também gera um link para a diretiva :rst:dir:`confval` correspondente, se existir.

source: An environment variable. Index entries are generated. Also generates a link to the matching :rst:dir:`envvar` directive, if it exists.
pt_br: Uma variável de ambiente. Entradas de índice são geradas. Também gera um link para a diretiva :rst:dir:`envvar` correspondente, se existir.

source: The name of a grammar token (used to create links between :rst:dir:`productionlist` directives).
pt_br: O nome de um token gramatical (usado para criar links entre as diretivas :rst:dir:`productionlist`).

source: The name of a keyword in Python. This creates a link to a reference label with that name, if it exists.
pt_br: O nome de uma palavra-chave no Python. Isso cria um link para um rótulo de referência com esse nome, se existir.

source: A command-line option to an executable program. This generates a link to a :rst:dir:`option` directive, if it exists.
pt_br: Uma opção de linha de comando para um programa executável. Isto gera um link para uma diretiva :rst:dir:`option`, se existir.

source: The following role creates a cross-reference to a term in a :ref:`glossary <glossary-directive>`:
pt_br: O papel a seguir cria uma referência cruzada para um termo em um :ref:`glossário <glossary-directive>`:

source: Reference to a term in a glossary. A glossary is created using the ``glossary`` directive containing a definition list with terms and definitions. It does not have to be in the same file as the ``term`` markup, for example the Python docs have one global glossary in the ``glossary.rst`` file.
pt_br: Referência a um termo em um glossário. Um glossário é criado usando a diretiva ``glossary`` contendo uma lista de definições com termos e definições. Não precisa estar no mesmo arquivo que a marcação ``term``, por exemplo, os documentos do Python têm um glossário global no arquivo ``glossary.rst``.

source: If you use a term that's not explained in a glossary, you'll get a warning during build.
pt_br: Se você usar um termo que não esteja explicado em um glossário, receberá um aviso durante a construção.

source: Cross-referencing anything
pt_br: Fazendo referência cruzada de qualquer coisa

source: This convenience role tries to do its best to find a valid target for its reference text.
pt_br: Esse papel de conveniência tenta fazer o melhor para localizar um alvo válido para seu texto de referência.

source: First, it tries standard cross-reference targets that would be referenced by :rst:role:`doc`, :rst:role:`ref` or :rst:role:`option`.
pt_br: Primeiro, ele tenta alvos de referência cruzada padrão que seriam referenciados por :rst:role:`doc`, :rst:role:`ref` ou :rst:role:`option`.

source: Custom objects added to the standard domain by extensions (see :meth:`.Sphinx.add_object_type`) are also searched.
pt_br: Objetos personalizados adicionados ao domínio padrão por extensões (veja :meth:`.Sphinx.add_object_type`) também são pesquisados.

source: Then, it looks for objects (targets) in all loaded domains. It is up to the domains how specific a match must be. For example, in the Python domain a reference of ``:any:`Builder``` would match the ``sphinx.builders.Builder`` class.
pt_br: Em seguida, ele procura por objetos (alvos) em todos os domínios carregados. Depende dos domínios quão específica deve ser uma correspondência. Por exemplo, no domínio Python uma referência de ``:any:`Builder``` corresponderia à classe ``sphinx.builders.Builder``.

source: If none or multiple targets are found, a warning will be emitted. In the case of multiple targets, you can change "any" to a specific role.
pt_br: Se nenhum ou vários alvos forem encontrados, um aviso será emitido. No caso de vários alvos, você pode alterar "any" para um papel específico.

source: This role is a good candidate for setting :confval:`default_role`. If you do, you can write cross-references without a lot of markup overhead. For example, in this Python function documentation::
pt_br: Este papel é uma bom candidato para configurar :confval:`default_role`. Se você fizer isso, poderá escrever referências cruzadas sem muita sobrecarga de marcação. Por exemplo, nesta documentação de função Python::

source: there could be references to a glossary term (usually ``:term:`handler```), a Python module (usually ``:py:mod:`signal``` or ``:mod:`signal```) and a section (usually ``:ref:`about-signals```).
pt_br: pode haver referências a um termo do glossário (normalmente ``:term:`handler```), um módulo Python (normalmente ``:py:mod:`signal``` ou ``:mod:`signal``` ) e uma seção (normalmente ``:ref:`about-signs```).

source: The :rst:role:`any` role also works together with the :mod:`~sphinx.ext.intersphinx` extension: when no local cross-reference is found, all object types of intersphinx inventories are also searched.
pt_br: O papel :rst:role:`any` também funciona junto com a extensão :mod:`~sphinx.ext.intersphinx`: quando nenhuma referência cruzada local é encontrada, todos os tipos de objetos de inventários intersphinx também são pesquisados.
