Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/internals/code-of-conduct.po
Languages: fr

source: Sphinx Code of Conduct
fr: Code de conduite Sphynx

source: Like the technical community as a whole, the Sphinx team and community is made up of volunteers from all over the world. Diversity is a strength, but it can also lead to communication issues and unhappiness. To that end, we have a few ground rules that we ask people to adhere to.
fr: Tout comme l'ensemble de la communauté technique, celle de Sphinx, au même titre que son équipe, est composée de bénévoles des quatre coins du monde. La diversité est une force, mais elle peut aussi conduire à des problèmes de communication et à des conflits. C'est pour cela que nous avons établi quelques règles fondamentales que nous demandons aux gens de respecter.

source: **Be friendly and patient.**
fr: **Soyez amical et patient.**

source: **Be welcoming.** We strive to be a community that welcomes and supports people of all backgrounds and identities. This includes, but is not limited to members of any race, ethnicity, culture, national origin, colour, immigration status, social and economic class, educational level, sex, sexual orientation, gender identity and expression, age, size, family status, political belief, religion, and mental and physical ability.
fr: **Soyez accueillant.** Nous aspirons à être une communauté qui accueille et encourage des personnes de toutes origines et identités. Entre autres, nos membres sont de toutes origines, ethnies, croyances, cultures, couleurs de peau, classes économiques, niveaux d'éducation, orientations sexuelles, identités et expressions de genre, âges, tailles, status familiaux, avis politiques et capacités mentales ou physiques.

source: **Be considerate.** Your work will be used by other people, and you in turn will depend on the work of others. Any decision you take will affect users and colleagues, and you should take those consequences into account when making decisions. Remember that we're a world-wide community, so you might not be communicating in someone else's primary language.
fr: **Soyez responsables.** Votre travail sera utilisé par d'autres personnes, tout comme vous êtes dépendant du travail d'autres personnes. Chaque décision que vous prenez affectera d'autres utilisateurs et collègues, ce qui est à prendre en compte avant de décider. N'oubliez pas que nous sommes une communauté mondiale, donc que la langue dans laquelle vous communiquez n'est peut-être pas la langue maternelle des autres.

source: **Be careful in the words that you choose.** We are a community of professionals, and we conduct ourselves professionally. Be kind to others. Do not insult or put down other participants. Harassment and other exclusionary behavior aren't acceptable. This includes, but is not limited to:
fr: **Soyez prudent dans les mots que vous choisissez.** Nous sommes une communauté de professionnels et nous nous comportons de manière professionnelle. Soyez gentil avec les autres. N'insultez pas et ne rabaissez pas les autres participants. Le harcèlement et autres comportements d'exclusion ne sont pas acceptables. Cela comprend, sans toutefois s'y limiter :

source: Violent threats or language directed against another person.
fr: Menaces ou violences verbales envers autrui.

source: Discriminatory jokes and language.
fr: Blagues et paroles discriminatoires.

source: Posting sexually explicit or violent material.
fr: Poster du contenu sexuellement explicite ou violent.

source: Posting (or threatening to post) other people's personally identifying information ("doxing").
fr: Poster (ou menacer de le faire) les informations personnelles de quelqu'un d'autre.

source: Personal insults, especially those using racist or sexist terms.
fr: Insultes personnelles, en particulier celles incluant des termes racistes ou sexistes.

source: Unwelcome sexual attention.
fr: Attention sexuelle indésirable.

source: Advocating for, or encouraging, any of the above behavior.
fr: Prôner ou encourager l’un des comportements ci-dessus.

source: Repeated harassment of others. In general, if someone asks you to stop, then stop.
fr: Harcèlement répété des autres. En général, si quelqu’un vous demande d’arrêter, arrêtez.

source: Original text courtesy of the Speak Up! project: http://web.archive.org/web/20141109123859/http://speakup.io/coc.html.
fr: Texte original inspiré du projet Speak Up! : http://web.archive.org/web/20141109123859/http://speakup.io/coc.html.
