Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/internals/organization.po
Languages: pt_br

source: Organization of the Sphinx project
pt_br: Organização do projeto Sphinx

source: The guide explains how the Sphinx project is organized.
pt_br: O guia explica como o projeto Sphinx está organizado.

source: Core developers
pt_br: Desenvolvedores core

source: The core developers of Sphinx have write access to the main repository. They can commit changes, accept/reject pull requests, and manage items on the issue tracker.
pt_br: Os desenvolvedores core do Sphinx possuem direito de escrita no repositório central. Podem fazer commit das modificações, aceitar / rejeitar pull requests bem como gerenciar itens no rastreador.

source: Guidelines
pt_br: Diretrizes

source: The following are some general guidelines for core developers:
pt_br: As seguintes diretrizes são orientações para desenvolvedores core:

source: Questionable or extensive changes should be submitted as a pull request instead of being committed directly to the main repository. The pull request should be reviewed by another core developer before it is merged.
pt_br: Extensivas ou modificações questionáveis devem ser submetidas como pull requests ao invés de commit direto no repositório principal. A pull request deve ser revista por outro desenvolvedor core antes de ser mesclada.

source: Trivial changes can be committed directly but be sure to keep the repository in a good working state and that all tests pass before pushing your changes.
pt_br: Modificações triviais podem ser incorporadas diretamente mas certificar-se que o repositório esteja em situação funcional e que todos os testes passaram antes de finalizar modificações.

source: When committing code written by someone else, please attribute the original author in the commit message and any relevant :file:`CHANGES.rst` entry.
pt_br: Ao fazer commit do código escrito por outra pessoa, favor identificar o autor na mensagem de commit e quaisquer outras entradas de :file:`CHANGES.rst`.

source: Membership
pt_br: Associação

source: Other contributors
pt_br: Outros contribuidores

source: You do not need to be a core developer or have write access to be involved in the development of Sphinx. You can submit patches or create pull requests from forked repositories and have a core developer add the changes for you.
pt_br: Não é preciso ser um desenvolvedor do núcleo ou possuir acesso a gravação para fazer algum desenvolvimento no Sphinx. As modificações podem ser submetidas através de requisições pull a partir de repositórios derivados e então um desenvolvedor do núcleo fará suas modificações.
