Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/restructuredtext/basics.po
Languages: ja, pt_br

source: :dudir:`highlights`, :dudir:`pull-quote` (block quotes with their own class attribute)
ja: :dudir:`highlights`, :dudir:`pull-quote` (特有のクラス属性を持つブロック引用)
pt_br: :dudir:`highlights`, :dudir:`pull-quote` (bloco com seus próprios atributos de classe)

source: :dudir:`compound <compound-paragraph>` (a compound paragraph)
ja: :dudir:`compound <compound-paragraph>` (複合パラグラフ)
pt_br: :dudir:`compound <compound-paragraph>` (parágrafo de composição)

source: Special tables:
ja: 特別なテーブル:
pt_br: Tabelas Especiais

source: :dudir:`table` (a table with title)
ja: :dudir:`table` (タイトル付きのテーブル)
pt_br: :dudir:`table` (tabela com título)

source: :dudir:`csv-table` (a table generated from comma-separated values)
ja: :dudir:`csv-table` (カンマ区切りの値からテーブル生成)
pt_br: :dudir:`csv-table` (tabela gerada com valores separados por virgulas)

source: :dudir:`list-table` (a table generated from a list of lists)
ja: :dudir:`list-table` (リストのリストからテーブル生成)
pt_br: :dudir:`list-table` (tabela gerada lista de listas)

source: Special directives:
ja: 特別なディレクティブ:
pt_br: Diretivas Especiais:

source: :dudir:`raw <raw-data-pass-through>` (include raw target-format markup)
ja: :dudir:`raw <raw-data-pass-through>` (ターゲットの書式のマークアップを挿入)
pt_br: :dudir:`raw <raw-data-pass-through>` (incluir marcação formato alvo bruto)

source: :dudir:`include` (include reStructuredText from another file) -- in Sphinx, when given an absolute include file path, this directive takes it as relative to the source directory
ja: :dudir:`include` (他のファイルからreStructuredTextを取り込み) -- Sphinxでは、絶対パスが指定されると、ソースディレクトリからの相対パスが利用されます。
pt_br: :dudir:`include` (inclui reStructured Text de outro arquivo) -- em Sphinx, quando informado o caminho absoluto do arquivo, essa diretiva torna isso relativo ao diretório fonte

source: :dudir:`class` (assign a class attribute to the next element) [1]_
ja: :dudir:`class` (次の要素へのクラス属性の設定) [1]_
pt_br: :dudir:`class` (assinala atributo a uma classe para o próximo elemento) [1]_

source: HTML specifics:
ja: HTML定義
pt_br: Especificidades HTML:

source: :dudir:`meta` (generation of HTML ``<meta>`` tags)
ja: :dudir:`meta` (HTMLの ``<meta>`` タグの生成)
pt_br: :dudir:`meta` (geração de HTML ``<meta>`` tags)

source: :dudir:`title <metadata-document-title>` (override document title)
ja: :dudir:`title <metadata-document-title>` (ドキュメントのタイトルの上書き)
pt_br: :dudir:`title <metadata-document-title>` (sobrepõe título do documento)

source: Influencing markup:
ja: 疑似命令マークアップ:
pt_br: Influenciando Markup:

source: :dudir:`default-role` (set a new default role)
ja: :dudir:`default-role` (デフォルトのロールをセット)
pt_br: :dudir:`default-role` (define nova role padrão)

source: :dudir:`role` (create a new role)
ja: :dudir:`role` (新しいロールの作成)
pt_br: :dudir:`role` (cria nova role)

source: Since these are only per-file, better use Sphinx's facilities for setting the :confval:`default_role`.
ja: これらのマークアップの影響範囲は、そのマークアップが書かれたファイルだけに限定されるため、Sphinxが提供する :confval:`default_role` を設定する方が良いでしょう。
pt_br: Desde que haja somente um por arquivo, melhor usar funcionalidades Sphinx para configurar :confval:`default_role`.

source: Do *not* use the directives :dudir:`sectnum`, :dudir:`header` and :dudir:`footer`.
ja: :dudir:`sectnum`, :dudir:`header`, :dudir:`footer` の3つのディレクティブは使用 *しない* で下さい。
pt_br: *Não* utilize as diretivas :dudir:`sectnum`, :dudir:`header` nem :dudir:`footer`.

source: Directives added by Sphinx are described in :doc:`directives`.
pt_br: As diretivas adicionadas pelo ``Sphinx`` são descritas em :doc:`directives`.

source: Basically, a directive consists of a name, arguments, options and content. (Keep this terminology in mind, it is used in the next chapter describing custom directives.) Looking at this example, ::
ja: 基本的に、ディレクティブは名前、引数、オプション、コンテンツなどで構成されています。これらの用語を覚えておいてください。これらは次の章でカスタムディレクティブの紹介を行う際に利用します。以下にサンプルを示します::
pt_br: Basicamente uma diretiva consiste de um nome, argumentos, opções e conteúdo. (Mantendo esta terminologia em mente, isso será descrito no próximo capítulo descrevendo diretivas personalizadas.) Veja nesse exemplo::

source: ``function`` is the directive name. It is given two arguments here, the remainder of the first line and the second line, as well as one option ``module`` (as you can see, options are given in the lines immediately following the arguments and indicated by the colons). Options must be indented to the same level as the directive content.
ja: ``function`` がディレクティブの名前です。ここでは二つの引数が与えられています。1行目の残りの部分と、2行目が引数です。そして1つのオプション ``module`` も同様に設定されています。見ての通り、オプションは引数のある行のすぐ次の行に書かれていています。そして、目印としてコロンが付いています。オプションは、ディレクティブのコンテンツと同じインデントの高さにします。
pt_br: ``função`` é o nome da diretiva. Isso é obtido com dois argumentos, o restante da primeira linha e a segunda linha, bem como uma opção ``módulo`` (como pode ver, opções são dadas em linhas imediatamente consecutivas aos argumentos e indicadas por dois pontos).

source: The directive content follows after a blank line and is indented relative to the directive start.
ja: ディレクティブのコンテンツというのは、空白行の後に続くブロックで、ディレクティブが開始された地点よりも深いインデントでくくられています。
pt_br: O conteúdo da diretiva segue-se após uma linha em branco e com indentação relativa ao início da diretiva.

source: Images
ja: 画像
pt_br: Imagens

source: reST supports an image directive (:dudir:`ref <image>`), used like so::
ja: reSTは画像に関するディレクティブ(:dudir:`ref <image>`)もサポートしています。以下のように使用します。::
pt_br: reST suporta diretiva de imagem (:dudir:`ref <image>`), usada assim::

source: When used within Sphinx, the file name given (here ``gnu.png``) must either be relative to the source file, or absolute which means that they are relative to the top source directory. For example, the file ``sketch/spam.rst`` could refer to the image ``images/spam.png`` as ``../images/spam.png`` or ``/images/spam.png``.
ja: Sphinx内で使用する場合には、ソースファイルからの相対パスか、トップのソースディレクトリからの絶対パスでファイル名(ここでは ``gnu.png``)を指定します。例えば、 ``sketch/spam.rst`` というソースファイルからは、 ``images/spam.png``, ``../images/spam.png``, ``/images/spam.png`` というように書くことができます。
pt_br: Quando usado com Sphinx o nome do arquivo (aqui ``gnu.png``) deve ser relativo ao arquivo fonte ou absoluto em relação ao diretório raiz do projeto. Por exemplo, o arquivo ``sketch/spam.rst`` refere-se a uma imagem ``images/spam.png`` como ``../images/spam.png`` ou ``/images/spam.png``.

source: Sphinx will automatically copy image files over to a subdirectory of the output directory on building (e.g. the ``_static`` directory for HTML output.)
ja: このディレクティブを使用すると、Sphinxはビルド時に、指定された画像ファイルを出力ディレクトリのサブディレクトリにコピーします。HTML出力の場合には、 ``_static`` といったディレクトリにコピーされます。
pt_br: Sphinx irá automaticamente copiar o arquivo de imagem para um subdiretório do diretório de construção (ex.. diretório ``_static`` para saída HTML.)

source: Interpretation of image size options (``width`` and ``height``) is as follows: if the size has no unit or the unit is pixels, the given size will only be respected for output channels that support pixels. Other units (like ``pt`` for points) will be used for HTML and LaTeX output (the latter replaces ``pt`` by ``bp`` as this is the TeX unit such that ``72bp=1in``).
ja: 画像サイズのオプション(``width`` と ``height``)は以下のように解釈されます。もし単位が無い、もしくは単位がピクセル(px)の場合には、与えられたサイズは出力するチャンネルがピクセルをサポートしているかどうかだけが考慮されます。他の単位(ポイントを表す ``pt`` など)はHTMLでもLaTeXでも使用されます(後者では ``72bp=1in`` が成り立つTeXの単位となるように ``pt`` を ``bp`` に置き換えます)。
pt_br: Interpretação das opções do tamanho da imagem (``largura`` e ``altura``) é essa: se o tamanho não tem unidade ou a unidade é pixel, então o tamanho suportado será respeitado, para a saída do respectivo canal. Outras unidades como ``pt`` (pontos) será usado para saída HTML e LaTeX (``pt`` por ``bp`` pois é uma unidade TeX como ``72bp=1in``).

source: Sphinx extends the standard docutils behavior by allowing an asterisk for the extension::
ja: Sphinxは標準のdocutilsを拡張していて、拡張子としてアスタリスク(*)を受け取れるようになっています::
pt_br: Sphinx expande os padrões e comportamentos de docutils permitindo extensões::

source: Sphinx then searches for all images matching the provided pattern and determines their type. Each builder then chooses the best image out of these candidates. For instance, if the file name ``gnu.*`` was given and two files :file:`gnu.pdf` and :file:`gnu.png` existed in the source tree, the LaTeX builder would choose the former, while the HTML builder would prefer the latter. Supported image types and choosing priority are defined at :doc:`/usage/builders/index`.
pt_br: O ``Sphinx``, em seguida, procura todas as imagens que correspondem ao padrão fornecido e determina seu tipo. Cada construtor escolhe a melhor imagem desses candidatos. Por exemplo, se o nome do arquivo ``gnu.*`` foi fornecido e dois arquivos :file:`gnu.png` existiam na árvore de origem, o construtor LaTeX escolheria o antigo, enquanto o construtor HTML preferiria o último. Os tipos de imagem suportados e a prioridade de escolha são definidos em :doc:`/usage/builders/index`.

source: Note that image file names should not contain spaces.
ja: 画像ファイルのファイル名にはスペースを含んではいけないことに注意してください。
pt_br: Note que um arquivo com nome de imagem não pode conter espaços.

source: Added the support for file names ending in an asterisk.
ja: ファイル名の末尾をアスタリスク（*）にできる機能が追加されました。
pt_br: Adicionado suporte a arquivo com nomes terminados com asterisco.

source: Image paths can now be absolute.
ja: イメージパスとして、ソースフォルダのルートからの絶対パスが指定できるようになりました。
pt_br: Imagens podem ter caminho absoluto.

source: latex target supports pixels (default is ``96px=1in``).
ja: latexターゲットがピクセルをサポートするようになりました(デフォルトは ``96px=1in`` です)。
pt_br: destino latex suporta pixels (padrão é ``96px=1in``).

source: Footnotes
ja: 脚注
pt_br: Notas de Rodapé

source: For footnotes (:duref:`ref <footnotes>`), use ``[#name]_`` to mark the footnote location, and add the footnote body at the bottom of the document after a "Footnotes" rubric heading, like so::
ja: 脚注(:duref:`ref <footnotes>`)を作成するためには、脚注を書きたい場所で ``[#name]_`` というマークアップを書きます。そして、脚注の本体をドキュメントの下の方の "脚注" のためのrubric見出しの中に書きます::
pt_br: Para notas rodapé (:duref:`ref <footnotes>`), use ``[#name]_`` para marcar o local da nota de rodapé e adicionar corpo da nota de rodape na base do documento após a rubrica "Footnotes" desse modo::

source: You can also explicitly number the footnotes (``[1]_``) or use auto-numbered footnotes without names (``[#]_``).
ja: 脚注の数値を明示的に指定(``[1]_``)することもできますし、名前を指定しないで脚注の自動採番(``[#]_``)をさせることも可能です。
pt_br: Pode também ser explicitado o número da nota de rodapé (``[1]_``) ou usar notas de rodapé autonumeradas sem nomes (``[#]_``).

source: Citations
ja: 引用
pt_br: Citações

source: Standard reST citations (:duref:`ref <citations>`) are supported, with the additional feature that they are "global", i.e. all citations can be referenced from all files. Use them like so::
ja: 標準のreSTでも引用(:duref:`ref <citations>`)はサポートしていますが、Sphinx独自の追加の機能としては、引用が"グローバル"ということです。そのため、全ての引用はすべてのファイルから参照できます。以下のように使用します::
pt_br: Citações padrão em reST (:duref:`ref <citations>`) são suportadas, com a funcionalidade adicional que é ser "global", ex.. todas citações são referenciadas em todos os arquivos. Use-as assim::

source: Citation usage is similar to footnote usage, but with a label that is not numeric or begins with ``#``.
ja: 引用は、脚注と同じように使用できますが、ラベルは数字ではありませんし、 ``#`` でも始まりません。
pt_br: Citação é usada de maneira similar ao uso de notas de rodapé, mas com um rótulo que não é numérico nem começa com ``#``.

source: Substitutions
ja: 置換
pt_br: Substituições

source: reST supports "substitutions" (:duref:`ref <substitution-definitions>`), which are pieces of text and/or markup referred to in the text by ``|name|``. They are defined like footnotes with explicit markup blocks, like this::
ja: reSTは"置換"(:duref:`ref <substitution-definitions>`)をサポートしています。これは、テキスト中の ``|名前|`` で指定された箇所に、テキストや、マークアップを挿入します。脚注と同じように明示的なマークアップブロックを使って定義します::
pt_br: reST suporta "substituições" (:duref:`ref <substitution-definitions>`), os quais são partes do texto ou marcações que se referem ao texto por ``|name|``. São definidos como notas de rodapé com blocos explícitos como esse::

source: or this::
ja: もしくはこのように書きます::
pt_br: or assim::

source: See the :duref:`reST reference for substitutions <substitution-definitions>` for details.
ja: 詳しくは :duref:`reSTリファレンスの置換の説明 <substitution-definitions>` を参照してください。
pt_br: Ver :duref:`reST para referências a detalhes em substituições <substitution-definitions>`.

source: If you want to use some substitutions for all documents, put them into :confval:`rst_prolog` or :confval:`rst_epilog` or put them into a separate file and include it into all documents you want to use them in, using the :rst:dir:`include` directive. (Be sure to give the include file a file name extension differing from that of other source files, to avoid Sphinx finding it as a standalone document.)
pt_br: Se você quiser usar algumas substituições para todos os documentos, coloque-os em :confval:`rst_prolog` ou :confval:`rst_epilog` ou coloque-os em um arquivo separado e inclua-os em todos os documentos nos quais deseja usá-los, usando a diretiva :rst:dir:`include`. (Certifique-se de fornecer ao arquivo de inclusão uma extensão de nome de arquivo diferente da de outros arquivos de origem, para evitar que o ``Sphinx`` o encontre como um documento independente.)

source: Sphinx defines some default substitutions, see :ref:`default-substitutions`.
ja: Sphinxはデフォルトの置換をいくつか定義しています。詳しくは :ref:`default-substitutions` を参照してください。
pt_br: Sphinx define algumas substituições padrões, ver :ref:`default-substitutions`.

source: Comments
ja: コメント
pt_br: Comentários

source: Every explicit markup block which isn't a valid markup construct (like the footnotes above) is regarded as a comment (:duref:`ref <comments>`). For example::
ja: 上記の脚注のような適切な構造をしていない明示的マークアップのブロックはすべてコメント(:duref:`ref <comments>`)とみなされます::
pt_br: Cada bloco explícito de marcação que não seja uma construção válida (como notas de rodapé acima) é entendida como um comentário (:duref:`ref <comments>`). Por exemplo::

source: You can indent text after a comment start to form multiline comments::
ja: コメントがスタートした行からインデントすることによって、複数行コメントにできます::
pt_br: Pode ser indentado texto após um comentário iniciar em um formulário de múltiplos comentários::

source: Source encoding
ja: ソースエンコーディング
pt_br: Codificação Página

source: Since the easiest way to include special characters like em dashes or copyright signs in reST is to directly write them as Unicode characters, one has to specify an encoding. Sphinx assumes source files to be encoded in UTF-8 by default; you can change this with the :confval:`source_encoding` config value.
ja: エムダッシュ(アルファベットのMと同じ幅を持つダッシュ)や、コピーライトの記号などの特殊記号をreSTに入れる場合にはユニコードの文字として直接入れるのが一番簡単な方法です。Sphinxはデフォルトでは、UTF-8であるとみなしてソースコードを読み込みます。 :confval:`source_encoding` の設定値を変更することで、このデフォルトのエンコーディングを変更できます。
pt_br: A maneira mais prática de incluir caracteres especiais como barras ou signais de direito autoral em reST é diretamente escrever em caracter Unicode e especificar um código específico. Sphinx assume arquivos fonte estejam em UTF-8 por padrão; o valor pode ser modificado através de :confval:`source_encoding`.

source: Gotchas
ja: 分かっていること
pt_br: Pegadinhas

source: There are some problems one commonly runs into while authoring reST documents:
ja: reSTのドキュメントを書いていると、良く遭遇する問題がいくつかあります:
pt_br: Existem algumas pegadinhas que são comuns quando criamos documentos reST:

source: **Separation of inline markup:** As said above, inline markup spans must be separated from the surrounding text by non-word characters, you have to use a backslash-escaped space to get around that. See :duref:`the reference <substitution-definitions>` for the details.
ja: **インラインマークアップの分離:** 上記の説明でも触れていますが、インラインマークアップを付ける領域の前後はテキスト以外の文字(スペース、カッコなど)や、バックスラッシュ(日本語フォントだと円記号)でエスケープしたスペースでくくる必要があります。詳しくは、 :duref:`the reference <substitution-definitions>` を参照してください。
pt_br: **Separação de marcação inline:** Como dito, marcações inline devem ser separadas por textos delimitados por caracteres não palavras e deve ser usado barra invertida como escape de espaço. Ver :duref:`the reference <substitution-definitions>` para detalhes.

source: **No nested inline markup:** Something like ``*see :func:`foo`*`` is not possible.
ja: **インラインマークアップのネストはできない:** ``*:func:`foo` 参照*`` といった書き方はできません。
pt_br: **Nenhuma marcação aninhada** Algo como ``*see :func:`foo`*`` não é possível.

source: When the default domain contains a :rst:dir:`class` directive, this directive will be shadowed. Therefore, Sphinx re-exports it as :rst:dir:`rst-class`.
ja: デフォルトドメインに :rst:dir:`class` ディレクティブが存在するため、このディレクティブはそのままでは使用できません。そのため、Sphinxでは、 :rst:dir:`rst-class` という名前で再定義しています。
pt_br: Quando um domínio padrão contém diretiva classe :rst:dir:`class`, essa diretiva será ocultada, entretanto, Sphinx irá reexportá-la como :rst:dir:`rst-class`.

source: Roles
ja: ロール
