Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/restructuredtext/basics.po
Languages: ja, pt_br

source: reStructuredText Primer
ja: reStructuredText入門
pt_br: Primer do reStructuredText

source: reStructuredText is the default plaintext markup language used by Sphinx. This section is a brief introduction to reStructuredText (reST) concepts and syntax, intended to provide authors with enough information to author documents productively. Since reST was designed to be a simple, unobtrusive markup language, this will not take too long.
pt_br: reStructuredText é a linguagem de marcação de texto simples usada pelo ``Sphinx``. Esta seção é uma breve introdução aos conceitos e à sintaxe reStructuredText (reST), destinada a fornecer aos autores informações suficientes para criar documentos de forma produtiva. Como o reST foi projetado para ser uma linguagem de marcação simples e discreta, isso não vai demorar muito.

source: The authoritative `reStructuredText User Documentation <http://docutils.sourceforge.net/rst.html>`_. The "ref" links in this document link to the description of the individual constructs in the reST reference.
ja: 本家 `reStructuredTextユーザドキュメント <http://docutils.sourceforge.net/rst.html>`_ このドキュメント中の参照リンクは、reSTのリファレンスの個々の要素の説明にリンクしています。
pt_br: A documentação original está em `Documentação para Usuário do reStructuredText<http://docutils.sourceforge.net/rst.html>`_. Todos os links "ref" utilizam este documento para descrever referências a construções reST.

source: Paragraphs
ja: 段落(パラグラフ)
pt_br: Parágrafos

source: The paragraph (:duref:`ref <paragraphs>`) is the most basic block in a reST document. Paragraphs are simply chunks of text separated by one or more blank lines. As in Python, indentation is significant in reST, so all lines of the same paragraph must be left-aligned to the same level of indentation.
ja: 段落(:duref:`ref <paragraphs>`)はreSTドキュメントにおける、もっとも基本的な要素です。段落は1行以上の空行で区切られた、シンプルなテキストの固まりです。 Pythonにおいてインデントが重要な意味を持つのと同様、reSTでもインデントは重要です。同じ段落のすべての行は、インデントを同じ高さにそろえて、左揃えにしなければなりません。
pt_br: O parágrafo (:duref:`ref <paragraphs>`) é um documento básico sobre reSt. Parágrafos são porções de texto separados por uma ou mais linhas em branco. Como em Python, indentação tem importância em reSt, portando todas as linhas do mesmo parágrafo devem estar alinhadas à esquerda para que preservem o mesmo nível correlado.

source: Inline markup
ja: インラインマークアップ
pt_br: Marcação Inline

source: The standard reST inline markup is quite simple: use
ja: 標準のreSTインラインマークアップは極めてシンプルです。
pt_br: O padrão reST para marcação inline é simples: use

source: one asterisk: ``*text*`` for emphasis (italics),
ja: アスタリスク1つ: ``*テキスト*`` 強調(イタリック)
pt_br: um asterisco: ``*texto*`` para enfatizar (itálico),

source: two asterisks: ``**text**`` for strong emphasis (boldface), and
ja: アスタリスク2つ: ``**テキスト**`` 強い強調(太文字)
pt_br: dois asteriscos: ``**texto**`` para enfatizar (negrito) e

source: backquotes: ````text```` for code samples.
ja: バッククオート: ````テキスト```` コードサンプル
pt_br: aspas backquotes <shift+crase> em pt-BR: ````texto```` para exemplo de código.

source: If asterisks or backquotes appear in running text and could be confused with inline markup delimiters, they have to be escaped with a backslash.
ja: もしも、アスタリスクかバッククオートがテキスト中に使用する場合は、インラインマークアップの区切り文字と間違ってしまうことがあります。そのような場合には、バックスラッシュ(訳注:日本語フォントだと円記号)を使ってエスケープしてください。
pt_br: Se asteriscos ou <shift-aspas> `` `` aparecem no texto e confundem-se com o texto utilizar backslash (barra invertida) como escape.

source: Be aware of some restrictions of this markup:
ja: このマークアップにはいくつかの制限があります。
pt_br: Certificar-se de algumas restrições dessas marcações:

source: it may not be nested,
ja: ネストすることはできません
pt_br: Não podem ser aninhadas,

source: content may not start or end with whitespace: ``* text*`` is wrong,
ja: 中のテキストの最初、もしくは最後にスペースを入れることもできません。 ``* text*`` と書くことはできません
pt_br: conteúdo não pode começar nem terminar por espaço em branco: ``* texto*`` está incorreto,

source: it must be separated from surrounding text by non-word characters. Use a backslash escaped space to work around that: ``thisis\ *one*\ word``.
ja: 周囲のテキストとは、テキスト以外の文字(スペース、カッコなど)で区切る必要があります。もしも空白を空けずに、続けて表記したい場合には、 ``thisis\ *one*\ word`` と、バックスラッシュでエスケープしたテキスト(スペースは表示されません)を使用してください。
pt_br: deve estar separado do texto envolvido por caracteres que não sejam palavras. Utilize sequência barra invertida para contornar: ``isso é\ *um*\ mundo``.

source: These restrictions may be lifted in future versions of the docutils.
ja: これらの制限は、docutilsの将来のバージョンでも残るでしょう。
pt_br: Essas restrições podem ser retiradas em futura versões do docutils.

source: It is also possible to replace or expand upon some of this inline markup with roles. Refer to :ref:`rst-roles-alt` for more information.
pt_br: Também é possível substituir ou expandir algumas dessas marcações inline com funções. Consulte :ref:`rst-roles-alt` para mais informações.

source: Lists and Quote-like blocks
ja: リストと引用のようなブロック
pt_br: Listas e Blocos Transcritos

source: List markup (:duref:`ref <bullet-lists>`) is natural: just place an asterisk at the start of a paragraph and indent properly. The same goes for numbered lists; they can also be autonumbered using a ``#`` sign::
ja: リストを表現するマークアップ (:duref:`ref <bullet-lists>`) はほぼ結果の見た目通りです。パラグラフの最初をアスタリスクで開始して、適切にインデントをしてやるだけです。ナンバー付きのリストも同様です。 ``#`` を使うことで、ナンバリングを自動で行うこともできます::
pt_br: Lista marcada (:duref:`ref <bullet-lists>`) é natural: apenas colocar um asterisco no início de cada parágrafo e identar apropriadamente. O mesmo acontece para listas numeradas; estas podem ser também autonumeradas usando o sinal ``#``::

source: Nested lists are possible, but be aware that they must be separated from the parent list items by blank lines::
ja: ネストされたリストも使用できますが、親のリストとは空白行で区切る必要があります::
pt_br: Listas aninhadas são possíveis, mas cautela pois devem estar separadas das listas hierarquicamente superiores por linhas em branco::

source: Definition lists (:duref:`ref <definition-lists>`) are created as follows::
ja: 定義リスト(:duref:`ref <definition-lists>`)は以下のようにして作成します::
pt_br: Definição listas (:duref:`ref <definition-lists>`) são criadas assim::

source: Note that the term cannot have more than one line of text.
ja: 用語のテキストは複数行書くことができないことに注意してください。
pt_br: Note que o termo não pode estar em mais de uma linha de texto.

source: Quoted paragraphs (:duref:`ref <block-quotes>`) are created by just indenting them more than the surrounding paragraphs.
ja: 引用パラグラフ(:duref:`ref <block-quotes>`)は周囲のパラグラフよりもインデントすることで作成できます。
pt_br: Parágrafos transcritos (:duref:`ref <block-quotes>`) são criados apenas indentando-os mais do que os parágrafos do entorno.

source: Line blocks (:duref:`ref <line-blocks>`) are a way of preserving line breaks::
ja: ラインブロック(:duref:`ref <line-blocks>`)を利用すると、改行状態をそのまま維持したまま出力できます::
pt_br: Blocos de Linhas (:duref:`ref <line-blocks>`) são uma maneira de preservar a quebra das linhas::

source: There are also several more special blocks available:
ja: 次のような特別なブロックも利用できます:
pt_br: Também existem diversos blocos especiais disponíveis:

source: field lists (:duref:`ref <field-lists>`, with caveats noted in :ref:`rst-field-lists`)
pt_br: listas de campos (:duref:`ref <field-lists>`, com advertências anotadas em :ref:`rst-field-lists`)

source: option lists (:duref:`ref <option-lists>`)
ja: オプションリスト (:duref:`ref <option-lists>`)
pt_br: lista opções (:duref:`ref <option-lists>`)

source: quoted literal blocks (:duref:`ref <quoted-literal-blocks>`)
ja: 引用リテラルブロック (:duref:`ref <quoted-literal-blocks>`)
pt_br: blocos transcrição literal (:duref:`ref <quoted-literal-blocks>`)

source: doctest blocks (:duref:`ref <doctest-blocks>`)
ja: doctestブロック (:duref:`ref <doctest-blocks>`)
pt_br: blocos doctest (:duref:`ref <doctest-blocks>`)

source: Literal blocks
pt_br: Blocos literais

source: Literal code blocks (:duref:`ref <literal-blocks>`) are introduced by ending a paragraph with the special marker ``::``. The literal block must be indented (and, like all paragraphs, separated from the surrounding ones by blank lines)::
ja: リテラルコードブロック(:duref:`ref <literal-blocks>`)は、前の段落の行末を特別な記号 ``::`` にすることで開始できます。リテラルコードブロックはインデントする必要があります。また、他のパラグラフ同様、空白行で前後をかこう必要があります::
pt_br: blocos código literal (:duref:`ref <literal-blocks>`) são introduzidos por um final de parágrafo com o marcador especial ``::``. O bloco literal deve estar indentado e (como todos os parágrafos, separados dos correlatos por uma ou mais linhas em branco)::

source: The handling of the ``::`` marker is smart:
ja: ``::`` マーカーの扱いはとてもスマートです:
pt_br: O manuseio do marcador ``::`` é esperto:

source: If it occurs as a paragraph of its own, that paragraph is completely left out of the document.
ja: もしマーカーがリテラルコードブロックのパラグラフの中に出てきた場合には、そのパラグラフは完全にそのままドキュメント中に残されます。
pt_br: Se ocorrer em um parágrafo próprio, o parágrafo é ajustado a esquerda do documento.

source: If it is preceded by whitespace, the marker is removed.
ja: もしもマーカーの前がホワイトスペースだった場合には、マーカー自身は非表示になります。
pt_br: Se for precedido por um espaço em branco, o marcador é removido.

source: If it is preceded by non-whitespace, the marker is replaced by a single colon.
ja: もしもマーカーの前がホワイトスペース以外だった場合には、コロン(:)1つだけが表示されます。
pt_br: Se for precedido por um não-espaço-em-branco o marcador é substituído por uma aspa simples.

source: That way, the second sentence in the above example's first paragraph would be rendered as "The next paragraph is a code sample:".
ja: 3つ目のルールが適用されるため、上記のサンプルの最初の段落中の２つめの文をレンダリングすると、 "次のパラグラフはコードサンプルです:" という表記になります。
pt_br: Dessa maneira, a segunda sentença no exemplo acima do primeiro parágrafo será renderizado como "O próximo parágrafo é um exemplo de código:".

source: Code highlighting can be enabled for these literal blocks on a document-wide basis using the :rst:dir:`highlight` directive and on a project-wide basis using the :confval:`highlight_language` configuration option. The :rst:dir:`code-block` directive can be used to set highlighting on a block-by-block basis. These directives are discussed later.
pt_br: O realce de código pode ser ativado para esses blocos literais em toda a documentação, usando a diretiva :rst:dir:`highlight` e em toda a base do projeto, usando a opção de configuração :confval:`highlight_language`. A diretiva :rst:dir:`code-block` pode ser usada para definir o destaque em uma base bloco a bloco. Essas diretrizes são discutidas mais adiante.

source: Doctest blocks
pt_br: Blocos doctest

source: Doctest blocks (:duref:`ref <doctest-blocks>`) are interactive Python sessions cut-and-pasted into docstrings. They do not require the :ref:`literal blocks <rst-literal-blocks>` syntax. The doctest block must end with a blank line and should *not* end with with an unused prompt::
pt_br: Os blocos do ``Doctest`` (:duref:`ref <doctest-blocks>`) são sessões do Python interativas recortadas e coladas em ``docstrings``. Elas não exigem a sintaxe :ref:`literal blocks <rst-literal-blocks>`. O bloco ``doctest`` deve terminar com uma linha em branco e *não* deve terminar com um prompt não utilizado::

source: Tables
ja: テーブル
pt_br: Tabelas

source: For *grid tables* (:duref:`ref <grid-tables>`), you have to "paint" the cell grid yourself. They look like this::
ja: **グリッドテーブル** (:duref:`ref <grid-tables>`)は、セルのグリッドを自分で線描する必要があります。これは次のようになります::
pt_br: Para *grid tables* (:duref:`ref <grid-tables>`), você precisa *pintar* a grade da célula. Eles se parecem com isso::

source: *Simple tables* (:duref:`ref <simple-tables>`) are easier to write, but limited: they must contain more than one row, and the first column cells cannot contain multiple lines. They look like this::
ja: **シンプルテーブル** (:duref:`ref <simple-tables>`)はより書くのが簡単な方法ですが、制限があります。1つ以上の列を含み、最初のカラムには複数行のテキストを書くことができません。次のように表現されます::
pt_br: *Simple tables* (:duref:`ref <simple-tables>`) é mais fácil de gravar, mas limitado: eles devem conter mais de uma linha e as primeiras células da coluna não podem conter várias linhas. Eles se parecem com isso::

source: Two more syntaxes are supported: *CSV tables* and *List tables*. They use an *explicit markup block*. Refer to :ref:`table-directives` for more information.
pt_br: Mais duas sintaxes são suportadas: *CSV tables* e *List tables*. Elas usam um *explicit markup block*. Consulte :ref:`table-directives` para mais informações.

source: Hyperlinks
ja: ハイパーリンク
pt_br: Hiperlinks

source: External links
ja: 外部リンク
pt_br: Links externos

source: Use ```Link text <https://domain.invalid/>`_`` for inline web links. If the link text should be the web address, you don't need special markup at all, the parser finds links and mail addresses in ordinary text.
ja: ```Link text <https://domain.invalid/>`_`` と書くことで、ウェブサイトへのリンクを埋め込めます。もしリンクテキストがウェブのアドレスである場合には、特別なマークアップは必要ありません。パーサーが通常のテキスト中にリンクかメールアドレスを見付けてくれます。
pt_br: Use ```Link text <https://domain.invalid/>`_`` para links da Web embutidos. Se o texto do link deve ser o endereço da web, você não precisa de nenhuma marcação especial, o analisador encontra links e endereços de e-mail em texto comum.

source: There must be a space between the link text and the opening \< for the URL.
ja: リンクテキストとURLの開き括弧 \< の間には空白がなければなりません。
pt_br: Deve haver um espaço enter o texto do link da URL e o \< de abertura.

source: You can also separate the link and the target definition (:duref:`ref <hyperlink-targets>`), like this::
ja: 次のようにして、ターゲット定義(:duref:`ref <hyperlink-targets>`)と、リンクを分割することもできます::
pt_br: Também é possível separar o link da definição do alvo (:duref:`ref <hyperlink-targets>`) como isso::

source: Internal links
ja: 内部リンク
pt_br: Links internos

source: Internal linking is done via a special reST role provided by Sphinx, see the section on specific markup, :ref:`ref-role`.
ja: 内部リンクはSphinxの提供する、特別なreSTのロールを通じて行われます。詳しくは、特別なマークアップ :ref:`ref-role` のセクションを見てください。
pt_br: Ligações internas são feitas através de regra reST provida por Sphinx, ver seção na marcação específica :ref:`ref-role`.

source: Sections
ja: セクション
pt_br: Seções

source: Section headers (:duref:`ref <sections>`) are created by underlining (and optionally overlining) the section title with a punctuation character, at least as long as the text::
ja: セクションのヘッダ(:duref:`ref <sections>`)は、セクションのタイトルを句読点などの記号の文字でアンダーラインを引くことで設定します。必要に応じてでオーバーラインも併用できます。アンダーラインはテキストと同じか、それ以上の長さにする必要があります::
pt_br: Seção cabeçalho (:duref:`ref <sections>`) são criadas através decomposição (e opcionalmente sobreposição) no título da seção com pontuação de caracter, pelo menos como um texto::

source: Normally, there are no heading levels assigned to certain characters as the structure is determined from the succession of headings. However, this convention is used in `Python's Style Guide for documenting <https://docs.python.org/devguide/documenting.html#style-guide>`_ which you may follow:
ja: 通常は、文字の種類と見出しのレベルは関係ないため、どの文字でも使用することができます。使用していない種類のアンダーラインが出てくると、見出しのレベルが一段変わる、というルールになっています。参考までに、 `Pythonドキュメントでのスタイルガイド<https://docs.python.org/devguide/documenting.html#style-guide>`_ で用いられる慣例について紹介しておきます:
pt_br: Normalmente, não há níveis de título atribuídos a determinados caracteres, pois a estrutura é determinada a partir da sucessão de títulos. No entanto, esta convenção é usada em `Python's Style Guide for documenting <https://docs.python.org/devguide/documenting.html#style-guide>`_, que você pode seguir:

source: ``#`` with overline, for parts
ja: ``#`` 部: オーバーライン付き
pt_br: ``#`` com sublinhado para componentes

source: ``*`` with overline, for chapters
ja: ``*`` 章: オーバーライン付き
pt_br: ``*`` com sublinhado para capítulos

source: ``=``, for sections
ja: ``=``, セクション
pt_br: ``=``, para seções

source: ``-``, for subsections
ja: ``-``, サブセクション
pt_br: ``-``, para subseções

source: ``^``, for subsubsections
ja: ``^``, サブサブセクション
pt_br: ``^``, para subsubseções

source: ``"``, for paragraphs
ja: ``"``, パラグラフ
pt_br: ``"``, para parágrafos

source: Of course, you are free to use your own marker characters (see the reST documentation), and use a deeper nesting level, but keep in mind that most target formats (HTML, LaTeX) have a limited supported nesting depth.
ja: もちろん、どのようなマークアップ文字を選択しても自由ですし、組み合わせることで、より深いネストレベルも使用できます。reSTの文章を参照してください。ただし、ほとんどの対象となる出力フォーマット(HTML, LaTeX)は、ネストできる深さには限界が設定されている、ということは忘れないでください。
pt_br: Claro que há liberdade para usar seus próprios caracteres de marcação (veja documentação reST) e use um maior nivel, mas tenha em mente que os formatos alvo (HTML, LaTeX) possuem limites de aninhamento.

source: Field Lists
pt_br: Listas de campo

source: Field lists (:duref:`ref <field-lists>`) are sequences of fields marked up like this::
pt_br: Listas de campos (:duref:`ref <field-lists>`) são seqüências de campos marcados assim::

source: They are commonly used in Python documentation::
pt_br: Eles são comumente usados em documentação do Python::

source: Sphinx extends standard docutils behavior and intercepts field lists specified at the beginning of documents. Refer to :doc:`field-lists` for more information.
pt_br: O ``Sphinx`` estende o comportamento dos ``docutils`` padrão e intercepta as listas de campos especificadas no início dos documentos. Consulte :doc:`field-lists` para mais informações.

source: A role or "custom interpreted text role" (:duref:`ref <roles>`) is an inline piece of explicit markup. It signifies that that the enclosed text should be interpreted in a specific way. Sphinx uses this to provide semantic markup and cross-referencing of identifiers, as described in the appropriate section. The general syntax is ``:rolename:`content```.
pt_br: Uma função ou "função de texto interpretada personalizada" (:duref:`ref <roles>`) é uma peça inline de marcação explícita. Isso significa que o texto em anexo deve ser interpretado de uma maneira específica. O ``Sphinx`` usa isso para fornecer marcação semântica e referência cruzada de identificadores, conforme descrito na seção apropriada. A sintaxe geral é ``:rolename:`content```.

source: Docutils supports the following roles:
pt_br: O ``Docutils`` suporta os seguintes *roles*:

source: :durole:`emphasis` -- equivalent of ``*emphasis*``
pt_br: :durole:`emphasis` -- equivalente a ``*emphasis*``

source: :durole:`strong` -- equivalent of ``**strong**``
pt_br: :durole:`strong` -- equivalente a ``**strong**``

source: :durole:`literal` -- equivalent of ````literal````
pt_br: :durole:`literal` -- equivalente a ````literal````

source: :durole:`subscript` -- subscript text
ja: :durole:`subscript` -- 下付き文字
pt_br: :durole:`subscript` -- texto escrita inferior

source: :durole:`superscript` -- superscript text
ja: :durole:`superscript` -- 上付き文字
pt_br: :durole:`superscript` -- texto escrita superior

source: :durole:`title-reference` -- for titles of books, periodicals, and other materials
ja: :durole:`title-reference` -- 書籍、定期刊行物などのタイトル
pt_br: :durole:`title-reference` -- para títulos de livros, periódicos e outros materiais

source: Refer to :doc:`roles` for roles added by Sphinx.
pt_br: Consulte :doc:`roles` para funções adicionadas pelo ``Sphinx``.

source: Explicit Markup
ja: 明示的なマークアップ
pt_br: Marcação Explícita

source: "Explicit markup" (:duref:`ref <explicit-markup-blocks>`) is used in reST for most constructs that need special handling, such as footnotes, specially-highlighted paragraphs, comments, and generic directives.
ja: "明示的なマークアップ"(:duref:`ref <explicit-markup-blocks>`)というのは、reSTの中では特別な操作の必要な多くの構成要素のために使用されます。例えば脚注や、言語別のハイライトをする特別な段落、コメントや処理系(Sphinx)に対する指示などです。
pt_br: "Marcação Explicita" (:duref:`ref <explicit-markup-blocks>` é usada em reST para maior parte dos construtores que necessitam de recursos especiais como notas de rodapé, parágrafos destacados, comentários e diretivas gerais.

source: An explicit markup block begins with a line starting with ``..`` followed by whitespace and is terminated by the next paragraph at the same level of indentation. (There needs to be a blank line between explicit markup and normal paragraphs. This may all sound a bit complicated, but it is intuitive enough when you write it.)
ja: 明示的なマークアップのブロックは ``..`` で始まる行から始まります。先頭の記号の後ろにはホワイトスペースが一つ入ります。そして、インデントが同じレベルになる次の段落までが１つのブロックとして扱われます。通常のパラグラフと、明示的なマークアップのブロックの間には一行以上のスペースを空ける必要があります。このような説明を聞くとわかりにくいと感じる人も多いと思いますが、実際に自分で書いてみると十分に直感的であるということがわかるでしょう。
pt_br: Um bloco de marcação inicia-se com uma linha com ``..`` seguido por um espaço em branco e terminado pelo próximo parágrafo no mesmo nível de indentação. (Há necessidade de linhas em branco entre marcações explicitas e parágrafos normais. Essa maneira pode parecer complicado, mas é a maneira intuitiva que já usamos para escrever.)

source: Directives
ja: ディレクティブ
pt_br: Diretivas

source: A directive (:duref:`ref <directives>`) is a generic block of explicit markup. Along with roles, it is one of the extension mechanisms of reST, and Sphinx makes heavy use of it.
pt_br: Uma diretiva (:duref:`ref <directives>`) é um bloco genérico de marcação explícita. Junto com os *roles*, é um dos mecanismos de extensão do reST, e o ``Sphinx`` faz uso pesado dele.

source: Docutils supports the following directives:
ja: Docutilsは次のようなディレクティブを含みます:
pt_br: Docutils suporta as seguintes diretivas:

source: Admonitions: :dudir:`attention`, :dudir:`caution`, :dudir:`danger`, :dudir:`error`, :dudir:`hint`, :dudir:`important`, :dudir:`note`, :dudir:`tip`, :dudir:`warning` and the generic :dudir:`admonition <admonitions>`. (Most themes style only "note" and "warning" specially.)
ja: 警告: :dudir:`attention`, :dudir:`caution`, :dudir:`danger`, :dudir:`error`, :dudir:`hint`, :dudir:`important`, :dudir:`note`, :dudir:`tip`, :dudir:`warning` ,および、一般的な用途の :dudir:`admonition <admonitions>` (ほとんどのテーマは、"note"と"warning"にだけスタイルを適用します)。
pt_br: Admonitions: :dudir:`attention`, :dudir:`caution`, :dudir:`danger`, :dudir:`error`, :dudir:`hint`, :dudir:`important`, :dudir:`note`, :dudir:`tip`, :dudir:`warning` e geral :dudir:`admonition <admonitions>`. (Muitos stilos de themas só "note" e "warning" especialmente.)

source: Images:
ja: イメージ:
pt_br: Imagens:

source: :dudir:`image` (see also Images_ below)
ja: :dudir:`image` (`画像`_ も参照してください)
pt_br: :dudir:`image` (ver também Images_ abaixo)

source: :dudir:`figure` (an image with caption and optional legend)
ja: :dudir:`figure` (キャプション、凡例を含むイメージ)
pt_br: :dudir:`figure` (uma imagem com legenda e legenda opcional)

source: Additional body elements:
ja: 追加の本体要素:
pt_br: Elementos Adicionais corpo:

source: :dudir:`contents <table-of-contents>` (a local, i.e. for the current file only, table of contents)
ja: :dudir:`contents <table-of-contents>` (ローカルな、つまり現在のファイル内だけの、目次)
pt_br: :dudir:`conteúdos <table-of-contents>` (um local, ex. para o arquivo corrente, sumário toc)

source: :dudir:`container` (a container with a custom class, useful to generate an outer ``<div>`` in HTML)
ja: :dudir:`container` (カスタムのクラスを付加できるコンテナ。HTMLで外部の ``<div>`` を生成するのに便利)
pt_br: :dudir:`container` (um container com classe configurada, util para gerar separação ``<div>`` em HTML)

source: :dudir:`rubric` (a heading without relation to the document sectioning)
ja: :dudir:`rubric` (ドキュメントのセクションと関係のない見出し)
pt_br: :dudir:`rubric` (um cabeçalho sem relação com a seção do documento)

source: :dudir:`topic`, :dudir:`sidebar` (special highlighted body elements)
ja: :dudir:`topic`, :dudir:`sidebar` (特別に強調されたなボディ要素)
pt_br: :dudir:`topic`, :dudir:`sidebar` (elementos destadacos especiais no corpo do documento)

source: :dudir:`parsed-literal` (literal block that supports inline markup)
ja: :dudir:`parsed-literal` (インラインマークアップをサポートしたリテラルブロック)
pt_br: :dudir:`parsed-literal` (bloco literal que suporta marcação inline)

source: :dudir:`epigraph` (a block quote with optional attribution line)
ja: :dudir:`epigraph` (追加の属性行を付加できるブロック引用)
pt_br: :dudir:`epigraph` (bloco epigrafado com atribuito opcional de linha)
