Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/restructuredtext/domains.po
Languages: pt_br

source: MOVED: Domains
pt_br: MOVIDO: Domínios

source: MOVED: Basic Markup
pt_br: MOVIDO: Marcação Básica

source: See :doc:`/usage/domains/index`.
pt_br: Veja :doc:`/usage/domains/index`.

source: MOVED: Python Domain
pt_br: MOVIDO: Domínio Python

source: See :doc:`/usage/domains/python`.
pt_br: Veja :doc:`/usage/domains/python`.

source: MOVED: C Domain
pt_br: MOVIDO: Domínio C

source: See :doc:`/usage/domains/c`.
pt_br: Veja :doc:`/usage/domains/c`.

source: MOVED: C++ Domain
pt_br: MOVIDO: Domínio C++

source: See :doc:`/usage/domains/cpp`.
pt_br: Veja :doc:`/usage/domains/cpp`.

source: MOVED: Standard Domain
pt_br: MOVIDO: Domínio padrão

source: See :doc:`/usage/domains/standard`.
pt_br: Veja :doc:`/usage/domains/standard`.

source: MOVED: JavaScript Domain
pt_br: MOVIDO: Domínio JavaScript

source: See :doc:`/usage/domains/javascript`.
pt_br: Veja :doc:`/usage/domains/javascript`.

source: MOVED: reStructuredText Domain
pt_br: MOVIDO: Domínio reStructuredText

source: See :doc:`/usage/domains/restructuredtext`.
pt_br: Veja :doc:`/usage/domains/restructuredtext`.

source: MOVED: Math Domain
pt_br: MOVIDO: Domínio Math

source: See :doc:`/usage/domains/mathematics`.
pt_br: Veja :doc:`/usage/domains/mathematics`.

source: MOVED: More domains
pt_br: MOVIDO: Mais domínios
