Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/restructuredtext/roles.po
Languages: ja, pt_br, zh_cn

source: Roles
ja: ロール
pt_br: Papéis
zh_cn: 角色

source: Sphinx uses interpreted text roles to insert semantic markup into documents. They are written as ``:rolename:`content```.
ja: Sphinxは解釈済みのテキストのロールというものを使用して、用語の意味を記述して、リンクを張ったりできます。これを記述する時は ``:ロール名:`内容``` というフォーマットで記述します。
pt_br: O Sphinx usa papéis (*roles*, em inglês) de texto interpretado para inserir marcação semântica em documentos. Eles são escritos como ``:nomedopapel:`conteúdo``.
zh_cn: Sphinx使用解释的文本角色将语义标记插入到文档中。它们被写成“:rolename:`content`”。

source: The default role (```content```) has no special meaning by default. You are free to use it for anything you like, e.g. variable names; use the :confval:`default_role` config value to set it to a known role -- the :rst:role:`any` role to find anything or the :rst:role:`py:obj` role to find Python objects are very useful for this.
ja: デフォルトのロール(```content```)は標準では特別な意味を持っていません。必要に応じてどのように使用してもかまいません。例えば変数名として使用する、などです。設定値 :confval:`default_role` を設定すれば、デフォルトのロールに対して、既存のロールを指定できます。例えば、 :rst:role:`any` ロールは、任意のロールか、 :rst:role:`py:obj` ロールによるPythonオブジェクトを見つけられるため、デフォルトロールに設定するのに非常に有用です。
pt_br: O papel padrão (```conteúdo```) não tem nenhum significado especial por padrão. Você é livre para usá-lo para o que quiser, por exemplo, nomes de variáveis; use o valor de configuração :confval:`default_role` para defini-lo para um papel conhecido -- o papel :rst:role:`any` para encontrar qualquer coisa ou o papel :rst:role:`py:obj` para encontrar objetos Python são muito útil para isso.
zh_cn: 默认角色（“`content`”）在默认情况下没有特殊含义。您可以将其用于任何您喜欢的用途，例如变量名；使用：confval:`default_role`配置值将其设置为已知角色--rst:角色：`any`角色查找任何内容或：rst:角色用于查找Python对象的：`py:obj`角色对此非常有用。

source: See :doc:`/usage/restructuredtext/domains` for roles added by domains.
zh_cn: 有关域添加的角色，请参见 :doc:`/usage/restructuredtext/domains` 。

source: Cross-referencing syntax
ja: クロスリファレンス文法
pt_br: Sintaxe de referência cruzada
zh_cn: 交叉引用语法

source: Cross-references are generated by many semantic interpreted text roles. Basically, you only need to write ``:role:`target```, and a link will be created to the item named *target* of the type indicated by *role*. The link's text will be the same as *target*.
ja: クロスリファレンスは、意味解釈済みのテキストロールから生成されます。基本的には ``:ロール:`用語``` という形式で書くだけでクロスリファレンスを作成できます。このときは *用語* というアイテム名で、 *ロール* で指定されたタイプを持つリンクが作成されます。リンクに表示されるテキストは *用語* と同じになります。
zh_cn: 交叉引用是由许多语义解释的文本角色生成的。基本上，您只需编写“:role:`target`”，并且将创建一个指向*target*的项目的链接，该项目的类型由*role*表示。链接的文本将与*target*相同。

source: There are some additional facilities, however, that make cross-referencing roles more versatile:
ja: 追加の補助機能がいくつかありますが、これはロールに対するクロスリファレンスの目的を増やすものになります。:
zh_cn: 但是，还有一些附加功能使交叉引用角色更加通用：

source: You may supply an explicit title and reference target, like in reST direct hyperlinks: ``:role:`title <target>``` will refer to *target*, but the link text will be *title*.
ja: ``:ロール:`タイトル <参照対象>``` というreSTのハイパーリンクに似た書き方をすると、タイトルと参照対象の両方を明示できます。この場合は *参照対象* を参照するリンクになりますが、リンクテキストとして表示されるのは *タイトル* になります。
zh_cn: 您可以提供一个显式的标题和引用目标，如在reST直接超链接中：“:role:`title <target>`”将引用*target*，但链接文本将是*title*。

source: If you prefix the content with ``!``, no reference/hyperlink will be created.
ja: 用語の先頭の文字に ``!`` を指定すると、参照もハイパーリンクも作成されなくなります。
zh_cn: 如果在内容前加上“！” ，则不会创建引用或超链接。

source: If you prefix the content with ``~``, the link text will only be the last component of the target. For example, ``:py:meth:`~Queue.Queue.get``` will refer to ``Queue.Queue.get`` but only display ``get`` as the link text. This does not work with all cross-reference roles, but is domain specific.
ja: もし、先頭に ``~`` が付けられると、ターゲットの最後の項目だけがリンクテキストになります。例えば、 ``:py:meth:`~Queue.Queue.get``` と書かれると、 ``Queue.Queue.get`` を参照しますが、リンクテキストとして表示されるのは、 ``get`` だけになります。これは全てのクロスリファレンスで動作するのではなく、ドメインでのみ動作します。
zh_cn: 如果在内容前面加上“~”，则链接文本将仅是目标的最后一个组件。例如，“:py:meth:`~Queue.Queue.get`”将指“Queue.Queue.get”但只显示“get”作为链接文本。这并不适用于所有交叉引用角色，而是特定于域的。

source: In HTML output, the link's ``title`` attribute (that is e.g. shown as a tool-tip on mouse-hover) will always be the full target name.
ja: HTML出力時には、リンクの ``title`` アトリビュート(マウスを上に持って行ったときにツールチップとして表示されるテキスト)には、常に、完全な参照対象の名前が設定されます。
zh_cn: 在HTML输出中，链接的“title”属性（即鼠标悬停时显示为工具提示）将始终是完整的目标名称。

source: Cross-referencing anything
ja: anyクロスリファレンス
zh_cn: 交叉引用任何内容

source: This convenience role tries to do its best to find a valid target for its reference text.
ja: この便利なロールは、参照先ターゲットを自動的に探してくれます。
zh_cn: 这个便利角色尽力为它的引用文本找到一个有效的目标。

source: First, it tries standard cross-reference targets that would be referenced by :rst:role:`doc`, :rst:role:`ref` or :rst:role:`option`.
ja: 最初に、標準のクロスリファレンス :rst:role:`doc`, :rst:role:`ref`, :rst:role:`option` として解釈できるか試してみます。
zh_cn: 首先，它尝试标准的交叉引用目标，这些目标将被以下对象引用 :rst:role:`doc`，:rst:role:`ref` 或 :rst:role:`option`。

source: Custom objects added to the standard domain by extensions (see :meth:`.Sphinx.add_object_type`) are also searched.
zh_cn: 通过扩展添加到标准域的自定义对象（请参见： :meth:`.Sphinx.add_object_type`)也会被搜索。

source: Then, it looks for objects (targets) in all loaded domains. It is up to the domains how specific a match must be. For example, in the Python domain a reference of ``:any:`Builder``` would match the ``sphinx.builders.Builder`` class.
ja: 次に、使われている全てのドメインのオブジェクト(ターゲット)に参照できるか試します。ターゲットが各ドメインで何にマッチするかの判定は各ドメインに任されています。例えば、Pythonドメインでは ``:any:`Builder``` は ``sphinx.builders.Builder`` クラスにマッチします。
zh_cn: 然后，它在所有加载的域中查找对象（目标）。匹配的具体程度取决于域。例如，在Python域中，“:any:`Builder`”的引用将匹配“sphinx.builders.Builder”班级。

source: If none or multiple targets are found, a warning will be emitted. In the case of multiple targets, you can change "any" to a specific role.
ja: もし、ターゲットが見つからない、または複数のターゲットが見つかった場合、警告が出力されます。複数のターゲットが見つかった場合は"any"ではなく明示的にロールを指定してください。
zh_cn: 如果没有发现或发现多个目标，将发出警告。对于多个目标，可以将“any”更改为特定角色。

source: This role is a good candidate for setting :confval:`default_role`. If you do, you can write cross-references without a lot of markup overhead. For example, in this Python function documentation ::
ja: このロールが適した候補を見つけるために :confval:`default_role` を設定できます。設定した場合、多くのマークアップを書かずにクロスリファレンスを書けるようになります。たとえば、以下のPython関数のドキュメントのように書けます::
zh_cn: 此角色很适合设置：confval:`default_role`。如果你可以写大量的交叉引用的话，你可以写很多标记。例如，在这个Python函数文档中：

source: there could be references to a glossary term (usually ``:term:`handler```), a Python module (usually ``:py:mod:`signal``` or ``:mod:`signal```) and a section (usually ``:ref:`about-signals```).
ja: これらは、次のように参照リンク設定されます: 用語集(``:term:`handler``` 同等)、Pythonモジュール(``:py:mod:`signal``` または ``:mod:`signal``` 同等)、セクション(``:ref:`about-signals``` 同等)。
zh_cn: 可能有对术语表术语（通常是“:term:`handler`”）、Python模块（通常为“:py:mod:`signal`”或“:mod:`signal`”）和一个部分（通常为“:ref:`about-signals`”）。

source: The :rst:role:`any` role also works together with the :mod:`~sphinx.ext.intersphinx` extension: when no local cross-reference is found, all object types of intersphinx inventories are also searched.
ja: :rst:role:`any` ロールは :mod:`~sphinx.ext.intersphinx` 拡張とも連携して動作します。ローカルのドキュメントにクロスリファレンスのターゲットがなくても、intersphinxのインベントリからターゲットを探します。
zh_cn: 这个 :rst:role:`any` 角色还可以与 :mod:`~sphinx.ext.intersphinx` 扩展：当没有找到本地交叉引用时，还搜索Interspinx库存的所有对象类型。

source: Cross-referencing objects
ja: オブジェクトのクロスリファレンス
zh_cn: 交互参考对象

source: These roles are described with their respective domains:
ja: これらのロールは、それぞれのドメインの中で説明されています。
zh_cn: 这些角色用各自的域来描述：

source: Cross-referencing arbitrary locations
ja: 自由な場所へのクロスリファレンス
zh_cn: 交叉引用任意位置

source: To support cross-referencing to arbitrary locations in any document, the standard reST labels are used. For this to work label names must be unique throughout the entire documentation. There are two ways in which you can refer to labels:
ja: 標準のreSTのラベルを使用して、ドキュメント内の自由な位置にクロスリファレンスを作成することもできます。このラベルがきちんと動作するためには、ドキュメント全体の中で重複したラベルを使用することはできません。ラベルはユニークである必要があります。ラベルを参照する方法は２つあります:
zh_cn: 为了支持对任何文档中任意位置的交叉引用，使用了标准reST标签。为此，标签名称在整个文档中必须是唯一的。有两种方法可以引用标签：

source: If you place a label directly before a section title, you can reference to it with ``:ref:`label-name```. For example::
zh_cn: 如果将标签直接放在节标题之前，则可以使用“`:ref:`label name``”来引用它。例如::

source: The ``:ref:`` role would then generate a link to the section, with the link title being "Section to cross-reference". This works just as well when section and reference are in different source files.
ja: ``:ref:`` ロールはセクションへのリンクを作成します。リンクのタイトルは "クロスリファレンスのセクション" になります。この機能はセクションと参照が異なるソースファイルにあるときに動作します。
zh_cn: 然后，“:ref:”角色将生成一个到节的链接，链接标题为“要交叉引用的节”。当节和引用位于不同的源文件中时，这种方法同样有效。

source: Automatic labels also work with figures. For example::
zh_cn: 自动标签也适用于图形。例如：

source: In this case, a reference ``:ref:`my-figure``` would insert a reference to the figure with link text "Figure caption".
zh_cn: 在这种情况下，引用“:ref:`my-figure`”会插入一个引用到图，链接文本为“figure caption”。

source: The same works for tables that are given an explicit caption using the :dudir:`table` directive.
ja: :dudir:`table` ディレクティブを使用して、キャプションを明示しているテーブルに対しても、同様の働きをします。
zh_cn: 对于使用：dudir:`table`指令给出显式标题的表，同样的方法也适用。

source: Labels that aren't placed before a section title can still be referenced, but you must give the link an explicit title, using this syntax: ``:ref:`Link title <label-name>```.
ja: セクションタイトルの前にないラベルに対しても参照することはできますが、タイトルを明示する必要があります。この場合には ``:ref:`リンクラベル <ラベル名>``` という文法を使用します。
zh_cn: 没有放在节标题之前的标签仍然可以被引用，但是必须给链接一个显式的标题，使用以下语法：“:ref:`Link title<label-name>`”。

source: Reference labels must start with an underscore. When referencing a label, the underscore must be omitted (see examples above).
ja: 参照ラベルはアンダースコアで始まる必要があります。ラベルを参照するときには、先頭のアンダースコアは取り除く必要があります(上の例を参照)。
zh_cn: 引用标签必须以下划线开头。引用标签时，必须省略下划线（参见上面的示例）。

source: Using :rst:role:`ref` is advised over standard reStructuredText links to sections (like ```Section title`_``) because it works across files, when section headings are changed, will raise warnings if incorrect, and works for all builders that support cross-references.
zh_cn: 使用 :rst:role:`ref`比标准的reStructuredText链接到节(如“`Section title`_”)更可取，因为它可以跨文件工作，当节标题更改时，如果不正确将发出警告，并且适用于所有支持交叉引用的构建器。

source: Cross-referencing documents
ja: ドキュメントのクロスリファレンス
zh_cn: 交叉引用文件

source: There is also a way to directly link to documents:
ja: ドキュメントに対して直接リンクを張る方法もあります。
zh_cn: 还有一种方法可以直接链接到文档：

source: Link to the specified document; the document name can be specified in absolute or relative fashion. For example, if the reference ``:doc:`parrot``` occurs in the document ``sketches/index``, then the link refers to ``sketches/parrot``. If the reference is ``:doc:`/people``` or ``:doc:`../people```, the link refers to ``people``.
ja: 絶対/相対のどちらかの形式でドキュメント名を指定することで、特定のドキュメントに対してリンクを張ることができます。例えば、 ``:doc:`parrot``` という参照が ``sketches/index`` というファイルの中にあったとすると、 ``sketches/parrot`` に対するリンクとなります。もし参照が ``:doc:`/people``` もしくは ``:doc:`../people``` という形式で書かれている場合には ``people`` に対するリンクが作成されます。
zh_cn: 链接到指定的文档；可以以绝对或相对方式指定文档名称。例如，如果引用“`:doc:`parrot`”出现在文档“sketches/index`”中，那么该链接引用的是“sketces/parrot`”。如果引用是“:doc:`/people`”或“` or ``:doc:`../people`”，那么链接就是“people”。

source: If no explicit link text is given (like usual: ``:doc:`Monty Python members </people>```), the link caption will be the title of the given document.
ja: ``:doc:`Monty Python members </people>``` という形式で、明示的にリンクテキストを指定できますが、もし明示的なリンクテキストが与えられなかった場合には指定されたドキュメントのタイトルがリンクテキストとなります。
zh_cn: 如果没有给出明确的链接文本（像通常的：“:doc:`Monty Python members </people>`”），那么链接标题将是给定文档的标题。

source: Referencing downloadable files
ja: ダウンロード可能なファイルへの参照
zh_cn: 引用可下载文件

source: This role lets you link to files within your source tree that are not reST documents that can be viewed, but files that can be downloaded.
ja: このロールは表示可能なreST形式ではなく、ソースツリーに存在するその他の形式のファイルへのリンクを張って、ファイルをダウンロードできるようにするときに使用します。
zh_cn: 此角色允许您链接到源树中的文件，这些文件不是可以查看的reST文档，而是可以下载的文件。

source: When you use this role, the referenced file is automatically marked for inclusion in the output when building (obviously, for HTML output only). All downloadable files are put into a ``_downloads/<unique hash>/`` subdirectory of the output directory; duplicate filenames are handled.
zh_cn: 当您使用此角色时，被引用的文件将自动标记为在生成时包含在输出中（显然，仅用于HTML输出）。所有可下载的文件都放在输出目录的“_downloads/<unique hash>/”子目录中；处理重复的文件名。

source: An example::
ja: サンプル::
zh_cn: 例如::

source: The given filename is usually relative to the directory the current source file is contained in, but if it absolute (starting with ``/``), it is taken as relative to the top source directory.
ja: 与えられたファイル名は通常、そのロールが書かれているソースファイルからの相対ディレクトリで指定されますが、もし絶対パス(``/`` で始まる)の場合には、トップのソースディレクトリからの相対パスとして見られます。
zh_cn: 给定的文件名通常是相对于当前源文件所在的目录的，但是如果是绝对的（以“/`”开头），则将其视为相对于顶级源目录的文件名。

source: The ``example.py`` file will be copied to the output directory, and a suitable link generated to it.
ja: ``example.py`` ファイルは出力ディレクトリにコピーされ、適切なリンクが生成されます。
zh_cn: 在“example.py”文件将被复制到输出目录，并为其生成适当的链接。

source: Not to show unavailable download links, you should wrap whole paragraphs that have this role::
zh_cn: 若要不显示不可用的下载链接，应将具有此角色的整个段落换行::

source: Cross-referencing figures by figure number
ja: 図表番号クロスリファレンス
zh_cn: 图号对照图

source: `numref` role can also refer sections. And `numref` allows `{name}` for the link text.
ja: `numref` ロールもセクションを参照します。 `numref` は `{name}` と書くことでリンクテキストを書くことも出来ます。
zh_cn: `numref` role也可以引用节。而“numref”允许使用{name}作为链接文本。

source: Link to the specified figures, tables, code-blocks and sections; the standard reST labels are used. When you use this role, it will insert a reference to the figure with link text by its figure number like "Fig. 1.1".
ja: 指定された図、表、コードブロック、セクションへの参照を作成します。ターゲットにはreSTのlabelを使用します。このロールを使用すると、"図 1.1"のようなリンクテキストを持つその図への参照が挿入されます。
zh_cn: 链接到指定的图、表、代码块和节；使用标准reST标签。当您使用这个角色时，它将插入一个引用，通过图号（如“图1.1”）链接文本。

source: If an explicit link text is given (as usual: ``:numref:`Image of Sphinx (Fig. %s) <my-figure>```), the link caption will serve as title of the reference. As placeholders, `%s` and `{number}` get replaced by the figure number and `{name}` by the figure caption. If no explicit link text is given, the :confval:`numfig_format` setting is used as fall-back default.
zh_cn: 如果给出一个明确的链接文本（通常为：“:numref:`Image of Sphinx（图%s）1`”），则链接标题将作为引用的标题。作为占位符，`%s`和{number}`将被图号替换，而{name}`将被图标题替换。如果没有给出明确的链接文本，则：confval:`numfig_format`设置将用作回退默认值。

source: If :confval:`numfig` is ``False``, figures are not numbered, so this role inserts not a reference but the label or the link text.
ja: もし :confval:`numfig` が ``False`` なら、図表番号は振られません。それなので、ロールは参照ではなく、ラベルか指定されたテキストを挿入します。
zh_cn: 如果：confval:`numfig`是“False”，则数字没有编号，因此此角色插入的不是引用而是标签或链接文本。

source: Cross-referencing other items of interest
ja: 他の要素へのクロスリファレンス
zh_cn: 交叉引用其他感兴趣的项目

source: The following roles do possibly create a cross-reference, but do not refer to objects:
ja: 以下のロールはクロスリファレンスを作成しますが、特定のオブジェクトを参照しません。
zh_cn: 以下角色可能会创建交叉引用，但不会引用对象：

source: An environment variable. Index entries are generated. Also generates a link to the matching :rst:dir:`envvar` directive, if it exists.
ja: 環境変数です。エントリーのインデックスが作成されます。もし :rst:dir:`envvar` ディレクティブがあれば、それへのリンクが作成されます。
zh_cn: 环境变量。生成索引项，同时生成指向匹配项的链接:rst:dir:`envvar`指令（如果存在）。

source: The name of a grammar token (used to create links between :rst:dir:`productionlist` directives).
ja: 文法のトークンの名前です。 :rst:dir:`productionlist` ディレクティブ内の定義との間でリンクが作成されます。
zh_cn: 语法标记的名称（用于在以下对象之间创建链接 :rst:dir:`productionlist` 指令）。

source: The name of a keyword in Python. This creates a link to a reference label with that name, if it exists.
ja: Pythonのキーワード名です。もし存在していれば、この名前を持つ参照ラベルとの間にリンクが作成されます。
zh_cn: Python中关键字的名称。这将创建指向具有该名称的引用标签（如果存在）的链接。

source: A command-line option to an executable program. This generates a link to a :rst:dir:`option` directive, if it exists.
ja: 実行ファイルのコマンドラインオプションです。 :rst:dir:`option` ディレクティブが定義されていれば、リンクを作成します。
zh_cn: 可执行程序的命令行选项。这将生成一个链接 :rst:dir:`option` 指令（如果存在）。

source: The following role creates a cross-reference to a term in a :ref:`glossary <glossary-directive>`:
ja: 以下のロールは :ref:`用語集 <glossary-directive>` との間にクロスリファレンスを作成します:
zh_cn: 以下角色创建对：ref:`glossary 1`中的术语的交叉引用：

source: Reference to a term in a glossary. A glossary is created using the ``glossary`` directive containing a definition list with terms and definitions. It does not have to be in the same file as the ``term`` markup, for example the Python docs have one global glossary in the ``glossary.rst`` file.
ja: 用語集の用語への参照。用語集は ``glossary`` ディレクティブを使用して定義します。用語集と ``term`` マークアップは同じファイルにある必要はありません。例えばPythonのドキュメントは一つの用語集の ``glossary.rst`` というファイルの中にすべての用語の定義が書かれています。
zh_cn: 对术语表中术语的引用。术语表是使用“glossary”指令创建的，该指令包含一个包含术语和定义的定义列表。它不必与“term”标记在同一个文件中，例如Python文档在“词汇表.rst”文件。

source: If you use a term that's not explained in a glossary, you'll get a warning during build.
ja: もしも、用語集の中で説明されていない用語がある場合には、ビルド時に警告が出力されます。
zh_cn: 如果您使用术语表中没有解释的术语，您将在构建期间收到警告。

source: Math
pt_br: Mathemática
zh_cn: 数学

source: Role for inline math. Use like this::
ja: インラインの数式のロールです。以下のようにして使用します::
pt_br: Papel para operações matemáticas em linha. Use assim::
zh_cn: 内联数学的角色。这样使用：

source: Same as :rst:role:`math:numref`.
pt_br: Mesmo que :rst:role:`math:numref`.
zh_cn: 与:rst:role:`math:numref`相同。

source: Other semantic markup
ja: 上記以外の意味のマークアップ
pt_br: Outras marcações semânticas
zh_cn: 其他语义标记

source: The following roles don't do anything special except formatting the text in a different style:
ja: 以下のロールは、テキストのスタイルを変更する以外には特別なことはしません。
pt_br: Os papéis a seguir não fazem nada de especial, exceto formatar o texto em um estilo diferente:
zh_cn: 以下角色除了以不同的样式格式化文本外，不会执行任何特殊操作：

source: An abbreviation. If the role content contains a parenthesized explanation, it will be treated specially: it will be shown in a tool-tip in HTML, and output only once in LaTeX.
ja: 言葉の短縮形を書くのに使用します。ロールの中身として、括弧付き表現が含まれていた場合には特別扱いされます。HTMLではツールチップとして使用され、LaTeXでは一度だけ出力されます。
pt_br: Uma abreviação. Se o conteúdo do papel contiver uma explicação entre parênteses, ele será tratado de maneira especial: será mostrado em uma dica de ferramenta em HTML e exibido apenas uma vez em LaTeX.
zh_cn: 缩写。如果角色内容包含带圆括号的解释，则将对其进行特殊处理：它将在HTML的工具提示中显示，在LaTeX中仅输出一次。

source: Example: ``:abbr:`LIFO (last-in, first-out)```.
ja: 例: ``:abbr:`LIFO (last-in, first-out)```.
zh_cn: 示例：“:abbr:`LIFO (last-in, first-out)`”。

source: The name of an OS-level command, such as ``rm``.
ja: ``rm`` のような、OSレベルのコマンドの名前に使用します。
pt_br: O nome de um comando no nível do sistema operacional, como ``rm``.
zh_cn: 操作系统级命令的名称，例如“rm”。

source: Mark the defining instance of a term in the text. (No index entries are generated.)
ja: テキスト中の用語の定義を書くのに使用します。インデックスエントリーは作成されません。
pt_br: Marca a instância definidora de um termo no texto. (Nenhuma entrada de índice é gerada.)
zh_cn: 标记文本中术语的定义实例。（不生成索引项。）

source: The name of a file or directory. Within the contents, you can use curly braces to indicate a "variable" part, for example::
ja: ファイルやディレクトリの名前に使用します。ロールのコンテンツ部分には波括弧を使って"変数"を表すことができます。例::
pt_br: O nome de um arquivo ou diretório. Dentro do conteúdo, você pode usar chaves para indicar uma parte "variável", por exemplo::
zh_cn: 文件或目录的名称。在内容中，可以使用大括号表示“变量”部分，例如：

source: In the built documentation, the ``x`` will be displayed differently to indicate that it is to be replaced by the Python minor version.
ja: ビルド後のドキュメントの中で、変数 ``x`` は Python のマイナーバージョンに置き換えられることを示すよう、強調表示されます。
pt_br: Na documentação construída, o ``x`` será exibido de forma diferente para indicar que será substituído pela versão secundária do Python.
zh_cn: 在生成的文档中，“x”将以不同的方式显示，以指示它将被Python次要版本所取代。

source: Labels presented as part of an interactive user interface should be marked using ``guilabel``. This includes labels from text-based interfaces such as those created using :mod:`curses` or other text-based libraries. Any label used in the interface should be marked with this role, including button labels, window titles, field names, menu and menu selection names, and even values in selection lists.
ja: インタラクティブなユーザインタフェースの一部のラベルとして表示される文字に対しては ``guilabel`` を使用します。これは、 :mod:`curses` やその他のコンソール用ライブラリを使用したテキストベースのインタフェースにも使用します。ボタンやウィンドウのタイトル、フィールド名、メニュー、やメニューの項目名、リスト中の選択された値など、インタフェース上に表示されるラベルには、このロールを使用すべきです。
pt_br: Rótulos apresentados como parte de uma interface de usuário interativa devem ser marcados usando ``guilabel``. Isto inclui rótulos de interfaces baseadas em texto, como aquelas criadas usando :mod:`curses` ou outras bibliotecas baseadas em texto. Qualquer rótulo usado na interface deve ser marcado com este papel, incluindo rótulos de botões, títulos de janelas, nomes de campos, nomes de menus e seleções de menu e até mesmo valores em listas de seleção.
zh_cn: 作为交互用户界面一部分的标签应该用“guilabel”来标记。这包括来自基于文本的接口的标签，例如使用：mod:`curses`或其他基于文本的库创建的标签。在界面中使用的任何标签都应该标记此角色，包括按钮标签、窗口标题、字段名称、菜单和菜单选择名称，甚至选择列表中的值。

source: An accelerator key for the GUI label can be included using an ampersand; this will be stripped and displayed underlined in the output (example: ``:guilabel:`&Cancel```). To include a literal ampersand, double it.
ja: GUIラベルにショートカットキーを設定するためにアンド記号を使用できます。この記号は表示されず代わりに下線が表示されます(例えばこのように書きます ``:guilabel:`&Cancel```)。アンド記号をそのまま表示したい場合は2つ書いてください。
zh_cn: GUI标签的加速键可以使用和号来包含；它将被剥离并在输出中显示下划线（例如：“:guilabel:`&amp;Cancel`”）。若要包含文字和，请将其加倍。

source: Mark a sequence of keystrokes. What form the key sequence takes may depend on platform- or application-specific conventions. When there are no relevant conventions, the names of modifier keys should be spelled out, to improve accessibility for new users and non-native speakers. For example, an *xemacs* key sequence may be marked like ``:kbd:`C-x C-f```, but without reference to a specific application or platform, the same sequence should be marked as ``:kbd:`Control-x Control-f```.
ja: キーボード操作のキーに使用します。 キー操作をどのように表現するかはプラットフォームや、アプリケーション上の慣習の影響を受けます。もし、慣習に関しての制約がない場合には、修飾キー(Shiftなど)の名前は、省略せずにきちんと書くと、新規ユーザと、英語がネイティブでないユーザから見たアクセシビリティは向上します。例えば、*xemacs* キー操作は ``:kbd:`C-x C-f``` という表現になるでしょう。しかし、特定のアプリケーションやプラットフォームに限定する必要がなければ同じ操作は ``:kbd:`Control-x Control-f``` と書くべきです。
zh_cn: 标记一系列按键。密钥序列的形式可能取决于特定于平台或应用程序的约定。当没有相关的约定时，应该拼写出修改键的名称，以提高新用户和非母语使用者的可访问性。例如，*xemacs*键序列可以标记为“`:kbd:`C-x C-f```”，但如果不引用特定的应用程序或平台，则应该将同一序列标记为“`:kbd:`Control-x Control-f```”。

source: The name of an RFC 822-style mail header. This markup does not imply that the header is being used in an email message, but can be used to refer to any header of the same "style." This is also used for headers defined by the various MIME specifications. The header name should be entered in the same way it would normally be found in practice, with the camel-casing conventions being preferred where there is more than one common usage. For example: ``:mailheader:`Content-Type```.
ja: RFC 822の形式のメールヘッダの名前に使用します。これでマークアップされたヘッダは電子メールのメッセージの中で必ず使用されている必要はありませんが、参照するのに他のヘッダと同じ形式を使用することが可能です。このヘッダはさまざまなMIMEの使用で定義されたヘッダに対しても使用できます。ヘッダ名は実際に電子メール内で使用されるのと同じ形式(キャメルケース)で書かれるべきです。例えば、 ``:mailheader:`Content-Type``` という形式になります。
zh_cn: RFC 822样式邮件头的名称。此标记并不表示邮件头正在电子邮件中使用，但可用于引用任何具有相同“样式”的标头。这也用于各种MIME规范定义的标头。头名称的输入方式应与实际中的相同，在有多个常用用法的情况下，最好使用驼峰大小写约定。例如：“`:mailheader:`Content Type`”。

source: The name of a :command:`make` variable.
ja: :command:`make` の変数名です。
pt_br: O nome de uma variável :command:`make`.
zh_cn: 命令名：`make` variable。

source: A reference to a Unix manual page including the section, e.g. ``:manpage:`ls(1)```. Creates a hyperlink to an external site rendering the manpage if :confval:`manpages_url` is defined.
zh_cn: 对Unix手册页的引用，包括以下部分，例如“手册页：`ls（1）`”。如果定义了:confval:`manpages_url`，则创建到呈现手册页的外部站点的超链接。
