Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/restructuredtext/roles.po
Languages: ja, pt_br, zh_cn

source: Menu selections should be marked using the ``menuselection`` role. This is used to mark a complete sequence of menu selections, including selecting submenus and choosing a specific operation, or any subsequence of such a sequence. The names of individual selections should be separated by ``-->``.
ja: メニュー選択は ``menuselection`` ロールを使用すべきです。これはメニュー操作の手順をマークアップするのに使用します。メニューにはメニュー選択、サブメニュー選択、特定の操作での選択や、さらに細かいサブ操作などを含みます。それぞれの選択要素の名前は ``-->`` を使用して分割すべきです。
pt_br: As seleções de menu devem ser marcadas usando o papel ``menuselection``. Isto é usado para marcar uma sequência completa de seleções de menu, incluindo a seleção de submenus e a escolha de uma operação específica ou qualquer subsequência de tal sequência. Os nomes das seleções individuais devem ser separados por ``-->``.
zh_cn: 应使用“menuselection”角色标记菜单选择。这用于标记菜单选择的完整序列，包括选择子菜单和选择特定操作，或此类序列的任何子序列。单个选择的名称应以“-->”分隔。

source: For example, to mark the selection "Start > Programs", use this markup::
ja: 例えば、"スタート > プログラム"という順番でメニューを選択する動作は以下のように記述します::
pt_br: Por exemplo, para marcar a seleção "Start > Programs", use esta marcação::
zh_cn: 例如，要标记选择“开始>程序”，请使用以下标记：

source: When including a selection that includes some trailing indicator, such as the ellipsis some operating systems use to indicate that the command opens a dialog, the indicator should be omitted from the selection name.
ja: もし、選択したメニューにはオペレーティングシステム固有のコマンドの指示などが含まれていた場合には、これは省略すべきです。例えば、ダイアログを開くコマンドなどです。このようなコマンドの指示は選択名からは省きます。
pt_br: Ao incluir uma seleção que inclui algum indicador ao final, como as reticências que alguns sistemas operacionais usam para indicar que o comando abre uma caixa de diálogo, o indicador deve ser omitido do nome da seleção.
zh_cn: 当包含包含某些尾随指示符的选择（例如某些操作系统用于指示命令打开对话框的省略号）时，应从选择名称中省略该指示符。

source: ``menuselection`` also supports ampersand accelerators just like :rst:role:`guilabel`.
ja: ``menuselection`` は :rst:role:`guilabel` と同じく、アンパサンドを利用したアクセラレータの表示に対応しています。
pt_br: ``menuselection`` também têm suporte a aceleradores com E comercial, assim como :rst:role:`guilabel`.
zh_cn: “menuselection”还支持与号和加速器，就像：rst:role:`guilabel`。

source: The name of a MIME type, or a component of a MIME type (the major or minor portion, taken alone).
ja: MIMEタイプの名前、もしくはの一部MIMEタイプ(メジャー、マイナー部分、もしくは単独)を表します。
pt_br: O nome de um tipo MIME ou de um componente de um tipo MIME (a parte maior ou menor, isoladamente).
zh_cn: MIME类型的名称，或MIME类型的组件（主要部分或次要部分，单独使用）。

source: The name of a Usenet newsgroup.
ja: USENETのニュースグループ名です。
pt_br: O nome de um grupo de notícias da Usenet.
zh_cn: Usenet新闻组的名称。

source: Todo
pt_br: Por fazer
zh_cn: 待处理

source: Is this not part of the standard domain?
pt_br: Isso não faz parte do domínio padrão?
zh_cn: 这不是标准域的一部分吗？

source: The name of an executable program. This may differ from the file name for the executable for some platforms. In particular, the ``.exe`` (or other) extension should be omitted for Windows programs.
ja: 実行プログラムの名前です。これはプラットフォームによって名前が変化することもあります。特にWindowsのプログラムのための ``.exe`` やそれ以外の拡張子はは省略すべきです。
pt_br: O nome de um programa executável. Isso pode ser diferente do nome do arquivo executável em algumas plataformas. Em particular, a extensão ``.exe`` (ou outra) deve ser omitida para programas Windows.
zh_cn: 可执行程序的名称。对于某些平台，这可能与可执行文件的文件名不同。特别是，对于Windows程序，应该省略“.exe”（或其他）扩展名。

source: A regular expression. Quotes should not be included.
ja: 正規表現です。引用符は含めることはできません。
pt_br: Uma expressão regular. Aspas não devem ser incluídas.
zh_cn: 正则表达式。不应包括引号。

source: A piece of literal text, such as code. Within the contents, you can use curly braces to indicate a "variable" part, as in :rst:role:`file`. For example, in ``:samp:`print 1+{variable}```, the part ``variable`` would be emphasized.
ja: リテラルのテキストの一部です。マークアップの内容の中には、 :rst:role:`file` と同様に波括弧を使った"変数"を書くことができます。たとえば、 ``:samp:`print 1+{variable}``` というテキストがあると、 ``variable`` の部分が強調されます。
zh_cn: 一段文字，如代码。在内容中，可以使用大括号表示“变量”部分，如:rst:role:`file`。例如，在“:samp:`print 1+{variable}`”中，会强调“variable”部分。

source: Allowed to escape curly braces with backslash
zh_cn: 允许用反斜杠转义大括号

source: There is also an :rst:role:`index` role to generate index entries.
ja: インデックスのエントリーを生成するための、 :rst:role:`index` ロールもあります。
pt_br: Há também um papel :rst:role:`index` para gerar entradas de índice.
zh_cn: 还有一个:rst:role:`index`角色生成索引项。

source: The following roles generate external links:
ja: 下記のロールは外部へのリンクを生成します。
pt_br: Os seguintes papéis geram links externos:
zh_cn: 以下角色生成外部链接：

source: A reference to a Python Enhancement Proposal. This generates appropriate index entries. The text "PEP *number*\ " is generated; in the HTML output, this text is a hyperlink to an online copy of the specified PEP. You can link to a specific section by saying ``:pep:`number#anchor```.
ja: Python拡張提案書(PEP)への参照です。これは適切なインデックスのエントリーを作成します。"PEP *number*\ "という形式のテキストが作成されます。HTML出力ではこのテキストは特定のPEPのオンラインのコピーへのハイパーリンクとなります。特定の節にリンクするには ``:pep:`number#anchor``` とします。
pt_br: Uma referência a uma Python Enhancement Proposal (Proposta de Melhoria do Python, em uma tradução livre). Isso gera entradas de índice apropriadas. O texto "PEP *número*\" é gerado; na saída HTML, este texto é um hiperlink para uma cópia online da PEP especificada. Você pode vincular a uma seção específica dizendo ``:pep:`número#âncora```.
zh_cn: 对Python增强建议的引用。这将生成适当的索引项。生成文本“PEP*number*\”；在HTML输出中，此文本是指向指定PEP的在线副本的超链接。你可以通过说“`:pep:`number#anchor``”来链接到特定的部分。

source: A reference to an Internet Request for Comments. This generates appropriate index entries. The text "RFC *number*\ " is generated; in the HTML output, this text is a hyperlink to an online copy of the specified RFC. You can link to a specific section by saying ``:rfc:`number#anchor```.
ja: インターネットのRFCへの参照です。これは適切なインデックスのエントリーを作成します。"RFC *number*\ "という形式のテキストが作成されます。HTML出力ではこのテキストは特定のRFCのオンラインのコピーへのハイパーリンクとなります。特定の節にリンクするには ``:rfc:`number#anchor``` とします。
pt_br: Uma referência a um Internet Request for Comments (Pedido de Comentários, em uma tradução livre). Isso gera entradas de índice apropriadas. O texto "RFC *número*\" é gerado; na saída HTML, este texto é um hiperlink para uma cópia online do RFC especificado. Você pode vincular a uma seção específica dizendo ``:rfc:`número#âncora```.
zh_cn: 对互联网征求意见的引用。这将生成适当的索引项。生成文本“RFC*number*\”；在HTML输出中，此文本是指向指定RFC联机副本的超链接。您可以通过说“`:rfc:`number#anchor``”来链接到特定的部分。

source: Note that there are no special roles for including hyperlinks as you can use the standard reST markup for that purpose.
ja: このような目的を達成しようとしても、標準のreSTマークアップだけではハイパーリンクを取り込む特別なロールは存在しません。
zh_cn: 请注意，对于包含超链接没有特殊的角色，因为您可以使用标准reST标记来实现这一目的。

source: Substitutions
ja: 置換
pt_br: Substituições
zh_cn: 替代品

source: The documentation system provides three substitutions that are defined by default. They are set in the build configuration file.
ja: デフォルトでは3つの代数がドキュメントシステムから提供されています。これらはビルドの設定ファイルの中で設定されます。
zh_cn: 文档系统提供默认定义的三种替换。它们在生成配置文件中设置。

source: Replaced by the project release the documentation refers to. This is meant to be the full version string including alpha/beta/release candidate tags, e.g. ``2.5.2b3``. Set by :confval:`release`.
ja: ドキュメントが参照しているプロジェクトのリリースと置き換えられます。これは、 ``2.5.2b3`` などのような、alpha/beta/release candidateタグも含めた完全なバージョン文字列と置換されます。 :confval:`release` を使って設定します。
pt_br: Substituído pela versão do projeto à qual a documentação se refere. Esta deve ser a string da versão completa, incluindo tags alfa/beta/candidatas a lançamento, por exemplo. ``2.5.2b3``. Definido por :confval:`release`.
zh_cn: 替换为文档所指的项目版本。这意味着是完整的版本字符串，包括alpha/beta/release候选标记，例如“2.5.2b3”。设置者 :confval:`release`。

source: Replaced by the project version the documentation refers to. This is meant to consist only of the major and minor version parts, e.g. ``2.5``, even for version 2.5.1. Set by :confval:`version`.
ja: ドキュメントが参照しているプロジェクトのリリースと置き換えられます。これは、メジャーバージョン、マイナーバージョンの定義部分のみを含む文字列です。例えば、``2.5.1`` というのがあったとすると、 ``2.5`` になります。 :confval:`version` を使って設定します。
pt_br: Substituído pela versão do projeto à qual a documentação se refere. Isto deve consistir apenas nas partes da versão principal e secundária, por ex. ``2.5``, mesmo para a versão 2.5.1. Definido por :confval:`version`.
zh_cn: 替换为文档所引用的项目版本。这意味着只包含主要版本和次要版本部分，例如“2.5”，即使对于版本2.5.1也是如此。设置者：confval:`version`。

source: Replaced by either today's date (the date on which the document is read), or the date set in the build configuration file. Normally has the format ``April 14, 2007``. Set by :confval:`today_fmt` and :confval:`today`.
ja: 本日の日付に置き換えられます。日付はドキュメントが読み込まれた日になります。もしくはビルド設定ファイルにて日付を設定することも可能です。通常は ``April 14, 2007`` というフォーマットが使用されます。 :confval:`today_fmt` と :confval:`today` を設定することで変更できます。
pt_br: Substituído pela data de hoje (a data em que o documento é lido) ou pela data definida no arquivo de configuração de construção. Normalmente tem o formato ``April 14, 2007``. Definido por :confval:`today_fmt` e :confval:`today`.
zh_cn: 替换为今天的日期（读取文档的日期）或生成配置文件中设置的日期。通常格式为“2007年4月14日”。设置者：confval:`today_fmt`和：confval:`today`。

source: When you use this role, the referenced file is automatically marked for inclusion in the output when building (obviously, for HTML output only). All downloadable files are put into the ``_downloads`` subdirectory of the output directory; duplicate filenames are handled.
ja: このロールを使用すると、HTML出力時に、参照されたファイルはビルド時に自動的に出力ディレクトリにコピーされることになります。すべてのダウンロード可能なファイルは出力ディレクトリ中の ``_downloads`` サブディレクトリ出力されます。重複した名前のファイルがあっても扱うことができます。

source: If you don't need the "variable part" indication, use the standard ````code```` instead.
ja: もし"変数部分"が不要であれば、標準の ````コード```` という形式を代わりに使用してください。

source: See :doc:`/usage/domains/index` for roles added by domains.
pt_br: Veja :doc:`/usage/domains/index` para papéis adicionados por domínios.

source: See :doc:`/usage/referencing/`.
pt_br: Veja :doc:`/usage/referencing/`.

source: Cross-reference roles include:
pt_br: Papéis de referência cruzada incluem:

source: :rst:role:`option` (and the deprecated :rst:role:`!cmdoption`)
pt_br: :rst:role:`option` (e o descontinuado :rst:role:`!cmdoption`)

source: Inline code highlighting
pt_br: Realce de código em linha

source: An *inline* code example. When used directly, this role just displays the text *without* syntax highlighting, as a literal.
pt_br: Um exemplo de código em linha, ou *inline*. Quando usado diretamente, este papel apenas exibe o texto *sem* realce de sintaxe, como um literal.

source: Displays: By default, inline code such as :code:`1 + 2` just displays without highlighting.
pt_br: Exibe: By default, inline code such as :code:`1 + 2` just displays without highlighting.

source: Unlike the :rst:dir:`code-block` directive, this role does not respect the default language set by the :rst:dir:`highlight` directive.
pt_br: Ao contrário da diretiva :rst:dir:`code-block`, este papel não respeita a linguagem padrão definida pela diretiva :rst:dir:`highlight`.

source: To enable syntax highlighting, you must first use the Docutils :dudir:`role` directive to define a custom role associated with a specific language:
pt_br: Para ativar o realce de sintaxe, você deve primeiro usar a diretiva :dudir:`role` do Docutils para definir um papel personalizado associado a uma linguagem específico:

source: To display a multi-line code example, use the :rst:dir:`code-block` directive instead.
pt_br: Para exibir um exemplo de código multilinha, use a diretiva :rst:dir:`code-block`.

source: Displays: Since Pythagoras, we know that :math:`a^2 + b^2 = c^2`.
pt_br: Exibe: Since Pythagoras, we know that :math:`a^2 + b^2 = c^2`.

source: For example: ``:abbr:`LIFO (last-in, first-out)``` displays :abbr:`LIFO (last-in, first-out)`.
pt_br: Por exemplo: ``:abbr:`LIFO (last-in, first-out)``` exibe :abbr:`LIFO (last-in, first-out)`.

source: For example: :command:`rm`
pt_br: Por exemplo: :command:`rm`

source: For example: :dfn:`binary mode`
pt_br: Por exemplo: :dfn:`binary mode`

source: Displays: ... is installed in :file:`/usr/lib/python3.{x}/site-packages` ...
pt_br: Exibe: ... is installed in :file:`/usr/lib/python3.{x}/site-packages` ...

source: An accelerator key for the GUI label can be included using an ampersand; this will be stripped and displayed underlined in the output (for example: ``:guilabel:`&Cancel``` displays :guilabel:`&Cancel`). To include a literal ampersand, double it.
pt_br: Uma chave aceleradora para o rótulo da GUI pode ser incluída usando um E comercial; isso será removido e exibido sublinhado na saída (por exemplo: ``:guilabel:`&Cancel``` exibe :guilabel:`&Cancel`). Para incluir um E comercial literal, duplique-o.

source: Mark a sequence of keystrokes. What form the key sequence takes may depend on platform- or application-specific conventions. When there are no relevant conventions, the names of modifier keys should be spelled out, to improve accessibility for new users and non-native speakers. For example, an *xemacs* key sequence may be marked like ``:kbd:`C-x C-f```, but without reference to a specific application or platform, the same sequence should be marked as ``:kbd:`Control-x Control-f```, displaying :kbd:`C-x C-f` and :kbd:`Control-x Control-f` respectively.
pt_br: Marca uma sequência de teclas. A forma que a sequência de teclas assume pode depender das convenções específicas da plataforma ou da aplicação. Quando não há convenções relevantes, os nomes das teclas modificadoras devem ser explicitados, para melhorar a acessibilidade para novos usuários e falantes não nativos. Por exemplo, uma sequência de teclas *xemacs* pode ser marcada como ``:kbd:`C-x C-f```, mas sem referência a uma aplicação ou plataforma específica, a mesma sequência deve ser marcada como ``:kbd:`Control- x Control-f```, exibindo :kbd:`C-x C-f` e :kbd:`Control-x Control-f` respectivamente.

source: The name of an RFC 822-style mail header. This markup does not imply that the header is being used in an email message, but can be used to refer to any header of the same "style." This is also used for headers defined by the various MIME specifications. The header name should be entered in the same way it would normally be found in practice, with the camel-casing conventions being preferred where there is more than one common usage. For example: ``:mailheader:`Content-Type``` displays :mailheader:`Content-Type`.
pt_br: O nome de um cabeçalho de correio estilo RFC 822. Essa marcação não implica que o cabeçalho esteja sendo usado em uma mensagem de e-mail, mas pode ser usada para se referir a qualquer cabeçalho do mesmo “estilo”. Isso também é usado para cabeçalhos definidos pelas diversas especificações MIME. O nome do cabeçalho deve ser inserido da mesma forma que normalmente seria encontrado na prática, sendo preferidas as convenções de tripa de camelo quando houver mais de um uso comum. Por exemplo: ``:mailheader:`Content-Type``` exibe :mailheader:`Content-Type`.

source: For example: :makevar:`help`
pt_br: Por exemplo: :makevar:`help`

source: A reference to a Unix manual page including the section, e.g. ``:manpage:`ls(1)``` displays :manpage:`ls(1)`. Creates a hyperlink to an external site rendering the manpage if :confval:`manpages_url` is defined.
pt_br: Uma referência a uma página man do Unix incluindo a seção, por exemplo, ``:manpage:`ls(1)``` exibe :manpage:`ls(1)`. Cria um hiperlink para um site externo que renderiza a página man se :confval:`manpages_url` estiver definido.

source: Allow specifying a target with ``<>``, like hyperlinks. For example, ``:manpage:`blah <ls(1)>``` displays :manpage:`blah <ls(1)>`.
pt_br: Permite especificar um alvo com ``<>``, como hiperlinks. Por exemplo, ``:manpage:`blah <ls(1)>``` exibe :manpage:`blah <ls(1)>`.

source: Displays: :menuselection:`Start --> Programs`
pt_br: Exibe: :menuselection:`Start --> Programs`

source: For example: :mimetype:`text/plain`
pt_br: Por exemplo: :mimetype:`text/plain`

source: For example: :newsgroup:`comp.lang.python`
pt_br: Por exemplo: :newsgroup:`comp.lang.python`

source: For example: :program:`curl`
pt_br: Por exemplo: :program:`curl`

source: For example: :regexp:`([abc])+`
pt_br: Por exemplo: :regexp:`([abc])+`

source: A piece of literal text, such as code. Within the contents, you can use curly braces to indicate a "variable" part, as in :rst:role:`file`. For example, in ``:samp:`print(1+{variable})```, the part ``variable`` would be emphasized: :samp:`print(1+{variable})`
pt_br: Um pedaço de texto literal, como código. Dentro do conteúdo, você pode usar chaves para indicar uma parte "variável", como em :rst:role:`file`. Por exemplo, em ``:samp:`print(1+{variable})```, a parte ``variable`` seria enfatizada: :samp:`print(1+{variable})`

source: If you don't need the "variable part" indication, use the standard :rst:role:`code` role instead.
pt_br: Se você não precisa da indicação "parte variável", use o papel padrão :rst:role:`code`.

source: Allowed to escape curly braces with double backslash. For example, in ``:samp:`print(f"answer=\\{1+{variable}*2\\}")```, the part ``variable`` would be emphasized and the escaped curly braces would be displayed: :samp:`print(f"answer=\\{1+{variable}*2\\}")`
pt_br: É permitido escapar chaves com barra invertida dupla. Por exemplo, em ``:samp:`print(f"answer=\\{1+{variable}*2\\}")```, a parte ``variable`` seria enfatizada e as chaves de escape seria exibido: :samp:`print(f"answer=\\{1+{variable}*2\\}")`

source: For example: :pep:`8`
pt_br: Por exemplo: :pep:`8`

source: For example: :rfc:`2324`
pt_br: Por exemplo: :rfc:`2324`

source: The documentation system provides some substitutions that are defined by default. They are set in the build configuration file.
pt_br: O sistema de documentação fornece algumas substituições definidas por padrão. Eles são definidos no arquivo de configuração de construção.

source: Replaced by the translation progress of the document. This substitution is intended for use by document translators as a marker for the translation progress of the document.
pt_br: Substituído pelo andamento da tradução do documento. Esta substituição destina-se a ser usada por tradutores de documentos como um marcador para o progresso da tradução do documento.
