Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/web/api.po
Languages: pt_br

source: The WebSupport Class
pt_br: Classe WebSupport

source: The main API class for the web support package. All interactions with the web support package should occur through this class.
pt_br: Classe principal API para suporte pacote. Todas interações com o pacote suporte web devem ocorrer através dessa classe.

source: The class takes the following keyword arguments:
pt_br: Classe usa os seguintes argumentos:

source: srcdir
pt_br: diretorio fonte

source: The directory containing reStructuredText source files.
pt_br: O diretório que contém fonte reStructuredText arquivos.

source: builddir
pt_br: diretório construção

source: The directory that build data and static files should be placed in. This should be used when creating a :class:`WebSupport` object that will be used to build data.
pt_br: O diretório para construir dados e arquivos estáticos. Deve ser usado quando criar objeto :class:`WebSupport` que irá ser usado para construir dados.

source: datadir
pt_br: diretório dados

source: The directory that the web support data is in. This should be used when creating a :class:`WebSupport` object that will be used to retrieve data.
pt_br: O diretório de dados para web support. Deve ser usado quando criando objeto :class:`WebSupport` que irá ser usado para recuperar dados.

source: search
pt_br: buscar

source: This may contain either a string (e.g. 'xapian') referencing a built-in search adapter to use, or an instance of a subclass of :class:`~.search.BaseSearch`.
pt_br: Pode conter uma string (e.g. 'xapian') referenciando adaptator intrínseco para usar uma instância de subclasse :class:`~.search.BaseSearch`.

source: storage
pt_br: memória

source: This may contain either a string representing a database uri, or an instance of a subclass of :class:`~.storage.StorageBackend`. If this is not provided, a new sqlite database will be created.
pt_br: Deve conter a string representando a uri do banco de dados ou instância da subclasse :class:`~.storage.StorageBackend`. Se não for informado, novo banco de dados sqlite será criado.

source: A callable to be called when a new comment is added that is not displayed. It must accept one argument: a dictionary representing the comment that was added.
pt_br: Chamada para ser usada quando novo comentário adicionado não for exibido. Aceita um argumento: dicionário representando o comentário que foi adicionado.

source: staticdir
pt_br: diretório estático

source: If static files are served from a location besides ``'/static'``, this should be a string with the name of that location (e.g. ``'/static_files'``).
pt_br: Se arquivos estáticos são servidos de local como ``'/static'``, deve ser uma string com o nome do local (ex. ``'/static_files'``).

source: docroot
pt_br: docraiz

source: If the documentation is not served from the base path of a URL, this should be a string specifying that path (e.g. ``'docs'``).
pt_br: Se a documentação não é servida do caminho base da URL, deve ser uma string especificando path (ex.. ``'docs'``).

source: Methods
pt_br: Métodos

source: Build the documentation. Places the data into the `outdir` directory. Use it like this::
pt_br: Construir documentação. Grava dados nos diretórios de saida `outdir`. Usar como::

source: This will read reStructured text files from `srcdir`. Then it will build the pickles and search index, placing them into `builddir`. It will also save node data to the database.
pt_br: Ler arquivos reStructured text do diretório fonte `srcdir`. Então será construído dados e índices, colocando isso no `builddir`. Também salva dados no banco de dados.

source: Load and return a document from a pickle. The document will be a dict object which can be used to render a template::
pt_br: Carrega e retorna conjunto de documento. O documento será um objeto dicionário o qual irá renderizar o modelo::

source: In most cases `docname` will be taken from the request path and passed directly to this function. In Flask, that would be something like this::
pt_br: Em muitos casos `docname` irá requisitar caminho e passar diretamente para essa função. Em Flask, isso fica algo como::

source: The document dict that is returned contains the following items to be used during template rendering.
pt_br: O dicionário do documento retornado contém os seguintes itens que podem ser usados durante a renderização do modelo.

source: **body**: The main body of the document as HTML
pt_br: **body**: O corpo principal do documento como HTML

source: **sidebar**: The sidebar of the document as HTML
pt_br: **sidebar**: A barra lateral do documento como HTML

source: **relbar**: A div containing links to related documents
pt_br: **relbal**: Div contendo links para documentos relacionados

source: **title**: The title of the document
pt_br: **title**: O título do documento

source: **css**: Links to css files used by Sphinx
pt_br: **css**: Links para arquivos css files usados pelo Sphinx

source: **script**: Javascript containing comment options
pt_br: **script**: Javascript contendo opções de comentário

source: Parameters
pt_br: Parâmetros

source: the name of the document to load.
pt_br: o nome do documento é carregado.

source: Get the comments and source associated with `node_id`. If `username` is given vote information will be included with the returned comments. The default CommentBackend returns a dict with two keys, *source*, and *comments*. *source* is raw source of the node and is used as the starting point for proposals a user can add. *comments* is a list of dicts that represent a comment, each having the following items:
pt_br: Obtem os comentários e fonte associado ao `node_id`. Se `username` é obtido será incluido nos comentários de retorno. O padrão CommentBackend retorna um dicionário de duas chaves, *fonte* e *comentários*. *fonte* e fonte raw do node e é usado como ponto inical para propôr o que o usuário pode adicionar *comentários* é uma lista de termos que representam comentário, cada qual com os seguintes itens:

source: Key
pt_br: Chave

source: Contents
pt_br: Conteúdos

source: The comment text.
pt_br: O texto ou Comentário

source: username
pt_br: nome do usuário

source: The username that was stored with the comment.
pt_br: O nome do usuário associado com o comentário

source: The comment's unique identifier.
pt_br: O id único do comentário

source: rating
pt_br: classific.

source: The comment's current rating.
pt_br: A avaliação do comentário atual

source: age
pt_br: tempo

source: The time in seconds since the comment was added.
pt_br: o tempo em segundos desde que o comentário foi adicionado

source: time
pt_br: data

source: A dict containing time information. It contains the following keys: year, month, day, hour, minute, second, iso, and delta. `iso` is the time formatted in ISO 8601 format. `delta` is a printable form of how old the comment is (e.g. "3 hours ago").
pt_br: conjunto contendo época da informação. Contém três chaves: ano, mês, dia, hora, minuto, segundo, iso e delta. `iso` é formato de tempo formato ISO 8601. `delta` é uma forma de imprimir tempo do comentário (ex. "3 horas atrás").

source: vote
pt_br: votação

source: If `user_id` was given, this will be an integer representing the vote. 1 for an upvote, -1 for a downvote, or 0 if unvoted.
pt_br: Se `user_id` foi usado, erá ser um inteiro representando o voto. 1 para aumentar voto, -1 para abaixar voto ou 0 se não votado.

source: The id of the node that the comment is attached to. If the comment's parent is another comment rather than a node, this will be null.
pt_br: O id do node ao qual o comentário está associado. Se o comentário pai é outro comentário em vez de um node, isso será nulo.

source: parent
pt_br: pai

source: The id of the comment that this comment is attached to if it is not attached to a node.
pt_br: O id do comentário ao qual este comentário está associado se não estiver associado a um node.

source: children
pt_br: filho

source: A list of all children, in this format.
pt_br: Lista de filhos no formato.

source: proposal_diff
pt_br: diff_proposta

source: An HTML representation of the differences between the the current source and the user's proposed source.
pt_br: HTML representando as diferenças entre o fonte atual e o fonte proposto.

source: the id of the node to get comments for.
pt_br: o id do node para obter comentários.

source: the username of the user viewing the comments.
pt_br: o nome do usuário do usuário leitor dos comentários.

source: whether the user is a moderator.
pt_br: onde usuário é um moderador.

source: Add a comment to a node or another comment. Returns the comment in the same format as :meth:`get_comments`. If the comment is being attached to a node, pass in the node's id (as a string) with the node keyword argument::
pt_br: Adicionar comentário para um node ou outro comentário. Retorna comentário no mesmo formato como :meth:`get_comments`. Se o comentário é vinculado a um node, passar o id do node (como string) com o argumento do node::

source: If the comment is the child of another comment, provide the parent's id (as a string) with the parent keyword argument::
pt_br: Se o comentário é filho de outro comentário, fornece id do pai (como string) com argumentos chaves do pai::

source: If you would like to store a username with the comment, pass in the optional `username` keyword argument::
pt_br: Se desejar armazenar nome usuário com o comentário, passe argumento opcional `username` aos argumentos::

source: the prefixed id of the comment's parent.
pt_br: o id prefixado do comentário pai.

source: the text of the comment.
pt_br: o texto do comentário

source: for moderation purposes
pt_br: com finalidade de moderação

source: the username of the user making the comment.
pt_br: o nome usuário que fez o comentário.

source: the time the comment was created, defaults to now.
pt_br: a data quando o comentário foi criado, padrão é agora.

source: Process a user's vote. The web support package relies on the API user to perform authentication. The API user will typically receive a comment_id and value from a form, and then make sure the user is authenticated. A unique username must be passed in, which will also be used to retrieve the user's past voting data. An example, once again in Flask::
pt_br: O processo votação usuário. O pacote web configa na API usuário para executar autenticação. A API usuário irá receber tipicamente um comentário_id e o valor de um formulário, certificar-se que o usuário está autenticado. Usuário único deve estar ativo o qual também pode ser usado para recuperar dados votações anteriores. Por exemplo, no Flask::

source: the comment being voted on
pt_br: o comentário em votação

source: the unique username of the user voting
pt_br: o nome único de usuário do usuário que votou

source: 1 for an upvote, -1 for a downvote, 0 for an unvote.
pt_br: 1 para subir voto, -1 para diminuir voto, 0 para não votado.

source: Perform a search for the query `q`, and create a set of search results. Then render the search results as html and return a context dict like the one created by :meth:`get_document`::
pt_br: Executar busca para query `q` e criar um conjunto de resultados de pesquisa. O renderizador de resultados de busca como html e retorna o contexto como dicionário criado por :meth:`get_document`::

source: the search query
pt_br: consulta de busca
