Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/web/quickstart.po
Languages: pt_br

source: Web Support Quick Start
pt_br: Web Suporte Início Rápido

source: Building Documentation Data
pt_br: Construindo Dados da Documentação

source: To make use of the web support package in your application you'll need to build the data it uses. This data includes pickle files representing documents, search indices, and node data that is used to track where comments and other things are in a document. To do this you will need to create an instance of the :class:`~.WebSupport` class and call its :meth:`~.WebSupport.build` method::
pt_br: Para fazer uso, do pacote de suporte a web, em sua aplicação é necessário construir os dados que o pacote utiliza. Esses dados incluem arquivos tipo pickle representando os documentos, índices de busca e dados que serão usados para comentários e outras finalidades dentro do documento. Para isso é necessário criar uma instância da :class:`~.WebSupport` e chamar o método :meth:`~.WebSupport.build`::

source: This will read reStructuredText sources from `srcdir` and place the necessary data in `builddir`. The `builddir` will contain two sub-directories: one named "data" that contains all the data needed to display documents, search through documents, and add comments to documents. The other directory will be called "static" and contains static files that should be served from "/static".
pt_br: Isso irá ler fontes reStructuredText a partir do `srcdir` e criar os dados necessários no `builddir`. O `builddir` irá conter dois sub-diretórios: um chamado "data" que contém todos os dados necessários para exibir, pesquisar e adicionar comentários aos documentos. O outro diretórico chamado "estático" irá conter arquivos estáticos que serão servidos a partir de "/static".

source: If you wish to serve static files from a path other than "/static", you can do so by providing the *staticdir* keyword argument when creating the :class:`~.WebSupport` object.
pt_br: Se desejar servir arquivos estáticos a partir de outro caminho que não "/static", deverá ser providenciado o argumento *staticdir* quando criada a :class:`~.WebSupport` do objeto.

source: Integrating Sphinx Documents Into Your Webapp
pt_br: Integrando Documentos Sphinx em sua aplicação Web

source: Now that the data is built, it's time to do something useful with it. Start off by creating a :class:`~.WebSupport` object for your application::
pt_br: Agora que os dados foram construídos, é hora de fazer algo útil com eles. Inicie criando a :class:`~.WebSupport` do objeto para sua aplicação::

source: You'll only need one of these for each set of documentation you will be working with. You can then call its :meth:`~.WebSupport.get_document` method to access individual documents::
pt_br: Só será necessário um desses conjuntos de documentação no qual está trabalhando. Pode ser chamado o método :meth:`~.WebSupport.get_document` para acessar individualmente os documentos::

source: This will return a dictionary containing the following items:
pt_br: Isso irá retornar um dicionário contendo os seguintes itens:

source: **body**: The main body of the document as HTML
pt_br: **body**: O corpo principal do documento como HTML

source: **sidebar**: The sidebar of the document as HTML
pt_br: **sidebar**: A barra lateral do documento como HTML

source: **relbar**: A div containing links to related documents
pt_br: **relbal**: Div contendo links para documentos relacionados

source: **title**: The title of the document
pt_br: **title**: O título do documento

source: **css**: Links to CSS files used by Sphinx
pt_br: **css**: Links para arquivos CSS usados pelo Sphinx

source: **script**: JavaScript containing comment options
pt_br: **script**: JavaScript contendo opções de comentários

source: This dict can then be used as context for templates. The goal is to be easy to integrate with your existing templating system. An example using `Jinja2 <http://jinja.pocoo.org/>`_ is:
pt_br: Esse dicionário dict, pode então ser usado como contexto para modelos. O objetivo é facilitar a integração com seu sistema de modelos. Um exemplo usando `Jinja2 <http://jinja.pocoo.org/>`_ é:

source: Authentication
pt_br: Autenticação

source: To use certain features such as voting, it must be possible to authenticate users. The details of the authentication are left to your application. Once a user has been authenticated you can pass the user's details to certain :class:`~.WebSupport` methods using the *username* and *moderator* keyword arguments. The web support package will store the username with comments and votes. The only caveat is that if you allow users to change their username you must update the websupport package's data::
pt_br: Para cirar certas funcionalidades como enquete, deve ser possível autenticar usuários. Os detalhes da autenticação são deixados para sua aplicação. Quando um usuário for autenticado, podemos passar a usar certos detalhes de classes :class:`~.WebSupport` e métodos usando argumentos *username* e *moderador* . O suporte ao pacote web irá armazenar nome do usuário com os comentários e votos. O cuidado é para que quando o nome do usuário for atualizado, sua aplicação deverá atualizar os dados de websuporte.

source: *username* should be a unique string which identifies a user, and *moderator* should be a boolean representing whether the user has moderation privileges. The default value for *moderator* is ``False``.
pt_br: *username* deve ser string única que identifica o usuário, e *moderator* deve ser um booleano representando onde o usuário tem privilégio de moderação. O valor padrão para *moderator* é ``False``.

source: An example `Flask <http://flask.pocoo.org/>`_ function that checks whether a user is logged in and then retrieves a document is::
pt_br: Um exemplo é a função `Flask <http://flask.pocoo.org/>`_ que verifica se o usuário está logado e então recupera documentos ::

source: The first thing to notice is that the *docname* is just the request path. This makes accessing the correct document easy from a single view. If the user is authenticated, then the username and moderation status are passed along with the docname to :meth:`~.WebSupport.get_document`. The web support package will then add this data to the ``COMMENT_OPTIONS`` that are used in the template.
pt_br: O primeiro detalhe a notar é que *docname* é o caminho da requisição. Isso torna fácil acessar o caminho correto do documento em uma simples visão. Se o usuário está autenticado, então o nome do usuário e situação de moderação são passadas junto com o método :meth:`~.WebSupport.get_document`. O pacote suporte a web irá adicionar dados em ``COMMENT_OPTIONS`` os quais serão usados como modelo.

source: This only works if your documentation is served from your document root. If it is served from another directory, you will need to prefix the url route with that directory, and give the `docroot` keyword argument when creating the web support object::
pt_br: Isso só funciona se sua documentação é servida a partir do diretório raiz. Se for servida de outro diretório, deve ser informado o prefixo complementar da url até esse diretório no argumento `docroot` quando criado o objeto websupport::

source: Performing Searches
pt_br: Realizando Pesquisas

source: Note that we used the same template to render our search results as we did to render our documents. That's because :meth:`~.WebSupport.get_search_results` returns a context dict in the same format that :meth:`~.WebSupport.get_document` does.
pt_br: Note que usamos o mesmo modelo para renderizar os resultados da pesquisa, como fizemos com nossos documentos. Isto é porque o método :meth:`~.WebSupport.get_search_results` retorna o mesmo formato que o método :meth:`~.WebSupport.get_document` utiliza.

source: Comments & Proposals
pt_br: Comentários & Propostas

source: Now that this is done it's time to define the functions that handle the AJAX calls from the script. You will need three functions. The first function is used to add a new comment, and will call the web support method :meth:`~.WebSupport.add_comment`::
pt_br: Agora que isto está feito, podemos definir as funções para manusear chamadas AJAX a partir do script. Precisaremos de três funções. A primeira função é usada para adicionar novo comentário e irá chamar o método de suporte da web :meth:`~.WebSupport.add_comment`::

source: The final function that is needed will call :meth:`~.WebSupport.process_vote`, and will handle user votes on comments::
pt_br: A função final irá chamar o método :meth:`~.WebSupport.process_vote` e ira manusear os votos do usuário nos comentários::

source: Comment Moderation
pt_br: Moderação de Comentário

source: By default, all comments added through :meth:`~.WebSupport.add_comment` are automatically displayed. If you wish to have some form of moderation, you can pass the `displayed` keyword argument::
pt_br: Por padrão, todos comentários adicionados através do método :meth:`~.WebSupport.add_comment` são automaticamente exibidos. Se desejar alguma forma de moderação, deve ser passado o argumento `displayed`::

source: You can then create a new view to handle the moderation of comments. It will be called when a moderator decides a comment should be accepted and displayed::
pt_br: Pode ser criada uma nova visão para manusear moderação de comentários. Será ativada quando o moderador decidir que um comentário deva ser aceito e exibido::

source: Rejecting comments happens via comment deletion.
pt_br: Rejeitar comentários ocorre através de apagar comentário.

source: To perform a custom action (such as emailing a moderator) when a new comment is added but not displayed, you can pass callable to the :class:`~.WebSupport` class when instantiating your support object::
pt_br: Para executar ação configurada (como email para moderador) quando um novo comentário for adicionado, mas ainda não estar exibido, pode ser chamada a classe :class:`~.WebSupport` quando instanciado o suporte do objeto::

source: The moderation callback must take one argument, which will be the same comment dict that is returned by :meth:`add_comment`.
pt_br: A chamada de retorno da moderação deve ter um argumento que deve ser o mesmo dict comentado que foi retornado com :meth:`add_comment`.
