Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/web/searchadapters.po
Languages: ja, pt_br

source: Search Adapters
ja: 検索アダプタ
pt_br: Adaptadores de Busca

source: To create a custom search adapter you will need to subclass the :class:`BaseSearch` class. Then create an instance of the new class and pass that as the `search` keyword argument when you create the :class:`~.WebSupport` object::
ja: カスタムの検索アダプタを作成したい場合にには、 :class:`BaseSearch` クラスのサブクラスを作成する必要があります。その後、新しいクラスのインスタンスを作成し、 :class:`~.WebSupport` オブジェクトのを作る時に、 `search` キーワード引数で渡します::
pt_br: Para criar um adaptador busca personalizado, será necessária a subclass da classe :class:`BaseSearch`. Após isso criar uma instância da nova classe e passar o argumento chave de `search` quando criar o objeto :class:`~.WebSupport`::

source: For more information about creating a custom search adapter, please see the documentation of the :class:`BaseSearch` class below.
ja: カスタムの検索アダプタを作る際のより詳しい情報は、これから説明する :class:`BaseSearch` クラスのドキュメントを参照してください。
pt_br: Para mais informações sobre criar adaptador de busca personalizado, favor ver a documentação da classe abaixo :class:`BaseSearch`.

source: Defines an interface for search adapters.
ja: 検索アダプタのインタフェースを定義しています。
pt_br: Definir o interface para adaptadores de busca.

source: BaseSearch Methods
ja: BaseSearchのメソッド
pt_br: Métodos Busca Básica

source: The following methods are defined in the BaseSearch class. Some methods do not need to be overridden, but some (:meth:`~BaseSearch.add_document` and :meth:`~BaseSearch.handle_query`) must be overridden in your subclass. For a working example, look at the built-in adapter for whoosh.
ja: これらのメソッドがBaseSearchクラスに定義されています。いくつかのメソッドはオーバーライドする必要はありませんが、サブクラスでオーバーライドしなければならないもの(:meth:`~BaseSearch.add_document` , :meth:`~BaseSearch.handle_query`)もあります。組み込みのwhoosh検索アダプタが、動作可能なサンプルとなっています。
pt_br: Os seguintes métodos são definidos na classe BaseSearch. Alguns métodos não precisar ser sobrepostos, mas ( :meth:`~BaseSearch.add_document` e :meth:`~BaseSearch.handle_query` ) devem ser sobrepostos com sua subclasse. Para um exemplo prático, veja o adaptador nativo do whoosh.

source: Called by the builder to initialize the search indexer. `changed` is a list of pagenames that will be reindexed. You may want to remove these from the search index before indexing begins.
ja: 検索のインデクサーを初期化するためにビルダーから呼ばれます。 `changed` は再インデックスされるページのリストです。インデックス作成が始まる前に検索インデックスからこれらを取り除くこともできます。
pt_br: Chamado pelo construtor para inicializar o indexador de busca. `changed` é uma lista de nome de páginas que serão reindexadas. Pode serem removidas algumas antes que a indexação começar.

source: Parameters
ja: パラメータ
pt_br: Parâmetros

source: a list of pagenames that will be re-indexed
ja: 再インデックスされるページ名のリスト。
pt_br: uma lista de nome de páginas que serão reindexadas

source: Called by the builder when writing has been completed. Use this to perform any finalization or cleanup actions after indexing is complete.
ja: 書き出しが完了した時にビルダーから呼ばれます。これはインデックス作成が完了した後の完了処理や後片付けに使います。
pt_br: Chamado pelo construtor quando gravação estiver completa. Use isso para executar qualquer finalização ou ações de limpeza após a indexação estar completa.

source: Called by the builder to add a doctree to the index. Converts the `doctree` to text and passes it to :meth:`add_document`. You probably won't want to override this unless you need access to the `doctree`. Override :meth:`add_document` instead.
ja: doctreeをインデックスに追加するために呼ばれます。 `doctree` をテキストに変換し、 :meth:`add_document` に渡します。おそらく `doctree` にアクセスする必要がない限り上書きする必要はないはずです。代わりに :meth:`add_document` を上書きしてください。
pt_br: Chamado pelo construtor para adicionar `doctree` em um índice. converte o `doctree` em texto e passa-o para :meth:`add_document`. Provavelmente não deseja sobrepor isso a menos que seja necessário acessar `doctree`. Nesse caso, sobrepor :meth:`add_document`.

source: the name of the page to be indexed
ja: インデックスされるページの名前。
pt_br: o nome da página que será indexada

source: the name of the original source file
ja: 元のソースファイルの名前

source: the title of the page to be indexed
ja: インデックスされるページのタイトル。
pt_br: o título da página que será indexada

source: is the docutils doctree representation of the page
ja: このページのdocutilsのdoctree表現
pt_br: é a representação docutils doctree da página

source: Called by :meth:`feed` to add a document to the search index. This method should should do everything necessary to add a single document to the search index.
ja: :meth:`feed` によって呼ばれ、検索インデックスにドキュメントを追加します。この関数は単一のドキュメントを検索インデックスに追加するために必要なすべてのことを行う必要があります。
pt_br: Chamado por :meth:`feed` para adicionar um documento no índice de busca. Esse método deve fazer o necessário para adicionar um simples documento no índice de busca.

source: `pagename` is name of the page being indexed. It is the combination of the source files relative path and filename, minus the extension. For example, if the source file is "ext/builders.rst", the `pagename` would be "ext/builders". This will need to be returned with search results when processing a query.
ja: `pagename` はインデックスされるページの名前です。ソースファイルの相対パスとファイル名と拡張子を除いたファイル名の組み合わせです。例えば、もしソースファイルが "ext/builders.rst" の場合、 `pagename` は "ext/builders" となるでしょう。これは検索クエリを処理した検索結果として使われます。
pt_br: `pagename` é o nome da página que está sendo indexada. É a combinação dos arquivos fonte relativa ao caminho e nome do arquivo, sem a extensão. Por exemplo se o fonte é "ext/builders.rst", então `pagename` deve ser "ext/builders". Isso será necessário nos resultados da pesquisa quando processar consulta.

source: the name of the page being indexed
ja: インデックスされるページの名前。
pt_br: O nome da página que está sendo indexada

source: the page's title
ja: そのページのタイトル。
pt_br: título da página

source: the full text of the page
ja: そのページの完全なテキスト。
pt_br: o texto completo da página

source: Called by the web support api to get search results. This method compiles the regular expression to be used when :meth:`extracting context <extract_context>`, then calls :meth:`handle_query`. You won't want to override this unless you don't want to use the included :meth:`extract_context` method. Override :meth:`handle_query` instead.
ja: 検索結果を取得するためにWeb support APIから呼ばれます。この関数は :meth:`extracting context <extract_context>` でコンテキストを展開する時に正規表現をコンパイルし、それから :meth:`handle_query` を呼び出します。 :meth:`extract_context` を含みたくない場合にのみこの関数を上書きしたほうがよいでしょう。代わりに :meth:`handle_query` を上書きしてください。
pt_br: Chamada pela api web para obter resultados de busca. Esse método compila expressões regulares para usá-las quando extrair :meth:`extracting context <extract_context>`, após o que chama :meth:`handle_query`. Não é necessário sobrepor isso a menos que não queira usar o método nativo :meth:`extract_context`. Para isso sobrepor :meth:`handle_query`.

source: the search query string.
ja: 検索クエリー文字列。
pt_br: a string de consulta da busca

source: Called by :meth:`query` to retrieve search results for a search query `q`. This should return an iterable containing tuples of the following format::
ja: 検索クエリー `q` に対する検索結果を取得するために :meth:`query` によって呼び出されます。これは以下のフォーマットに従うiterableを返す必要があります::
pt_br: Chamado pelo :meth:`query` para recuperar resultados na busca da consulta `q`. Pode retornar tuples iterativas contendo o seguinte formato:

source: `path` and `title` are the same values that were passed to :meth:`add_document`, and `context` should be a short text snippet of the text surrounding the search query in the document.
ja: `path` と `title` は :meth:`add_document` に渡された同じ値であり、 `context` はドキュメント内で検索クエリー文字列の周りにある、テキストスニペットです。
pt_br: `path` e `title` são os mesmos valores quando passados para :meth:`add_document` e `context`, podendo ser um snippet de texto envolvido na busca ou consulta do documento.

source: The :meth:`extract_context` method is provided as a simple way to create the `context`.
ja: :meth:`extract_context` メソッドは `context` を作成するための簡単な方法です。
pt_br: O método :meth:`extract_context` é fornecido como uma maneira simples de criar o `context`.

source: the search query
ja: 検索クエリー
pt_br: consulta de busca

source: Extract the context for the search query from the document's full `text`.
ja: ドキュメントの完全な `テキスト` から検索文字列に対するコンテキストを展開します。
pt_br: Extrair o contexto da consulta de busca do texto completo do documento

source: the full text of the document to create the context for
ja: コンテキスト作成に使われる、ドキュメントの完全なテキスト
pt_br: o texto completo do documento para ser criado contexto para

source: the length of the context snippet to return.
ja: 返却するコンテキストのスニペットの長さ。
pt_br: o tamanho do snippet do contexto para retornar
