Repository: sphinx-doc/sphinx-doc-translations
Catalog: locales/*/LC_MESSAGES/usage/advanced/intl.po
Languages: fr, zh_cn

source: Internationalization
fr: Internationalisation
zh_cn: 国际化

source: Complementary to translations provided for Sphinx-generated messages such as navigation bars, Sphinx provides mechanisms facilitating the translation of *documents*. See the :ref:`intl-options` for details on configuration.
fr: En complément des traductions fournies pour les messages générés par Sphinx comme les barres de navigation, Sphinx offre un mécanisme facilitant la traduction du *document* en lui-même. Voir les :ref:`intl-options` pour les détails de configuration.
zh_cn: 作为对Sphinx生成的消息（如导航栏）提供的翻译的补充，Sphinx提供了促进 *文档* 翻译的机制。有关配置的详细信息，请参阅 :ref:`intl-options`。

source: Workflow visualization of translations in Sphinx. (The figure is created by `plantuml <https://plantuml.com>`_.)
fr: Visualisation du flux de traitement des traductions dans Sphinx. (Le schéma est réalisé avec `plantuml <https://plantuml.com>`_.)
zh_cn: Sphinx翻译的工作流可视化（图形由 `plantuml <https://plantuml.com>`_ 创建）。

source: Sphinx internationalization details
fr: Détails de l'internationalisation avec Sphinx
zh_cn: Sphinx国际化细节

source: **gettext** [1]_ is an established standard for internationalization and localization. It naively maps messages in a program to a translated string. Sphinx uses these facilities to translate whole documents.
fr: **gettext** [1]_ est un standard reconnu pour l'internationalisation et la localisation. Il met naïvement en correspondance les messages dans un programme avec des chaines traduites. Sphinx utilise cette infrastructure pour traduire des documents entiers.
zh_cn: **gettext** [1]_ 是国际化和本地化的既定标准。它简单地将程序中的消息映射到翻译后的字符串。Sphinx使用这些工具翻译整个文件。

source: Initially project maintainers have to collect all translatable strings (also referred to as *messages*) to make them known to translators. Sphinx extracts these through invocation of :command:`sphinx-build -M gettext`.
zh_cn: 最初，项目维护人员必须收集所有可翻译的字符串（也称为 *消息* ）以使其为翻译人员所知。Sphinx通过调用 :command:`sphinx-build -M gettext` 来提取这些字符串。

source: Every single element in the doctree will end up in a single message which results in lists being equally split into different chunks while large paragraphs will remain as coarsely-grained as they were in the original document. This grants seamless document updates while still providing a little bit of context for translators in free-text passages. It is the maintainer's task to split up paragraphs which are too large as there is no sane automated way to do that.
fr: Chaque élément du doctree se retrouvera individuellement dans un message unique, les liste se trouvant ainsi séparées en différents éléments, alors que les paragraphes le seront aussi grossièrement qu'ils le sont dans le document original. Ceci permet des mises à jour de documents transparentes tout en fournissant aux traducteurs un peu de contexte dans les passages en texte libre. Il appartient au mainteneur de séparer les paragraphes trop longs, car il n'existe pas de manière fiable de le faire automatiquement.
zh_cn: doctree中的每个元素都将以一条消息结束，这将导致列表被平均地分成不同的块，而大的段落将保持与原始文档中一样的粗粒度。这就允许无缝的文档更新，同时仍然为自由文本段中的翻译人员提供一点上下文。维护人员的任务是分割太大的段落，因为没有一种合理的自动化方法来分割这些段落。

source: After Sphinx successfully ran the :class:`~sphinx.builders.gettext.MessageCatalogBuilder` you will find a collection of ``.pot`` files in your output directory. These are **catalog templates** and contain messages in your original language *only*.
fr: Après que Sphinx a exécuté le :class:`~sphinx.builders.gettext.MessageCatalogBuilder`, vous trouverez une collection de fichiers ``.pot`` dans votre répertoire de sortie. Ce sont les **catalogues modèles** et contiennent les messages dans votre langue d'origine *uniquement*.
zh_cn: 在Sphinx成功运行 :class:`~sphinx.builders.gettext.MessageCatalogBuilder` 后，您将在输出目录中找到一组 ``.pot`` 文件。这些是 **catalog templates** ， *只* 包含您的原始语言的消息。

source: They can be delivered to translators which will transform them to ``.po`` files --- so called **message catalogs** --- containing a mapping from the original messages to foreign-language strings.
fr: Ils peuvent être distribués aux traducteurs qui les transformeront en fichiers ``.po`` --- dits **catalogues de messages** --- mettant en correspondance les messages originaux avec les chaines en langues étrangères.
zh_cn: 它们可以被传递给翻译程序，翻译程序会将它们转换成 ``.po`` 文件，即所谓的 **消息目录**，其中包含从原始消息到外语字符串的映射。

source: *gettext* compiles them into a binary format known as **binary catalogs** through :program:`msgfmt` for efficiency reasons. If you make these files discoverable with :confval:`locale_dirs` for your :confval:`language`, Sphinx will pick them up automatically.
fr: *gettext* les compile sous forme de **catalogues binaires** avec :program:`msgfmt` pour des raisons d'efficacité. Si vous rendez ces fichiers découvrables avec le paramètre :confval:`locale_dirs` pour votre :confval:`language`, Sphinx les trouvera automatiquement.
zh_cn: 为了提高效率，*gettext* 使用 :program:`msgfmt` 将它们编译成一种称为 **binary catalogs** 的二进制格式。如果您使用 :confval:`locale_dirs` 为您 :confval:`language` 设置这些文件的可发现性，Sphinx将自动提取它们。

source: An example: you have a document :file:`usage.rst` in your Sphinx project. The *gettext* builder will put its messages into :file:`usage.pot`. Imagine you have Spanish translations [2]_ stored in :file:`usage.po` --- for your builds to be translated you need to follow these instructions:
zh_cn: 一个例子：您在Sphinx项目中有一个文档 :file:`usage.rst` 。 *gettext* 构建器将把它的消息放入 :file:`usage.pot` 。假设您有存储在 :file:`usage.po` 中的西班牙语翻译 [2]_ --- 要进行翻译的构建，您需要遵循以下说明：

source: Compile your message catalog to a locale directory, say ``locale``, so it ends up in :file:`./locale/es/LC_MESSAGES/usage.mo` in your source directory (where ``es`` is the language code for Spanish.) ::
zh_cn: 将您的消息目录编译到一个区域目录中，比如 ``locale``，这样它最终会出现在您的源目录中的 :file:`./locale/es/LC_MESSAGES/usage.mo` 中（其中 ``es`` 是西班牙语的语言代码）。::

source: Run your desired build.
fr: Générer la sortie voulue.
zh_cn: 运行所需的构建。

source: In order to protect against mistakes, a warning is emitted if cross-references in the translated paragraph do not match those from the original. This can be turned off globally using the :confval:`suppress_warnings` configuration variable. Alternatively, to turn it off for one message only, end the message with ``#noqa`` like this::
fr: Afin d'éviter les erreurs, un avertissement est émis si les références croisées dans le paragraphe traduit ne correspondent pas à celles de l'original. Ce comportement peut être désactivé globalement avec le paramètre :confval:`suppress_warnings`. Autrement, pour le supprimer pour certains messages seulement, terminer ceux-ci avec ``#noqa`` comme ceci ::
zh_cn: 为了防止错误，如果翻译段落中的交叉引用与原始段落中的不匹配，则会发出警告。这可以使用配置变量 :confval:`suppress_warnings` 全局关闭。或者，为了仅关闭一条消息，请像这样用 ``#noqa`` 结尾该消息::

source: (Write ``\#noqa`` in case you want to have "#noqa" literally in the text. This does not apply to code blocks, where ``#noqa`` is ignored because code blocks do not contain references anyway.)
fr: (Écrire ``\#noqua`` si vous souhaitez que "#noqua" apparaisse littéralement dans le texte. Ceci ne s'applique pas aux blocs de code dans lesquels ``#noqua`` est ignoré puisqu'ils ne contiennent pas de références croisées de toute façon.)
zh_cn: (如果您想在文本中逐字写入“#noqa”，请写 ``\#noqa`` 。这不适用于代码块，因为代码块无论如何都不包含引用， ``#noqa`` 会被忽略。)

source: The ``#noqa`` mechanism.
fr: Le mécanisme ``#noqa``.
zh_cn: ``#noqa`` 机制。

source: Translating with sphinx-intl
fr: Traduire avec sphinx-intl
zh_cn: 使用sphinx-intl做翻译

source: Quick guide
fr: Guide rapide
zh_cn: 快速指南

source: `sphinx-intl`_ is a useful tool to work with Sphinx translation flow. This section describe an easy way to translate with *sphinx-intl*.
fr: `sphinx-intl`_ est un outil pratique pour travailler avec le flux de traduction de Sphinx. Cette section décrit une manière facile de traduire avec *sphinx-intl*.
zh_cn: `sphinx-intl`_ 是Sphinx翻译工作流中的有用工具。本节介绍一种使用 *sphinx-intl* 进行翻译的简单方法。

source: Install `sphinx-intl`_.
fr: Installer `sphinx-intl`_ :
zh_cn: 安装 `sphinx-intl`_.

source: Add configurations to :file:`conf.py`.
zh_cn: 将配置添加到 :file:`conf.py`。

source: This case-study assumes that BUILDDIR is set to ``_build``, :confval:`locale_dirs` is set to ``locale/`` and :confval:`gettext_compact` is set to ``False`` (the Sphinx document is already configured as such).
fr: Cette étude de cas présume que la valeur ``_build`` est affectée à la variable d'environnement BUILDDIR, ``locale/`` au paramètre :confval:`locale_dirs`, et ``False`` à :confval:`gettext_compact` (the Sphinx document is already configured as such).
zh_cn: 这个案例研究假设BUILDDIR被设置为 ``_build``， :confval:`locale_dirs` 被设置为 ``locale/`` 并且 :confval:`gettext_compact` 被设置为 ``False`` （Sphinx文档已经这样配置）。

source: Extract translatable messages into pot files.
fr: Extraire les messages traduisibles dans des fichiers POT :
zh_cn: 将可翻译的消息提取到pot文件中。

source: The generated pot files will be placed in the ``_build/gettext`` directory. If you want to customize the output beyond what can be done via the :ref:`intl-options`, the :download:`default pot file template <../../../sphinx/templates/gettext/message.pot.jinja>` can be replaced by a custom :file:`message.pot.jinja` file placed in any directory listed in :confval:`templates_path`.
zh_cn: 生成的pot文件将放在 ``_build/gettext`` 目录中。如果您想自定义输出，超出 :ref:`intl-options` 可以完成的范围，可以通过放置在 :confval:`templates_path` 列表中的任何目录中的自定义 :file:`message.pot.jinja` 文件来替换 :download:`default pot file template <../../../sphinx/templates/gettext/message.pot.jinja>` 。

source: Generate po files.
fr: Générer les fichiers PO :
zh_cn: 生成po文件。

source: We'll use the pot files generated in the above step.
fr: Nous utiliserons les fichiers POT générés à l'étape précédente.
zh_cn: 我们将使用上述步骤中生成的pot文件。

source: Once completed, the generated po files will be placed in the below directories:
fr: Une fois terminé, les fichiers PO générés seront placés dans les répertoires suivants :
zh_cn: 完成后，生成的po文件将放在以下目录中：

source: Translate po files.
fr: Traduire les fichiers PO :
zh_cn: 翻译po文件。

source: As noted above, these are located in the ``./locale/<lang>/LC_MESSAGES`` directory. An example of one such file, from Sphinx, :file:`builders.po`, is given below.
zh_cn: 如上所述，这些文件位于 ``./locale/<lang>/LC_MESSAGES`` 目录中。下面给出了Sphinx中的一个此类文件 :file:`builders.po` 的示例。

source: Another case, msgid is multi-line text and contains reStructuredText syntax:
fr: Autre cas, ``msgid`` est un segment de texte multiligne comportant de la syntaxe reStructuredText :
zh_cn: 另一种情况是，msgid是多行文本，并包含restructedText语法：

source: Please be careful not to break reStructuredText notation. Most po-editors will help you with that.
zh_cn: 请注意不要破坏reStructuredText符号。大多数po编辑器都会帮助您做到这一点。

source: Build translated document.
fr: Générer les documents traduits
zh_cn: 生成翻译文档。

source: You need a :confval:`language` parameter in :file:`conf.py` or you may also specify the parameter on the command line.
zh_cn: 你需要在 :file:`conf.py` 中设置 :confval:`language` 参数，或者你也可以在命令行中指定该参数。

source: For BSD/GNU make, run:
fr: Pour BSD/GNU make, exécutez :
zh_cn: 对于BSD/GNU make，运行：

source: For Windows :command:`cmd.exe`, run:
fr: Dans l'Invite de commande Windows :command:`cmd.exe`, exécuter :
zh_cn: 对于Windows :command:`cmd.exe`，运行：

source: For PowerShell, run:
fr: Dans Windows PowerShell, exécuter :
zh_cn: 对于PowerShell，运行：

source: Congratulations! You got the translated documentation in the ``_build/html`` directory.
fr: Félicitations ! La documentation traduite est obtenue dans le répertoire ``_build/html```.
zh_cn: 祝贺你！翻译后的文档在 ``_build/html`` 目录下。

source: :program:`sphinx-build` that is invoked by make command will build po files into mo files.
fr: Le programme :program:`sphinx-build` invoqué via la commande make compilera les fichiers PO en fichiers MO.
zh_cn: :program:`sphinx-build` 被make命令调用，将po文件编译成mo文件。

source: If you are using 1.2.x or earlier, please invoke :command:`sphinx-intl build` command before :command:`make` command.
fr: Si vous utilisez la version 1.2.x ou antérieure, veuillez exécuter la commande :command:`sphinx-intl build` avant d'invoquer la commande :command:`make`.
zh_cn: 如果您使用的是1.2.x或更早版本，请在 :command:`sphinx-intl build` 命令之前调用 :command:`make` 命令。

source: Translating
fr: Traduction
zh_cn: 翻译

source: Update your po files by new pot files
fr: Mise-à-jour des fichiers PO avec de nouveaux fichiers POT
zh_cn: 用新的pot文件更新你的po文件

source: If a document is updated, it is necessary to generate updated pot files and to apply differences to translated po files. In order to apply the updates from a pot file to the po file, use the :command:`sphinx-intl update` command.
fr: Si un document est actualisé, il est nécessaire de générer des fichiers POT mis-à-jour et d'appliquer les différences aux fichiers PO traduits. Afin d'appliquer les mises à jour depuis un fichier POT vers un fichier PO, utilisez la commande :command:`sphinx-intl update`.
zh_cn: 如果更新了文档，则需要生成更新的pot文件，并将差异应用于已翻译的po文件。要将pot文件中的更新应用于po文件，请使用 :command:`sphinx-intl update` 命令。

source: Using Transifex service for team translation
fr: Utilisation du service Transifex pour la traduction en équipe
zh_cn: 使用Transifex服务进行团队翻译

source: Transifex_ is one of several services that allow collaborative translation via a web interface. It has a nifty Go-based command line client that makes it easy to fetch and push translations.
zh_cn: Transifex_ 是几种允许通过Web界面进行协作翻译的服务之一。它有一个巧妙的基于Go的命令行客户端，使获取和推送翻译变得容易。

source: Install the `Transifex CLI tool`_.
zh_cn: 安装 `Transifex CLI tool`_.

source: You need the :command:`tx` command line tool for uploading resources (pot files). The official installation process place the :file:`tx` binary file in the current directory along with a README and a LICENSE file, and adds the current directory to ``$PATH``.
zh_cn: 为了上传资源（pot文件），您需要 :command:`tx` 命令行工具。官方安装过程将 :file:`tx` 二进制文件放在当前目录中，以及一个README和一个LICENSE文件，并将当前目录添加到 ``$PATH`` 中。

source: Create your Transifex_ account and create a new project and an organization for your document.
zh_cn: 创建您的 Transifex_ 帐户，并为您的文档创建一个新项目和一个组织。

source: Currently, Transifex does not allow for a translation project to have more than one version of the document, so you'd better include a version number in your project name.
fr: À ce jour, Transifex ne permet pas de gérer plusieurs versions de document dans un projet de traduction. Il est donc préférable d'inclure un numéro de version dans votre nom de projet.
zh_cn: 当前，Transifex不允许翻译项目拥有多个版本的文档，因此您最好在项目名称中包含版本号。

source: For example:
fr: Par exemple :
zh_cn: 例如：

source: Organization ID
zh_cn: 组织ID

source: Project ID
fr: ID projet
zh_cn: 项目ID

source: Project URL
fr: URL projet
zh_cn: 项目URL

source: Create an API token to be used in the command-line.
zh_cn: 创建一个将在命令行中使用的API令牌。

source: Go to your `Transifex API token`_ page and generate a token. Copy the generated token now, as you will not be able to see it again later.
zh_cn: 转到您的 `Transifex API token`_ 页面并生成一个令牌。现在复制生成的令牌，因为您以后将无法再次看到它。

source: Set your Transifex API token in the user configuration file :file:`$HOME/.transifexrc`.
zh_cn: 在用户配置文件 :file:`$HOME/.transifexrc` 中设置您的Transifex API令牌。

source: Alternatively, you can store your Transifex API token as the environment variable ``TX_TOKEN``, which is recognized and used by :command:`tx`.
zh_cn: 或者，您可以将您的Transifex API令牌存储为环境变量 ``TX_TOKEN``，该变量由 :command:`tx` 识别和使用。

source: Create the project's config file for :command:`tx` command.
zh_cn: 为 :command:`tx` 命令创建项目的配置文件。

source: This process will create ``.tx/config`` in the current directory.
zh_cn: 该过程将在当前目录中创建 ``.tx/config`` 。

source: Upload pot files to Transifex service.
fr: Téléversement des fichiers POT vers le service Transifex.
zh_cn: 将pot文件上传到Transifex服务。

source: Register pot files to ``.tx/config`` file using :command:`sphinx-intl update-txconfig-resources`, adjusting ``--pot-dir`` value to your project's pot files' directory:
zh_cn: 使用 :command:`sphinx-intl update-txconfig-resources` 将pot文件注册到 ``.tx/config`` 文件中，调整 ``--pot-dir`` 值以适应您项目的pot文件目录：

source: You can use the ``SPHINXINTL_TRANSIFEX_ORGANIZATION_NAME`` and ``SPHINXINTL_TRANSIFEX_PROJECT_NAME`` environment variables instead of the respective command line arguments.
zh_cn: 您可以使用 ``SPHINXINTL_TRANSIFEX_ORGANIZATION_NAME`` 和 ``SPHINXINTL_TRANSIFEX_PROJECT_NAME`` 环境变量来代替各自的命令行参数。

source: and upload pot files:
fr: puis téléverser les fichiers POT :
zh_cn: 以及上传pot文件

source: Forward the translation on Transifex.
fr: Transfert des traductions vers Transifex.
zh_cn: 在Transifex上转发翻译。

source: Pull translated po files and make translated HTML.
fr: Récupération des fichiers PO traduits et génération des traductions HTML.
zh_cn: 拉取翻译后的po文件，并制作翻译的HTML。

source: Get translated catalogs and build mo files. For example, to build mo files for German (de):
fr: Téléchargez les catalogues traduits et construisez les fichiers MO. Par exemple, pour générer les fichiers MO pour l'Allemand (de) :
zh_cn: 获取翻译的目录并生成mo文件。例如，要为德语（de）生成mo文件：

source: Invoke :command:`make html` (for BSD/GNU make) passing the language code:
zh_cn: 调用 :command:`make html` （对于BSD/GNU make）传递语言代码：

source: That's all!
fr: C'est tout !
zh_cn: 大功告成！

source: Translating locally and on Transifex
fr: Traduction en local et sur Transifex
zh_cn: 在本地和Transifex上翻译

source: If you want to push all language's po files, you can be done by using :command:`tx push -t` command. Watch out! This operation overwrites translations in Transifex.
fr: Si vous souhaitez pousser tous les fichiers PO de langues, vous le pouvez avec la commande :command:`tx push -t`. Prenez garde ! Cette opération écrase les traductions dans Transifex.
zh_cn: 如果您想推送所有语言的po文件，可以使用 :command:`tx push -t` 命令来完成。注意！此操作会覆盖Transifex中的翻译。

source: In other words, if you have updated each in the service and local po files, it would take much time and effort to integrate them.
fr: En d'autres termes, si les fichiers PO ont été édités simultanément en local et via le service, cela nécessiterait beaucoup de temps et d'effort pour les réconcilier.
zh_cn: 换句话说，如果您已经更新了服务和本地po文件中的每一个文件，那么集成它们将花费大量的时间和精力。

source: Using Weblate service for team translation
fr: Utilisation du service Weblate pour la traduction en équipe
zh_cn: 使用Weblate服务进行团队翻译

source: Read more in `Weblate's documentation`_.
fr: Pour en savoir plus, consultez la `documentation de Weblate`_.
zh_cn: 阅读更多 `Weblate's documentation`_。

source: Contributing to Sphinx reference translation
fr: Contribution à la traduction de Sphinx
zh_cn: 对 Sphinx参考翻译 做贡献

source: The recommended way for new contributors to translate Sphinx reference is to join the translation team on Transifex.
fr: La manière recommandée aux nouveaux contributeurs pour traduire Sphinx est de rejoindre l'équipe de traduction sur Transifex.
zh_cn: 新贡献者翻译sphinx参考文献的推荐方式是加入Transifex上的翻译团队。

source: There is a `Sphinx translation page`_ for Sphinx (master) documentation.
zh_cn: Sphinx（master）文档有一个 `Sphinx translation page`_ 。

source: Login to Transifex_ service.
fr: Connectez-vous au service Transifex_.
zh_cn: 登录到 Transifex_ 服务。

source: Go to the `"Sphinx's documentation" translation project <https://app.transifex.com/sphinx-doc/sphinx-doc/>`__.
zh_cn: 转到 `"Sphinx's documentation" translation project <https://app.transifex.com/sphinx-doc/sphinx-doc/>`__ 。

source: Click ``Request language`` and fill form.
fr: Cliquez sur ``Demander une langue`` et remplissez le formulaire.
zh_cn: 单击 ``Request language`` 并填写表单。

source: Wait acceptance by Transifex sphinx translation maintainers.
fr: Attendez l'approbation par les mainteneurs de la traduction de Sphinx.
zh_cn: 等待Transifex sphinx翻译维护人员的接受。

source: (After acceptance) Translate on Transifex.
fr: (Après approbation) Traduisez Sphinx sur Transifex.
zh_cn: （在被接受后）在Transifex上进行翻译。

source: Detail is here: https://help.transifex.com/en/articles/6248698-getting-started-as-a-translator
zh_cn: 细节在这里：https://help.transifex.com/en/articles/6248698-getting-started-as-a-translator

source: Translation progress and statistics
zh_cn: 翻译进度和统计

source: During the rendering process, Sphinx marks each translatable node with a ``translated`` attribute, indicating if a translation was found for the text in that node.
zh_cn: 在渲染过程中，Sphinx使用 ``translated`` 属性标记每个可翻译的节点，指示是否找到了该节点中文本的翻译。

source: The :confval:`translation_progress_classes` configuration value can be used to add a class to each element, depending on the value of the ``translated`` attribute.
zh_cn: 配置值 :confval:`translation_progress_classes` 可用于根据 ``translated`` 属性的值向每个元素添加类。

source: The ``|translation progress|`` substitution can be used to display the percentage of nodes that have been translated on a per-document basis.
zh_cn: 可以使用 ``|translation progress|`` 替换来显示每个文档中已翻译节点的百分比。

source: Footnotes
fr: Notes de bas de page
zh_cn: 脚注

source: See the `GNU gettext utilities <https://www.gnu.org/software/gettext/manual/gettext.html#Introduction>`_ for details on that software suite.
fr: Voir les `outils GNU gettext <https://www.gnu.org/software/gettext/manual/gettext.html#Introduction>`_ pour les détails sur cette suite logicielle.
zh_cn: 有关该软件套件的详细信息，请参见 `GNU gettext utilities <https://www.gnu.org/software/gettext/manual/gettext.html#Introduction>`_

source: Because nobody expects the Spanish Inquisition!
fr: Parce que nul n'espère l'Inquisition Espagnole !
zh_cn: 因为没人期待西班牙宗教裁判所！

source: Set :confval:`locale_dirs` to ``["locale/"]``.
fr: Configurer :confval:`locale_dirs` comme valant ``["locale/"]``.

source: Set :confval:`language` to ``es`` (also possible via :option:`-D <sphinx-build -D>`).
fr: Configurer :confval:`language` comme valant ``es`` (également possible grâce à l'option :option:`-D <sphinx-build -D>` de ``sphinx-build``).

source: `Transifex Client documentation`_
fr: `Documentation du client Transifex`_

source: There is a `sphinx translation page`_ for Sphinx (master) documentation.
fr: Il y a une `sphinx translation page`_ pour la documentation de Sphinx (branche master).

source: Go to `sphinx translation page`_.
fr: Rendez-vous sur la `sphinx translation page`_.
