Repository: sphinx-doc/sphinx-doc-translations
Catalog: locale/*/LC_MESSAGES/usage/domains/standard.po
Languages: pt_br

source: The Standard Domain
pt_br: O domínio padrão

source: The so-called "standard" domain collects all markup that doesn't warrant a domain of its own. Its directives and roles are not prefixed with a domain name.
pt_br: O chamado domínio “padrão” coleta todas as marcações que não garantem um domínio próprio. Suas diretivas e papéis não são prefixados com um nome de domínio.

source: The standard domain is also where custom object descriptions, added using the :func:`~sphinx.application.Sphinx.add_object_type` API, are placed.
pt_br: O domínio padrão também é onde as descrições de objetos personalizados, adicionadas usando a API :func:`~sphinx.application.Sphinx.add_object_type`, são colocadas.

source: There is a set of directives allowing documenting command-line programs:
pt_br: Existe um conjunto de diretivas que permitem documentar programas de linha de comando:

source: Describes a command line argument or switch. Option argument names should be enclosed in angle brackets. Examples::
pt_br: Descreve um argumento ou opção de linha de comando. Os nomes dos argumentos das opções devem ser colocados entre colchetes angulares. Exemplos::

source: The directive will create cross-reference targets for the given options, referenceable by :rst:role:`option` (in the example case, you'd use something like ``:option:`dest_dir```, ``:option:`-m```, or ``:option:`--module```).
pt_br: A diretiva criará alvos de referência cruzada para as opções fornecidas, referenciáveis ​​por :rst:role:`option` (no caso de exemplo, você usaria algo como ``:option:`dest_dir```, ``:option :`-m```, ou ``:option:`--module```).

source: One can cross-reference including an option value: ``:option:`--module=foobar```, ,``:option:`--module[=foobar]``` or ``:option:`--module foobar```.
pt_br: Pode-se fazer referência cruzada incluindo um valor de opção: ``:option:`--module=foobar```, ``:option:`--module[=foobar]``` ou ``:option:`--module foobar```.

source: Use :confval:`option_emphasise_placeholders` for parsing of "variable part" of a literal text (similarly to the :rst:role:`samp` role).
pt_br: Use :confval:`option_emphasise_placeholders` para analisar a "parte variável" de um texto literal (similarmente ao papel :rst:role:`samp`).

source: ``cmdoption`` directive is a deprecated alias for the ``option`` directive.
pt_br: A diretiva ``cmdoption`` é um alias descontinuado para a diretiva ``option``.

source: Describes a configuration value or setting that the documented code or program uses or defines. Referenceable by :rst:role:`confval`.
pt_br: Descreve um valor de configuração ou uma definição que o código ou programa documentado usa ou define. Referenciável por :rst:role:`confval`.

source: Describes the type of the configuration value. This is optional, and if specified will be interpreted as reStructuredText.
pt_br: Descreve o tipo do valor de configuração. Isso é opcional e, se especificado, será interpretado como reStructuredText.

source: Describes the default value of the configuration value. This is optional, and if specified will be interpreted as reStructuredText.
pt_br: Descreve o valor padrão do valor de configuração. Isso é opcional e, se especificado, será interpretado como reStructuredText.

source: Example:
pt_br: Exemplo:

source: will be rendered as follows:
pt_br: será renderizado da seguinte maneira:

source: Describes an environment variable that the documented code or program uses or defines. Referenceable by :rst:role:`envvar`.
pt_br: Descreve uma variável de ambiente que o código ou programa documentado usa ou define. Referenciável por :rst:role:`envvar`.

source: Like :rst:dir:`py:currentmodule`, this directive produces no output. Instead, it serves to notify Sphinx that all following :rst:dir:`option` directives document options for the program called *name*.
pt_br: Assim como :rst:dir:`py:currentmodule`, esta diretiva não produz saída. Em vez disso, serve para notificar o Sphinx que todas as diretivas :rst:dir:`option` documentam opções para o programa chamado *name*.

source: If you use :rst:dir:`program`, you have to qualify the references in your :rst:role:`option` roles by the program name, so if you have the following situation ::
pt_br: Se você usar :rst:dir:`program`, você tem que qualificar as referências em seus papéis :rst:role:`option` pelo nome do programa, então se você tiver a seguinte situação ::

source: then ``:option:`rm -r``` would refer to the first option, while ``:option:`svn -r``` would refer to the second one.
pt_br: então ``:option:`rm -r``` se referiria à primeira opção, enquanto ``:option:`svn -r``` se referiria à segunda.

source: If ``None`` is passed to the argument, the directive will reset the current program name.
pt_br: Se ``None`` for passado para o argumento, a diretiva irá redefinir o nome do programa atual.

source: The program name may contain spaces (in case you want to document subcommands like ``svn add`` and ``svn commit`` separately).
pt_br: O nome do programa pode conter espaços (caso você queira documentar subcomandos como ``svn add`` e ``svn commit`` separadamente).

source: There is also a very generic object description directive, which is not tied to any domain:
pt_br: Há também uma diretiva de descrição de objeto muito genérica, que não está vinculada a nenhum domínio:

source: This directive produces the same formatting as the specific ones provided by domains, but does not create index entries or cross-referencing targets. Example::
pt_br: Esta diretiva produz a mesma formatação específica fornecida pelos domínios, mas não cria entradas de índice ou alvos de referência cruzada. Exemplo::
